// 0x0 bytes (sizeof)
typedef struct _LDRP_LOAD_CONTEXT {
} _LDRP_LOAD_CONTEXT;

// 0x0 bytes (sizeof)
typedef struct _ADAPTER_OBJECT {
} _ADAPTER_OBJECT;

// 0x0 bytes (sizeof)
typedef struct _VERIFIER_SHARED_EXPORT_THUNK {
} _VERIFIER_SHARED_EXPORT_THUNK;

// 0x20 bytes (sizeof)
typedef struct _VF_TARGET_ALL_SHARED_EXPORT_THUNKS {
  struct _VERIFIER_SHARED_EXPORT_THUNK
      *SharedExportThunks; // offset: 0x0 ordinal: 0x0
  struct _VERIFIER_SHARED_EXPORT_THUNK
      *PoolSharedExportThunks; // offset: 0x8 ordinal: 0x1
  struct _VERIFIER_SHARED_EXPORT_THUNK
      *OrderDependentSharedExportThunks; // offset: 0x10 ordinal: 0x2
  struct _VERIFIER_SHARED_EXPORT_THUNK
      *XdvSharedExportThunks; // offset: 0x18 ordinal: 0x3
} _VF_TARGET_ALL_SHARED_EXPORT_THUNKS;

// 0x0 bytes (sizeof)
typedef struct _ACTIVATION_CONTEXT_DATA {
} _ACTIVATION_CONTEXT_DATA;

// 0x0 bytes (sizeof)
typedef struct _KTMNOTIFICATION_PACKET {
} _KTMNOTIFICATION_PACKET;

// 0x0 bytes (sizeof)
typedef struct _ETW_PERFECT_HASH_FUNCTION {
} _ETW_PERFECT_HASH_FUNCTION;

// 0x0 bytes (sizeof)
typedef struct _SERVER_SILO_MONITOR {
} _SERVER_SILO_MONITOR;

// 0x0 bytes (sizeof)
typedef struct _HAL_PMC_COUNTERS {
} _HAL_PMC_COUNTERS;

// 0x0 bytes (sizeof)
typedef struct _ETW_STACK_CACHE {
} _ETW_STACK_CACHE;

// 0x0 bytes (sizeof)
typedef struct _CALLBACK_OBJECT {
} _CALLBACK_OBJECT;

typedef unsigned char UCHAR;

typedef unsigned long long ULONGLONG;

// 0x0 bytes (sizeof)
typedef struct _DEVICE_OBJECT_LIST {
} _DEVICE_OBJECT_LIST;

// 0x8 bytes (sizeof)
typedef union __anon_1226 {
  struct _DEVICE_NODE *NextResourceDeviceNode; // offset: 0x0 ordinal: 0x0
} __anon_1226;

typedef void VOID;

// 0x0 bytes (sizeof)
typedef struct _PCW_INSTANCE {
} _PCW_INSTANCE;

// 0x0 bytes (sizeof)
typedef struct _PCW_BUFFER {
} _PCW_BUFFER;

// 0x0 bytes (sizeof)
typedef struct _PCW_REGISTRATION {
} _PCW_REGISTRATION;

typedef void __anon_1063;

typedef unsigned short USHORT;

typedef unsigned long ULONG;

// 0x4 bytes (sizeof)
typedef struct _MMSECTION_FLAGS {
  ULONG BeingDeleted : 1;                   // offset: 0x0 ordinal: 0x0
  ULONG BeingCreated : 1;                   // offset: 0x0 ordinal: 0x1
  ULONG BeingPurged : 1;                    // offset: 0x0 ordinal: 0x2
  ULONG NoModifiedWriting : 1;              // offset: 0x0 ordinal: 0x3
  ULONG FailAllIo : 1;                      // offset: 0x0 ordinal: 0x4
  ULONG Image : 1;                          // offset: 0x0 ordinal: 0x5
  ULONG Based : 1;                          // offset: 0x0 ordinal: 0x6
  ULONG File : 1;                           // offset: 0x0 ordinal: 0x7
  ULONG AttemptingDelete : 1;               // offset: 0x0 ordinal: 0x8
  ULONG PrefetchCreated : 1;                // offset: 0x0 ordinal: 0x9
  ULONG PhysicalMemory : 1;                 // offset: 0x0 ordinal: 0xa
  ULONG CopyOnWrite : 1;                    // offset: 0x0 ordinal: 0xb
  ULONG Reserve : 1;                        // offset: 0x0 ordinal: 0xc
  ULONG Commit : 1;                         // offset: 0x0 ordinal: 0xd
  ULONG NoChange : 1;                       // offset: 0x0 ordinal: 0xe
  ULONG WasPurged : 1;                      // offset: 0x0 ordinal: 0xf
  ULONG UserReference : 1;                  // offset: 0x0 ordinal: 0x10
  ULONG GlobalMemory : 1;                   // offset: 0x0 ordinal: 0x11
  ULONG DeleteOnClose : 1;                  // offset: 0x0 ordinal: 0x12
  ULONG FilePointerNull : 1;                // offset: 0x0 ordinal: 0x13
  ULONG PreferredNode : 6;                  // offset: 0x0 ordinal: 0x14
  ULONG GlobalOnlyPerSession : 1;           // offset: 0x0 ordinal: 0x15
  ULONG UserWritable : 1;                   // offset: 0x0 ordinal: 0x16
  ULONG SystemVaAllocated : 1;              // offset: 0x0 ordinal: 0x17
  ULONG PreferredFsCompressionBoundary : 1; // offset: 0x0 ordinal: 0x18
  ULONG UsingFileExtents : 1;               // offset: 0x0 ordinal: 0x19
  ULONG Spare : 1;                          // offset: 0x0 ordinal: 0x1a
} _MMSECTION_FLAGS;

// 0x8 bytes (sizeof)
typedef struct _MI_FILE_EXTENTS {
  struct _MI_FILE_EXTENTS_WAIT_BLOCK *WaitList; // offset: 0x0 ordinal: 0x0
} _MI_FILE_EXTENTS;

// 0x0 bytes (sizeof)
typedef struct _SCSI_REQUEST_BLOCK {
} _SCSI_REQUEST_BLOCK;

// 0x0 bytes (sizeof)
typedef struct _JOB_IO_RATE_CONTROL {
} _JOB_IO_RATE_CONTROL;

// 0x0 bytes (sizeof)
typedef struct _JOB_NET_RATE_CONTROL {
} _JOB_NET_RATE_CONTROL;

// 0x0 bytes (sizeof)
typedef struct _JOB_CPU_RATE_CONTROL {
} _JOB_CPU_RATE_CONTROL;

// 0x0 bytes (sizeof)
typedef struct _JOB_NOTIFICATION_INFORMATION {
} _JOB_NOTIFICATION_INFORMATION;

// 0x0 bytes (sizeof)
typedef struct _JOB_ACCESS_STATE {
} _JOB_ACCESS_STATE;

// 0x8 bytes (sizeof)
typedef struct __anon_655 {
  struct _SCSI_REQUEST_BLOCK *Srb; // offset: 0x0 ordinal: 0x0
} __anon_655;

// 0x0 bytes (sizeof)
typedef struct _EPROCESS_QUOTA_BLOCK {
} _EPROCESS_QUOTA_BLOCK;

// 0x0 bytes (sizeof)
typedef struct _PAGEFAULT_HISTORY {
} _PAGEFAULT_HISTORY;

// 0x8 bytes (sizeof)
typedef struct __anon_1466 {
  struct _FILE_OBJECT *FileObject; // offset: 0x0 ordinal: 0x0
} __anon_1466;

// 0x0 bytes (sizeof)
typedef struct _ESILO {
} _ESILO;

// 0x8 bytes (sizeof)
typedef struct _ARBITER_ADD_RESERVED_PARAMETERS {
  struct _DEVICE_OBJECT *ReserveDevice; // offset: 0x0 ordinal: 0x0
} _ARBITER_ADD_RESERVED_PARAMETERS;

// 0x10 bytes (sizeof)
typedef struct _SLIST_ENTRY {
  struct _SLIST_ENTRY *Next; // offset: 0x0 ordinal: 0x0
} _SLIST_ENTRY;

typedef short SHORT;

typedef long long LONGLONG;

// 0x10 bytes (sizeof)
typedef struct _TIME_FIELDS {
  SHORT Year;         // offset: 0x0 ordinal: 0x0
  SHORT Month;        // offset: 0x2 ordinal: 0x1
  SHORT Day;          // offset: 0x4 ordinal: 0x2
  SHORT Hour;         // offset: 0x6 ordinal: 0x3
  SHORT Minute;       // offset: 0x8 ordinal: 0x4
  SHORT Second;       // offset: 0xa ordinal: 0x5
  SHORT Milliseconds; // offset: 0xc ordinal: 0x6
  SHORT Weekday;      // offset: 0xe ordinal: 0x7
} _TIME_FIELDS;

// 0x4 bytes (sizeof)
typedef struct __anon_1509 {
  SHORT Type;           // offset: 0x0 ordinal: 0x0
  SHORT DataInfoOffset; // offset: 0x2 ordinal: 0x1
} __anon_1509;

// 0x4 bytes (sizeof)
typedef struct __anon_1507 {
  SHORT DataLength;  // offset: 0x0 ordinal: 0x0
  SHORT TotalLength; // offset: 0x2 ordinal: 0x1
} __anon_1507;

// 0x8 bytes (sizeof)
typedef struct _RTL_AVL_TREE {
  struct _RTL_BALANCED_NODE *Root; // offset: 0x0 ordinal: 0x0
} _RTL_AVL_TREE;

// 0x10 bytes (sizeof)
typedef struct _RTL_RB_TREE {
  struct _RTL_BALANCED_NODE *Root; // offset: 0x0 ordinal: 0x0
  struct _RTL_BALANCED_NODE *Min;  // offset: 0x8 ordinal: 0x1
} _RTL_RB_TREE;

// 0x18 bytes (sizeof)
typedef struct _RTL_SPLAY_LINKS {
  struct _RTL_SPLAY_LINKS *Parent;     // offset: 0x0 ordinal: 0x0
  struct _RTL_SPLAY_LINKS *LeftChild;  // offset: 0x8 ordinal: 0x1
  struct _RTL_SPLAY_LINKS *RightChild; // offset: 0x10 ordinal: 0x2
} _RTL_SPLAY_LINKS;

// 0x8 bytes (sizeof)
typedef struct _LDRP_CSLIST {
  struct _SINGLE_LIST_ENTRY *Tail; // offset: 0x0 ordinal: 0x0
} _LDRP_CSLIST;

// 0x8 bytes (sizeof)
typedef struct _SINGLE_LIST_ENTRY {
  struct _SINGLE_LIST_ENTRY *Next; // offset: 0x0 ordinal: 0x0
} _SINGLE_LIST_ENTRY;

// 0x18 bytes (sizeof)
typedef struct _ETW_BUFFER_QUEUE {
  struct _SINGLE_LIST_ENTRY *QueueHead; // offset: 0x0 ordinal: 0x0
  struct _SINGLE_LIST_ENTRY *QueueTail; // offset: 0x8 ordinal: 0x1
  struct _SINGLE_LIST_ENTRY QueueEntry; // offset: 0x10 ordinal: 0x2
} _ETW_BUFFER_QUEUE;

// 0x8 bytes (sizeof)
typedef struct _KWAIT_CHAIN {
  struct _SINGLE_LIST_ENTRY Head; // offset: 0x0 ordinal: 0x0
} _KWAIT_CHAIN;

// 0x10 bytes (sizeof)
typedef struct _KDPC_LIST {
  struct _SINGLE_LIST_ENTRY ListHead;   // offset: 0x0 ordinal: 0x0
  struct _SINGLE_LIST_ENTRY *LastEntry; // offset: 0x8 ordinal: 0x1
} _KDPC_LIST;

typedef char CHAR;

// 0x0 bytes (sizeof)
typedef struct _FLS_CALLBACK_INFO {
} _FLS_CALLBACK_INFO;

// 0x0 bytes (sizeof)
typedef struct _ASSEMBLY_STORAGE_MAP {
} _ASSEMBLY_STORAGE_MAP;

// 0x8 bytes (sizeof)
typedef struct _ARBITER_QUERY_ARBITRATE_PARAMETERS {
  struct _LIST_ENTRY *ArbitrationList; // offset: 0x0 ordinal: 0x0
} _ARBITER_QUERY_ARBITRATE_PARAMETERS;

// 0x8 bytes (sizeof)
typedef struct _ARBITER_BOOT_ALLOCATION_PARAMETERS {
  struct _LIST_ENTRY *ArbitrationList; // offset: 0x0 ordinal: 0x0
} _ARBITER_BOOT_ALLOCATION_PARAMETERS;

// 0x10 bytes (sizeof)
typedef struct _LIST_ENTRY {
  struct _LIST_ENTRY *Flink; // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY *Blink; // offset: 0x8 ordinal: 0x1
} _LIST_ENTRY;

// 0x10 bytes (sizeof)
typedef struct __anon_2286 {
  struct _LIST_ENTRY ListHead; // offset: 0x0 ordinal: 0x0
} __anon_2286;

// 0x18 bytes (sizeof)
typedef struct _DELAY_ACK_FO {
  struct _LIST_ENTRY Links;                // offset: 0x0 ordinal: 0x0
  struct _FILE_OBJECT *OriginalFileObject; // offset: 0x10 ordinal: 0x1
} _DELAY_ACK_FO;

// 0x18 bytes (sizeof)
typedef struct _TRIAGE_PNP_DEVICE_COMPLETION_REQUEST {
  struct _LIST_ENTRY ListEntry;           // offset: 0x0 ordinal: 0x0
  struct _TRIAGE_DEVICE_NODE *DeviceNode; // offset: 0x10 ordinal: 0x1
} _TRIAGE_PNP_DEVICE_COMPLETION_REQUEST;

// 0x10 bytes (sizeof)
typedef struct _TRIAGE_PNP_DEVICE_COMPLETION_QUEUE {
  struct _LIST_ENTRY DispatchedList; // offset: 0x0 ordinal: 0x0
} _TRIAGE_PNP_DEVICE_COMPLETION_QUEUE;

// 0x10 bytes (sizeof)
typedef struct _MMWORKING_SET_EXPANSION_HEAD {
  struct _LIST_ENTRY ListHead; // offset: 0x0 ordinal: 0x0
} _MMWORKING_SET_EXPANSION_HEAD;

typedef VOID (*__anon_1061)(__anon_1063);

typedef VOID (*__anon_572)(struct _DEVICE_OBJECT *, struct _DEVICE_OBJECT *);

typedef VOID (*__anon_571)(struct _FILE_OBJECT *);

typedef VOID (*__anon_108)();

// 0x10 bytes (sizeof)
typedef struct __anon_2285 {
  VOID *UserData; // offset: 0x0 ordinal: 0x0
  VOID *Owner;    // offset: 0x8 ordinal: 0x1
} __anon_2285;

// 0x48 bytes (sizeof)
typedef struct _VI_FAULT_TRACE {
  struct _ETHREAD *Thread; // offset: 0x0 ordinal: 0x0
  VOID *StackTrace[8];     // offset: 0x8 ordinal: 0x1
} _VI_FAULT_TRACE;

// 0x40 bytes (sizeof)
typedef struct _VF_KE_CRITICAL_REGION_TRACE {
  struct _ETHREAD *Thread; // offset: 0x0 ordinal: 0x0
  VOID *StackTrace[7];     // offset: 0x8 ordinal: 0x1
} _VF_KE_CRITICAL_REGION_TRACE;

// 0x8 bytes (sizeof)
typedef struct _ALPC_HANDLE_ENTRY {
  VOID *Object; // offset: 0x0 ordinal: 0x0
} _ALPC_HANDLE_ENTRY;

// 0x8 bytes (sizeof)
typedef struct __anon_1305 {
  VOID *Notification; // offset: 0x0 ordinal: 0x0
} __anon_1305;

// 0x8 bytes (sizeof)
typedef struct __anon_1096 {
  VOID *CheckStack; // offset: 0x0 ordinal: 0x0
} __anon_1096;

// 0x28 bytes (sizeof)
typedef struct __anon_771 {
  VOID *Argument1; // offset: 0x0 ordinal: 0x0
  VOID *Argument2; // offset: 0x8 ordinal: 0x1
  VOID *Argument3; // offset: 0x10 ordinal: 0x2
  VOID *Argument4; // offset: 0x18 ordinal: 0x3
  VOID *Argument5; // offset: 0x20 ordinal: 0x4
} __anon_771;

// 0x10 bytes (sizeof)
typedef struct _IO_COMPLETION_CONTEXT {
  VOID *Port; // offset: 0x0 ordinal: 0x0
  VOID *Key;  // offset: 0x8 ordinal: 0x1
} _IO_COMPLETION_CONTEXT;

// 0x18 bytes (sizeof)
typedef struct _SECTION_OBJECT_POINTERS {
  VOID *DataSectionObject;  // offset: 0x0 ordinal: 0x0
  VOID *SharedCacheMap;     // offset: 0x8 ordinal: 0x1
  VOID *ImageSectionObject; // offset: 0x10 ordinal: 0x2
} _SECTION_OBJECT_POINTERS;

// 0x20 bytes (sizeof)
typedef struct __anon_671 {
  VOID *Argument1; // offset: 0x0 ordinal: 0x0
  VOID *Argument2; // offset: 0x8 ordinal: 0x1
  VOID *Argument3; // offset: 0x10 ordinal: 0x2
  VOID *Argument4; // offset: 0x18 ordinal: 0x3
} __anon_671;

// 0x10 bytes (sizeof)
typedef struct _IO_CLIENT_EXTENSION {
  struct _IO_CLIENT_EXTENSION *NextExtension; // offset: 0x0 ordinal: 0x0
  VOID *ClientIdentificationAddress;          // offset: 0x8 ordinal: 0x1
} _IO_CLIENT_EXTENSION;

typedef VOID (*__anon_522)(struct _DEVICE_OBJECT *, VOID *);

// 0x30 bytes (sizeof)
typedef struct _IO_TIMER {
  SHORT Type;                   // offset: 0x0 ordinal: 0x0
  SHORT TimerFlag;              // offset: 0x2 ordinal: 0x1
  struct _LIST_ENTRY TimerList; // offset: 0x8 ordinal: 0x2
  VOID(*TimerRoutine)
  (struct _DEVICE_OBJECT *, VOID *);   // offset: 0x18 ordinal: 0x3
  VOID *Context;                       // offset: 0x20 ordinal: 0x4
  struct _DEVICE_OBJECT *DeviceObject; // offset: 0x28 ordinal: 0x5
} _IO_TIMER;

// 0x10 bytes (sizeof)
typedef struct _TERMINATION_PORT {
  struct _TERMINATION_PORT *Next; // offset: 0x0 ordinal: 0x0
  VOID *Port;                     // offset: 0x8 ordinal: 0x1
} _TERMINATION_PORT;

typedef VOID (*__anon_411)(VOID *, VOID *, VOID *, VOID *);

typedef VOID (*__anon_386)(VOID *, VOID *, VOID *);

typedef VOID (*__anon_340)(VOID *);

// 0x20 bytes (sizeof)
typedef struct _WORK_QUEUE_ITEM {
  struct _LIST_ENTRY List;       // offset: 0x0 ordinal: 0x0
  VOID (*WorkerRoutine)(VOID *); // offset: 0x10 ordinal: 0x1
  VOID *Parameter;               // offset: 0x18 ordinal: 0x2
} _WORK_QUEUE_ITEM;

// 0x28 bytes (sizeof)
typedef struct _MI_COMBINE_WORKITEM {
  VOID *NextEntry;                  // offset: 0x0 ordinal: 0x0
  struct _WORK_QUEUE_ITEM WorkItem; // offset: 0x8 ordinal: 0x1
} _MI_COMBINE_WORKITEM;

// 0x20 bytes (sizeof)
typedef struct _KREQUEST_PACKET {
  VOID *CurrentPacket[3]; // offset: 0x0 ordinal: 0x0
  VOID(*WorkerRoutine)
  (VOID *, VOID *, VOID *, VOID *); // offset: 0x18 ordinal: 0x1
} _KREQUEST_PACKET;

// 0x80 bytes (sizeof)
typedef struct _OBJECT_REF_TRACE {
  VOID *StackTrace[16]; // offset: 0x0 ordinal: 0x0
} _OBJECT_REF_TRACE;

// 0x10 bytes (sizeof)
typedef struct _CLIENT_ID {
  VOID *UniqueProcess; // offset: 0x0 ordinal: 0x0
  VOID *UniqueThread;  // offset: 0x8 ordinal: 0x1
} _CLIENT_ID;

typedef VOID (*__anon_51)(VOID *, VOID *);

// 0x0 bytes (sizeof)
typedef struct _TP_CALLBACK_INSTANCE {
} _TP_CALLBACK_INSTANCE;

typedef VOID (*__anon_53)(struct _TP_CALLBACK_INSTANCE *, VOID *);

// 0x0 bytes (sizeof)
typedef struct _ACTIVATION_CONTEXT {
} _ACTIVATION_CONTEXT;

// 0x0 bytes (sizeof)
typedef struct _TP_CLEANUP_GROUP {
} _TP_CLEANUP_GROUP;

// 0x0 bytes (sizeof)
typedef struct _TP_POOL {
} _TP_POOL;

typedef long LONG;

typedef enum _MI_DYNAMICBASE_BITMAP {
  DynamicBaseBitMap32 = 0,       // ordinal: 0x0
  DynamicBaseBitMap64Low = 1,    // ordinal: 0x1
  DynamicBaseBitMap64High = 2,   // ordinal: 0x2
  DynamicBaseBitMapWow64Dll = 3, // ordinal: 0x3
  LastDynamicBaseBitMap = 4,     // ordinal: 0x4
} _MI_DYNAMICBASE_BITMAP;

typedef enum _MI_LOCK_ACQUIRE_TYPE {
  MiAcquireExclusive = 0,           // ordinal: 0x0
  MiAcquireExclusiveAutoExpand = 1, // ordinal: 0x1
  MiAcquireShared = 2,              // ordinal: 0x2
  MiAcquireSharedAutoExpand = 3,    // ordinal: 0x3
} _MI_LOCK_ACQUIRE_TYPE;

typedef enum _MI_MEMORY_EVENT_TYPES {
  LowAvailablePagesEvent = 0,     // ordinal: 0x0
  HighAvailablePagesEvent = 1,    // ordinal: 0x1
  LowPagedPoolEvent = 2,          // ordinal: 0x2
  HighPagedPoolEvent = 3,         // ordinal: 0x3
  LowNonPagedPoolEvent = 4,       // ordinal: 0x4
  HighNonPagedPoolEvent = 5,      // ordinal: 0x5
  LowCommitEvent = 6,             // ordinal: 0x6
  HighCommitEvent = 7,            // ordinal: 0x7
  MaximumCommitEvent = 8,         // ordinal: 0x8
  BadMemoryDetectedEvent = 9,     // ordinal: 0x9
  PhysicalMemoryChangeEvent = 10, // ordinal: 0xa
  TotalNumberOfMemoryEvents = 11, // ordinal: 0xb
} _MI_MEMORY_EVENT_TYPES;

typedef enum _FILE_OBJECT_EXTENSION_TYPE {
  FoExtTypeTransactionParams = 0, // ordinal: 0x0
  FoExtTypeInternal = 1,          // ordinal: 0x1
  FoExtTypeIosbRange = 2,         // ordinal: 0x2
  FoExtTypeGeneric = 3,           // ordinal: 0x3
  FoExtTypeSfio = 4,              // ordinal: 0x4
  FoExtTypeSymlink = 5,           // ordinal: 0x5
  FoExtTypeOplockKey = 6,         // ordinal: 0x6
  MaxFoExtTypes = 7,              // ordinal: 0x7
} _FILE_OBJECT_EXTENSION_TYPE;

typedef enum _PERFINFO_MM_STAT {
  PerfInfoMMStatNotUsed = 0,              // ordinal: 0x0
  PerfInfoMMStatAggregatePageCombine = 1, // ordinal: 0x1
  PerfInfoMMStatIterationPageCombine = 2, // ordinal: 0x2
  PerfInfoMMStatMax = 3,                  // ordinal: 0x3
} _PERFINFO_MM_STAT;

typedef enum _TlgOut_t {
  _TlgOutNULL = 0,           // ordinal: 0x0
  _TlgOutNOPRINT = 1,        // ordinal: 0x1
  _TlgOutSTRING = 2,         // ordinal: 0x2
  _TlgOutBOOLEAN = 3,        // ordinal: 0x3
  _TlgOutHEX = 4,            // ordinal: 0x4
  _TlgOutPID = 5,            // ordinal: 0x5
  _TlgOutTID = 6,            // ordinal: 0x6
  _TlgOutPORT = 7,           // ordinal: 0x7
  _TlgOutIPV4 = 8,           // ordinal: 0x8
  _TlgOutIPV6 = 9,           // ordinal: 0x9
  _TlgOutSOCKETADDRESS = 10, // ordinal: 0xa
  _TlgOutXML = 11,           // ordinal: 0xb
  _TlgOutJSON = 12,          // ordinal: 0xc
  _TlgOutWIN32ERROR = 13,    // ordinal: 0xd
  _TlgOutNTSTATUS = 14,      // ordinal: 0xe
  _TlgOutHRESULT = 15,       // ordinal: 0xf
  _TlgOutFILETIME = 16,      // ordinal: 0x10
  _TlgOutSIGNED = 17,        // ordinal: 0x11
  _TlgOutUNSIGNED = 18,      // ordinal: 0x12
  _TlgOutMax = 19,           // ordinal: 0x13
  _TlgOutChain = 128,        // ordinal: 0x14
  _TlgOutTypeMask = 127,     // ordinal: 0x15
} _TlgOut_t;

typedef enum _REG_NOTIFY_CLASS {
  RegNtDeleteKey = 0,                     // ordinal: 0x0
  RegNtPreDeleteKey = 0,                  // ordinal: 0x1
  RegNtSetValueKey = 1,                   // ordinal: 0x2
  RegNtPreSetValueKey = 1,                // ordinal: 0x3
  RegNtDeleteValueKey = 2,                // ordinal: 0x4
  RegNtPreDeleteValueKey = 2,             // ordinal: 0x5
  RegNtSetInformationKey = 3,             // ordinal: 0x6
  RegNtPreSetInformationKey = 3,          // ordinal: 0x7
  RegNtRenameKey = 4,                     // ordinal: 0x8
  RegNtPreRenameKey = 4,                  // ordinal: 0x9
  RegNtEnumerateKey = 5,                  // ordinal: 0xa
  RegNtPreEnumerateKey = 5,               // ordinal: 0xb
  RegNtEnumerateValueKey = 6,             // ordinal: 0xc
  RegNtPreEnumerateValueKey = 6,          // ordinal: 0xd
  RegNtQueryKey = 7,                      // ordinal: 0xe
  RegNtPreQueryKey = 7,                   // ordinal: 0xf
  RegNtQueryValueKey = 8,                 // ordinal: 0x10
  RegNtPreQueryValueKey = 8,              // ordinal: 0x11
  RegNtQueryMultipleValueKey = 9,         // ordinal: 0x12
  RegNtPreQueryMultipleValueKey = 9,      // ordinal: 0x13
  RegNtPreCreateKey = 10,                 // ordinal: 0x14
  RegNtPostCreateKey = 11,                // ordinal: 0x15
  RegNtPreOpenKey = 12,                   // ordinal: 0x16
  RegNtPostOpenKey = 13,                  // ordinal: 0x17
  RegNtKeyHandleClose = 14,               // ordinal: 0x18
  RegNtPreKeyHandleClose = 14,            // ordinal: 0x19
  RegNtPostDeleteKey = 15,                // ordinal: 0x1a
  RegNtPostSetValueKey = 16,              // ordinal: 0x1b
  RegNtPostDeleteValueKey = 17,           // ordinal: 0x1c
  RegNtPostSetInformationKey = 18,        // ordinal: 0x1d
  RegNtPostRenameKey = 19,                // ordinal: 0x1e
  RegNtPostEnumerateKey = 20,             // ordinal: 0x1f
  RegNtPostEnumerateValueKey = 21,        // ordinal: 0x20
  RegNtPostQueryKey = 22,                 // ordinal: 0x21
  RegNtPostQueryValueKey = 23,            // ordinal: 0x22
  RegNtPostQueryMultipleValueKey = 24,    // ordinal: 0x23
  RegNtPostKeyHandleClose = 25,           // ordinal: 0x24
  RegNtPreCreateKeyEx = 26,               // ordinal: 0x25
  RegNtPostCreateKeyEx = 27,              // ordinal: 0x26
  RegNtPreOpenKeyEx = 28,                 // ordinal: 0x27
  RegNtPostOpenKeyEx = 29,                // ordinal: 0x28
  RegNtPreFlushKey = 30,                  // ordinal: 0x29
  RegNtPostFlushKey = 31,                 // ordinal: 0x2a
  RegNtPreLoadKey = 32,                   // ordinal: 0x2b
  RegNtPostLoadKey = 33,                  // ordinal: 0x2c
  RegNtPreUnLoadKey = 34,                 // ordinal: 0x2d
  RegNtPostUnLoadKey = 35,                // ordinal: 0x2e
  RegNtPreQueryKeySecurity = 36,          // ordinal: 0x2f
  RegNtPostQueryKeySecurity = 37,         // ordinal: 0x30
  RegNtPreSetKeySecurity = 38,            // ordinal: 0x31
  RegNtPostSetKeySecurity = 39,           // ordinal: 0x32
  RegNtCallbackObjectContextCleanup = 40, // ordinal: 0x33
  RegNtPreRestoreKey = 41,                // ordinal: 0x34
  RegNtPostRestoreKey = 42,               // ordinal: 0x35
  RegNtPreSaveKey = 43,                   // ordinal: 0x36
  RegNtPostSaveKey = 44,                  // ordinal: 0x37
  RegNtPreReplaceKey = 45,                // ordinal: 0x38
  RegNtPostReplaceKey = 46,               // ordinal: 0x39
  RegNtPreQueryKeyName = 47,              // ordinal: 0x3a
  RegNtPostQueryKeyName = 48,             // ordinal: 0x3b
  MaxRegNtNotifyClass = 49,               // ordinal: 0x3c
} _REG_NOTIFY_CLASS;

typedef enum _WOW64_SHARED_INFORMATION {
  SharedNtdll32LdrInitializeThunk = 0,                  // ordinal: 0x0
  SharedNtdll32KiUserExceptionDispatcher = 1,           // ordinal: 0x1
  SharedNtdll32KiUserApcDispatcher = 2,                 // ordinal: 0x2
  SharedNtdll32KiUserCallbackDispatcher = 3,            // ordinal: 0x3
  SharedNtdll32ExpInterlockedPopEntrySListFault = 4,    // ordinal: 0x4
  SharedNtdll32ExpInterlockedPopEntrySListResume = 5,   // ordinal: 0x5
  SharedNtdll32ExpInterlockedPopEntrySListEnd = 6,      // ordinal: 0x6
  SharedNtdll32RtlUserThreadStart = 7,                  // ordinal: 0x7
  SharedNtdll32pQueryProcessDebugInformationRemote = 8, // ordinal: 0x8
  SharedNtdll32BaseAddress = 9,                         // ordinal: 0x9
  SharedNtdll32LdrSystemDllInitBlock = 10,              // ordinal: 0xa
  Wow64SharedPageEntriesCount = 11,                     // ordinal: 0xb
} _WOW64_SHARED_INFORMATION;

typedef enum _MI_CFG_BITMAP_TYPE {
  CfgBitMapNative = 0, // ordinal: 0x0
  CfgBitMapWow64 = 1,  // ordinal: 0x1
  CfgBitMapMax = 2,    // ordinal: 0x2
} _MI_CFG_BITMAP_TYPE;

typedef enum _WORKING_SET_TYPE {
  WorkingSetTypeUser = 0,        // ordinal: 0x0
  WorkingSetTypeSession = 1,     // ordinal: 0x1
  WorkingSetTypeSystemTypes = 2, // ordinal: 0x2
  WorkingSetTypeSystemCache = 2, // ordinal: 0x3
  WorkingSetTypePagedPool = 3,   // ordinal: 0x4
  WorkingSetTypeSystemPtes = 4,  // ordinal: 0x5
  WorkingSetTypeMaximum = 5,     // ordinal: 0x6
} _WORKING_SET_TYPE;

typedef enum _TlgIn_t {
  _TlgInNULL = 0,                 // ordinal: 0x0
  _TlgInUNICODESTRING = 1,        // ordinal: 0x1
  _TlgInANSISTRING = 2,           // ordinal: 0x2
  _TlgInINT8 = 3,                 // ordinal: 0x3
  _TlgInUINT8 = 4,                // ordinal: 0x4
  _TlgInINT16 = 5,                // ordinal: 0x5
  _TlgInUINT16 = 6,               // ordinal: 0x6
  _TlgInINT32 = 7,                // ordinal: 0x7
  _TlgInUINT32 = 8,               // ordinal: 0x8
  _TlgInINT64 = 9,                // ordinal: 0x9
  _TlgInUINT64 = 10,              // ordinal: 0xa
  _TlgInFLOAT = 11,               // ordinal: 0xb
  _TlgInDOUBLE = 12,              // ordinal: 0xc
  _TlgInBOOL32 = 13,              // ordinal: 0xd
  _TlgInBINARY = 14,              // ordinal: 0xe
  _TlgInGUID = 15,                // ordinal: 0xf
  _TlgInPOINTER_unsupported = 16, // ordinal: 0x10
  _TlgInFILETIME = 17,            // ordinal: 0x11
  _TlgInSYSTEMTIME = 18,          // ordinal: 0x12
  _TlgInSID = 19,                 // ordinal: 0x13
  _TlgInHEXINT32 = 20,            // ordinal: 0x14
  _TlgInHEXINT64 = 21,            // ordinal: 0x15
  _TlgInCOUNTEDSTRING = 22,       // ordinal: 0x16
  _TlgInCOUNTEDANSISTRING = 23,   // ordinal: 0x17
  _TlgInSTRUCT = 24,              // ordinal: 0x18
  _TlgInMax = 25,                 // ordinal: 0x19
  _TlgInINTPTR = 9,               // ordinal: 0x1a
  _TlgInUINTPTR = 10,             // ordinal: 0x1b
  _TlgInPOINTER = 21,             // ordinal: 0x1c
  _TlgInCcount = 32,              // ordinal: 0x1d
  _TlgInVcount = 64,              // ordinal: 0x1e
  _TlgInChain = 128,              // ordinal: 0x1f
  _TlgInCustom = 96,              // ordinal: 0x20
  _TlgInTypeMask = 31,            // ordinal: 0x21
  _TlgInCountMask = 96,           // ordinal: 0x22
  _TlgInFlagMask = 224,           // ordinal: 0x23
} _TlgIn_t;

typedef enum _KPROCESS_STATE {
  ProcessInMemory = 0,      // ordinal: 0x0
  ProcessOutOfMemory = 1,   // ordinal: 0x1
  ProcessInTransition = 2,  // ordinal: 0x2
  ProcessOutTransition = 3, // ordinal: 0x3
  ProcessInSwap = 4,        // ordinal: 0x4
  ProcessOutSwap = 5,       // ordinal: 0x5
  ProcessRetryOutSwap = 6,  // ordinal: 0x6
  ProcessAllSwapStates = 7, // ordinal: 0x7
} _KPROCESS_STATE;

typedef enum _MM_POOL_FAILURE_REASONS {
  MmNonPagedNoPtes = 0,               // ordinal: 0x0
  MmPriorityTooLow = 1,               // ordinal: 0x1
  MmNonPagedNoPagesAvailable = 2,     // ordinal: 0x2
  MmPagedNoPtes = 3,                  // ordinal: 0x3
  MmSessionPagedNoPtes = 4,           // ordinal: 0x4
  MmPagedNoPagesAvailable = 5,        // ordinal: 0x5
  MmSessionPagedNoPagesAvailable = 6, // ordinal: 0x6
  MmPagedNoCommit = 7,                // ordinal: 0x7
  MmSessionPagedNoCommit = 8,         // ordinal: 0x8
  MmNonPagedNoResidentAvailable = 9,  // ordinal: 0x9
  MmNonPagedNoCommit = 10,            // ordinal: 0xa
  MmMaximumFailureReason = 11,        // ordinal: 0xb
} _MM_POOL_FAILURE_REASONS;

typedef enum JOB_OBJECT_IO_RATE_CONTROL_FLAGS {
  JOB_OBJECT_IO_RATE_CONTROL_ENABLE = 1,      // ordinal: 0x0
  JOB_OBJECT_IO_RATE_CONTROL_VALID_FLAGS = 1, // ordinal: 0x1
} JOB_OBJECT_IO_RATE_CONTROL_FLAGS;

typedef enum _KWAIT_BLOCK_STATE {
  WaitBlockBypassStart = 0,           // ordinal: 0x0
  WaitBlockBypassComplete = 1,        // ordinal: 0x1
  WaitBlockSuspendBypassStart = 2,    // ordinal: 0x2
  WaitBlockSuspendBypassComplete = 3, // ordinal: 0x3
  WaitBlockActive = 4,                // ordinal: 0x4
  WaitBlockInactive = 5,              // ordinal: 0x5
  WaitBlockSuspended = 6,             // ordinal: 0x6
  WaitBlockAllStates = 7,             // ordinal: 0x7
} _KWAIT_BLOCK_STATE;

typedef enum _OBJECT_INFORMATION_CLASS {
  ObjectBasicInformation = 0,      // ordinal: 0x0
  ObjectNameInformation = 1,       // ordinal: 0x1
  ObjectTypeInformation = 2,       // ordinal: 0x2
  ObjectTypesInformation = 3,      // ordinal: 0x3
  ObjectHandleFlagInformation = 4, // ordinal: 0x4
  ObjectSessionInformation = 5,    // ordinal: 0x5
  MaxObjectInfoClass = 6,          // ordinal: 0x6
} _OBJECT_INFORMATION_CLASS;

typedef enum _PS_WAKE_REASON {
  PsWakeReasonUser = 0,              // ordinal: 0x0
  PsWakeReasonExecutionRequired = 1, // ordinal: 0x1
  PsWakeReasonKernel = 2,            // ordinal: 0x2
  PsWakeReasonInstrumentation = 3,   // ordinal: 0x3
  PsWakeReasonPreserveProcess = 4,   // ordinal: 0x4
  PsMaxWakeReasons = 5,              // ordinal: 0x5
} _PS_WAKE_REASON;

typedef enum _ETW_PERFECT_HASH_FUNCTION_TYPE {
  ETW_PHF_EVENT_ID = 0,   // ordinal: 0x0
  ETW_PHF_STACK_WALK = 1, // ordinal: 0x1
  ETW_PHF_MAX_COUNT = 2,  // ordinal: 0x2
} _ETW_PERFECT_HASH_FUNCTION_TYPE;

typedef enum _PROCESS_SECTION_TYPE {
  ProcessSectionData = 0,           // ordinal: 0x0
  ProcessSectionImage = 1,          // ordinal: 0x1
  ProcessSectionImageNx = 2,        // ordinal: 0x2
  ProcessSectionPagefileBacked = 3, // ordinal: 0x3
  ProcessSectionMax = 4,            // ordinal: 0x4
} _PROCESS_SECTION_TYPE;

typedef enum ReplacesCorHdrNumericDefines {
  COMIMAGE_FLAGS_ILONLY = 1,                      // ordinal: 0x0
  COMIMAGE_FLAGS_32BITREQUIRED = 2,               // ordinal: 0x1
  COMIMAGE_FLAGS_IL_LIBRARY = 4,                  // ordinal: 0x2
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,            // ordinal: 0x3
  COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 16,          // ordinal: 0x4
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 65536,          // ordinal: 0x5
  COMIMAGE_FLAGS_32BITPREFERRED = 131072,         // ordinal: 0x6
  COR_VERSION_MAJOR_V2 = 2,                       // ordinal: 0x7
  COR_VERSION_MAJOR = 2,                          // ordinal: 0x8
  COR_VERSION_MINOR = 5,                          // ordinal: 0x9
  COR_DELETED_NAME_LENGTH = 8,                    // ordinal: 0xa
  COR_VTABLEGAP_NAME_LENGTH = 8,                  // ordinal: 0xb
  NATIVE_TYPE_MAX_CB = 1,                         // ordinal: 0xc
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,     // ordinal: 0xd
  IMAGE_COR_MIH_METHODRVA = 1,                    // ordinal: 0xe
  IMAGE_COR_MIH_EHRVA = 2,                        // ordinal: 0xf
  IMAGE_COR_MIH_BASICBLOCK = 8,                   // ordinal: 0x10
  COR_VTABLE_32BIT = 1,                           // ordinal: 0x11
  COR_VTABLE_64BIT = 2,                           // ordinal: 0x12
  COR_VTABLE_FROM_UNMANAGED = 4,                  // ordinal: 0x13
  COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8, // ordinal: 0x14
  COR_VTABLE_CALL_MOST_DERIVED = 16,              // ordinal: 0x15
  IMAGE_COR_EATJ_THUNK_SIZE = 32,                 // ordinal: 0x16
  MAX_CLASS_NAME = 1024,                          // ordinal: 0x17
  MAX_PACKAGE_NAME = 1024,                        // ordinal: 0x18
} ReplacesCorHdrNumericDefines;

typedef enum _EX_BALANCE_OBJECT {
  ExTimerExpiration = 0,       // ordinal: 0x0
  ExThreadSetManagerEvent = 1, // ordinal: 0x1
  ExThreadReaperEvent = 2,     // ordinal: 0x2
  ExMaximumBalanceObject = 3,  // ordinal: 0x3
} _EX_BALANCE_OBJECT;

typedef enum _MI_IO_PFN_TYPE {
  MiIoPfnProbes = 0,      // ordinal: 0x0
  MiIoPfnMaps = 1,        // ordinal: 0x1
  MiIoPfnUnmapped = 2,    // ordinal: 0x2
  MiMaximumIoPfnType = 3, // ordinal: 0x3
} _MI_IO_PFN_TYPE;

typedef enum _PS_STD_HANDLE_STATE {
  PsNeverDuplicate = 0,     // ordinal: 0x0
  PsRequestDuplicate = 1,   // ordinal: 0x1
  PsAlwaysDuplicate = 2,    // ordinal: 0x2
  PsMaxStdHandleStates = 3, // ordinal: 0x3
} _PS_STD_HANDLE_STATE;

typedef enum _PROCESS_VA_TYPE {
  ProcessVAImage = 0,   // ordinal: 0x0
  ProcessVASection = 1, // ordinal: 0x1
  ProcessVAPrivate = 2, // ordinal: 0x2
  ProcessVAMax = 3,     // ordinal: 0x3
} _PROCESS_VA_TYPE;

typedef enum _PS_PROTECTED_SIGNER {
  PsProtectedSignerNone = 0,         // ordinal: 0x0
  PsProtectedSignerAuthenticode = 1, // ordinal: 0x1
  PsProtectedSignerCodeGen = 2,      // ordinal: 0x2
  PsProtectedSignerAntimalware = 3,  // ordinal: 0x3
  PsProtectedSignerLsa = 4,          // ordinal: 0x4
  PsProtectedSignerWindows = 5,      // ordinal: 0x5
  PsProtectedSignerWinTcb = 6,       // ordinal: 0x6
  PsProtectedSignerMax = 7,          // ordinal: 0x7
} _PS_PROTECTED_SIGNER;

typedef enum _POLICY_AUDIT_EVENT_TYPE {
  AuditCategorySystem = 0,                 // ordinal: 0x0
  AuditCategoryLogon = 1,                  // ordinal: 0x1
  AuditCategoryObjectAccess = 2,           // ordinal: 0x2
  AuditCategoryPrivilegeUse = 3,           // ordinal: 0x3
  AuditCategoryDetailedTracking = 4,       // ordinal: 0x4
  AuditCategoryPolicyChange = 5,           // ordinal: 0x5
  AuditCategoryAccountManagement = 6,      // ordinal: 0x6
  AuditCategoryDirectoryServiceAccess = 7, // ordinal: 0x7
  AuditCategoryAccountLogon = 8,           // ordinal: 0x8
} _POLICY_AUDIT_EVENT_TYPE;

typedef enum _MI_AVAILABLE_PAGE_WAIT_TYPES {
  AvailablePagesWaitLow = 0,     // ordinal: 0x0
  AvailablePagesWaitHigh = 1,    // ordinal: 0x1
  AvailablePagesWaitMaximum = 2, // ordinal: 0x2
} _MI_AVAILABLE_PAGE_WAIT_TYPES;

typedef enum _PERFINFO_KERNELMEMORY_USAGE_TYPE {
  PerfInfoMemUsagePfnMetadata = 0, // ordinal: 0x0
  PerfInfoMemUsageMax = 1,         // ordinal: 0x1
} _PERFINFO_KERNELMEMORY_USAGE_TYPE;

typedef enum _KOBJECTS {
  EventNotificationObject = 0,      // ordinal: 0x0
  EventSynchronizationObject = 1,   // ordinal: 0x1
  MutantObject = 2,                 // ordinal: 0x2
  ProcessObject = 3,                // ordinal: 0x3
  QueueObject = 4,                  // ordinal: 0x4
  SemaphoreObject = 5,              // ordinal: 0x5
  ThreadObject = 6,                 // ordinal: 0x6
  GateObject = 7,                   // ordinal: 0x7
  TimerNotificationObject = 8,      // ordinal: 0x8
  TimerSynchronizationObject = 9,   // ordinal: 0x9
  Spare2Object = 10,                // ordinal: 0xa
  Spare3Object = 11,                // ordinal: 0xb
  Spare4Object = 12,                // ordinal: 0xc
  Spare5Object = 13,                // ordinal: 0xd
  Spare6Object = 14,                // ordinal: 0xe
  Spare7Object = 15,                // ordinal: 0xf
  Spare8Object = 16,                // ordinal: 0x10
  ProfileCallbackObject = 17,       // ordinal: 0x11
  ApcObject = 18,                   // ordinal: 0x12
  DpcObject = 19,                   // ordinal: 0x13
  DeviceQueueObject = 20,           // ordinal: 0x14
  PriQueueObject = 21,              // ordinal: 0x15
  InterruptObject = 22,             // ordinal: 0x16
  ProfileObject = 23,               // ordinal: 0x17
  Timer2NotificationObject = 24,    // ordinal: 0x18
  Timer2SynchronizationObject = 25, // ordinal: 0x19
  ThreadedDpcObject = 26,           // ordinal: 0x1a
  MaximumKernelObject = 27,         // ordinal: 0x1b
} _KOBJECTS;

typedef enum _PS_PROTECTED_TYPE {
  PsProtectedTypeNone = 0,           // ordinal: 0x0
  PsProtectedTypeProtectedLight = 1, // ordinal: 0x1
  PsProtectedTypeProtected = 2,      // ordinal: 0x2
  PsProtectedTypeMax = 3,            // ordinal: 0x3
} _PS_PROTECTED_TYPE;

typedef enum _INTERLOCKED_RESULT {
  ResultNegative = 1, // ordinal: 0x0
  ResultZero = 0,     // ordinal: 0x1
  ResultPositive = 2, // ordinal: 0x2
} _INTERLOCKED_RESULT;

typedef enum _KTHREAD_STATE {
  Initialized = 0,             // ordinal: 0x0
  Ready = 1,                   // ordinal: 0x1
  Running = 2,                 // ordinal: 0x2
  Standby = 3,                 // ordinal: 0x3
  Terminated = 4,              // ordinal: 0x4
  Waiting = 5,                 // ordinal: 0x5
  Transition = 6,              // ordinal: 0x6
  DeferredReady = 7,           // ordinal: 0x7
  GateWaitObsolete = 8,        // ordinal: 0x8
  WaitingForProcessInSwap = 9, // ordinal: 0x9
} _KTHREAD_STATE;

typedef enum _MM_POOL_PRIORITIES {
  MmHighPriority = 0,        // ordinal: 0x0
  MmNormalPriority = 1,      // ordinal: 0x1
  MmLowPriority = 2,         // ordinal: 0x2
  MmMaximumPoolPriority = 3, // ordinal: 0x3
} _MM_POOL_PRIORITIES;

typedef enum _KTHREAD_TAG {
  KThreadTagNone = 0,           // ordinal: 0x0
  KThreadTagMediaBuffering = 1, // ordinal: 0x1
  KThreadTagMax = 2,            // ordinal: 0x2
} _KTHREAD_TAG;

typedef enum _MEMORY_CACHING_TYPE_ORIG {
  MmFrameBufferCached = 2, // ordinal: 0x0
} _MEMORY_CACHING_TYPE_ORIG;

typedef enum _KWAIT_STATE {
  WaitInProgress = 0,        // ordinal: 0x0
  WaitCommitted = 1,         // ordinal: 0x1
  WaitAborted = 2,           // ordinal: 0x2
  WaitSuspendInProgress = 3, // ordinal: 0x3
  WaitSuspended = 4,         // ordinal: 0x4
  WaitResumeInProgress = 5,  // ordinal: 0x5
  WaitResumeAborted = 6,     // ordinal: 0x6
  WaitFirstSuspendState = 3, // ordinal: 0x7
  WaitLastSuspendState = 6,  // ordinal: 0x8
  MaximumWaitState = 7,      // ordinal: 0x9
} _KWAIT_STATE;

typedef enum _MM_POOL_TYPES {
  MmNonPagedPool = 0,     // ordinal: 0x0
  MmPagedPool = 1,        // ordinal: 0x1
  MmSessionPagedPool = 2, // ordinal: 0x2
  MmMaximumPoolType = 3,  // ordinal: 0x3
} _MM_POOL_TYPES;

typedef enum _ETW_STRING_TOKEN_TYPE {
  ETW_STRING_TOKEN_EXE = 0,        // ordinal: 0x0
  ETW_STRING_TOKEN_PACKAGE_ID = 1, // ordinal: 0x1
  ETW_STRING_TOKEN_PKG_APP_ID = 2, // ordinal: 0x2
  ETW_STRING_TOKEN_MAX_COUNT = 3,  // ordinal: 0x3
} _ETW_STRING_TOKEN_TYPE;

typedef enum _MI_MEMORY_HIGHLOW {
  MiMemoryHigh = 0,    // ordinal: 0x0
  MiMemoryLow = 1,     // ordinal: 0x1
  MiMemoryHighLow = 2, // ordinal: 0x2
} _MI_MEMORY_HIGHLOW;

typedef enum _KHETERO_CPU_POLICY {
  KHeteroCpuPolicyAll = 0,         // ordinal: 0x0
  KHeteroCpuPolicyLarge = 1,       // ordinal: 0x1
  KHeteroCpuPolicyLargeOrIdle = 2, // ordinal: 0x2
  KHeteroCpuPolicySmall = 3,       // ordinal: 0x3
  KHeteroCpuPolicySmallOrIdle = 4, // ordinal: 0x4
  KHeteroCpuPolicyDynamic = 5,     // ordinal: 0x5
  KHeteroCpuPolicyStaticMax = 5,   // ordinal: 0x6
  KHeteroCpuPolicyBiasedSmall = 6, // ordinal: 0x7
  KHeteroCpuPolicyBiasedLarge = 7, // ordinal: 0x8
  KHeteroCpuPolicyDefault = 8,     // ordinal: 0x9
  KHeteroCpuPolicyMax = 9,         // ordinal: 0xa
} _KHETERO_CPU_POLICY;

typedef enum PS_CREATE_STATE {
  PsCreateInitialState = 0,        // ordinal: 0x0
  PsCreateFailOnFileOpen = 1,      // ordinal: 0x1
  PsCreateFailOnSectionCreate = 2, // ordinal: 0x2
  PsCreateFailExeFormat = 3,       // ordinal: 0x3
  PsCreateFailMachineMismatch = 4, // ordinal: 0x4
  PsCreateFailExeName = 5,         // ordinal: 0x5
  PsCreateSuccess = 6,             // ordinal: 0x6
  PsCreateMaximumStates = 7,       // ordinal: 0x7
} PS_CREATE_STATE;

typedef enum _TlgBlob_t {
  _TlgBlobNone = 0,      // ordinal: 0x0
  _TlgBlobEnd = 1,       // ordinal: 0x1
  _TlgBlobProvider = 2,  // ordinal: 0x2
  _TlgBlobEvent3 = 3,    // ordinal: 0x3
  _TlgBlobProvider3 = 4, // ordinal: 0x4
  _TlgBlobEvent2 = 5,    // ordinal: 0x5
  _TlgBlobMax = 6,       // ordinal: 0x6
} _TlgBlob_t;

typedef enum _DEVPROP_OPERATOR {
  DEVPROP_OPERATOR_MODIFIER_NOT = 65536,               // ordinal: 0x0
  DEVPROP_OPERATOR_MODIFIER_IGNORE_CASE = 131072,      // ordinal: 0x1
  DEVPROP_OPERATOR_NONE = 0,                           // ordinal: 0x2
  DEVPROP_OPERATOR_EXISTS = 1,                         // ordinal: 0x3
  DEVPROP_OPERATOR_NOT_EXISTS = 65537,                 // ordinal: 0x4
  DEVPROP_OPERATOR_EQUALS = 2,                         // ordinal: 0x5
  DEVPROP_OPERATOR_NOT_EQUALS = 65538,                 // ordinal: 0x6
  DEVPROP_OPERATOR_GREATER_THAN = 3,                   // ordinal: 0x7
  DEVPROP_OPERATOR_LESS_THAN = 4,                      // ordinal: 0x8
  DEVPROP_OPERATOR_GREATER_THAN_EQUALS = 5,            // ordinal: 0x9
  DEVPROP_OPERATOR_LESS_THAN_EQUALS = 6,               // ordinal: 0xa
  DEVPROP_OPERATOR_EQUALS_IGNORE_CASE = 131074,        // ordinal: 0xb
  DEVPROP_OPERATOR_NOT_EQUALS_IGNORE_CASE = 196610,    // ordinal: 0xc
  DEVPROP_OPERATOR_BITWISE_AND = 7,                    // ordinal: 0xd
  DEVPROP_OPERATOR_BITWISE_OR = 8,                     // ordinal: 0xe
  DEVPROP_OPERATOR_BEGINS_WITH = 9,                    // ordinal: 0xf
  DEVPROP_OPERATOR_ENDS_WITH = 10,                     // ordinal: 0x10
  DEVPROP_OPERATOR_CONTAINS = 11,                      // ordinal: 0x11
  DEVPROP_OPERATOR_BEGINS_WITH_IGNORE_CASE = 131081,   // ordinal: 0x12
  DEVPROP_OPERATOR_ENDS_WITH_IGNORE_CASE = 131082,     // ordinal: 0x13
  DEVPROP_OPERATOR_CONTAINS_IGNORE_CASE = 131083,      // ordinal: 0x14
  DEVPROP_OPERATOR_LIST_CONTAINS = 4096,               // ordinal: 0x15
  DEVPROP_OPERATOR_LIST_ELEMENT_BEGINS_WITH = 8192,    // ordinal: 0x16
  DEVPROP_OPERATOR_LIST_ELEMENT_ENDS_WITH = 12288,     // ordinal: 0x17
  DEVPROP_OPERATOR_LIST_ELEMENT_CONTAINS = 16384,      // ordinal: 0x18
  DEVPROP_OPERATOR_LIST_CONTAINS_IGNORE_CASE = 135168, // ordinal: 0x19
  DEVPROP_OPERATOR_LIST_ELEMENT_BEGINS_WITH_IGNORE_CASE =
      139264,                                                   // ordinal: 0x1a
  DEVPROP_OPERATOR_LIST_ELEMENT_ENDS_WITH_IGNORE_CASE = 143360, // ordinal: 0x1b
  DEVPROP_OPERATOR_LIST_ELEMENT_CONTAINS_IGNORE_CASE = 147456,  // ordinal: 0x1c
  DEVPROP_OPERATOR_AND_OPEN = 1048576,                          // ordinal: 0x1d
  DEVPROP_OPERATOR_AND_CLOSE = 2097152,                         // ordinal: 0x1e
  DEVPROP_OPERATOR_OR_OPEN = 3145728,                           // ordinal: 0x1f
  DEVPROP_OPERATOR_OR_CLOSE = 4194304,                          // ordinal: 0x20
  DEVPROP_OPERATOR_NOT_OPEN = 5242880,                          // ordinal: 0x21
  DEVPROP_OPERATOR_NOT_CLOSE = 6291456,                         // ordinal: 0x22
  DEVPROP_OPERATOR_ARRAY_CONTAINS = 268435456,                  // ordinal: 0x23
  DEVPROP_OPERATOR_MASK_EVAL = 4095,                            // ordinal: 0x24
  DEVPROP_OPERATOR_MASK_LIST = 61440,                           // ordinal: 0x25
  DEVPROP_OPERATOR_MASK_MODIFIER = 983040,                      // ordinal: 0x26
  DEVPROP_OPERATOR_MASK_NOT_LOGICAL = -267386881,               // ordinal: 0x27
  DEVPROP_OPERATOR_MASK_LOGICAL = 267386880,                    // ordinal: 0x28
  DEVPROP_OPERATOR_MASK_ARRAY = -268435456,                     // ordinal: 0x29
} _DEVPROP_OPERATOR;

typedef enum _MI_KSTACK_TYPE {
  MiRegularKstack = 0,    // ordinal: 0x0
  MiShortLivedKstack = 1, // ordinal: 0x1
  MiMaximumKstack = 2,    // ordinal: 0x2
} _MI_KSTACK_TYPE;

typedef enum JOB_OBJECT_NET_RATE_CONTROL_FLAGS {
  JOB_OBJECT_NET_RATE_CONTROL_ENABLE = 1,        // ordinal: 0x0
  JOB_OBJECT_NET_RATE_CONTROL_MAX_BANDWIDTH = 2, // ordinal: 0x1
  JOB_OBJECT_NET_RATE_CONTROL_DSCP_TAG = 4,      // ordinal: 0x2
  JOB_OBJECT_NET_RATE_CONTROL_VALID_FLAGS = 7,   // ordinal: 0x3
} JOB_OBJECT_NET_RATE_CONTROL_FLAGS;

typedef enum LSA_FOREST_TRUST_RECORD_TYPE {
  ForestTrustTopLevelName = 0,   // ordinal: 0x0
  ForestTrustTopLevelNameEx = 1, // ordinal: 0x1
  ForestTrustDomainInfo = 2,     // ordinal: 0x2
  ForestTrustRecordTypeLast = 2, // ordinal: 0x3
} LSA_FOREST_TRUST_RECORD_TYPE;

typedef enum _MM_PREEMPTIVE_TRIMS {
  MmPreemptForNonPaged = 0,         // ordinal: 0x0
  MmPreemptForPaged = 1,            // ordinal: 0x1
  MmPreemptForNonPagedPriority = 2, // ordinal: 0x2
  MmPreemptForPagedPriority = 3,    // ordinal: 0x3
  MmMaximumPreempt = 4,             // ordinal: 0x4
} _MM_PREEMPTIVE_TRIMS;

typedef enum _ConnectionResourceConsumerDesc {
  ConnectionResourceConsumerDescIsUndefined = 0, // ordinal: 0x0
  ConnectionResourceConsumerDescIsDevice = 1,    // ordinal: 0x1
  ConnectionResourceConsumerDescIsOpregion = 2,  // ordinal: 0x2
  ConnectionResourceConsumerDescMax = 3,         // ordinal: 0x3
} _ConnectionResourceConsumerDesc;

typedef enum _CM_SHARE_DISPOSITION {
  CmResourceShareUndetermined = 0,    // ordinal: 0x0
  CmResourceShareDeviceExclusive = 1, // ordinal: 0x1
  CmResourceShareDriverExclusive = 2, // ordinal: 0x2
  CmResourceShareShared = 3,          // ordinal: 0x3
} _CM_SHARE_DISPOSITION;

typedef enum _JOBOBJECTINFOCLASS {
  JobObjectBasicAccountingInformation = 1,         // ordinal: 0x0
  JobObjectBasicLimitInformation = 2,              // ordinal: 0x1
  JobObjectBasicProcessIdList = 3,                 // ordinal: 0x2
  JobObjectBasicUIRestrictions = 4,                // ordinal: 0x3
  JobObjectSecurityLimitInformation = 5,           // ordinal: 0x4
  JobObjectEndOfJobTimeInformation = 6,            // ordinal: 0x5
  JobObjectAssociateCompletionPortInformation = 7, // ordinal: 0x6
  JobObjectBasicAndIoAccountingInformation = 8,    // ordinal: 0x7
  JobObjectExtendedLimitInformation = 9,           // ordinal: 0x8
  JobObjectJobSetInformation = 10,                 // ordinal: 0x9
  JobObjectGroupInformation = 11,                  // ordinal: 0xa
  JobObjectNotificationLimitInformation = 12,      // ordinal: 0xb
  JobObjectLimitViolationInformation = 13,         // ordinal: 0xc
  JobObjectGroupInformationEx = 14,                // ordinal: 0xd
  JobObjectCpuRateControlInformation = 15,         // ordinal: 0xe
  JobObjectCompletionFilter = 16,                  // ordinal: 0xf
  JobObjectCompletionCounter = 17,                 // ordinal: 0x10
  JobObjectFreezeInformation = 18,                 // ordinal: 0x11
  JobObjectExtendedAccountingInformation = 19,     // ordinal: 0x12
  JobObjectWakeInformation = 20,                   // ordinal: 0x13
  JobObjectBackgroundInformation = 21,             // ordinal: 0x14
  JobObjectSchedulingRankBiasInformation = 22,     // ordinal: 0x15
  JobObjectTimerVirtualizationInformation = 23,    // ordinal: 0x16
  JobObjectCycleTimeNotification = 24,             // ordinal: 0x17
  JobObjectClearEvent = 25,                        // ordinal: 0x18
  JobObjectInterferenceInformation = 26,           // ordinal: 0x19
  JobObjectClearPeakJobMemoryUsed = 27,            // ordinal: 0x1a
  JobObjectMemoryUsageInformation = 28,            // ordinal: 0x1b
  JobObjectSharedCommit = 29,                      // ordinal: 0x1c
  JobObjectContainerId = 30,                       // ordinal: 0x1d
  JobObjectIoRateControlInformation = 31,          // ordinal: 0x1e
  JobObjectReserved1Information = 18,              // ordinal: 0x1f
  JobObjectReserved2Information = 19,              // ordinal: 0x20
  JobObjectReserved3Information = 20,              // ordinal: 0x21
  JobObjectReserved4Information = 21,              // ordinal: 0x22
  JobObjectReserved5Information = 22,              // ordinal: 0x23
  JobObjectReserved6Information = 23,              // ordinal: 0x24
  JobObjectReserved7Information = 24,              // ordinal: 0x25
  JobObjectReserved8Information = 25,              // ordinal: 0x26
  JobObjectReserved9Information = 26,              // ordinal: 0x27
  JobObjectReserved10Information = 27,             // ordinal: 0x28
  JobObjectReserved11Information = 28,             // ordinal: 0x29
  JobObjectReserved12Information = 29,             // ordinal: 0x2a
  JobObjectReserved13Information = 30,             // ordinal: 0x2b
  JobObjectReserved14Information = 31,             // ordinal: 0x2c
  JobObjectNetRateControlInformation = 32,         // ordinal: 0x2d
  JobObjectNotificationLimitInformation2 = 33,     // ordinal: 0x2e
  JobObjectLimitViolationInformation2 = 34,        // ordinal: 0x2f
  JobObjectCreateSilo = 35,                        // ordinal: 0x30
  JobObjectSiloBasicInformation = 36,              // ordinal: 0x31
  JobObjectSiloRootDirectory = 37,                 // ordinal: 0x32
  JobObjectServerSiloBasicInformation = 38,        // ordinal: 0x33
  JobObjectServerSiloServiceSessionId = 39,        // ordinal: 0x34
  JobObjectServerSiloInitialize = 40,              // ordinal: 0x35
  JobObjectServerSiloDefaultCompartmentId = 41,    // ordinal: 0x36
  MaxJobObjectInfoClass = 42,                      // ordinal: 0x37
} _JOBOBJECTINFOCLASS;

typedef enum _ETW_HEADER_TYPE {
  EtwHeaderTypeNative = 0, // ordinal: 0x0
  EtwHeaderTypeWow = 1,    // ordinal: 0x1
  EtwHeaderTypeMax = 2,    // ordinal: 0x2
} _ETW_HEADER_TYPE;

typedef enum _PS_RESOURCE_TYPE {
  PsResourceNonPagedPool = 0, // ordinal: 0x0
  PsResourcePagedPool = 1,    // ordinal: 0x1
  PsResourcePageFile = 2,     // ordinal: 0x2
  PsResourceWorkingSet = 3,   // ordinal: 0x3
  PsResourceMax = 4,          // ordinal: 0x4
} _PS_RESOURCE_TYPE;

typedef enum _USER_ACTIVITY_PRESENCE {
  PowerUserPresent = 0,    // ordinal: 0x0
  PowerUserNotPresent = 1, // ordinal: 0x1
  PowerUserInactive = 2,   // ordinal: 0x2
  PowerUserMaximum = 3,    // ordinal: 0x3
  PowerUserInvalid = 3,    // ordinal: 0x4
} _USER_ACTIVITY_PRESENCE;

typedef enum _PS_ATTRIBUTE_NUM {
  PsAttributeParentProcess = 0,      // ordinal: 0x0
  PsAttributeDebugObject = 1,        // ordinal: 0x1
  PsAttributeToken = 2,              // ordinal: 0x2
  PsAttributeClientId = 3,           // ordinal: 0x3
  PsAttributeTebAddress = 4,         // ordinal: 0x4
  PsAttributeImageName = 5,          // ordinal: 0x5
  PsAttributeImageInfo = 6,          // ordinal: 0x6
  PsAttributeMemoryReserve = 7,      // ordinal: 0x7
  PsAttributePriorityClass = 8,      // ordinal: 0x8
  PsAttributeErrorMode = 9,          // ordinal: 0x9
  PsAttributeStdHandleInfo = 10,     // ordinal: 0xa
  PsAttributeHandleList = 11,        // ordinal: 0xb
  PsAttributeGroupAffinity = 12,     // ordinal: 0xc
  PsAttributePreferredNode = 13,     // ordinal: 0xd
  PsAttributeIdealProcessor = 14,    // ordinal: 0xe
  PsAttributeUmsThread = 15,         // ordinal: 0xf
  PsAttributeMitigationOptions = 16, // ordinal: 0x10
  PsAttributeProtectionLevel = 17,   // ordinal: 0x11
  PsAttributeSecureProcess = 18,     // ordinal: 0x12
  PsAttributeJobList = 19,           // ordinal: 0x13
  PsAttributeMax = 20,               // ordinal: 0x14
} _PS_ATTRIBUTE_NUM;

typedef enum _MI_NODE_NONPAGED_POOL_BITMAP {
  NonPagedPoolLargePdeNx = 0, // ordinal: 0x0
  NonPagedPoolSmallPde = 1,   // ordinal: 0x1
  NonPagedPoolPerPage = 2,    // ordinal: 0x2
} _MI_NODE_NONPAGED_POOL_BITMAP;

typedef enum SLEEPSTUDY_SPM_SCENARIO_CS_EXIT {
  SpmScenarioStopReasonUnspecified = 16, // ordinal: 0x0
  SpmScenarioStopReasonCsExit = 17,      // ordinal: 0x1
  SpmScenarioStopReasonMax = 18,         // ordinal: 0x2
} SLEEPSTUDY_SPM_SCENARIO_CS_EXIT;

typedef enum _MI_WORKING_SET_TYPE {
  MiWorkingSetTypeSystemCache = 0, // ordinal: 0x0
  MiWorkingSetTypePagedPool = 1,   // ordinal: 0x1
  MiWorkingSetTypeSystemPtes = 2,  // ordinal: 0x2
  MiWorkingSetTypeMaximum = 3,     // ordinal: 0x3
} _MI_WORKING_SET_TYPE;

typedef enum _TRACE_INFORMATION_CLASS {
  TraceIdClass = 0,                    // ordinal: 0x0
  TraceHandleClass = 1,                // ordinal: 0x1
  TraceEnableFlagsClass = 2,           // ordinal: 0x2
  TraceEnableLevelClass = 3,           // ordinal: 0x3
  GlobalLoggerHandleClass = 4,         // ordinal: 0x4
  EventLoggerHandleClass = 5,          // ordinal: 0x5
  AllLoggerHandlesClass = 6,           // ordinal: 0x6
  TraceHandleByNameClass = 7,          // ordinal: 0x7
  LoggerEventsLostClass = 8,           // ordinal: 0x8
  TraceSessionSettingsClass = 9,       // ordinal: 0x9
  LoggerEventsLoggedClass = 10,        // ordinal: 0xa
  DiskIoNotifyRoutinesClass = 11,      // ordinal: 0xb
  TraceInformationClassReserved1 = 12, // ordinal: 0xc
  AllPossibleNotifyRoutinesClass = 12, // ordinal: 0xd
  FltIoNotifyRoutinesClass = 13,       // ordinal: 0xe
  TraceInformationClassReserved2 = 14, // ordinal: 0xf
  WdfNotifyRoutinesClass = 15,         // ordinal: 0x10
  MaxTraceInformationClass = 16,       // ordinal: 0x11
} _TRACE_INFORMATION_CLASS;

typedef enum _KTIMER2_TYPE {
  KTimer2TypeMin = 0,        // ordinal: 0x0
  KTimer2Plain = 0,          // ordinal: 0x1
  KTimer2IdleResilient = 1,  // ordinal: 0x2
  KTimer2HighResolution = 2, // ordinal: 0x3
  KTimer2NoWake = 3,         // ordinal: 0x4
  KTimer2NoWakeFinite = 4,   // ordinal: 0x5
  KTimer2TypeMax = 5,        // ordinal: 0x6
} _KTIMER2_TYPE;

typedef enum _TRANSFER_TYPE {
  ReadTransfer = 0,  // ordinal: 0x0
  WriteTransfer = 1, // ordinal: 0x1
  OtherTransfer = 2, // ordinal: 0x2
} _TRANSFER_TYPE;

typedef enum _LOCK_OPERATION {
  IoReadAccess = 0,   // ordinal: 0x0
  IoWriteAccess = 1,  // ordinal: 0x1
  IoModifyAccess = 2, // ordinal: 0x2
} _LOCK_OPERATION;

typedef enum _EX_POOL_PRIORITY {
  LowPoolPriority = 0,                        // ordinal: 0x0
  LowPoolPrioritySpecialPoolOverrun = 8,      // ordinal: 0x1
  LowPoolPrioritySpecialPoolUnderrun = 9,     // ordinal: 0x2
  NormalPoolPriority = 16,                    // ordinal: 0x3
  NormalPoolPrioritySpecialPoolOverrun = 24,  // ordinal: 0x4
  NormalPoolPrioritySpecialPoolUnderrun = 25, // ordinal: 0x5
  HighPoolPriority = 32,                      // ordinal: 0x6
  HighPoolPrioritySpecialPoolOverrun = 40,    // ordinal: 0x7
  HighPoolPrioritySpecialPoolUnderrun = 41,   // ordinal: 0x8
} _EX_POOL_PRIORITY;

typedef enum _KWAIT_REASON {
  Executive = 0,          // ordinal: 0x0
  FreePage = 1,           // ordinal: 0x1
  PageIn = 2,             // ordinal: 0x2
  PoolAllocation = 3,     // ordinal: 0x3
  DelayExecution = 4,     // ordinal: 0x4
  Suspended = 5,          // ordinal: 0x5
  UserRequest = 6,        // ordinal: 0x6
  WrExecutive = 7,        // ordinal: 0x7
  WrFreePage = 8,         // ordinal: 0x8
  WrPageIn = 9,           // ordinal: 0x9
  WrPoolAllocation = 10,  // ordinal: 0xa
  WrDelayExecution = 11,  // ordinal: 0xb
  WrSuspended = 12,       // ordinal: 0xc
  WrUserRequest = 13,     // ordinal: 0xd
  WrSpare0 = 14,          // ordinal: 0xe
  WrQueue = 15,           // ordinal: 0xf
  WrLpcReceive = 16,      // ordinal: 0x10
  WrLpcReply = 17,        // ordinal: 0x11
  WrVirtualMemory = 18,   // ordinal: 0x12
  WrPageOut = 19,         // ordinal: 0x13
  WrRendezvous = 20,      // ordinal: 0x14
  WrKeyedEvent = 21,      // ordinal: 0x15
  WrTerminated = 22,      // ordinal: 0x16
  WrProcessInSwap = 23,   // ordinal: 0x17
  WrCpuRateControl = 24,  // ordinal: 0x18
  WrCalloutStack = 25,    // ordinal: 0x19
  WrKernel = 26,          // ordinal: 0x1a
  WrResource = 27,        // ordinal: 0x1b
  WrPushLock = 28,        // ordinal: 0x1c
  WrMutex = 29,           // ordinal: 0x1d
  WrQuantumEnd = 30,      // ordinal: 0x1e
  WrDispatchInt = 31,     // ordinal: 0x1f
  WrPreempted = 32,       // ordinal: 0x20
  WrYieldExecution = 33,  // ordinal: 0x21
  WrFastMutex = 34,       // ordinal: 0x22
  WrGuardedMutex = 35,    // ordinal: 0x23
  WrRundown = 36,         // ordinal: 0x24
  WrAlertByThreadId = 37, // ordinal: 0x25
  WrDeferredPreempt = 38, // ordinal: 0x26
  MaximumWaitReason = 39, // ordinal: 0x27
} _KWAIT_REASON;

typedef enum _HEAP_FAILURE_TYPE {
  heap_failure_internal = 0,                       // ordinal: 0x0
  heap_failure_unknown = 1,                        // ordinal: 0x1
  heap_failure_generic = 2,                        // ordinal: 0x2
  heap_failure_entry_corruption = 3,               // ordinal: 0x3
  heap_failure_multiple_entries_corruption = 4,    // ordinal: 0x4
  heap_failure_virtual_block_corruption = 5,       // ordinal: 0x5
  heap_failure_buffer_overrun = 6,                 // ordinal: 0x6
  heap_failure_buffer_underrun = 7,                // ordinal: 0x7
  heap_failure_block_not_busy = 8,                 // ordinal: 0x8
  heap_failure_invalid_argument = 9,               // ordinal: 0x9
  heap_failure_usage_after_free = 10,              // ordinal: 0xa
  heap_failure_cross_heap_operation = 11,          // ordinal: 0xb
  heap_failure_freelists_corruption = 12,          // ordinal: 0xc
  heap_failure_listentry_corruption = 13,          // ordinal: 0xd
  heap_failure_lfh_bitmap_mismatch = 14,           // ordinal: 0xe
  heap_failure_segment_lfh_bitmap_corruption = 15, // ordinal: 0xf
  heap_failure_segment_lfh_double_free = 16,       // ordinal: 0x10
  heap_failure_vs_subsegment_corruption = 17,      // ordinal: 0x11
} _HEAP_FAILURE_TYPE;

typedef enum _POWER_REQUEST_TYPE_INTERNAL {
  PowerRequestDisplayRequiredInternal = 0,   // ordinal: 0x0
  PowerRequestSystemRequiredInternal = 1,    // ordinal: 0x1
  PowerRequestAwayModeRequiredInternal = 2,  // ordinal: 0x2
  PowerRequestExecutionRequiredInternal = 3, // ordinal: 0x3
  PowerRequestPerfBoostRequiredInternal = 4, // ordinal: 0x4
  PowerRequestInternalInvalid = 5,           // ordinal: 0x5
} _POWER_REQUEST_TYPE_INTERNAL;

typedef enum _POWER_REQUEST_TYPE {
  PowerRequestDisplayRequired = 0,   // ordinal: 0x0
  PowerRequestSystemRequired = 1,    // ordinal: 0x1
  PowerRequestAwayModeRequired = 2,  // ordinal: 0x2
  PowerRequestExecutionRequired = 3, // ordinal: 0x3
} _POWER_REQUEST_TYPE;

typedef enum _TOKEN_INFORMATION_CLASS {
  TokenUser = 1,                             // ordinal: 0x0
  TokenGroups = 2,                           // ordinal: 0x1
  TokenPrivileges = 3,                       // ordinal: 0x2
  TokenOwner = 4,                            // ordinal: 0x3
  TokenPrimaryGroup = 5,                     // ordinal: 0x4
  TokenDefaultDacl = 6,                      // ordinal: 0x5
  TokenSource = 7,                           // ordinal: 0x6
  TokenType = 8,                             // ordinal: 0x7
  TokenImpersonationLevel = 9,               // ordinal: 0x8
  TokenStatistics = 10,                      // ordinal: 0x9
  TokenRestrictedSids = 11,                  // ordinal: 0xa
  TokenSessionId = 12,                       // ordinal: 0xb
  TokenGroupsAndPrivileges = 13,             // ordinal: 0xc
  TokenSessionReference = 14,                // ordinal: 0xd
  TokenSandBoxInert = 15,                    // ordinal: 0xe
  TokenAuditPolicy = 16,                     // ordinal: 0xf
  TokenOrigin = 17,                          // ordinal: 0x10
  TokenElevationType = 18,                   // ordinal: 0x11
  TokenLinkedToken = 19,                     // ordinal: 0x12
  TokenElevation = 20,                       // ordinal: 0x13
  TokenHasRestrictions = 21,                 // ordinal: 0x14
  TokenAccessInformation = 22,               // ordinal: 0x15
  TokenVirtualizationAllowed = 23,           // ordinal: 0x16
  TokenVirtualizationEnabled = 24,           // ordinal: 0x17
  TokenIntegrityLevel = 25,                  // ordinal: 0x18
  TokenUIAccess = 26,                        // ordinal: 0x19
  TokenMandatoryPolicy = 27,                 // ordinal: 0x1a
  TokenLogonSid = 28,                        // ordinal: 0x1b
  TokenIsAppContainer = 29,                  // ordinal: 0x1c
  TokenCapabilities = 30,                    // ordinal: 0x1d
  TokenAppContainerSid = 31,                 // ordinal: 0x1e
  TokenAppContainerNumber = 32,              // ordinal: 0x1f
  TokenUserClaimAttributes = 33,             // ordinal: 0x20
  TokenDeviceClaimAttributes = 34,           // ordinal: 0x21
  TokenRestrictedUserClaimAttributes = 35,   // ordinal: 0x22
  TokenRestrictedDeviceClaimAttributes = 36, // ordinal: 0x23
  TokenDeviceGroups = 37,                    // ordinal: 0x24
  TokenRestrictedDeviceGroups = 38,          // ordinal: 0x25
  TokenSecurityAttributes = 39,              // ordinal: 0x26
  TokenIsRestricted = 40,                    // ordinal: 0x27
  TokenProcessTrustLevel = 41,               // ordinal: 0x28
  TokenPrivateNameSpace = 42,                // ordinal: 0x29
  MaxTokenInfoClass = 43,                    // ordinal: 0x2a
} _TOKEN_INFORMATION_CLASS;

typedef enum _CMP_FAILURE_INJECTION_POINT {
  CmpFailurePointPoolAllocation = 0,    // ordinal: 0x0
  CmpFailurePointViewMapping = 1,       // ordinal: 0x1
  CmpFailurePointViewPinning = 2,       // ordinal: 0x2
  CmpFailurePointResourceCharging = 3,  // ordinal: 0x3
  CmpFailurePointFileWrite = 4,         // ordinal: 0x4
  CmpFailurePointFileRead = 5,          // ordinal: 0x5
  CmpFailurePointCacheFlush = 6,        // ordinal: 0x6
  CmpFailurePointFlush = 7,             // ordinal: 0x7
  CmpFailurePointFlushAndPurge = 8,     // ordinal: 0x8
  CmpFailurePointForceLargeBin = 9,     // ordinal: 0x9
  CmpFailurePointDontFixAlignment = 10, // ordinal: 0xa
  CmpFailureInjectionPointCount = 11,   // ordinal: 0xb
} _CMP_FAILURE_INJECTION_POINT;

typedef enum _MI_PFN_CACHE_ATTRIBUTE {
  MiNonCached = 0,     // ordinal: 0x0
  MiCached = 1,        // ordinal: 0x1
  MiWriteCombined = 2, // ordinal: 0x2
  MiNotMapped = 3,     // ordinal: 0x3
} _MI_PFN_CACHE_ATTRIBUTE;

typedef enum _EVENT_INFO_CLASS {
  EventProviderBinaryTrackInfo = 0,      // ordinal: 0x0
  EventProviderSetEnableAllKeywords = 1, // ordinal: 0x1
  EventProviderSetTraits = 2,            // ordinal: 0x2
  EventProviderUseDescriptorType = 3,    // ordinal: 0x3
  MaxEventInfo = 4,                      // ordinal: 0x4
} _EVENT_INFO_CLASS;

typedef enum _DEVICE_WAKE_DEPTH {
  DeviceWakeDepthNotWakeable = 0, // ordinal: 0x0
  DeviceWakeDepthD0 = 1,          // ordinal: 0x1
  DeviceWakeDepthD1 = 2,          // ordinal: 0x2
  DeviceWakeDepthD2 = 3,          // ordinal: 0x3
  DeviceWakeDepthD3hot = 4,       // ordinal: 0x4
  DeviceWakeDepthD3cold = 5,      // ordinal: 0x5
  DeviceWakeDepthMaximum = 6,     // ordinal: 0x6
} _DEVICE_WAKE_DEPTH;

typedef enum _DEVICE_POWER_STATE {
  PowerDeviceUnspecified = 0, // ordinal: 0x0
  PowerDeviceD0 = 1,          // ordinal: 0x1
  PowerDeviceD1 = 2,          // ordinal: 0x2
  PowerDeviceD2 = 3,          // ordinal: 0x3
  PowerDeviceD3 = 4,          // ordinal: 0x4
  PowerDeviceMaximum = 5,     // ordinal: 0x5
} _DEVICE_POWER_STATE;

typedef enum _PF_FILE_ACCESS_TYPE {
  PfFileAccessTypeRead = 0,  // ordinal: 0x0
  PfFileAccessTypeWrite = 1, // ordinal: 0x1
  PfFileAccessTypeMax = 2,   // ordinal: 0x2
} _PF_FILE_ACCESS_TYPE;

typedef enum _MEMORY_CACHING_TYPE {
  MmNonCached = 0,              // ordinal: 0x0
  MmCached = 1,                 // ordinal: 0x1
  MmWriteCombined = 2,          // ordinal: 0x2
  MmHardwareCoherentCached = 3, // ordinal: 0x3
  MmNonCachedUnordered = 4,     // ordinal: 0x4
  MmUSWCCached = 5,             // ordinal: 0x5
  MmMaximumCacheType = 6,       // ordinal: 0x6
  MmNotMapped = -1,             // ordinal: 0x7
} _MEMORY_CACHING_TYPE;

typedef enum _EX_GEN_RANDOM_DOMAIN {
  ExGenRandomDomainKernel = 0,      // ordinal: 0x0
  ExGenRandomDomainFirst = 0,       // ordinal: 0x1
  ExGenRandomDomainUserVisible = 1, // ordinal: 0x2
  ExGenRandomDomainMax = 2,         // ordinal: 0x3
} _EX_GEN_RANDOM_DOMAIN;

typedef enum _PP_NPAGED_LOOKASIDE_NUMBER {
  LookasideSmallIrpList = 0,      // ordinal: 0x0
  LookasideMediumIrpList = 1,     // ordinal: 0x1
  LookasideLargeIrpList = 2,      // ordinal: 0x2
  LookasideMdlList = 3,           // ordinal: 0x3
  LookasideCreateInfoList = 4,    // ordinal: 0x4
  LookasideNameBufferList = 5,    // ordinal: 0x5
  LookasideTwilightList = 6,      // ordinal: 0x6
  LookasideCompletionList = 7,    // ordinal: 0x7
  LookasideScratchBufferList = 8, // ordinal: 0x8
  LookasideMaximumList = 9,       // ordinal: 0x9
} _PP_NPAGED_LOOKASIDE_NUMBER;

typedef enum _EVENT_TYPE {
  NotificationEvent = 0,    // ordinal: 0x0
  SynchronizationEvent = 1, // ordinal: 0x1
} _EVENT_TYPE;

typedef enum _MODE {
  KernelMode = 0,  // ordinal: 0x0
  UserMode = 1,    // ordinal: 0x1
  MaximumMode = 2, // ordinal: 0x2
} _MODE;

typedef enum SE_WS_APPX_SIGNATURE_ORIGIN {
  SE_WS_APPX_SIGNATURE_ORIGIN_NOT_VALIDATED = 0, // ordinal: 0x0
  SE_WS_APPX_SIGNATURE_ORIGIN_UNKNOWN = 1,       // ordinal: 0x1
  SE_WS_APPX_SIGNATURE_ORIGIN_APPSTORE = 2,      // ordinal: 0x2
  SE_WS_APPX_SIGNATURE_ORIGIN_WINDOWS = 3,       // ordinal: 0x3
  SE_WS_APPX_SIGNATURE_ORIGIN_ENTERPRISE = 4,    // ordinal: 0x4
} SE_WS_APPX_SIGNATURE_ORIGIN;

typedef enum _KERNEL_STACK_LIMITS {
  BugcheckStackLimits = 0, // ordinal: 0x0
  DPCStackLimits = 1,      // ordinal: 0x1
  ExpandedStackLimits = 2, // ordinal: 0x2
  NormalStackLimits = 3,   // ordinal: 0x3
  Win32kStackLimits = 4,   // ordinal: 0x4
  SwapBusyStackLimits = 5, // ordinal: 0x5
  IsrStackLimits = 6,      // ordinal: 0x6
  MaximumStackLimits = 7,  // ordinal: 0x7
} _KERNEL_STACK_LIMITS;

typedef enum _LDR_DDAG_STATE {
  LdrModulesMerged = -5,                // ordinal: 0x0
  LdrModulesInitError = -4,             // ordinal: 0x1
  LdrModulesSnapError = -3,             // ordinal: 0x2
  LdrModulesUnloaded = -2,              // ordinal: 0x3
  LdrModulesUnloading = -1,             // ordinal: 0x4
  LdrModulesPlaceHolder = 0,            // ordinal: 0x5
  LdrModulesMapping = 1,                // ordinal: 0x6
  LdrModulesMapped = 2,                 // ordinal: 0x7
  LdrModulesWaitingForDependencies = 3, // ordinal: 0x8
  LdrModulesSnapping = 4,               // ordinal: 0x9
  LdrModulesSnapped = 5,                // ordinal: 0xa
  LdrModulesCondensed = 6,              // ordinal: 0xb
  LdrModulesReadyToInit = 7,            // ordinal: 0xc
  LdrModulesInitializing = 8,           // ordinal: 0xd
  LdrModulesReadyToRun = 9,             // ordinal: 0xe
} _LDR_DDAG_STATE;

typedef enum _LDR_DLL_LOAD_REASON {
  LoadReasonStaticDependency = 0,           // ordinal: 0x0
  LoadReasonStaticForwarderDependency = 1,  // ordinal: 0x1
  LoadReasonDynamicForwarderDependency = 2, // ordinal: 0x2
  LoadReasonDelayloadDependency = 3,        // ordinal: 0x3
  LoadReasonDynamicLoad = 4,                // ordinal: 0x4
  LoadReasonAsImageLoad = 5,                // ordinal: 0x5
  LoadReasonAsDataLoad = 6,                 // ordinal: 0x6
  LoadReasonUnknown = -1,                   // ordinal: 0x7
} _LDR_DLL_LOAD_REASON;

typedef enum _ETW_NOTIFICATION_TYPE {
  EtwNotificationTypeNoReply = 1,        // ordinal: 0x0
  EtwNotificationTypeLegacyEnable = 2,   // ordinal: 0x1
  EtwNotificationTypeEnable = 3,         // ordinal: 0x2
  EtwNotificationTypePrivateLogger = 4,  // ordinal: 0x3
  EtwNotificationTypePerflib = 5,        // ordinal: 0x4
  EtwNotificationTypeAudio = 6,          // ordinal: 0x5
  EtwNotificationTypeSession = 7,        // ordinal: 0x6
  EtwNotificationTypeReserved = 8,       // ordinal: 0x7
  EtwNotificationTypeCredentialUI = 9,   // ordinal: 0x8
  EtwNotificationTypeInProcSession = 10, // ordinal: 0x9
  EtwNotificationTypeMax = 11,           // ordinal: 0xa
} _ETW_NOTIFICATION_TYPE;

typedef enum _PNP_DEVICE_ACTION_REQUEST {
  AssignResources = 0,                 // ordinal: 0x0
  ClearDeviceProblem = 1,              // ordinal: 0x1
  ClearProblem = 2,                    // ordinal: 0x2
  ClearEjectProblem = 3,               // ordinal: 0x3
  HaltDevice = 4,                      // ordinal: 0x4
  QueryPowerRelations = 5,             // ordinal: 0x5
  Rebalance = 6,                       // ordinal: 0x6
  ReenumerateBootDevices = 7,          // ordinal: 0x7
  ReenumerateDeviceOnly = 8,           // ordinal: 0x8
  ReenumerateDeviceTree = 9,           // ordinal: 0x9
  ReenumerateRootDevices = 10,         // ordinal: 0xa
  RequeryDeviceState = 11,             // ordinal: 0xb
  ResetDevice = 12,                    // ordinal: 0xc
  ResourceRequirementsChanged = 13,    // ordinal: 0xd
  RestartEnumeration = 14,             // ordinal: 0xe
  SetDeviceProblem = 15,               // ordinal: 0xf
  StartDevice = 16,                    // ordinal: 0x10
  StartSystemDevicesPass0 = 17,        // ordinal: 0x11
  StartSystemDevicesPass1 = 18,        // ordinal: 0x12
  NotifyTransportRelationsChange = 19, // ordinal: 0x13
  NotifyEjectionRelationsChange = 20,  // ordinal: 0x14
  ConfigureDevice = 21,                // ordinal: 0x15
  ConfigureDeviceClass = 22,           // ordinal: 0x16
  ConfigureDeviceExtensions = 23,      // ordinal: 0x17
  ConfigureDeviceReset = 24,           // ordinal: 0x18
} _PNP_DEVICE_ACTION_REQUEST;

typedef enum _VI_DEADLOCK_RESOURCE_TYPE {
  VfDeadlockUnknown = 0,               // ordinal: 0x0
  VfDeadlockMutex = 1,                 // ordinal: 0x1
  VfDeadlockMutexAbandoned = 2,        // ordinal: 0x2
  VfDeadlockFastMutex = 3,             // ordinal: 0x3
  VfDeadlockFastMutexUnsafe = 4,       // ordinal: 0x4
  VfDeadlockSpinLock = 5,              // ordinal: 0x5
  VfDeadlockInStackQueuedSpinLock = 6, // ordinal: 0x6
  VfDeadlockUnusedSpinLock = 7,        // ordinal: 0x7
  VfDeadlockEresource = 8,             // ordinal: 0x8
  VfDeadlockTypeMaximum = 9,           // ordinal: 0x9
} _VI_DEADLOCK_RESOURCE_TYPE;

typedef enum _IO_SESSION_STATE {
  IoSessionStateCreated = 1,              // ordinal: 0x0
  IoSessionStateInitialized = 2,          // ordinal: 0x1
  IoSessionStateConnected = 3,            // ordinal: 0x2
  IoSessionStateDisconnected = 4,         // ordinal: 0x3
  IoSessionStateDisconnectedLoggedOn = 5, // ordinal: 0x4
  IoSessionStateLoggedOn = 6,             // ordinal: 0x5
  IoSessionStateLoggedOff = 7,            // ordinal: 0x6
  IoSessionStateTerminated = 8,           // ordinal: 0x7
  IoSessionStateMax = 9,                  // ordinal: 0x8
} _IO_SESSION_STATE;

typedef enum _DUMP_EVENTS {
  DUMP_EVENT_NONE = 0,             // ordinal: 0x0
  DUMP_EVENT_HIBER_RESUME = 1,     // ordinal: 0x1
  DUMP_EVENT_HIBER_RESUME_END = 2, // ordinal: 0x2
} _DUMP_EVENTS;

typedef enum _POP_IO_STATUS {
  IoReady = 0,   // ordinal: 0x0
  IoPending = 1, // ordinal: 0x1
  IoDone = 2,    // ordinal: 0x2
} _POP_IO_STATUS;

typedef enum SYSTEM_POWER_CONDITION {
  PoAc = 0,               // ordinal: 0x0
  PoDc = 1,               // ordinal: 0x1
  PoHot = 2,              // ordinal: 0x2
  PoConditionMaximum = 3, // ordinal: 0x3
} SYSTEM_POWER_CONDITION;

typedef enum POWER_POLICY_DEVICE_TYPE {
  PolicyDeviceSystemButton = 0,     // ordinal: 0x0
  PolicyDeviceThermalZone = 1,      // ordinal: 0x1
  PolicyDeviceBattery = 2,          // ordinal: 0x2
  PolicyDeviceMemory = 3,           // ordinal: 0x3
  PolicyInitiatePowerActionAPI = 4, // ordinal: 0x4
  PolicySetPowerStateAPI = 5,       // ordinal: 0x5
  PolicyImmediateDozeS4 = 6,        // ordinal: 0x6
  PolicySystemIdle = 7,             // ordinal: 0x7
  PolicyDeviceWakeAlarm = 8,        // ordinal: 0x8
  PolicyDeviceFan = 9,              // ordinal: 0x9
  PolicyCsBatterySaver = 10,        // ordinal: 0xa
  PolicyDeviceMax = 11,             // ordinal: 0xb
} POWER_POLICY_DEVICE_TYPE;

typedef enum _ARBITER_RESULT {
  ArbiterResultUndefined = -1,       // ordinal: 0x0
  ArbiterResultSuccess = 0,          // ordinal: 0x1
  ArbiterResultExternalConflict = 1, // ordinal: 0x2
  ArbiterResultNullRequest = 2,      // ordinal: 0x3
} _ARBITER_RESULT;

typedef enum _ARBITER_ACTION {
  ArbiterActionTestAllocation = 0,          // ordinal: 0x0
  ArbiterActionRetestAllocation = 1,        // ordinal: 0x1
  ArbiterActionCommitAllocation = 2,        // ordinal: 0x2
  ArbiterActionRollbackAllocation = 3,      // ordinal: 0x3
  ArbiterActionQueryAllocatedResources = 4, // ordinal: 0x4
  ArbiterActionWriteReservedResources = 5,  // ordinal: 0x5
  ArbiterActionQueryConflict = 6,           // ordinal: 0x6
  ArbiterActionQueryArbitrate = 7,          // ordinal: 0x7
  ArbiterActionAddReserved = 8,             // ordinal: 0x8
  ArbiterActionBootAllocation = 9,          // ordinal: 0x9
} _ARBITER_ACTION;

typedef enum _REQUESTER_TYPE {
  KernelRequester = 0,            // ordinal: 0x0
  UserProcessRequester = 1,       // ordinal: 0x1
  UserSharedServiceRequester = 2, // ordinal: 0x2
} _REQUESTER_TYPE;

typedef enum _TYPE_OF_MEMORY {
  LoaderExceptionBlock = 0,      // ordinal: 0x0
  LoaderSystemBlock = 1,         // ordinal: 0x1
  LoaderFree = 2,                // ordinal: 0x2
  LoaderBad = 3,                 // ordinal: 0x3
  LoaderLoadedProgram = 4,       // ordinal: 0x4
  LoaderFirmwareTemporary = 5,   // ordinal: 0x5
  LoaderFirmwarePermanent = 6,   // ordinal: 0x6
  LoaderOsloaderHeap = 7,        // ordinal: 0x7
  LoaderOsloaderStack = 8,       // ordinal: 0x8
  LoaderSystemCode = 9,          // ordinal: 0x9
  LoaderHalCode = 10,            // ordinal: 0xa
  LoaderBootDriver = 11,         // ordinal: 0xb
  LoaderConsoleInDriver = 12,    // ordinal: 0xc
  LoaderConsoleOutDriver = 13,   // ordinal: 0xd
  LoaderStartupDpcStack = 14,    // ordinal: 0xe
  LoaderStartupKernelStack = 15, // ordinal: 0xf
  LoaderStartupPanicStack = 16,  // ordinal: 0x10
  LoaderStartupPcrPage = 17,     // ordinal: 0x11
  LoaderStartupPdrPage = 18,     // ordinal: 0x12
  LoaderRegistryData = 19,       // ordinal: 0x13
  LoaderMemoryData = 20,         // ordinal: 0x14
  LoaderNlsData = 21,            // ordinal: 0x15
  LoaderSpecialMemory = 22,      // ordinal: 0x16
  LoaderBBTMemory = 23,          // ordinal: 0x17
  LoaderZero = 24,               // ordinal: 0x18
  LoaderXIPRom = 25,             // ordinal: 0x19
  LoaderHALCachedMemory = 26,    // ordinal: 0x1a
  LoaderLargePageFiller = 27,    // ordinal: 0x1b
  LoaderErrorLogMemory = 28,     // ordinal: 0x1c
  LoaderVsmMemory = 29,          // ordinal: 0x1d
  LoaderFirmwareCode = 30,       // ordinal: 0x1e
  LoaderFirmwareData = 31,       // ordinal: 0x1f
  LoaderFirmwareReserved = 32,   // ordinal: 0x20
  LoaderMaximum = 33,            // ordinal: 0x21
} _TYPE_OF_MEMORY;

typedef enum _DMA_SPEED {
  Compatible = 0,      // ordinal: 0x0
  TypeA = 1,           // ordinal: 0x1
  TypeB = 2,           // ordinal: 0x2
  TypeC = 3,           // ordinal: 0x3
  TypeF = 4,           // ordinal: 0x4
  MaximumDmaSpeed = 5, // ordinal: 0x5
} _DMA_SPEED;

typedef enum _DMA_WIDTH {
  Width8Bits = 0,      // ordinal: 0x0
  Width16Bits = 1,     // ordinal: 0x1
  Width32Bits = 2,     // ordinal: 0x2
  Width64Bits = 3,     // ordinal: 0x3
  WidthNoWrap = 4,     // ordinal: 0x4
  MaximumDmaWidth = 5, // ordinal: 0x5
} _DMA_WIDTH;

typedef enum _RTL_GENERIC_COMPARE_RESULTS {
  GenericLessThan = 0,    // ordinal: 0x0
  GenericGreaterThan = 1, // ordinal: 0x1
  GenericEqual = 2,       // ordinal: 0x2
} _RTL_GENERIC_COMPARE_RESULTS;

typedef enum _CM_DIRTY_VECTOR_OPERATION {
  DirtyVectorModified = 0,   // ordinal: 0x0
  DirtyDataCaptureStart = 1, // ordinal: 0x1
  DirtyDataCaptureEnd = 2,   // ordinal: 0x2
} _CM_DIRTY_VECTOR_OPERATION;

typedef enum __anon_1900 {
  KTMOH_CommitTransaction_Result = 1,   // ordinal: 0x0
  KTMOH_RollbackTransaction_Result = 2, // ordinal: 0x1
} __anon_1900;

typedef enum KTM_STATE {
  KKtmUninitialized = 0,  // ordinal: 0x0
  KKtmInitialized = 1,    // ordinal: 0x1
  KKtmRecovering = 2,     // ordinal: 0x2
  KKtmOnline = 3,         // ordinal: 0x3
  KKtmRecoveryFailed = 4, // ordinal: 0x4
  KKtmOffline = 5,        // ordinal: 0x5
} KTM_STATE;

typedef enum _KTRANSACTION_OUTCOME {
  KTxOutcomeUninitialized = 0, // ordinal: 0x0
  KTxOutcomeUndetermined = 1,  // ordinal: 0x1
  KTxOutcomeCommitted = 2,     // ordinal: 0x2
  KTxOutcomeAborted = 3,       // ordinal: 0x3
  KTxOutcomeUnavailable = 4,   // ordinal: 0x4
} _KTRANSACTION_OUTCOME;

typedef enum _KTRANSACTION_STATE {
  KTransactionUninitialized = 0, // ordinal: 0x0
  KTransactionActive = 1,        // ordinal: 0x1
  KTransactionPreparing = 2,     // ordinal: 0x2
  KTransactionPrepared = 3,      // ordinal: 0x3
  KTransactionInDoubt = 4,       // ordinal: 0x4
  KTransactionCommitted = 5,     // ordinal: 0x5
  KTransactionAborted = 6,       // ordinal: 0x6
  KTransactionDelegated = 7,     // ordinal: 0x7
  KTransactionPrePreparing = 8,  // ordinal: 0x8
  KTransactionForgotten = 9,     // ordinal: 0x9
  KTransactionRecovering = 10,   // ordinal: 0xa
  KTransactionPrePrepared = 11,  // ordinal: 0xb
} _KTRANSACTION_STATE;

typedef enum _KRESOURCEMANAGER_STATE {
  KResourceManagerUninitialized = 0, // ordinal: 0x0
  KResourceManagerOffline = 1,       // ordinal: 0x1
  KResourceManagerOnline = 2,        // ordinal: 0x2
} _KRESOURCEMANAGER_STATE;

typedef enum HSTORAGE_TYPE {
  Stable = 0,         // ordinal: 0x0
  Volatile = 1,       // ordinal: 0x1
  InvalidStorage = 2, // ordinal: 0x2
} HSTORAGE_TYPE;

typedef enum UoWActionType {
  UoWAddThisKey = 0,            // ordinal: 0x0
  UoWAddChildKey = 1,           // ordinal: 0x1
  UoWDeleteThisKey = 2,         // ordinal: 0x2
  UoWDeleteChildKey = 3,        // ordinal: 0x3
  UoWSetValueNew = 4,           // ordinal: 0x4
  UoWSetValueExisting = 5,      // ordinal: 0x5
  UoWDeleteValue = 6,           // ordinal: 0x6
  UoWSetKeyUserFlags = 7,       // ordinal: 0x7
  UoWSetLastWriteTime = 8,      // ordinal: 0x8
  UoWSetSecurityDescriptor = 9, // ordinal: 0x9
  UoWRenameSubKey = 10,         // ordinal: 0xa
  UoWRenameOldSubKey = 11,      // ordinal: 0xb
  UoWRenameNewSubKey = 12,      // ordinal: 0xc
  UoWIsolation = 13,            // ordinal: 0xd
  UoWInvalid = 14,              // ordinal: 0xe
} UoWActionType;

typedef enum _KENLISTMENT_STATE {
  KEnlistmentUninitialized = 0,           // ordinal: 0x0
  KEnlistmentActive = 256,                // ordinal: 0x1
  KEnlistmentPreparing = 257,             // ordinal: 0x2
  KEnlistmentPrepared = 258,              // ordinal: 0x3
  KEnlistmentInDoubt = 259,               // ordinal: 0x4
  KEnlistmentCommitted = 260,             // ordinal: 0x5
  KEnlistmentCommittedNotify = 261,       // ordinal: 0x6
  KEnlistmentCommitRequested = 262,       // ordinal: 0x7
  KEnlistmentAborted = 263,               // ordinal: 0x8
  KEnlistmentDelegated = 264,             // ordinal: 0x9
  KEnlistmentDelegatedDisconnected = 265, // ordinal: 0xa
  KEnlistmentPrePreparing = 266,          // ordinal: 0xb
  KEnlistmentForgotten = 267,             // ordinal: 0xc
  KEnlistmentRecovering = 268,            // ordinal: 0xd
  KEnlistmentAborting = 269,              // ordinal: 0xe
  KEnlistmentReadOnly = 270,              // ordinal: 0xf
  KEnlistmentOutcomeUnavailable = 271,    // ordinal: 0x10
  KEnlistmentOffline = 272,               // ordinal: 0x11
  KEnlistmentPrePrepared = 273,           // ordinal: 0x12
  KEnlistmentInitialized = 274,           // ordinal: 0x13
} _KENLISTMENT_STATE;

typedef enum HAL_APIC_DESTINATION_MODE {
  ApicDestinationModePhysical = 1,         // ordinal: 0x0
  ApicDestinationModeLogicalFlat = 2,      // ordinal: 0x1
  ApicDestinationModeLogicalClustered = 3, // ordinal: 0x2
  ApicDestinationModeUnknown = 4,          // ordinal: 0x3
} HAL_APIC_DESTINATION_MODE;

// 0x4 bytes (sizeof)
typedef struct __anon_1796 {
  enum HAL_APIC_DESTINATION_MODE DestinationMode; // offset: 0x0 ordinal: 0x0
} __anon_1796;

typedef enum INTERRUPT_CONNECTION_TYPE {
  InterruptTypeControllerInput = 0, // ordinal: 0x0
  InterruptTypeXapicMessage = 1,    // ordinal: 0x1
  InterruptTypeHypertransport = 2,  // ordinal: 0x2
  InterruptTypeMessageRequest = 3,  // ordinal: 0x3
} INTERRUPT_CONNECTION_TYPE;

typedef enum _WHEA_ERROR_SOURCE_STATE {
  WheaErrSrcStateStopped = 1, // ordinal: 0x0
  WheaErrSrcStateStarted = 2, // ordinal: 0x1
} _WHEA_ERROR_SOURCE_STATE;

typedef enum _KPROFILE_SOURCE {
  ProfileTime = 0,                  // ordinal: 0x0
  ProfileAlignmentFixup = 1,        // ordinal: 0x1
  ProfileTotalIssues = 2,           // ordinal: 0x2
  ProfilePipelineDry = 3,           // ordinal: 0x3
  ProfileLoadInstructions = 4,      // ordinal: 0x4
  ProfilePipelineFrozen = 5,        // ordinal: 0x5
  ProfileBranchInstructions = 6,    // ordinal: 0x6
  ProfileTotalNonissues = 7,        // ordinal: 0x7
  ProfileDcacheMisses = 8,          // ordinal: 0x8
  ProfileIcacheMisses = 9,          // ordinal: 0x9
  ProfileCacheMisses = 10,          // ordinal: 0xa
  ProfileBranchMispredictions = 11, // ordinal: 0xb
  ProfileStoreInstructions = 12,    // ordinal: 0xc
  ProfileFpInstructions = 13,       // ordinal: 0xd
  ProfileIntegerInstructions = 14,  // ordinal: 0xe
  Profile2Issue = 15,               // ordinal: 0xf
  Profile3Issue = 16,               // ordinal: 0x10
  Profile4Issue = 17,               // ordinal: 0x11
  ProfileSpecialInstructions = 18,  // ordinal: 0x12
  ProfileTotalCycles = 19,          // ordinal: 0x13
  ProfileIcacheIssues = 20,         // ordinal: 0x14
  ProfileDcacheAccesses = 21,       // ordinal: 0x15
  ProfileMemoryBarrierCycles = 22,  // ordinal: 0x16
  ProfileLoadLinkedIssues = 23,     // ordinal: 0x17
  ProfileMaximum = 24,              // ordinal: 0x18
} _KPROFILE_SOURCE;

typedef enum _TOKEN_TYPE {
  TokenPrimary = 1,       // ordinal: 0x0
  TokenImpersonation = 2, // ordinal: 0x1
} _TOKEN_TYPE;

typedef enum _ETW_BUFFER_STATE {
  EtwBufferStateFree = 0,           // ordinal: 0x0
  EtwBufferStateGeneralLogging = 1, // ordinal: 0x1
  EtwBufferStateCSwitch = 2,        // ordinal: 0x2
  EtwBufferStateFlush = 3,          // ordinal: 0x3
  EtwBufferStateMaximum = 4,        // ordinal: 0x4
} _ETW_BUFFER_STATE;

typedef enum _ETW_RT_EVENT_LOSS {
  EtwRtEventNoLoss = 0,  // ordinal: 0x0
  EtwRtEventLost = 1,    // ordinal: 0x1
  EtwRtBufferLost = 2,   // ordinal: 0x2
  EtwRtBackupLost = 3,   // ordinal: 0x3
  EtwRtEventLossMax = 4, // ordinal: 0x4
} _ETW_RT_EVENT_LOSS;

typedef enum _CREATE_FILE_TYPE {
  CreateFileTypeNone = 0,      // ordinal: 0x0
  CreateFileTypeNamedPipe = 1, // ordinal: 0x1
  CreateFileTypeMailslot = 2,  // ordinal: 0x2
} _CREATE_FILE_TYPE;

typedef enum _IOP_PRIORITY_HINT {
  IopIoPriorityNotSet = 0,   // ordinal: 0x0
  IopIoPriorityVeryLow = 1,  // ordinal: 0x1
  IopIoPriorityLow = 2,      // ordinal: 0x2
  IopIoPriorityNormal = 3,   // ordinal: 0x3
  IopIoPriorityHigh = 4,     // ordinal: 0x4
  IopIoPriorityCritical = 5, // ordinal: 0x5
  MaxIopIoPriorityTypes = 6, // ordinal: 0x6
} _IOP_PRIORITY_HINT;

typedef enum _SECURITY_OPERATION_CODE {
  SetSecurityDescriptor = 0,    // ordinal: 0x0
  QuerySecurityDescriptor = 1,  // ordinal: 0x1
  DeleteSecurityDescriptor = 2, // ordinal: 0x2
  AssignSecurityDescriptor = 3, // ordinal: 0x3
} _SECURITY_OPERATION_CODE;

typedef enum _OB_OPEN_REASON {
  ObCreateHandle = 0,    // ordinal: 0x0
  ObOpenHandle = 1,      // ordinal: 0x1
  ObDuplicateHandle = 2, // ordinal: 0x2
  ObInheritHandle = 3,   // ordinal: 0x3
  ObMaxOpenReason = 4,   // ordinal: 0x4
} _OB_OPEN_REASON;

typedef enum _BLOB_ID {
  BLOB_TYPE_UNKNOWN = 0,          // ordinal: 0x0
  BLOB_TYPE_CONNECTION_INFO = 1,  // ordinal: 0x1
  BLOB_TYPE_MESSAGE = 2,          // ordinal: 0x2
  BLOB_TYPE_SECURITY_CONTEXT = 3, // ordinal: 0x3
  BLOB_TYPE_SECTION = 4,          // ordinal: 0x4
  BLOB_TYPE_REGION = 5,           // ordinal: 0x5
  BLOB_TYPE_VIEW = 6,             // ordinal: 0x6
  BLOB_TYPE_RESERVE = 7,          // ordinal: 0x7
  BLOB_TYPE_DIRECT_TRANSFER = 8,  // ordinal: 0x8
  BLOB_TYPE_HANDLE_DATA = 9,      // ordinal: 0x9
  BLOB_TYPE_MAX_ID = 10,          // ordinal: 0xa
} _BLOB_ID;

typedef enum _GPIO_PIN_IORESTRICTION_TYPE {
  IoRestrictionNone = 0,            // ordinal: 0x0
  IoRestrictionInputOnly = 1,       // ordinal: 0x1
  IoRestrictionOutputOnly = 2,      // ordinal: 0x2
  IoRestrictionNoneAndPreserve = 3, // ordinal: 0x3
} _GPIO_PIN_IORESTRICTION_TYPE;

typedef enum _GPIO_PIN_CONFIG_TYPE {
  PullDefault = 0, // ordinal: 0x0
  PullUp = 1,      // ordinal: 0x1
  PullDown = 2,    // ordinal: 0x2
  PullNone = 3,    // ordinal: 0x3
} _GPIO_PIN_CONFIG_TYPE;

typedef enum _KINTERRUPT_POLARITY {
  InterruptPolarityUnknown = 0,       // ordinal: 0x0
  InterruptActiveHigh = 1,            // ordinal: 0x1
  InterruptRisingEdge = 1,            // ordinal: 0x2
  InterruptActiveLow = 2,             // ordinal: 0x3
  InterruptFallingEdge = 2,           // ordinal: 0x4
  InterruptActiveBoth = 3,            // ordinal: 0x5
  InterruptActiveBothTriggerLow = 3,  // ordinal: 0x6
  InterruptActiveBothTriggerHigh = 4, // ordinal: 0x7
} _KINTERRUPT_POLARITY;

typedef enum _KINTERRUPT_MODE {
  LevelSensitive = 0, // ordinal: 0x0
  Latched = 1,        // ordinal: 0x1
} _KINTERRUPT_MODE;

typedef enum _PEP_ACPI_RESOURCE_TYPE {
  PepAcpiMemory = 0,         // ordinal: 0x0
  PepAcpiIoPort = 1,         // ordinal: 0x1
  PepAcpiInterrupt = 2,      // ordinal: 0x2
  PepAcpiGpioIo = 3,         // ordinal: 0x3
  PepAcpiGpioInt = 4,        // ordinal: 0x4
  PepAcpiSpbI2c = 5,         // ordinal: 0x5
  PepAcpiSpbSpi = 6,         // ordinal: 0x6
  PepAcpiSpbUart = 7,        // ordinal: 0x7
  PepAcpiExtendedMemory = 8, // ordinal: 0x8
  PepAcpiExtendedIo = 9,     // ordinal: 0x9
} _PEP_ACPI_RESOURCE_TYPE;

typedef enum _ARBITER_REQUEST_SOURCE {
  ArbiterRequestUndefined = -1,     // ordinal: 0x0
  ArbiterRequestLegacyReported = 0, // ordinal: 0x1
  ArbiterRequestHalReported = 1,    // ordinal: 0x2
  ArbiterRequestLegacyAssigned = 2, // ordinal: 0x3
  ArbiterRequestPnpDetected = 3,    // ordinal: 0x4
  ArbiterRequestPnpEnumerated = 4,  // ordinal: 0x5
} _ARBITER_REQUEST_SOURCE;

typedef enum _PO_FX_PERF_STATE_TYPE {
  PoFxPerfStateTypeDiscrete = 0, // ordinal: 0x0
  PoFxPerfStateTypeRange = 1,    // ordinal: 0x1
  PoFxPerfStateTypeMaximum = 2,  // ordinal: 0x2
} _PO_FX_PERF_STATE_TYPE;

typedef enum _PO_FX_PERF_STATE_UNIT {
  PoFxPerfStateUnitOther = 0,     // ordinal: 0x0
  PoFxPerfStateUnitFrequency = 1, // ordinal: 0x1
  PoFxPerfStateUnitBandwidth = 2, // ordinal: 0x2
  PoFxPerfStateUnitMaximum = 3,   // ordinal: 0x3
} _PO_FX_PERF_STATE_UNIT;

typedef enum PROFILE_DEPARTURE_STYLE {
  PDS_UPDATE_DEFAULT = 1,      // ordinal: 0x0
  PDS_UPDATE_ON_REMOVE = 2,    // ordinal: 0x1
  PDS_UPDATE_ON_INTERFACE = 3, // ordinal: 0x2
  PDS_UPDATE_ON_EJECT = 4,     // ordinal: 0x3
} PROFILE_DEPARTURE_STYLE;

typedef enum _PLUGPLAY_EVENT_CATEGORY {
  HardwareProfileChangeEvent = 0,  // ordinal: 0x0
  TargetDeviceChangeEvent = 1,     // ordinal: 0x1
  DeviceClassChangeEvent = 2,      // ordinal: 0x2
  CustomDeviceEvent = 3,           // ordinal: 0x3
  DeviceInstallEvent = 4,          // ordinal: 0x4
  DeviceArrivalEvent = 5,          // ordinal: 0x5
  VetoEvent = 6,                   // ordinal: 0x6
  BlockedDriverEvent = 7,          // ordinal: 0x7
  InvalidIDEvent = 8,              // ordinal: 0x8
  DevicePropertyChangeEvent = 9,   // ordinal: 0x9
  DeviceInstanceRemovalEvent = 10, // ordinal: 0xa
  DeviceInstanceStartedEvent = 11, // ordinal: 0xb
  MaxPlugEventCategory = 12,       // ordinal: 0xc
} _PLUGPLAY_EVENT_CATEGORY;

typedef enum _PNP_VETO_TYPE {
  PNP_VetoTypeUnknown = 0,          // ordinal: 0x0
  PNP_VetoLegacyDevice = 1,         // ordinal: 0x1
  PNP_VetoPendingClose = 2,         // ordinal: 0x2
  PNP_VetoWindowsApp = 3,           // ordinal: 0x3
  PNP_VetoWindowsService = 4,       // ordinal: 0x4
  PNP_VetoOutstandingOpen = 5,      // ordinal: 0x5
  PNP_VetoDevice = 6,               // ordinal: 0x6
  PNP_VetoDriver = 7,               // ordinal: 0x7
  PNP_VetoIllegalDeviceRequest = 8, // ordinal: 0x8
  PNP_VetoInsufficientPower = 9,    // ordinal: 0x9
  PNP_VetoNonDisableable = 10,      // ordinal: 0xa
  PNP_VetoLegacyDriver = 11,        // ordinal: 0xb
  PNP_VetoInsufficientRights = 12,  // ordinal: 0xc
} _PNP_VETO_TYPE;

// 0x4 bytes (sizeof)
typedef struct PEPHANDLE__ {
  LONG unused; // offset: 0x0 ordinal: 0x0
} PEPHANDLE__;

// 0x10 bytes (sizeof)
typedef struct _PEP_CRASHDUMP_INFORMATION {
  struct PEPHANDLE__ *DeviceHandle; // offset: 0x0 ordinal: 0x0
  VOID *DeviceContext;              // offset: 0x8 ordinal: 0x1
} _PEP_CRASHDUMP_INFORMATION;

typedef enum _PNP_DEVICE_DELETE_TYPE {
  QueryRemoveDevice = 0,           // ordinal: 0x0
  CancelRemoveDevice = 1,          // ordinal: 0x1
  RemoveDevice = 2,                // ordinal: 0x2
  SurpriseRemoveDevice = 3,        // ordinal: 0x3
  EjectDevice = 4,                 // ordinal: 0x4
  RemoveFailedDevice = 5,          // ordinal: 0x5
  RemoveUnstartedFailedDevice = 6, // ordinal: 0x6
  MaxDeviceDeleteType = 7,         // ordinal: 0x7
} _PNP_DEVICE_DELETE_TYPE;

typedef enum IRPLOCK {
  IRPLOCK_CANCELABLE = 0,      // ordinal: 0x0
  IRPLOCK_CANCEL_STARTED = 1,  // ordinal: 0x1
  IRPLOCK_CANCEL_COMPLETE = 2, // ordinal: 0x2
  IRPLOCK_COMPLETED = 3,       // ordinal: 0x3
} IRPLOCK;

typedef enum PROFILE_STATUS {
  DOCK_NOTDOCKDEVICE = 0,      // ordinal: 0x0
  DOCK_QUIESCENT = 1,          // ordinal: 0x1
  DOCK_ARRIVING = 2,           // ordinal: 0x2
  DOCK_DEPARTING = 3,          // ordinal: 0x3
  DOCK_EJECTIRP_COMPLETED = 4, // ordinal: 0x4
} PROFILE_STATUS;

typedef enum _PNP_DEVNODE_STATE {
  DeviceNodeUnspecified = 768,            // ordinal: 0x0
  DeviceNodeUninitialized = 769,          // ordinal: 0x1
  DeviceNodeInitialized = 770,            // ordinal: 0x2
  DeviceNodeDriversAdded = 771,           // ordinal: 0x3
  DeviceNodeResourcesAssigned = 772,      // ordinal: 0x4
  DeviceNodeStartPending = 773,           // ordinal: 0x5
  DeviceNodeStartCompletion = 774,        // ordinal: 0x6
  DeviceNodeStartPostWork = 775,          // ordinal: 0x7
  DeviceNodeStarted = 776,                // ordinal: 0x8
  DeviceNodeQueryStopped = 777,           // ordinal: 0x9
  DeviceNodeStopped = 778,                // ordinal: 0xa
  DeviceNodeRestartCompletion = 779,      // ordinal: 0xb
  DeviceNodeEnumeratePending = 780,       // ordinal: 0xc
  DeviceNodeEnumerateCompletion = 781,    // ordinal: 0xd
  DeviceNodeAwaitingQueuedDeletion = 782, // ordinal: 0xe
  DeviceNodeAwaitingQueuedRemoval = 783,  // ordinal: 0xf
  DeviceNodeQueryRemoved = 784,           // ordinal: 0x10
  DeviceNodeRemovePendingCloses = 785,    // ordinal: 0x11
  DeviceNodeRemoved = 786,                // ordinal: 0x12
  DeviceNodeDeletePendingCloses = 787,    // ordinal: 0x13
  DeviceNodeDeleted = 788,                // ordinal: 0x14
  MaxDeviceNodeState = 789,               // ordinal: 0x15
} _PNP_DEVNODE_STATE;

typedef enum _PCW_CALLBACK_TYPE {
  PcwCallbackAddCounter = 0,         // ordinal: 0x0
  PcwCallbackRemoveCounter = 1,      // ordinal: 0x1
  PcwCallbackEnumerateInstances = 2, // ordinal: 0x2
  PcwCallbackCollectData = 3,        // ordinal: 0x3
} _PCW_CALLBACK_TYPE;

typedef enum _CM_LOAD_FAILURE_TYPE {
  _None = 0,                               // ordinal: 0x0
  _CmInitializeHive = 1,                   // ordinal: 0x1
  _HvInitializeHive = 2,                   // ordinal: 0x2
  _HvpBuildMap = 3,                        // ordinal: 0x3
  _HvpBuildMapForLoaderHive = 4,           // ordinal: 0x4
  _HvpInitMap = 5,                         // ordinal: 0x5
  _HvLoadHive = 6,                         // ordinal: 0x6
  _HvpMapHiveImage = 7,                    // ordinal: 0x7
  _HvpRecoverData = 8,                     // ordinal: 0x8
  _CmpValidateHiveSecurityDescriptors = 9, // ordinal: 0x9
  _HvpEnlistBinInMap = 10,                 // ordinal: 0xa
  _CmCheckRegistry = 11,                   // ordinal: 0xb
  _CmRegistryIO = 12,                      // ordinal: 0xc
  _CmCheckRegistry2 = 13,                  // ordinal: 0xd
  _CmpCheckKey = 14,                       // ordinal: 0xe
  _CmpCheckValueList = 15,                 // ordinal: 0xf
  _HvCheckHive = 16,                       // ordinal: 0x10
  _HvCheckBin = 17,                        // ordinal: 0x11
  _HvpGetLogEntryDirtyVector = 18,         // ordinal: 0x12
  _HvpReadLogEntryHeader = 19,             // ordinal: 0x13
  _HvpReadLogEntry = 20,                   // ordinal: 0x14
  _CmpMountPreloadedHives = 21,            // ordinal: 0x15
  _CmpLoadHiveThread = 22,                 // ordinal: 0x16
} _CM_LOAD_FAILURE_TYPE;

typedef enum _MI_SYSTEM_VA_TYPE {
  MiVaUnused = 0,               // ordinal: 0x0
  MiVaSessionSpace = 1,         // ordinal: 0x1
  MiVaProcessSpace = 2,         // ordinal: 0x2
  MiVaBootLoaded = 3,           // ordinal: 0x3
  MiVaPfnDatabase = 4,          // ordinal: 0x4
  MiVaNonPagedPool = 5,         // ordinal: 0x5
  MiVaPagedPool = 6,            // ordinal: 0x6
  MiVaSpecialPoolPaged = 7,     // ordinal: 0x7
  MiVaSystemCache = 8,          // ordinal: 0x8
  MiVaSystemPtes = 9,           // ordinal: 0x9
  MiVaHal = 10,                 // ordinal: 0xa
  MiVaSessionGlobalSpace = 11,  // ordinal: 0xb
  MiVaDriverImages = 12,        // ordinal: 0xc
  MiVaSpecialPoolNonPaged = 13, // ordinal: 0xd
  MiVaMaximumType = 14,         // ordinal: 0xe
  MiVaSystemPtesLarge = 15,     // ordinal: 0xf
} _MI_SYSTEM_VA_TYPE;

// 0x30 bytes (sizeof)
typedef struct _iobuf {
  CHAR *_ptr;      // offset: 0x0 ordinal: 0x0
  LONG _cnt;       // offset: 0x8 ordinal: 0x1
  CHAR *_base;     // offset: 0x10 ordinal: 0x2
  LONG _flag;      // offset: 0x18 ordinal: 0x3
  LONG _file;      // offset: 0x1c ordinal: 0x4
  LONG _charbuf;   // offset: 0x20 ordinal: 0x5
  LONG _bufsiz;    // offset: 0x24 ordinal: 0x6
  CHAR *_tmpfname; // offset: 0x28 ordinal: 0x7
} _iobuf;

typedef enum _WHEA_ERROR_PACKET_DATA_FORMAT {
  WheaDataFormatIPFSalRecord = 0, // ordinal: 0x0
  WheaDataFormatXPFMCA = 1,       // ordinal: 0x1
  WheaDataFormatMemory = 2,       // ordinal: 0x2
  WheaDataFormatPCIExpress = 3,   // ordinal: 0x3
  WheaDataFormatNMIPort = 4,      // ordinal: 0x4
  WheaDataFormatPCIXBus = 5,      // ordinal: 0x5
  WheaDataFormatPCIXDevice = 6,   // ordinal: 0x6
  WheaDataFormatGeneric = 7,      // ordinal: 0x7
  WheaDataFormatMax = 8,          // ordinal: 0x8
} _WHEA_ERROR_PACKET_DATA_FORMAT;

typedef enum _WHEA_ERROR_SOURCE_TYPE {
  WheaErrSrcTypeMCE = 0,        // ordinal: 0x0
  WheaErrSrcTypeCMC = 1,        // ordinal: 0x1
  WheaErrSrcTypeCPE = 2,        // ordinal: 0x2
  WheaErrSrcTypeNMI = 3,        // ordinal: 0x3
  WheaErrSrcTypePCIe = 4,       // ordinal: 0x4
  WheaErrSrcTypeGeneric = 5,    // ordinal: 0x5
  WheaErrSrcTypeINIT = 6,       // ordinal: 0x6
  WheaErrSrcTypeBOOT = 7,       // ordinal: 0x7
  WheaErrSrcTypeSCIGeneric = 8, // ordinal: 0x8
  WheaErrSrcTypeIPFMCA = 9,     // ordinal: 0x9
  WheaErrSrcTypeIPFCMC = 10,    // ordinal: 0xa
  WheaErrSrcTypeIPFCPE = 11,    // ordinal: 0xb
  WheaErrSrcTypeMax = 12,       // ordinal: 0xc
} _WHEA_ERROR_SOURCE_TYPE;

typedef enum _WHEA_ERROR_SEVERITY {
  WheaErrSevRecoverable = 0,   // ordinal: 0x0
  WheaErrSevFatal = 1,         // ordinal: 0x1
  WheaErrSevCorrected = 2,     // ordinal: 0x2
  WheaErrSevInformational = 3, // ordinal: 0x3
} _WHEA_ERROR_SEVERITY;

typedef enum _WHEA_ERROR_TYPE {
  WheaErrTypeProcessor = 0,  // ordinal: 0x0
  WheaErrTypeMemory = 1,     // ordinal: 0x1
  WheaErrTypePCIExpress = 2, // ordinal: 0x2
  WheaErrTypeNMI = 3,        // ordinal: 0x3
  WheaErrTypePCIXBus = 4,    // ordinal: 0x4
  WheaErrTypePCIXDevice = 5, // ordinal: 0x5
  WheaErrTypeGeneric = 6,    // ordinal: 0x6
} _WHEA_ERROR_TYPE;

typedef enum _MM_PAGE_ACCESS_TYPE {
  MmPteAccessType = 0,         // ordinal: 0x0
  MmCcReadAheadType = 1,       // ordinal: 0x1
  MmPfnRepurposeType = 2,      // ordinal: 0x2
  MmMaximumPageAccessType = 3, // ordinal: 0x3
} _MM_PAGE_ACCESS_TYPE;

typedef enum _IO_PRIORITY_HINT {
  IoPriorityVeryLow = 0,  // ordinal: 0x0
  IoPriorityLow = 1,      // ordinal: 0x1
  IoPriorityNormal = 2,   // ordinal: 0x2
  IoPriorityHigh = 3,     // ordinal: 0x3
  IoPriorityCritical = 4, // ordinal: 0x4
  MaxIoPriorityTypes = 5, // ordinal: 0x5
} _IO_PRIORITY_HINT;

typedef enum _MMLISTS {
  ZeroedPageList = 0,          // ordinal: 0x0
  FreePageList = 1,            // ordinal: 0x1
  StandbyPageList = 2,         // ordinal: 0x2
  ModifiedPageList = 3,        // ordinal: 0x3
  ModifiedNoWritePageList = 4, // ordinal: 0x4
  BadPageList = 5,             // ordinal: 0x5
  ActiveAndValid = 6,          // ordinal: 0x6
  TransitionPage = 7,          // ordinal: 0x7
} _MMLISTS;

typedef enum _IRQ_PRIORITY {
  IrqPriorityUndefined = 0, // ordinal: 0x0
  IrqPriorityLow = 1,       // ordinal: 0x1
  IrqPriorityNormal = 2,    // ordinal: 0x2
  IrqPriorityHigh = 3,      // ordinal: 0x3
} _IRQ_PRIORITY;

typedef enum _SECURITY_IMPERSONATION_LEVEL {
  SecurityAnonymous = 0,      // ordinal: 0x0
  SecurityIdentification = 1, // ordinal: 0x1
  SecurityImpersonation = 2,  // ordinal: 0x2
  SecurityDelegation = 3,     // ordinal: 0x3
} _SECURITY_IMPERSONATION_LEVEL;

// 0x20 bytes (sizeof)
typedef struct _SECURITY_SUBJECT_CONTEXT {
  VOID *ClientToken; // offset: 0x0 ordinal: 0x0
  enum _SECURITY_IMPERSONATION_LEVEL
      ImpersonationLevel; // offset: 0x8 ordinal: 0x1
  VOID *PrimaryToken;     // offset: 0x10 ordinal: 0x2
  VOID *ProcessAuditId;   // offset: 0x18 ordinal: 0x3
} _SECURITY_SUBJECT_CONTEXT;

typedef enum _FUNCTION_TABLE_TYPE {
  RF_SORTED = 0,         // ordinal: 0x0
  RF_UNSORTED = 1,       // ordinal: 0x1
  RF_CALLBACK = 2,       // ordinal: 0x2
  RF_KERNEL_DYNAMIC = 3, // ordinal: 0x3
} _FUNCTION_TABLE_TYPE;

typedef enum _FS_FILTER_STREAM_FO_NOTIFICATION_TYPE {
  NotifyTypeCreate = 0,  // ordinal: 0x0
  NotifyTypeRetired = 1, // ordinal: 0x1
} _FS_FILTER_STREAM_FO_NOTIFICATION_TYPE;

typedef enum _FS_FILTER_SECTION_SYNC_TYPE {
  SyncTypeOther = 0,         // ordinal: 0x0
  SyncTypeCreateSection = 1, // ordinal: 0x1
} _FS_FILTER_SECTION_SYNC_TYPE;

typedef enum _INTERFACE_TYPE {
  InterfaceTypeUndefined = -1, // ordinal: 0x0
  Internal = 0,                // ordinal: 0x1
  Isa = 1,                     // ordinal: 0x2
  Eisa = 2,                    // ordinal: 0x3
  MicroChannel = 3,            // ordinal: 0x4
  TurboChannel = 4,            // ordinal: 0x5
  PCIBus = 5,                  // ordinal: 0x6
  VMEBus = 6,                  // ordinal: 0x7
  NuBus = 7,                   // ordinal: 0x8
  PCMCIABus = 8,               // ordinal: 0x9
  CBus = 9,                    // ordinal: 0xa
  MPIBus = 10,                 // ordinal: 0xb
  MPSABus = 11,                // ordinal: 0xc
  ProcessorInternal = 12,      // ordinal: 0xd
  InternalPowerBus = 13,       // ordinal: 0xe
  PNPISABus = 14,              // ordinal: 0xf
  PNPBus = 15,                 // ordinal: 0x10
  Vmcs = 16,                   // ordinal: 0x11
  ACPIBus = 17,                // ordinal: 0x12
  MaximumInterfaceType = 18,   // ordinal: 0x13
} _INTERFACE_TYPE;

typedef enum POWER_ACTION {
  PowerActionNone = 0,          // ordinal: 0x0
  PowerActionReserved = 1,      // ordinal: 0x1
  PowerActionSleep = 2,         // ordinal: 0x2
  PowerActionHibernate = 3,     // ordinal: 0x3
  PowerActionShutdown = 4,      // ordinal: 0x4
  PowerActionShutdownReset = 5, // ordinal: 0x5
  PowerActionShutdownOff = 6,   // ordinal: 0x6
  PowerActionWarmEject = 7,     // ordinal: 0x7
  PowerActionDisplayOff = 8,    // ordinal: 0x8
} POWER_ACTION;

typedef enum _POWER_STATE_TYPE {
  SystemPowerState = 0, // ordinal: 0x0
  DevicePowerState = 1, // ordinal: 0x1
} _POWER_STATE_TYPE;

typedef enum _SYSTEM_POWER_STATE {
  PowerSystemUnspecified = 0, // ordinal: 0x0
  PowerSystemWorking = 1,     // ordinal: 0x1
  PowerSystemSleeping1 = 2,   // ordinal: 0x2
  PowerSystemSleeping2 = 3,   // ordinal: 0x3
  PowerSystemSleeping3 = 4,   // ordinal: 0x4
  PowerSystemHibernate = 5,   // ordinal: 0x5
  PowerSystemShutdown = 6,    // ordinal: 0x6
  PowerSystemMaximum = 7,     // ordinal: 0x7
} _SYSTEM_POWER_STATE;

// 0x4 bytes (sizeof)
typedef struct __anon_666 {
  enum _SYSTEM_POWER_STATE PowerState; // offset: 0x0 ordinal: 0x0
} __anon_666;

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE {
  DeviceUsageTypeUndefined = 0,   // ordinal: 0x0
  DeviceUsageTypePaging = 1,      // ordinal: 0x1
  DeviceUsageTypeHibernation = 2, // ordinal: 0x2
  DeviceUsageTypeDumpFile = 3,    // ordinal: 0x3
  DeviceUsageTypeBoot = 4,        // ordinal: 0x4
  DeviceUsageTypePostDisplay = 5, // ordinal: 0x5
} _DEVICE_USAGE_NOTIFICATION_TYPE;

typedef enum DEVICE_TEXT_TYPE {
  DeviceTextDescription = 0,         // ordinal: 0x0
  DeviceTextLocationInformation = 1, // ordinal: 0x1
} DEVICE_TEXT_TYPE;

typedef enum BUS_QUERY_ID_TYPE {
  BusQueryDeviceID = 0,           // ordinal: 0x0
  BusQueryHardwareIDs = 1,        // ordinal: 0x1
  BusQueryCompatibleIDs = 2,      // ordinal: 0x2
  BusQueryInstanceID = 3,         // ordinal: 0x3
  BusQueryDeviceSerialNumber = 4, // ordinal: 0x4
  BusQueryContainerID = 5,        // ordinal: 0x5
} BUS_QUERY_ID_TYPE;

// 0x4 bytes (sizeof)
typedef struct __anon_663 {
  enum BUS_QUERY_ID_TYPE IdType; // offset: 0x0 ordinal: 0x0
} __anon_663;

typedef enum _DEVICE_RELATION_TYPE {
  BusRelations = 0,         // ordinal: 0x0
  EjectionRelations = 1,    // ordinal: 0x1
  PowerRelations = 2,       // ordinal: 0x2
  RemovalRelations = 3,     // ordinal: 0x3
  TargetDeviceRelation = 4, // ordinal: 0x4
  SingleBusRelations = 5,   // ordinal: 0x5
  TransportRelations = 6,   // ordinal: 0x6
} _DEVICE_RELATION_TYPE;

// 0x4 bytes (sizeof)
typedef struct __anon_657 {
  enum _DEVICE_RELATION_TYPE Type; // offset: 0x0 ordinal: 0x0
} __anon_657;

typedef enum _FSINFOCLASS {
  FileFsVolumeInformation = 1,        // ordinal: 0x0
  FileFsLabelInformation = 2,         // ordinal: 0x1
  FileFsSizeInformation = 3,          // ordinal: 0x2
  FileFsDeviceInformation = 4,        // ordinal: 0x3
  FileFsAttributeInformation = 5,     // ordinal: 0x4
  FileFsControlInformation = 6,       // ordinal: 0x5
  FileFsFullSizeInformation = 7,      // ordinal: 0x6
  FileFsObjectIdInformation = 8,      // ordinal: 0x7
  FileFsDriverPathInformation = 9,    // ordinal: 0x8
  FileFsVolumeFlagsInformation = 10,  // ordinal: 0x9
  FileFsSectorSizeInformation = 11,   // ordinal: 0xa
  FileFsDataCopyInformation = 12,     // ordinal: 0xb
  FileFsMetadataSizeInformation = 13, // ordinal: 0xc
  FileFsMaximumInformation = 14,      // ordinal: 0xd
} _FSINFOCLASS;

typedef enum _FILE_INFORMATION_CLASS {
  FileDirectoryInformation = 1,                 // ordinal: 0x0
  FileFullDirectoryInformation = 2,             // ordinal: 0x1
  FileBothDirectoryInformation = 3,             // ordinal: 0x2
  FileBasicInformation = 4,                     // ordinal: 0x3
  FileStandardInformation = 5,                  // ordinal: 0x4
  FileInternalInformation = 6,                  // ordinal: 0x5
  FileEaInformation = 7,                        // ordinal: 0x6
  FileAccessInformation = 8,                    // ordinal: 0x7
  FileNameInformation = 9,                      // ordinal: 0x8
  FileRenameInformation = 10,                   // ordinal: 0x9
  FileLinkInformation = 11,                     // ordinal: 0xa
  FileNamesInformation = 12,                    // ordinal: 0xb
  FileDispositionInformation = 13,              // ordinal: 0xc
  FilePositionInformation = 14,                 // ordinal: 0xd
  FileFullEaInformation = 15,                   // ordinal: 0xe
  FileModeInformation = 16,                     // ordinal: 0xf
  FileAlignmentInformation = 17,                // ordinal: 0x10
  FileAllInformation = 18,                      // ordinal: 0x11
  FileAllocationInformation = 19,               // ordinal: 0x12
  FileEndOfFileInformation = 20,                // ordinal: 0x13
  FileAlternateNameInformation = 21,            // ordinal: 0x14
  FileStreamInformation = 22,                   // ordinal: 0x15
  FilePipeInformation = 23,                     // ordinal: 0x16
  FilePipeLocalInformation = 24,                // ordinal: 0x17
  FilePipeRemoteInformation = 25,               // ordinal: 0x18
  FileMailslotQueryInformation = 26,            // ordinal: 0x19
  FileMailslotSetInformation = 27,              // ordinal: 0x1a
  FileCompressionInformation = 28,              // ordinal: 0x1b
  FileObjectIdInformation = 29,                 // ordinal: 0x1c
  FileCompletionInformation = 30,               // ordinal: 0x1d
  FileMoveClusterInformation = 31,              // ordinal: 0x1e
  FileQuotaInformation = 32,                    // ordinal: 0x1f
  FileReparsePointInformation = 33,             // ordinal: 0x20
  FileNetworkOpenInformation = 34,              // ordinal: 0x21
  FileAttributeTagInformation = 35,             // ordinal: 0x22
  FileTrackingInformation = 36,                 // ordinal: 0x23
  FileIdBothDirectoryInformation = 37,          // ordinal: 0x24
  FileIdFullDirectoryInformation = 38,          // ordinal: 0x25
  FileValidDataLengthInformation = 39,          // ordinal: 0x26
  FileShortNameInformation = 40,                // ordinal: 0x27
  FileIoCompletionNotificationInformation = 41, // ordinal: 0x28
  FileIoStatusBlockRangeInformation = 42,       // ordinal: 0x29
  FileIoPriorityHintInformation = 43,           // ordinal: 0x2a
  FileSfioReserveInformation = 44,              // ordinal: 0x2b
  FileSfioVolumeInformation = 45,               // ordinal: 0x2c
  FileHardLinkInformation = 46,                 // ordinal: 0x2d
  FileProcessIdsUsingFileInformation = 47,      // ordinal: 0x2e
  FileNormalizedNameInformation = 48,           // ordinal: 0x2f
  FileNetworkPhysicalNameInformation = 49,      // ordinal: 0x30
  FileIdGlobalTxDirectoryInformation = 50,      // ordinal: 0x31
  FileIsRemoteDeviceInformation = 51,           // ordinal: 0x32
  FileUnusedInformation = 52,                   // ordinal: 0x33
  FileNumaNodeInformation = 53,                 // ordinal: 0x34
  FileStandardLinkInformation = 54,             // ordinal: 0x35
  FileRemoteProtocolInformation = 55,           // ordinal: 0x36
  FileRenameInformationBypassAccessCheck = 56,  // ordinal: 0x37
  FileLinkInformationBypassAccessCheck = 57,    // ordinal: 0x38
  FileVolumeNameInformation = 58,               // ordinal: 0x39
  FileIdInformation = 59,                       // ordinal: 0x3a
  FileIdExtdDirectoryInformation = 60,          // ordinal: 0x3b
  FileReplaceCompletionInformation = 61,        // ordinal: 0x3c
  FileHardLinkFullIdInformation = 62,           // ordinal: 0x3d
  FileIdExtdBothDirectoryInformation = 63,      // ordinal: 0x3e
  FileMaximumInformation = 64,                  // ordinal: 0x3f
} _FILE_INFORMATION_CLASS;

// 0x4 bytes (sizeof)
typedef union _POWER_STATE {
  enum _SYSTEM_POWER_STATE SystemState; // offset: 0x0 ordinal: 0x0
  enum _DEVICE_POWER_STATE DeviceState; // offset: 0x0 ordinal: 0x1
} _POWER_STATE;

typedef enum _POP_DEVICE_IDLE_TYPE {
  DeviceIdleNormal = 0, // ordinal: 0x0
  DeviceIdleDisk = 1,   // ordinal: 0x1
} _POP_DEVICE_IDLE_TYPE;

typedef enum _IO_ALLOCATION_ACTION {
  KeepObject = 1,                    // ordinal: 0x0
  DeallocateObject = 2,              // ordinal: 0x1
  DeallocateObjectKeepRegisters = 3, // ordinal: 0x2
} _IO_ALLOCATION_ACTION;

typedef enum _EXQUEUEINDEX {
  ExPoolUntrusted = 0, // ordinal: 0x0
  ExPoolTrusted = 1,   // ordinal: 0x1
  ExPoolMax = 8,       // ordinal: 0x2
} _EXQUEUEINDEX;

typedef enum _HARDWARE_COUNTER_TYPE {
  PMCCounter = 0,             // ordinal: 0x0
  MaxHardwareCounterType = 1, // ordinal: 0x1
} _HARDWARE_COUNTER_TYPE;

typedef enum PPM_IDLE_BUCKET_TIME_TYPE {
  PpmIdleBucketTimeInQpc = 0,   // ordinal: 0x0
  PpmIdleBucketTimeIn100ns = 1, // ordinal: 0x1
  PpmIdleBucketTimeMaximum = 2, // ordinal: 0x2
} PPM_IDLE_BUCKET_TIME_TYPE;

typedef enum _PROCESSOR_CACHE_TYPE {
  CacheUnified = 0,     // ordinal: 0x0
  CacheInstruction = 1, // ordinal: 0x1
  CacheData = 2,        // ordinal: 0x2
  CacheTrace = 3,       // ordinal: 0x3
} _PROCESSOR_CACHE_TYPE;

typedef enum _POOL_TYPE {
  NonPagedPool = 0,                          // ordinal: 0x0
  NonPagedPoolExecute = 0,                   // ordinal: 0x1
  PagedPool = 1,                             // ordinal: 0x2
  NonPagedPoolMustSucceed = 2,               // ordinal: 0x3
  DontUseThisType = 3,                       // ordinal: 0x4
  NonPagedPoolCacheAligned = 4,              // ordinal: 0x5
  PagedPoolCacheAligned = 5,                 // ordinal: 0x6
  NonPagedPoolCacheAlignedMustS = 6,         // ordinal: 0x7
  MaxPoolType = 7,                           // ordinal: 0x8
  NonPagedPoolBase = 0,                      // ordinal: 0x9
  NonPagedPoolBaseMustSucceed = 2,           // ordinal: 0xa
  NonPagedPoolBaseCacheAligned = 4,          // ordinal: 0xb
  NonPagedPoolBaseCacheAlignedMustS = 6,     // ordinal: 0xc
  NonPagedPoolSession = 32,                  // ordinal: 0xd
  PagedPoolSession = 33,                     // ordinal: 0xe
  NonPagedPoolMustSucceedSession = 34,       // ordinal: 0xf
  DontUseThisTypeSession = 35,               // ordinal: 0x10
  NonPagedPoolCacheAlignedSession = 36,      // ordinal: 0x11
  PagedPoolCacheAlignedSession = 37,         // ordinal: 0x12
  NonPagedPoolCacheAlignedMustSSession = 38, // ordinal: 0x13
  NonPagedPoolNx = 512,                      // ordinal: 0x14
  NonPagedPoolNxCacheAligned = 516,          // ordinal: 0x15
  NonPagedPoolSessionNx = 544,               // ordinal: 0x16
} _POOL_TYPE;

typedef enum _PROC_HYPERVISOR_STATE {
  ProcHypervisorNone = 0,       // ordinal: 0x0
  ProcHypervisorPresent = 1,    // ordinal: 0x1
  ProcHypervisorPower = 2,      // ordinal: 0x2
  ProcHypervisorHvCounters = 3, // ordinal: 0x3
} _PROC_HYPERVISOR_STATE;

typedef enum _EXCEPTION_DISPOSITION {
  ExceptionContinueExecution = 0, // ordinal: 0x0
  ExceptionContinueSearch = 1,    // ordinal: 0x1
  ExceptionNestedException = 2,   // ordinal: 0x2
  ExceptionCollidedUnwind = 3,    // ordinal: 0x3
} _EXCEPTION_DISPOSITION;

typedef enum _TP_CALLBACK_PRIORITY {
  TP_CALLBACK_PRIORITY_HIGH = 0,    // ordinal: 0x0
  TP_CALLBACK_PRIORITY_NORMAL = 1,  // ordinal: 0x1
  TP_CALLBACK_PRIORITY_LOW = 2,     // ordinal: 0x2
  TP_CALLBACK_PRIORITY_INVALID = 3, // ordinal: 0x3
  TP_CALLBACK_PRIORITY_COUNT = 3,   // ordinal: 0x4
} _TP_CALLBACK_PRIORITY;

typedef unsigned short WCHAR;

// 0x2 bytes (sizeof)
typedef struct __anon_1309 {
  WCHAR ParentId[1]; // offset: 0x0 ordinal: 0x0
} __anon_1309;

// 0x8 bytes (sizeof)
typedef struct __anon_1307 {
  enum _PNP_VETO_TYPE VetoType;    // offset: 0x0 ordinal: 0x0
  WCHAR DeviceIdVetoNameBuffer[1]; // offset: 0x4 ordinal: 0x1
} __anon_1307;

// 0x10 bytes (sizeof)
typedef struct __anon_1304 {
  VOID *NotificationStructure; // offset: 0x0 ordinal: 0x0
  WCHAR DeviceId[1];           // offset: 0x8 ordinal: 0x1
} __anon_1304;

// 0x2 bytes (sizeof)
typedef struct __anon_1303 {
  WCHAR DeviceId[1]; // offset: 0x0 ordinal: 0x0
} __anon_1303;

typedef LONGLONG (*__anon_1646)();

// 0x8 bytes (sizeof)
typedef struct _QUAD {
  union {
    LONGLONG UseThisFieldToCopy; // offset: 0x0 ordinal: 0x0
    double DoNotUseThisField;    // offset: 0x0 ordinal: 0x1
  };
} _QUAD;

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE {
  StandardDesign = 0,  // ordinal: 0x0
  NEC98x86 = 1,        // ordinal: 0x1
  EndAlternatives = 2, // ordinal: 0x2
} _ALTERNATIVE_ARCHITECTURE_TYPE;

// 0x18 bytes (sizeof)
typedef struct _HIVE_WRITE_WAIT_QUEUE {
  struct _ETHREAD *ActiveThread;      // offset: 0x0 ordinal: 0x0
  struct _HIVE_WAIT_PACKET *WaitList; // offset: 0x8 ordinal: 0x1
  ULONG OwnerBoosted;                 // offset: 0x10 ordinal: 0x2
} _HIVE_WRITE_WAIT_QUEUE;

// 0x1 bytes (sizeof)
typedef union __anon_2150 {
  UCHAR AsUCHAR;                // offset: 0x0 ordinal: 0x0
  UCHAR NoDomainAccounting : 1; // offset: 0x0 ordinal: 0x1
  UCHAR IncreasePolicy : 2;     // offset: 0x0 ordinal: 0x2
  UCHAR DecreasePolicy : 2;     // offset: 0x0 ordinal: 0x3
  UCHAR Reserved : 3;           // offset: 0x0 ordinal: 0x4
} __anon_2150;

// 0x10 bytes (sizeof)
typedef struct _VF_TRACKER_STAMP {
  VOID *Thread;        // offset: 0x0 ordinal: 0x0
  UCHAR Flags : 8;     // offset: 0x8 ordinal: 0x1
  UCHAR OldIrql : 8;   // offset: 0x9 ordinal: 0x2
  UCHAR NewIrql : 8;   // offset: 0xa ordinal: 0x3
  UCHAR Processor : 8; // offset: 0xb ordinal: 0x4
} _VF_TRACKER_STAMP;

// 0x1 bytes (sizeof)
typedef union _XPF_MC_BANK_FLAGS {
  UCHAR ClearOnInitializationRW : 1; // offset: 0x0 ordinal: 0x0
  UCHAR ControlDataRW : 1;           // offset: 0x0 ordinal: 0x1
  UCHAR Reserved : 6;                // offset: 0x0 ordinal: 0x2
  UCHAR AsUCHAR;                     // offset: 0x0 ordinal: 0x3
} _XPF_MC_BANK_FLAGS;

// 0x1e bytes (sizeof)
typedef struct _TOKEN_AUDIT_POLICY {
  UCHAR PerUserPolicy[30]; // offset: 0x0 ordinal: 0x0
} _TOKEN_AUDIT_POLICY;

// 0x1f bytes (sizeof)
typedef struct _SEP_AUDIT_POLICY {
  struct _TOKEN_AUDIT_POLICY AdtTokenPolicy; // offset: 0x0 ordinal: 0x0
  UCHAR PolicySetStatus;                     // offset: 0x1e ordinal: 0x1
} _SEP_AUDIT_POLICY;

// 0x1 bytes (sizeof)
typedef struct _ETW_LOGGER_HANDLE {
  UCHAR DereferenceAndLeave; // offset: 0x0 ordinal: 0x0
} _ETW_LOGGER_HANDLE;

// 0x4 bytes (sizeof)
typedef struct __anon_1628 {
  UCHAR MajorVersion;    // offset: 0x0 ordinal: 0x0
  UCHAR MinorVersion;    // offset: 0x1 ordinal: 0x1
  UCHAR SubVersion;      // offset: 0x2 ordinal: 0x2
  UCHAR SubMinorVersion; // offset: 0x3 ordinal: 0x3
} __anon_1628;

// 0x1 bytes (sizeof)
typedef struct __anon_1520 {
  UCHAR ReferenceCache : 1; // offset: 0x0 ordinal: 0x0
  UCHAR Lookaside : 1;      // offset: 0x0 ordinal: 0x1
  UCHAR Initializing : 1;   // offset: 0x0 ordinal: 0x2
  UCHAR Deleted : 1;        // offset: 0x0 ordinal: 0x3
} __anon_1520;

// 0x1 bytes (sizeof)
typedef union __anon_1521 {
  struct __anon_1520 s1; // offset: 0x0 ordinal: 0x0
  UCHAR Flags;           // offset: 0x0 ordinal: 0x1
} __anon_1521;

typedef UCHAR (*__anon_1464)(VOID *, UCHAR);

// 0x20 bytes (sizeof)
typedef struct _CACHE_MANAGER_CALLBACKS {
  UCHAR (*AcquireForLazyWrite)(VOID *, UCHAR); // offset: 0x0 ordinal: 0x0
  VOID (*ReleaseFromLazyWrite)(VOID *);        // offset: 0x8 ordinal: 0x1
  UCHAR (*AcquireForReadAhead)(VOID *, UCHAR); // offset: 0x10 ordinal: 0x2
  VOID (*ReleaseFromReadAhead)(VOID *);        // offset: 0x18 ordinal: 0x3
} _CACHE_MANAGER_CALLBACKS;

// 0x10 bytes (sizeof)
typedef struct _VF_ADDRESS_RANGE {
  UCHAR *Start; // offset: 0x0 ordinal: 0x0
  UCHAR *End;   // offset: 0x8 ordinal: 0x1
} _VF_ADDRESS_RANGE;

// 0x10 bytes (sizeof)
typedef struct _RELATION_LIST {
  struct _DEVICE_OBJECT_LIST *DeviceObjectList; // offset: 0x0 ordinal: 0x0
  UCHAR Sorted;                                 // offset: 0x8 ordinal: 0x1
} _RELATION_LIST;

typedef UCHAR (*__anon_1263)(struct _PEP_CRASHDUMP_INFORMATION *);

// 0x1 bytes (sizeof)
typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS {
  UCHAR FRUId : 1;    // offset: 0x0 ordinal: 0x0
  UCHAR FRUText : 1;  // offset: 0x0 ordinal: 0x1
  UCHAR Reserved : 6; // offset: 0x0 ordinal: 0x2
  UCHAR AsUCHAR;      // offset: 0x0 ordinal: 0x3
} _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS;

// 0x2 bytes (sizeof)
typedef struct _MI_REBUILD_LARGE_PAGE_COUNTDOWN {
  UCHAR SecondsLeft;     // offset: 0x0 ordinal: 0x0
  UCHAR SecondsAssigned; // offset: 0x1 ordinal: 0x1
} _MI_REBUILD_LARGE_PAGE_COUNTDOWN;

// 0x4 bytes (sizeof)
typedef struct _MMPAGE_FILE_EXPANSION_FLAGS {
  UCHAR PageFileNumber : 8;      // offset: 0x0 ordinal: 0x0
  UCHAR Spare1 : 8;              // offset: 0x1 ordinal: 0x1
  UCHAR Spare2 : 8;              // offset: 0x2 ordinal: 0x2
  UCHAR IgnoreCurrentCommit : 1; // offset: 0x3 ordinal: 0x3
  UCHAR IncreaseMinimumSize : 1; // offset: 0x3 ordinal: 0x4
  UCHAR Spare3 : 6;              // offset: 0x3 ordinal: 0x5
} _MMPAGE_FILE_EXPANSION_FLAGS;

// 0x2 bytes (sizeof)
typedef struct _MMPFNENTRY {
  UCHAR PageLocation : 3;       // offset: 0x0 ordinal: 0x0
  UCHAR WriteInProgress : 1;    // offset: 0x0 ordinal: 0x1
  UCHAR Modified : 1;           // offset: 0x0 ordinal: 0x2
  UCHAR ReadInProgress : 1;     // offset: 0x0 ordinal: 0x3
  UCHAR CacheAttribute : 2;     // offset: 0x0 ordinal: 0x4
  UCHAR Priority : 3;           // offset: 0x1 ordinal: 0x5
  UCHAR OnProtectedStandby : 1; // offset: 0x1 ordinal: 0x6
  UCHAR InPageError : 1;        // offset: 0x1 ordinal: 0x7
  UCHAR SystemChargedPage : 1;  // offset: 0x1 ordinal: 0x8
  UCHAR RemovalRequested : 1;   // offset: 0x1 ordinal: 0x9
  UCHAR ParityError : 1;        // offset: 0x1 ordinal: 0xa
} _MMPFNENTRY;

// 0x4 bytes (sizeof)
typedef struct _MMINPAGE_FLAGS {
  UCHAR InjectRetry : 1;             // offset: 0x0 ordinal: 0x0
  UCHAR CrossThreadPadding : 7;      // offset: 0x0 ordinal: 0x1
  UCHAR PrefetchSystemVmType : 2;    // offset: 0x1 ordinal: 0x2
  UCHAR VaPrefetchReadBlock : 1;     // offset: 0x1 ordinal: 0x3
  UCHAR CollidedFlowThrough : 1;     // offset: 0x1 ordinal: 0x4
  UCHAR ForceCollisions : 1;         // offset: 0x1 ordinal: 0x5
  UCHAR InPageExpanded : 1;          // offset: 0x1 ordinal: 0x6
  UCHAR IssuedAtLowPriority : 1;     // offset: 0x1 ordinal: 0x7
  UCHAR FaultFromStore : 1;          // offset: 0x1 ordinal: 0x8
  UCHAR PagePriority : 3;            // offset: 0x2 ordinal: 0x9
  UCHAR PerformRelocations : 1;      // offset: 0x2 ordinal: 0xa
  UCHAR ClusteredPagePriority : 3;   // offset: 0x2 ordinal: 0xb
  UCHAR MakeClusterValid : 1;        // offset: 0x2 ordinal: 0xc
  UCHAR ZeroLastPage : 1;            // offset: 0x3 ordinal: 0xd
  UCHAR UserFault : 1;               // offset: 0x3 ordinal: 0xe
  UCHAR StandbyProtectionNeeded : 1; // offset: 0x3 ordinal: 0xf
  UCHAR PteChanged : 1;              // offset: 0x3 ordinal: 0x10
  UCHAR PageFileFault : 1;           // offset: 0x3 ordinal: 0x11
  UCHAR PageFilePageHashActive : 1;  // offset: 0x3 ordinal: 0x12
  UCHAR CoalescedIo : 1;             // offset: 0x3 ordinal: 0x13
  UCHAR VmLockNotNeeded : 1;         // offset: 0x3 ordinal: 0x14
} _MMINPAGE_FLAGS;

// 0x10 bytes (sizeof)
typedef struct __anon_770 {
  enum _FS_FILTER_STREAM_FO_NOTIFICATION_TYPE
      NotificationType; // offset: 0x0 ordinal: 0x0
  UCHAR SafeToRecurse;  // offset: 0x8 ordinal: 0x1
} __anon_770;

typedef VOID (*__anon_720)(VOID *, UCHAR);

// 0x1 bytes (sizeof)
typedef struct __anon_662 {
  UCHAR Lock; // offset: 0x0 ordinal: 0x0
} __anon_662;

// 0x4 bytes (sizeof)
typedef struct _MMSUPPORT_FLAGS {
  UCHAR WorkingSetType : 3;        // offset: 0x0 ordinal: 0x0
  UCHAR ForceCredits : 3;          // offset: 0x0 ordinal: 0x1
  UCHAR MaximumWorkingSetHard : 1; // offset: 0x0 ordinal: 0x2
  UCHAR MinimumWorkingSetHard : 1; // offset: 0x0 ordinal: 0x3
  UCHAR SessionMaster : 1;         // offset: 0x1 ordinal: 0x4
  UCHAR TrimmerState : 2;          // offset: 0x1 ordinal: 0x5
  UCHAR Reserved : 1;              // offset: 0x1 ordinal: 0x6
  UCHAR PageStealers : 4;          // offset: 0x1 ordinal: 0x7
  UCHAR MemoryPriority;            // offset: 0x2 ordinal: 0x8
  UCHAR WsleDeleted : 1;           // offset: 0x3 ordinal: 0x9
  UCHAR VmExiting : 1;             // offset: 0x3 ordinal: 0xa
  UCHAR ExpansionFailed : 1;       // offset: 0x3 ordinal: 0xb
  UCHAR SvmEnabled : 1;            // offset: 0x3 ordinal: 0xc
  UCHAR ForceAge : 1;              // offset: 0x3 ordinal: 0xd
  UCHAR NewMaximum : 1;            // offset: 0x3 ordinal: 0xe
  UCHAR CommitReleaseState : 2;    // offset: 0x3 ordinal: 0xf
} _MMSUPPORT_FLAGS;

// 0x1 bytes (sizeof)
typedef struct _PS_PROTECTION {
  union {
    UCHAR Level;    // offset: 0x0 ordinal: 0x0
    UCHAR Type : 3; // offset: 0x0 ordinal: 0x1
  };
  UCHAR Audit : 1;  // offset: 0x0 ordinal: 0x2
  UCHAR Signer : 4; // offset: 0x0 ordinal: 0x3
} _PS_PROTECTION;

typedef UCHAR (*__anon_576)(struct _FILE_OBJECT *, struct _MDL *,
                            struct _DEVICE_OBJECT *);

typedef UCHAR (*__anon_397)(VOID *);

// 0x1 bytes (sizeof)
typedef union _KEXECUTE_OPTIONS {
  UCHAR ExecuteDisable : 1;                  // offset: 0x0 ordinal: 0x0
  UCHAR ExecuteEnable : 1;                   // offset: 0x0 ordinal: 0x1
  UCHAR DisableThunkEmulation : 1;           // offset: 0x0 ordinal: 0x2
  UCHAR Permanent : 1;                       // offset: 0x0 ordinal: 0x3
  UCHAR ExecuteDispatchEnable : 1;           // offset: 0x0 ordinal: 0x4
  UCHAR ImageDispatchEnable : 1;             // offset: 0x0 ordinal: 0x5
  UCHAR DisableExceptionChainValidation : 1; // offset: 0x0 ordinal: 0x6
  UCHAR Spare : 1;                           // offset: 0x0 ordinal: 0x7
  UCHAR ExecuteOptions;                      // offset: 0x0 ordinal: 0x8
  UCHAR ExecuteOptionsNV;                    // offset: 0x0 ordinal: 0x9
} _KEXECUTE_OPTIONS;

// 0x2 bytes (sizeof)
typedef struct _PROC_PERF_LOAD {
  UCHAR BusyPercentage;      // offset: 0x0 ordinal: 0x0
  UCHAR FrequencyPercentage; // offset: 0x1 ordinal: 0x1
} _PROC_PERF_LOAD;

// 0x1 bytes (sizeof)
typedef struct _flags {
  UCHAR Removable : 1;            // offset: 0x0 ordinal: 0x0
  UCHAR GroupAssigned : 1;        // offset: 0x0 ordinal: 0x1
  UCHAR GroupCommitted : 1;       // offset: 0x0 ordinal: 0x2
  UCHAR GroupAssignmentFixed : 1; // offset: 0x0 ordinal: 0x3
  UCHAR Fill : 4;                 // offset: 0x0 ordinal: 0x4
} _flags;

// 0x1 bytes (sizeof)
typedef union _KWAIT_STATUS_REGISTER {
  UCHAR Flags;        // offset: 0x0 ordinal: 0x0
  UCHAR State : 3;    // offset: 0x0 ordinal: 0x1
  UCHAR Affinity : 1; // offset: 0x0 ordinal: 0x2
  UCHAR Priority : 1; // offset: 0x0 ordinal: 0x3
  UCHAR Apc : 1;      // offset: 0x0 ordinal: 0x4
  UCHAR UserApc : 1;  // offset: 0x0 ordinal: 0x5
  UCHAR Alert : 1;    // offset: 0x0 ordinal: 0x6
} _KWAIT_STATUS_REGISTER;

// 0x5 bytes (sizeof)
typedef struct _PROC_IDLE_POLICY {
  UCHAR PromotePercent;     // offset: 0x0 ordinal: 0x0
  UCHAR DemotePercent;      // offset: 0x1 ordinal: 0x1
  UCHAR PromotePercentBase; // offset: 0x2 ordinal: 0x2
  UCHAR DemotePercentBase;  // offset: 0x3 ordinal: 0x3
  UCHAR AllowScaling;       // offset: 0x4 ordinal: 0x4
} _PROC_IDLE_POLICY;

// 0x4 bytes (sizeof)
typedef struct __anon_220 {
  UCHAR BaseMiddle; // offset: 0x0 ordinal: 0x0
  UCHAR Flags1;     // offset: 0x1 ordinal: 0x1
  UCHAR Flags2;     // offset: 0x2 ordinal: 0x2
  UCHAR BaseHigh;   // offset: 0x3 ordinal: 0x3
} __anon_220;

// 0x6 bytes (sizeof)
typedef struct _SID_IDENTIFIER_AUTHORITY {
  UCHAR Value[6]; // offset: 0x0 ordinal: 0x0
} _SID_IDENTIFIER_AUTHORITY;

// 0x20 bytes (sizeof)
typedef struct _RTL_BALANCED_LINKS {
  struct _RTL_BALANCED_LINKS *Parent;     // offset: 0x0 ordinal: 0x0
  struct _RTL_BALANCED_LINKS *LeftChild;  // offset: 0x8 ordinal: 0x1
  struct _RTL_BALANCED_LINKS *RightChild; // offset: 0x10 ordinal: 0x2
  CHAR Balance;                           // offset: 0x18 ordinal: 0x3
  UCHAR Reserved[3];                      // offset: 0x19 ordinal: 0x4
} _RTL_BALANCED_LINKS;

// 0x28 bytes (sizeof)
typedef struct _KTMOBJECT_NAMESPACE_LINK {
  struct _RTL_BALANCED_LINKS Links; // offset: 0x0 ordinal: 0x0
  UCHAR Expired;                    // offset: 0x20 ordinal: 0x1
} _KTMOBJECT_NAMESPACE_LINK;

// 0x10 bytes (sizeof)
typedef struct __anon_665 {
  UCHAR InPath;                              // offset: 0x0 ordinal: 0x0
  UCHAR Reserved[3];                         // offset: 0x1 ordinal: 0x1
  enum _DEVICE_USAGE_NOTIFICATION_TYPE Type; // offset: 0x8 ordinal: 0x2
} __anon_665;

typedef enum _NT_PRODUCT_TYPE {
  NtProductWinNt = 1,    // ordinal: 0x0
  NtProductLanManNt = 2, // ordinal: 0x1
  NtProductServer = 3,   // ordinal: 0x2
} _NT_PRODUCT_TYPE;

// 0x28 bytes (sizeof)
typedef struct _MI_QUEUED_DEADSTACK_WORKITEM {
  struct _WORK_QUEUE_ITEM WorkItem; // offset: 0x0 ordinal: 0x0
  LONG Active;                      // offset: 0x20 ordinal: 0x1
} _MI_QUEUED_DEADSTACK_WORKITEM;

// 0x10 bytes (sizeof)
typedef struct _MI_COMBINE_PAGE_LISTHEAD {
  struct _RTL_AVL_TREE Table; // offset: 0x0 ordinal: 0x0
  LONG Lock;                  // offset: 0x8 ordinal: 0x1
} _MI_COMBINE_PAGE_LISTHEAD;

// 0x8088 bytes (sizeof)
typedef struct _STACK_TABLE {
  USHORT NumStackTraces;                    // offset: 0x0 ordinal: 0x0
  USHORT TraceCapacity;                     // offset: 0x2 ordinal: 0x1
  struct _OBJECT_REF_TRACE *StackTrace[16]; // offset: 0x8 ordinal: 0x2
  USHORT StackTableHash[16381];             // offset: 0x88 ordinal: 0x3
} _STACK_TABLE;

// 0x4 bytes (sizeof)
typedef struct _HEAP_FREE_ENTRY_EXTRA {
  USHORT TagIndex;           // offset: 0x0 ordinal: 0x0
  USHORT FreeBackTraceIndex; // offset: 0x2 ordinal: 0x1
} _HEAP_FREE_ENTRY_EXTRA;

// 0x2 bytes (sizeof)
typedef union __anon_2288 {
  USHORT AsUSHORT;         // offset: 0x0 ordinal: 0x0
  USHORT AllowScaling : 1; // offset: 0x0 ordinal: 0x1
  USHORT Disabled : 1;     // offset: 0x0 ordinal: 0x2
  USHORT Reserved : 14;    // offset: 0x0 ordinal: 0x3
} __anon_2288;

// 0x2 bytes (sizeof)
typedef union __anon_2124 {
  USHORT SignatureLevel : 4; // offset: 0x0 ordinal: 0x0
  USHORT SignatureType : 3;  // offset: 0x0 ordinal: 0x1
  USHORT Unused : 9;         // offset: 0x0 ordinal: 0x2
  USHORT EntireField;        // offset: 0x0 ordinal: 0x3
} __anon_2124;

// 0x2 bytes (sizeof)
typedef union _WHEA_NOTIFICATION_FLAGS {
  USHORT PollIntervalRW : 1;             // offset: 0x0 ordinal: 0x0
  USHORT SwitchToPollingThresholdRW : 1; // offset: 0x0 ordinal: 0x1
  USHORT SwitchToPollingWindowRW : 1;    // offset: 0x0 ordinal: 0x2
  USHORT ErrorThresholdRW : 1;           // offset: 0x0 ordinal: 0x3
  USHORT ErrorThresholdWindowRW : 1;     // offset: 0x0 ordinal: 0x4
  USHORT Reserved : 11;                  // offset: 0x0 ordinal: 0x5
  USHORT AsUSHORT;                       // offset: 0x0 ordinal: 0x6
} _WHEA_NOTIFICATION_FLAGS;

// 0x2 bytes (sizeof)
typedef union _AER_BRIDGE_DESCRIPTOR_FLAGS {
  USHORT UncorrectableErrorMaskRW : 1;          // offset: 0x0 ordinal: 0x0
  USHORT UncorrectableErrorSeverityRW : 1;      // offset: 0x0 ordinal: 0x1
  USHORT CorrectableErrorMaskRW : 1;            // offset: 0x0 ordinal: 0x2
  USHORT AdvancedCapsAndControlRW : 1;          // offset: 0x0 ordinal: 0x3
  USHORT SecondaryUncorrectableErrorMaskRW : 1; // offset: 0x0 ordinal: 0x4
  USHORT SecondaryUncorrectableErrorSevRW : 1;  // offset: 0x0 ordinal: 0x5
  USHORT SecondaryCapsAndControlRW : 1;         // offset: 0x0 ordinal: 0x6
  USHORT Reserved : 9;                          // offset: 0x0 ordinal: 0x7
  USHORT AsUSHORT;                              // offset: 0x0 ordinal: 0x8
} _AER_BRIDGE_DESCRIPTOR_FLAGS;

// 0x2 bytes (sizeof)
typedef union _AER_ENDPOINT_DESCRIPTOR_FLAGS {
  USHORT UncorrectableErrorMaskRW : 1;     // offset: 0x0 ordinal: 0x0
  USHORT UncorrectableErrorSeverityRW : 1; // offset: 0x0 ordinal: 0x1
  USHORT CorrectableErrorMaskRW : 1;       // offset: 0x0 ordinal: 0x2
  USHORT AdvancedCapsAndControlRW : 1;     // offset: 0x0 ordinal: 0x3
  USHORT Reserved : 12;                    // offset: 0x0 ordinal: 0x4
  USHORT AsUSHORT;                         // offset: 0x0 ordinal: 0x5
} _AER_ENDPOINT_DESCRIPTOR_FLAGS;

// 0x2 bytes (sizeof)
typedef union _AER_ROOTPORT_DESCRIPTOR_FLAGS {
  USHORT UncorrectableErrorMaskRW : 1;     // offset: 0x0 ordinal: 0x0
  USHORT UncorrectableErrorSeverityRW : 1; // offset: 0x0 ordinal: 0x1
  USHORT CorrectableErrorMaskRW : 1;       // offset: 0x0 ordinal: 0x2
  USHORT AdvancedCapsAndControlRW : 1;     // offset: 0x0 ordinal: 0x3
  USHORT RootErrorCommandRW : 1;           // offset: 0x0 ordinal: 0x4
  USHORT Reserved : 11;                    // offset: 0x0 ordinal: 0x5
  USHORT AsUSHORT;                         // offset: 0x0 ordinal: 0x6
} _AER_ROOTPORT_DESCRIPTOR_FLAGS;

// 0x4 bytes (sizeof)
typedef struct _WHEA_IPF_CPE_DESCRIPTOR {
  USHORT Type;    // offset: 0x0 ordinal: 0x0
  UCHAR Enabled;  // offset: 0x2 ordinal: 0x1
  UCHAR Reserved; // offset: 0x3 ordinal: 0x2
} _WHEA_IPF_CPE_DESCRIPTOR;

// 0x4 bytes (sizeof)
typedef struct _WHEA_IPF_CMC_DESCRIPTOR {
  USHORT Type;    // offset: 0x0 ordinal: 0x0
  UCHAR Enabled;  // offset: 0x2 ordinal: 0x1
  UCHAR Reserved; // offset: 0x3 ordinal: 0x2
} _WHEA_IPF_CMC_DESCRIPTOR;

// 0x4 bytes (sizeof)
typedef struct _WHEA_IPF_MCA_DESCRIPTOR {
  USHORT Type;    // offset: 0x0 ordinal: 0x0
  UCHAR Enabled;  // offset: 0x2 ordinal: 0x1
  UCHAR Reserved; // offset: 0x3 ordinal: 0x2
} _WHEA_IPF_MCA_DESCRIPTOR;

// 0x3 bytes (sizeof)
typedef struct _WHEA_XPF_NMI_DESCRIPTOR {
  USHORT Type;   // offset: 0x0 ordinal: 0x0
  UCHAR Enabled; // offset: 0x2 ordinal: 0x1
} _WHEA_XPF_NMI_DESCRIPTOR;

// 0x20 bytes (sizeof)
typedef struct _OBJECT_HEADER_CREATOR_INFO {
  struct _LIST_ENTRY TypeList;  // offset: 0x0 ordinal: 0x0
  VOID *CreatorUniqueProcess;   // offset: 0x10 ordinal: 0x1
  USHORT CreatorBackTraceIndex; // offset: 0x18 ordinal: 0x2
  USHORT Reserved;              // offset: 0x1a ordinal: 0x3
} _OBJECT_HEADER_CREATOR_INFO;

// 0x8 bytes (sizeof)
typedef struct _ACL {
  UCHAR AclRevision; // offset: 0x0 ordinal: 0x0
  UCHAR Sbz1;        // offset: 0x1 ordinal: 0x1
  USHORT AclSize;    // offset: 0x2 ordinal: 0x2
  USHORT AceCount;   // offset: 0x4 ordinal: 0x3
  USHORT Sbz2;       // offset: 0x6 ordinal: 0x4
} _ACL;

// 0x28 bytes (sizeof)
typedef struct _SECURITY_DESCRIPTOR {
  UCHAR Revision;    // offset: 0x0 ordinal: 0x0
  UCHAR Sbz1;        // offset: 0x1 ordinal: 0x1
  USHORT Control;    // offset: 0x2 ordinal: 0x2
  VOID *Owner;       // offset: 0x8 ordinal: 0x3
  VOID *Group;       // offset: 0x10 ordinal: 0x4
  struct _ACL *Sacl; // offset: 0x18 ordinal: 0x5
  struct _ACL *Dacl; // offset: 0x20 ordinal: 0x6
} _SECURITY_DESCRIPTOR;

// 0x10 bytes (sizeof)
typedef struct _ETW_SYSTEMTIME {
  USHORT Year;         // offset: 0x0 ordinal: 0x0
  USHORT Month;        // offset: 0x2 ordinal: 0x1
  USHORT DayOfWeek;    // offset: 0x4 ordinal: 0x2
  USHORT Day;          // offset: 0x6 ordinal: 0x3
  USHORT Hour;         // offset: 0x8 ordinal: 0x4
  USHORT Minute;       // offset: 0xa ordinal: 0x5
  USHORT Second;       // offset: 0xc ordinal: 0x6
  USHORT Milliseconds; // offset: 0xe ordinal: 0x7
} _ETW_SYSTEMTIME;

// 0x10 bytes (sizeof)
typedef struct _IO_IRP_EXT_TRACK_OFFSET_HEADER {
  USHORT Validation; // offset: 0x0 ordinal: 0x0
  USHORT Flags;      // offset: 0x2 ordinal: 0x1
  VOID(*TrackedOffsetCallback)
  (struct _IO_IRP_EXT_TRACK_OFFSET_HEADER *,
   struct _IO_IRP_EXT_TRACK_OFFSET_HEADER *,
   LONGLONG); // offset: 0x8 ordinal: 0x2
} _IO_IRP_EXT_TRACK_OFFSET_HEADER;

typedef VOID (*__anon_1610)(struct _IO_IRP_EXT_TRACK_OFFSET_HEADER *,
                            struct _IO_IRP_EXT_TRACK_OFFSET_HEADER *, LONGLONG);

// 0x8 bytes (sizeof)
typedef struct _PCW_COUNTER_DESCRIPTOR {
  USHORT Id;          // offset: 0x0 ordinal: 0x0
  USHORT StructIndex; // offset: 0x2 ordinal: 0x1
  USHORT Offset;      // offset: 0x4 ordinal: 0x2
  USHORT Size;        // offset: 0x6 ordinal: 0x3
} _PCW_COUNTER_DESCRIPTOR;

// 0x2 bytes (sizeof)
typedef union _WHEA_REVISION {
  UCHAR MinorRevision; // offset: 0x0 ordinal: 0x0
  UCHAR MajorRevision; // offset: 0x1 ordinal: 0x1
  USHORT AsUSHORT;     // offset: 0x0 ordinal: 0x2
} _WHEA_REVISION;

// 0x4 bytes (sizeof)
typedef struct _ETW_BUFFER_CONTEXT {
  UCHAR ProcessorNumber; // offset: 0x0 ordinal: 0x0
  UCHAR Alignment;       // offset: 0x1 ordinal: 0x1
  USHORT ProcessorIndex; // offset: 0x0 ordinal: 0x2
  USHORT LoggerId;       // offset: 0x2 ordinal: 0x3
} _ETW_BUFFER_CONTEXT;

// 0x10 bytes (sizeof)
typedef struct _TXN_PARAMETER_BLOCK {
  USHORT Length;           // offset: 0x0 ordinal: 0x0
  USHORT TxFsContext;      // offset: 0x2 ordinal: 0x1
  VOID *TransactionObject; // offset: 0x8 ordinal: 0x2
} _TXN_PARAMETER_BLOCK;

// 0x4 bytes (sizeof)
typedef struct __anon_915 {
  USHORT ReferenceCount; // offset: 0x0 ordinal: 0x0
  union {
    USHORT ShortFlags;         // offset: 0x2 ordinal: 0x1
    USHORT VolatileShortFlags; // offset: 0x2 ordinal: 0x2
  };
} __anon_915;

// 0x4 bytes (sizeof)
typedef union __anon_909 {
  USHORT ReferenceCount; // offset: 0x0 ordinal: 0x0
  struct _MMPFNENTRY e1; // offset: 0x2 ordinal: 0x1
  struct __anon_915 e2;  // offset: 0x0 ordinal: 0x2
} __anon_909;

// 0x4 bytes (sizeof)
typedef struct _SEGMENT_FLAGS {
  USHORT TotalNumberOfPtes4132 : 10; // offset: 0x0 ordinal: 0x0
  USHORT Spare0 : 2;                 // offset: 0x0 ordinal: 0x1
  USHORT LargePages : 1;             // offset: 0x0 ordinal: 0x2
  USHORT DebugSymbolsLoaded : 1;     // offset: 0x0 ordinal: 0x3
  USHORT WriteCombined : 1;          // offset: 0x0 ordinal: 0x4
  USHORT NoCache : 1;                // offset: 0x0 ordinal: 0x5
  USHORT Short0;                     // offset: 0x0 ordinal: 0x6
  UCHAR FloppyMedia : 1;             // offset: 0x2 ordinal: 0x7
  UCHAR DefaultProtectionMask : 5;   // offset: 0x2 ordinal: 0x8
  UCHAR Binary32 : 1;                // offset: 0x2 ordinal: 0x9
  UCHAR ContainsDebug : 1;           // offset: 0x2 ordinal: 0xa
  UCHAR UChar1;                      // offset: 0x2 ordinal: 0xb
  UCHAR ForceCollision : 1;          // offset: 0x3 ordinal: 0xc
  UCHAR ImageSigningType : 3;        // offset: 0x3 ordinal: 0xd
  UCHAR ImageSigningLevel : 4;       // offset: 0x3 ordinal: 0xe
  UCHAR UChar2;                      // offset: 0x3 ordinal: 0xf
} _SEGMENT_FLAGS;

// 0x4 bytes (sizeof)
typedef struct _MMSUBSECTION_FLAGS {
  USHORT SubsectionAccessed : 1;  // offset: 0x0 ordinal: 0x0
  USHORT Protection : 5;          // offset: 0x0 ordinal: 0x1
  USHORT StartingSector4132 : 10; // offset: 0x0 ordinal: 0x2
  USHORT SubsectionStatic : 1;    // offset: 0x2 ordinal: 0x3
  USHORT GlobalMemory : 1;        // offset: 0x2 ordinal: 0x4
  USHORT DirtyPages : 1;          // offset: 0x2 ordinal: 0x5
  USHORT OnDereferenceList : 1;   // offset: 0x2 ordinal: 0x6
  USHORT SectorEndOffset : 12;    // offset: 0x2 ordinal: 0x7
} _MMSUBSECTION_FLAGS;

// 0x20 bytes (sizeof)
typedef struct _INTERFACE {
  USHORT Size;                          // offset: 0x0 ordinal: 0x0
  USHORT Version;                       // offset: 0x2 ordinal: 0x1
  VOID *Context;                        // offset: 0x8 ordinal: 0x2
  VOID (*InterfaceReference)(VOID *);   // offset: 0x10 ordinal: 0x3
  VOID (*InterfaceDereference)(VOID *); // offset: 0x18 ordinal: 0x4
} _INTERFACE;

// 0x8 bytes (sizeof)
typedef struct _PROC_PERF_HISTORY_ENTRY {
  USHORT Utility;            // offset: 0x0 ordinal: 0x0
  USHORT AffinitizedUtility; // offset: 0x2 ordinal: 0x1
  UCHAR Frequency;           // offset: 0x4 ordinal: 0x2
  UCHAR TaggedPercent[2];    // offset: 0x5 ordinal: 0x3
} _PROC_PERF_HISTORY_ENTRY;

// 0x10 bytes (sizeof)
typedef struct _KDESCRIPTOR {
  USHORT Pad[3]; // offset: 0x0 ordinal: 0x0
  USHORT Limit;  // offset: 0x6 ordinal: 0x1
  VOID *Base;    // offset: 0x8 ordinal: 0x2
} _KDESCRIPTOR;

// 0x28 bytes (sizeof)
typedef struct _ETW_PMC_SUPPORT {
  enum _KPROFILE_SOURCE Source[4];            // offset: 0x0 ordinal: 0x0
  ULONG HookIdCount;                          // offset: 0x10 ordinal: 0x1
  USHORT HookId[4];                           // offset: 0x14 ordinal: 0x2
  ULONG CountersCount;                        // offset: 0x1c ordinal: 0x3
  struct _HAL_PMC_COUNTERS *ProcessorCtrs[1]; // offset: 0x20 ordinal: 0x4
} _ETW_PMC_SUPPORT;

// 0x10 bytes (sizeof)
typedef struct _STRING {
  USHORT Length;        // offset: 0x0 ordinal: 0x0
  USHORT MaximumLength; // offset: 0x2 ordinal: 0x1
  CHAR *Buffer;         // offset: 0x8 ordinal: 0x2
} _STRING;

// 0x10 bytes (sizeof)
typedef struct _ETW_FILTER_STRING_TOKEN_ELEMENT {
  USHORT Length;  // offset: 0x0 ordinal: 0x0
  USHORT *String; // offset: 0x8 ordinal: 0x1
} _ETW_FILTER_STRING_TOKEN_ELEMENT;

// 0x18 bytes (sizeof)
typedef struct _ETW_FILTER_STRING_TOKEN {
  USHORT Count;                                      // offset: 0x0 ordinal: 0x0
  struct _ETW_FILTER_STRING_TOKEN_ELEMENT Tokens[1]; // offset: 0x8 ordinal: 0x1
} _ETW_FILTER_STRING_TOKEN;

typedef VOID (*__anon_1441)(VOID *, USHORT *);

// 0x20 bytes (sizeof)
typedef struct __anon_1227 {
  enum PROFILE_STATUS DockStatus; // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY ListEntry;   // offset: 0x8 ordinal: 0x1
  USHORT *SerialNumber;           // offset: 0x18 ordinal: 0x2
} __anon_1227;

// 0x10 bytes (sizeof)
typedef struct _UNICODE_STRING {
  USHORT Length;        // offset: 0x0 ordinal: 0x0
  USHORT MaximumLength; // offset: 0x2 ordinal: 0x1
  USHORT *Buffer;       // offset: 0x8 ordinal: 0x2
} _UNICODE_STRING;

// 0x4 bytes (sizeof)
typedef struct _PROCESSOR_NUMBER {
  USHORT Group;   // offset: 0x0 ordinal: 0x0
  UCHAR Number;   // offset: 0x2 ordinal: 0x1
  UCHAR Reserved; // offset: 0x3 ordinal: 0x2
} _PROCESSOR_NUMBER;

// 0x20 bytes (sizeof)
typedef struct _RELATIVE_SYMLINK_INFO {
  USHORT ExposedNamespaceLength;                     // offset: 0x0 ordinal: 0x0
  USHORT Flags;                                      // offset: 0x2 ordinal: 0x1
  USHORT DeviceNameLength;                           // offset: 0x4 ordinal: 0x2
  USHORT Reserved;                                   // offset: 0x6 ordinal: 0x3
  struct _RELATIVE_SYMLINK_INFO *InteriorMountPoint; // offset: 0x8 ordinal: 0x4
  struct _UNICODE_STRING OpenedName; // offset: 0x10 ordinal: 0x5
} _RELATIVE_SYMLINK_INFO;

// 0x10 bytes (sizeof)
typedef struct _OBJECT_NAME_INFORMATION {
  struct _UNICODE_STRING Name; // offset: 0x0 ordinal: 0x0
} _OBJECT_NAME_INFORMATION;

// 0x8 bytes (sizeof)
typedef struct _SE_AUDIT_PROCESS_CREATION_INFO {
  struct _OBJECT_NAME_INFORMATION *ImageFileName; // offset: 0x0 ordinal: 0x0
} _SE_AUDIT_PROCESS_CREATION_INFO;

// 0x18 bytes (sizeof)
typedef struct _CURDIR {
  struct _UNICODE_STRING DosPath; // offset: 0x0 ordinal: 0x0
  VOID *Handle;                   // offset: 0x10 ordinal: 0x1
} _CURDIR;

// 0x8 bytes (sizeof)
typedef struct _ISR_THUNK {
  UCHAR PushImm;  // offset: 0x0 ordinal: 0x0
  UCHAR Vector;   // offset: 0x1 ordinal: 0x1
  UCHAR PushRbp;  // offset: 0x2 ordinal: 0x2
  UCHAR JmpOp;    // offset: 0x3 ordinal: 0x3
  LONG JmpOffset; // offset: 0x4 ordinal: 0x4
} _ISR_THUNK;

// 0x8 bytes (sizeof)
typedef struct _UNEXPECTED_INTERRUPT {
  UCHAR PushImm;  // offset: 0x0 ordinal: 0x0
  UCHAR Vector;   // offset: 0x1 ordinal: 0x1
  UCHAR PushRbp;  // offset: 0x2 ordinal: 0x2
  UCHAR JmpOp;    // offset: 0x3 ordinal: 0x3
  LONG JmpOffset; // offset: 0x4 ordinal: 0x4
} _UNEXPECTED_INTERRUPT;

// 0x20 bytes (sizeof)
typedef struct _OBJECT_HEADER_NAME_INFO {
  struct _OBJECT_DIRECTORY *Directory; // offset: 0x0 ordinal: 0x0
  struct _UNICODE_STRING Name;         // offset: 0x8 ordinal: 0x1
  LONG ReferenceCount;                 // offset: 0x18 ordinal: 0x2
} _OBJECT_HEADER_NAME_INFO;

// 0xac bytes (sizeof)
typedef struct _RTL_TIME_ZONE_INFORMATION {
  LONG Bias;                         // offset: 0x0 ordinal: 0x0
  WCHAR StandardName[32];            // offset: 0x4 ordinal: 0x1
  struct _TIME_FIELDS StandardStart; // offset: 0x44 ordinal: 0x2
  LONG StandardBias;                 // offset: 0x54 ordinal: 0x3
  WCHAR DaylightName[32];            // offset: 0x58 ordinal: 0x4
  struct _TIME_FIELDS DaylightStart; // offset: 0x98 ordinal: 0x5
  LONG DaylightBias;                 // offset: 0xa8 ordinal: 0x6
} _RTL_TIME_ZONE_INFORMATION;

typedef LONG (*__anon_1519)(VOID *);

// 0x8 bytes (sizeof)
typedef struct _VACB_LEVEL_REFERENCE {
  LONG Reference;        // offset: 0x0 ordinal: 0x0
  LONG SpecialReference; // offset: 0x4 ordinal: 0x1
} _VACB_LEVEL_REFERENCE;

// 0x4 bytes (sizeof)
typedef struct _DBGKD_CONTINUE {
  LONG ContinueStatus; // offset: 0x0 ordinal: 0x0
} _DBGKD_CONTINUE;

// 0x18 bytes (sizeof)
typedef struct _ETW_PERF_COUNTERS {
  LONG TotalActiveSessions;           // offset: 0x0 ordinal: 0x0
  LONG TotalBufferMemoryNonPagedPool; // offset: 0x4 ordinal: 0x1
  LONG TotalBufferMemoryPagedPool;    // offset: 0x8 ordinal: 0x2
  LONG TotalGuidsEnabled;             // offset: 0xc ordinal: 0x3
  LONG TotalGuidsNotEnabled;          // offset: 0x10 ordinal: 0x4
  LONG TotalGuidsPreEnabled;          // offset: 0x14 ordinal: 0x5
} _ETW_PERF_COUNTERS;

// 0x228 bytes (sizeof)
typedef struct _MI_REBUILD_LARGE_PAGES {
  LONG Active; // offset: 0x0 ordinal: 0x0
  struct _MI_REBUILD_LARGE_PAGE_COUNTDOWN Timer[64]
                                               [4]; // offset: 0x4 ordinal: 0x1
  struct _WORK_QUEUE_ITEM WorkItem; // offset: 0x208 ordinal: 0x2
} _MI_REBUILD_LARGE_PAGES;

// 0x38 bytes (sizeof)
typedef struct _MI_LDW_WORK_CONTEXT {
  struct _WORK_QUEUE_ITEM WorkItem; // offset: 0x0 ordinal: 0x0
  struct _FILE_OBJECT *FileObject;  // offset: 0x20 ordinal: 0x1
  LONG ErrorStatus;                 // offset: 0x28 ordinal: 0x2
  LONG Active;                      // offset: 0x2c ordinal: 0x3
  UCHAR FreeWhenDone;               // offset: 0x30 ordinal: 0x4
} _MI_LDW_WORK_CONTEXT;

// 0x4 bytes (sizeof)
typedef union __anon_949 {
  LONG FlushCompleting : 1;  // offset: 0x0 ordinal: 0x0
  LONG FlushInProgress : 31; // offset: 0x0 ordinal: 0x1
  LONG Long;                 // offset: 0x0 ordinal: 0x2
} __anon_949;

typedef LONG (*__anon_581)(struct _FILE_OBJECT *, struct _DEVICE_OBJECT *);

// 0x8 bytes (sizeof)
typedef union __anon_504 {
  struct _IRP *MasterIrp; // offset: 0x0 ordinal: 0x0
  LONG IrpCount;          // offset: 0x0 ordinal: 0x1
  VOID *SystemBuffer;     // offset: 0x0 ordinal: 0x2
} __anon_504;

// 0x18 bytes (sizeof)
typedef struct _DISPATCHER_HEADER {
  union {
    LONG Lock;   // offset: 0x0 ordinal: 0x0
    LONG LockNV; // offset: 0x0 ordinal: 0x1
    UCHAR Type;  // offset: 0x0 ordinal: 0x2
  };
  UCHAR Signalling; // offset: 0x1 ordinal: 0x3
  UCHAR Size;       // offset: 0x2 ordinal: 0x4
  UCHAR Reserved1;  // offset: 0x3 ordinal: 0x5
  UCHAR TimerType;  // offset: 0x0 ordinal: 0x6
  union {
    UCHAR TimerControlFlags; // offset: 0x1 ordinal: 0x7
    UCHAR Absolute : 1;      // offset: 0x1 ordinal: 0x8
  };
  UCHAR Wake : 1;                  // offset: 0x1 ordinal: 0x9
  UCHAR EncodedTolerableDelay : 6; // offset: 0x1 ordinal: 0xa
  UCHAR Hand;                      // offset: 0x2 ordinal: 0xb
  union {
    UCHAR TimerMiscFlags; // offset: 0x3 ordinal: 0xc
    UCHAR Index : 6;      // offset: 0x3 ordinal: 0xd
  };
  UCHAR Inserted : 1; // offset: 0x3 ordinal: 0xe
  UCHAR Expired : 1;  // offset: 0x3 ordinal: 0xf
  UCHAR Timer2Type;   // offset: 0x0 ordinal: 0x10
  union {
    UCHAR Timer2Flags;        // offset: 0x1 ordinal: 0x11
    UCHAR Timer2Inserted : 1; // offset: 0x1 ordinal: 0x12
  };
  UCHAR Timer2Expiring : 1;      // offset: 0x1 ordinal: 0x13
  UCHAR Timer2CancelPending : 1; // offset: 0x1 ordinal: 0x14
  UCHAR Timer2SetPending : 1;    // offset: 0x1 ordinal: 0x15
  UCHAR Timer2Running : 1;       // offset: 0x1 ordinal: 0x16
  UCHAR Timer2Disabled : 1;      // offset: 0x1 ordinal: 0x17
  UCHAR Timer2ReservedFlags : 2; // offset: 0x1 ordinal: 0x18
  UCHAR Timer2Reserved1;         // offset: 0x2 ordinal: 0x19
  UCHAR Timer2Reserved2;         // offset: 0x3 ordinal: 0x1a
  UCHAR QueueType;               // offset: 0x0 ordinal: 0x1b
  union {
    UCHAR QueueControlFlags; // offset: 0x1 ordinal: 0x1c
    UCHAR Abandoned : 1;     // offset: 0x1 ordinal: 0x1d
  };
  UCHAR DisableIncrement : 1;          // offset: 0x1 ordinal: 0x1e
  UCHAR QueueReservedControlFlags : 6; // offset: 0x1 ordinal: 0x1f
  UCHAR QueueSize;                     // offset: 0x2 ordinal: 0x20
  UCHAR QueueReserved;                 // offset: 0x3 ordinal: 0x21
  UCHAR ThreadType;                    // offset: 0x0 ordinal: 0x22
  UCHAR ThreadReserved;                // offset: 0x1 ordinal: 0x23
  union {
    UCHAR ThreadControlFlags; // offset: 0x2 ordinal: 0x24
    UCHAR CycleProfiling : 1; // offset: 0x2 ordinal: 0x25
  };
  UCHAR CounterProfiling : 1;           // offset: 0x2 ordinal: 0x26
  UCHAR GroupScheduling : 1;            // offset: 0x2 ordinal: 0x27
  UCHAR AffinitySet : 1;                // offset: 0x2 ordinal: 0x28
  UCHAR Tagged : 1;                     // offset: 0x2 ordinal: 0x29
  UCHAR EnergyProfiling : 1;            // offset: 0x2 ordinal: 0x2a
  UCHAR ThreadReservedControlFlags : 2; // offset: 0x2 ordinal: 0x2b
  union {
    UCHAR DebugActive;   // offset: 0x3 ordinal: 0x2c
    UCHAR ActiveDR7 : 1; // offset: 0x3 ordinal: 0x2d
  };
  UCHAR Instrumented : 1;          // offset: 0x3 ordinal: 0x2e
  UCHAR Minimal : 1;               // offset: 0x3 ordinal: 0x2f
  UCHAR Reserved4 : 3;             // offset: 0x3 ordinal: 0x30
  UCHAR UmsScheduled : 1;          // offset: 0x3 ordinal: 0x31
  UCHAR UmsPrimary : 1;            // offset: 0x3 ordinal: 0x32
  UCHAR MutantType;                // offset: 0x0 ordinal: 0x33
  UCHAR MutantSize;                // offset: 0x1 ordinal: 0x34
  UCHAR DpcActive;                 // offset: 0x2 ordinal: 0x35
  UCHAR MutantReserved;            // offset: 0x3 ordinal: 0x36
  LONG SignalState;                // offset: 0x4 ordinal: 0x37
  struct _LIST_ENTRY WaitListHead; // offset: 0x8 ordinal: 0x38
} _DISPATCHER_HEADER;

// 0x38 bytes (sizeof)
typedef struct _KMUTANT {
  struct _DISPATCHER_HEADER Header;   // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY MutantListEntry; // offset: 0x18 ordinal: 0x1
  struct _KTHREAD *OwnerThread;       // offset: 0x28 ordinal: 0x2
  UCHAR Abandoned;                    // offset: 0x30 ordinal: 0x3
  UCHAR ApcDisable;                   // offset: 0x31 ordinal: 0x4
} _KMUTANT;

// 0x20 bytes (sizeof)
typedef struct _KSEMAPHORE {
  struct _DISPATCHER_HEADER Header; // offset: 0x0 ordinal: 0x0
  LONG Limit;                       // offset: 0x18 ordinal: 0x1
} _KSEMAPHORE;

// 0x28 bytes (sizeof)
typedef struct _LPCP_NONPAGED_PORT_QUEUE {
  struct _KSEMAPHORE Semaphore;          // offset: 0x0 ordinal: 0x0
  struct _LPCP_PORT_OBJECT *BackPointer; // offset: 0x20 ordinal: 0x1
} _LPCP_NONPAGED_PORT_QUEUE;

// 0x20 bytes (sizeof)
typedef struct _LPCP_PORT_QUEUE {
  struct _LPCP_NONPAGED_PORT_QUEUE
      *NonPagedPortQueue;         // offset: 0x0 ordinal: 0x0
  struct _KSEMAPHORE *Semaphore;  // offset: 0x8 ordinal: 0x1
  struct _LIST_ENTRY ReceiveHead; // offset: 0x10 ordinal: 0x2
} _LPCP_PORT_QUEUE;

// 0x30 bytes (sizeof)
typedef struct _MMDEREFERENCE_SEGMENT_HEADER {
  struct _KSEMAPHORE Semaphore; // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY ListHead;  // offset: 0x20 ordinal: 0x1
} _MMDEREFERENCE_SEGMENT_HEADER;

// 0x18 bytes (sizeof)
typedef struct _KEVENT {
  struct _DISPATCHER_HEADER Header; // offset: 0x0 ordinal: 0x0
} _KEVENT;

// 0x38 bytes (sizeof)
typedef struct _MI_RESUME_WORKITEM {
  struct _KEVENT ResumeCompleteEvent; // offset: 0x0 ordinal: 0x0
  struct _WORK_QUEUE_ITEM WorkItem;   // offset: 0x18 ordinal: 0x1
} _MI_RESUME_WORKITEM;

// 0x28 bytes (sizeof)
typedef struct _HIVE_WAIT_PACKET {
  struct _KEVENT WakeEvent;       // offset: 0x0 ordinal: 0x0
  LONG Status;                    // offset: 0x18 ordinal: 0x1
  struct _HIVE_WAIT_PACKET *Next; // offset: 0x20 ordinal: 0x2
} _HIVE_WAIT_PACKET;

// 0x20 bytes (sizeof)
typedef struct _PALPC_PORT_REFERENCE_WAIT_BLOCK {
  struct _KEVENT DesiredReferenceNoEvent; // offset: 0x0 ordinal: 0x0
  LONG DesiredReferenceNo;                // offset: 0x18 ordinal: 0x1
} _PALPC_PORT_REFERENCE_WAIT_BLOCK;

// 0x20 bytes (sizeof)
typedef struct _CACHE_UNINITIALIZE_EVENT {
  struct _CACHE_UNINITIALIZE_EVENT *Next; // offset: 0x0 ordinal: 0x0
  struct _KEVENT Event;                   // offset: 0x8 ordinal: 0x1
} _CACHE_UNINITIALIZE_EVENT;

// 0x20 bytes (sizeof)
typedef struct _IO_REMOVE_LOCK_COMMON_BLOCK {
  UCHAR Removed;              // offset: 0x0 ordinal: 0x0
  UCHAR Reserved[3];          // offset: 0x1 ordinal: 0x1
  LONG IoCount;               // offset: 0x4 ordinal: 0x2
  struct _KEVENT RemoveEvent; // offset: 0x8 ordinal: 0x3
} _IO_REMOVE_LOCK_COMMON_BLOCK;

// 0x20 bytes (sizeof)
typedef struct _IO_REMOVE_LOCK {
  struct _IO_REMOVE_LOCK_COMMON_BLOCK Common; // offset: 0x0 ordinal: 0x0
} _IO_REMOVE_LOCK;

// 0x8 bytes (sizeof)
typedef struct __anon_1468 {
  struct _KEVENT *Event; // offset: 0x0 ordinal: 0x0
} __anon_1468;

// 0x18 bytes (sizeof)
typedef struct _KGATE {
  struct _DISPATCHER_HEADER Header; // offset: 0x0 ordinal: 0x0
} _KGATE;

// 0x28 bytes (sizeof)
typedef struct _MMMOD_WRITER_LISTHEAD {
  struct _LIST_ENTRY ListHead; // offset: 0x0 ordinal: 0x0
  union {
    struct _KGATE Gate;   // offset: 0x10 ordinal: 0x1
    struct _KEVENT Event; // offset: 0x10 ordinal: 0x2
  };
} _MMMOD_WRITER_LISTHEAD;

// 0x20 bytes (sizeof)
typedef struct _MI_FILE_EXTENTS_WAIT_BLOCK {
  struct _MI_FILE_EXTENTS_WAIT_BLOCK *Next; // offset: 0x0 ordinal: 0x0
  struct _KGATE Gate;                       // offset: 0x8 ordinal: 0x1
} _MI_FILE_EXTENTS_WAIT_BLOCK;

// 0x40 bytes (sizeof)
typedef struct _IMAGE_DOS_HEADER {
  USHORT e_magic;    // offset: 0x0 ordinal: 0x0
  USHORT e_cblp;     // offset: 0x2 ordinal: 0x1
  USHORT e_cp;       // offset: 0x4 ordinal: 0x2
  USHORT e_crlc;     // offset: 0x6 ordinal: 0x3
  USHORT e_cparhdr;  // offset: 0x8 ordinal: 0x4
  USHORT e_minalloc; // offset: 0xa ordinal: 0x5
  USHORT e_maxalloc; // offset: 0xc ordinal: 0x6
  USHORT e_ss;       // offset: 0xe ordinal: 0x7
  USHORT e_sp;       // offset: 0x10 ordinal: 0x8
  USHORT e_csum;     // offset: 0x12 ordinal: 0x9
  USHORT e_ip;       // offset: 0x14 ordinal: 0xa
  USHORT e_cs;       // offset: 0x16 ordinal: 0xb
  USHORT e_lfarlc;   // offset: 0x18 ordinal: 0xc
  USHORT e_ovno;     // offset: 0x1a ordinal: 0xd
  USHORT e_res[4];   // offset: 0x1c ordinal: 0xe
  USHORT e_oemid;    // offset: 0x24 ordinal: 0xf
  USHORT e_oeminfo;  // offset: 0x26 ordinal: 0x10
  USHORT e_res2[10]; // offset: 0x28 ordinal: 0x11
  LONG e_lfanew;     // offset: 0x3c ordinal: 0x12
} _IMAGE_DOS_HEADER;

// 0x4 bytes (sizeof)
typedef union _MI_RESERVATION_CLUSTER_INFO {
  ULONG ClusterSize : 10;    // offset: 0x0 ordinal: 0x0
  ULONG SequenceNumber : 22; // offset: 0x0 ordinal: 0x1
  LONG EntireInfo;           // offset: 0x0 ordinal: 0x2
} _MI_RESERVATION_CLUSTER_INFO;

// 0x48 bytes (sizeof)
typedef struct _DEFERRED_WRITE {
  SHORT NodeTypeCode;                    // offset: 0x0 ordinal: 0x0
  SHORT NodeByteSize;                    // offset: 0x2 ordinal: 0x1
  struct _FILE_OBJECT *FileObject;       // offset: 0x8 ordinal: 0x2
  ULONG BytesToWrite;                    // offset: 0x10 ordinal: 0x3
  struct _LIST_ENTRY DeferredWriteLinks; // offset: 0x18 ordinal: 0x4
  struct _KEVENT *Event;                 // offset: 0x28 ordinal: 0x5
  VOID (*PostRoutine)(VOID *, VOID *);   // offset: 0x30 ordinal: 0x6
  VOID *Context1;                        // offset: 0x38 ordinal: 0x7
  VOID *Context2;                        // offset: 0x40 ordinal: 0x8
} _DEFERRED_WRITE;

// 0x10 bytes (sizeof)
typedef struct _VF_TRACKER {
  ULONG TrackerFlags; // offset: 0x0 ordinal: 0x0
  ULONG TrackerSize;  // offset: 0x4 ordinal: 0x1
  ULONG TrackerIndex; // offset: 0x8 ordinal: 0x2
  ULONG TraceDepth;   // offset: 0xc ordinal: 0x3
} _VF_TRACKER;

// 0x8 bytes (sizeof)
typedef struct _CM_INDEX {
  ULONG Cell; // offset: 0x0 ordinal: 0x0
  union {
    UCHAR NameHint[4]; // offset: 0x4 ordinal: 0x1
    ULONG HashKey;     // offset: 0x4 ordinal: 0x2
  };
} _CM_INDEX;

// 0x14 bytes (sizeof)
typedef struct _NB10 {
  ULONG Signature; // offset: 0x0 ordinal: 0x0
  ULONG Offset;    // offset: 0x4 ordinal: 0x1
  ULONG TimeStamp; // offset: 0x8 ordinal: 0x2
  ULONG Age;       // offset: 0xc ordinal: 0x3
  CHAR PdbName[1]; // offset: 0x10 ordinal: 0x4
} _NB10;

// 0x4 bytes (sizeof)
typedef union __anon_2327 {
  ULONG NodeSize;     // offset: 0x0 ordinal: 0x0
  ULONG UseLookaside; // offset: 0x0 ordinal: 0x1
} __anon_2327;

// 0x10 bytes (sizeof)
typedef struct _LDR_SERVICE_TAG_RECORD {
  struct _LDR_SERVICE_TAG_RECORD *Next; // offset: 0x0 ordinal: 0x0
  ULONG ServiceTag;                     // offset: 0x8 ordinal: 0x1
} _LDR_SERVICE_TAG_RECORD;

// 0x50 bytes (sizeof)
typedef struct _LDR_DDAG_NODE {
  struct _LIST_ENTRY Modules;                     // offset: 0x0 ordinal: 0x0
  struct _LDR_SERVICE_TAG_RECORD *ServiceTagList; // offset: 0x10 ordinal: 0x1
  ULONG LoadCount;                                // offset: 0x18 ordinal: 0x2
  ULONG LoadWhileUnloadingCount;                  // offset: 0x1c ordinal: 0x3
  ULONG LowestLink;                               // offset: 0x20 ordinal: 0x4
  struct _LDRP_CSLIST Dependencies;               // offset: 0x28 ordinal: 0x5
  struct _LDRP_CSLIST IncomingDependencies;       // offset: 0x30 ordinal: 0x6
  enum _LDR_DDAG_STATE State;                     // offset: 0x38 ordinal: 0x7
  struct _SINGLE_LIST_ENTRY CondenseLink;         // offset: 0x40 ordinal: 0x8
  ULONG PreorderNumber;                           // offset: 0x48 ordinal: 0x9
} _LDR_DDAG_NODE;

// 0x4 bytes (sizeof)
typedef union _PPM_COORDINATED_SYNCHRONIZATION {
  LONG AsLong;               // offset: 0x0 ordinal: 0x0
  ULONG EnterProcessor : 14; // offset: 0x0 ordinal: 0x1
  ULONG ExitProcessor : 14;  // offset: 0x0 ordinal: 0x2
  ULONG Transition : 2;      // offset: 0x0 ordinal: 0x3
  ULONG Entered : 1;         // offset: 0x0 ordinal: 0x4
  ULONG Reserved : 1;        // offset: 0x0 ordinal: 0x5
} _PPM_COORDINATED_SYNCHRONIZATION;

// 0x18 bytes (sizeof)
typedef struct _SHARED_CACHE_MAP_LIST_CURSOR {
  struct _LIST_ENTRY SharedCacheMapLinks; // offset: 0x0 ordinal: 0x0
  ULONG Flags;                            // offset: 0x10 ordinal: 0x1
} _SHARED_CACHE_MAP_LIST_CURSOR;

// 0x4 bytes (sizeof)
typedef union _PPM_IDLE_SYNCHRONIZATION_STATE {
  LONG AsLong;        // offset: 0x0 ordinal: 0x0
  LONG RefCount : 24; // offset: 0x0 ordinal: 0x1
  ULONG State : 8;    // offset: 0x0 ordinal: 0x2
} _PPM_IDLE_SYNCHRONIZATION_STATE;

// 0x8 bytes (sizeof)
typedef struct PROCESSOR_IDLESTATE_INFO {
  ULONG TimeCheck;      // offset: 0x0 ordinal: 0x0
  UCHAR DemotePercent;  // offset: 0x4 ordinal: 0x1
  UCHAR PromotePercent; // offset: 0x5 ordinal: 0x2
  UCHAR Spare[2];       // offset: 0x6 ordinal: 0x3
} PROCESSOR_IDLESTATE_INFO;

// 0x20 bytes (sizeof)
typedef struct PROCESSOR_IDLESTATE_POLICY {
  USHORT Revision;                           // offset: 0x0 ordinal: 0x0
  union __anon_2288 Flags;                   // offset: 0x2 ordinal: 0x1
  ULONG PolicyCount;                         // offset: 0x4 ordinal: 0x2
  struct PROCESSOR_IDLESTATE_INFO Policy[3]; // offset: 0x8 ordinal: 0x3
} PROCESSOR_IDLESTATE_POLICY;

// 0x4 bytes (sizeof)
typedef struct __anon_2280 {
  ULONG Type; // offset: 0x0 ordinal: 0x0
} __anon_2280;

// 0x4 bytes (sizeof)
typedef struct __anon_2279 {
  ULONG PercentLevel; // offset: 0x0 ordinal: 0x0
} __anon_2279;

// 0x18 bytes (sizeof)
typedef struct _POP_ACTION_TRIGGER {
  enum POWER_POLICY_DEVICE_TYPE Type; // offset: 0x0 ordinal: 0x0
  ULONG Flags;                        // offset: 0x4 ordinal: 0x1
  struct _POP_TRIGGER_WAIT *Wait;     // offset: 0x8 ordinal: 0x2
  union {
    struct __anon_2279 Battery; // offset: 0x10 ordinal: 0x3
    struct __anon_2280 Button;  // offset: 0x10 ordinal: 0x4
  };
} _POP_ACTION_TRIGGER;

// 0x38 bytes (sizeof)
typedef struct _POP_TRIGGER_WAIT {
  struct _KEVENT Event;                // offset: 0x0 ordinal: 0x0
  LONG Status;                         // offset: 0x18 ordinal: 0x1
  struct _LIST_ENTRY Link;             // offset: 0x20 ordinal: 0x2
  struct _POP_ACTION_TRIGGER *Trigger; // offset: 0x30 ordinal: 0x3
} _POP_TRIGGER_WAIT;

// 0x4 bytes (sizeof)
typedef union __anon_2270 {
  ULONG Active : 1;             // offset: 0x0 ordinal: 0x0
  ULONG OnlyTryAcquireUsed : 1; // offset: 0x0 ordinal: 0x1
  ULONG ReleasedOutOfOrder : 1; // offset: 0x0 ordinal: 0x2
  ULONG SequenceNumber : 29;    // offset: 0x0 ordinal: 0x3
  ULONG Whole;                  // offset: 0x0 ordinal: 0x4
} __anon_2270;

// 0x38 bytes (sizeof)
typedef struct _VI_DEADLOCK_THREAD {
  struct _KTHREAD *Thread;                    // offset: 0x0 ordinal: 0x0
  struct _VI_DEADLOCK_NODE *CurrentSpinNode;  // offset: 0x8 ordinal: 0x1
  struct _VI_DEADLOCK_NODE *CurrentOtherNode; // offset: 0x10 ordinal: 0x2
  union {
    struct _LIST_ENTRY ListEntry;     // offset: 0x18 ordinal: 0x3
    struct _LIST_ENTRY FreeListEntry; // offset: 0x18 ordinal: 0x4
  };
  ULONG NodeCount;            // offset: 0x28 ordinal: 0x5
  ULONG PagingCount;          // offset: 0x2c ordinal: 0x6
  UCHAR ThreadUsesEresources; // offset: 0x30 ordinal: 0x7
} _VI_DEADLOCK_THREAD;

// 0xf8 bytes (sizeof)
typedef struct _VI_DEADLOCK_RESOURCE {
  enum _VI_DEADLOCK_RESOURCE_TYPE Type;    // offset: 0x0 ordinal: 0x0
  ULONG NodeCount : 16;                    // offset: 0x4 ordinal: 0x1
  ULONG RecursionCount : 16;               // offset: 0x4 ordinal: 0x2
  VOID *ResourceAddress;                   // offset: 0x8 ordinal: 0x3
  struct _VI_DEADLOCK_THREAD *ThreadOwner; // offset: 0x10 ordinal: 0x4
  struct _LIST_ENTRY ResourceList;         // offset: 0x18 ordinal: 0x5
  union {
    struct _LIST_ENTRY HashChainList; // offset: 0x28 ordinal: 0x6
    struct _LIST_ENTRY FreeListEntry; // offset: 0x28 ordinal: 0x7
  };
  VOID *StackTrace[8];       // offset: 0x38 ordinal: 0x8
  VOID *LastAcquireTrace[8]; // offset: 0x78 ordinal: 0x9
  VOID *LastReleaseTrace[8]; // offset: 0xb8 ordinal: 0xa
} _VI_DEADLOCK_RESOURCE;

// 0xd0 bytes (sizeof)
typedef struct _VI_DEADLOCK_NODE {
  struct _VI_DEADLOCK_NODE *Parent; // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY ChildrenList;  // offset: 0x8 ordinal: 0x1
  struct _LIST_ENTRY SiblingsList;  // offset: 0x18 ordinal: 0x2
  union {
    struct _LIST_ENTRY ResourceList;  // offset: 0x28 ordinal: 0x3
    struct _LIST_ENTRY FreeListEntry; // offset: 0x28 ordinal: 0x4
  };
  struct _VI_DEADLOCK_RESOURCE *Root;      // offset: 0x38 ordinal: 0x5
  struct _VI_DEADLOCK_THREAD *ThreadEntry; // offset: 0x40 ordinal: 0x6
  union __anon_2270 u1;                    // offset: 0x48 ordinal: 0x7
  LONG ChildrenCount;                      // offset: 0x4c ordinal: 0x8
  VOID *StackTrace[8];                     // offset: 0x50 ordinal: 0x9
  VOID *ParentStackTrace[8];               // offset: 0x90 ordinal: 0xa
} _VI_DEADLOCK_NODE;

// 0x4 bytes (sizeof)
typedef struct _MM_SESSION_SPACE_FLAGS {
  ULONG Initialized : 1;            // offset: 0x0 ordinal: 0x0
  ULONG DeletePending : 1;          // offset: 0x0 ordinal: 0x1
  ULONG PoolInitialized : 1;        // offset: 0x0 ordinal: 0x2
  ULONG DynamicVaInitialized : 1;   // offset: 0x0 ordinal: 0x3
  ULONG WsInitialized : 1;          // offset: 0x0 ordinal: 0x4
  ULONG PoolDestroyed : 1;          // offset: 0x0 ordinal: 0x5
  ULONG ObjectInitialized : 1;      // offset: 0x0 ordinal: 0x6
  ULONG LeakedPoolDeliberately : 1; // offset: 0x0 ordinal: 0x7
  ULONG Filler : 24;                // offset: 0x0 ordinal: 0x8
} _MM_SESSION_SPACE_FLAGS;

// 0x4 bytes (sizeof)
typedef union __anon_2253 {
  ULONG LongFlags;                      // offset: 0x0 ordinal: 0x0
  struct _MM_SESSION_SPACE_FLAGS Flags; // offset: 0x0 ordinal: 0x1
} __anon_2253;

// 0xc bytes (sizeof)
typedef struct POWER_ACTION_POLICY {
  enum POWER_ACTION Action; // offset: 0x0 ordinal: 0x0
  ULONG Flags;              // offset: 0x4 ordinal: 0x1
  ULONG EventCode;          // offset: 0x8 ordinal: 0x2
} POWER_ACTION_POLICY;

// 0x18 bytes (sizeof)
typedef struct SYSTEM_POWER_LEVEL {
  UCHAR Enable;                            // offset: 0x0 ordinal: 0x0
  UCHAR Spare[3];                          // offset: 0x1 ordinal: 0x1
  ULONG BatteryLevel;                      // offset: 0x4 ordinal: 0x2
  struct POWER_ACTION_POLICY PowerPolicy;  // offset: 0x8 ordinal: 0x3
  enum _SYSTEM_POWER_STATE MinSystemState; // offset: 0x14 ordinal: 0x4
} SYSTEM_POWER_LEVEL;

typedef VOID (*__anon_2241)(enum _DUMP_EVENTS, VOID *, ULONG);

typedef LONG (*__anon_2239)(ULONG, ULONG, VOID *, ULONG);

// 0x8 bytes (sizeof)
typedef struct __anon_2236 {
  ULONG Signature; // offset: 0x0 ordinal: 0x0
  ULONG CheckSum;  // offset: 0x4 ordinal: 0x1
} __anon_2236;

typedef VOID (*__anon_2231)(ULONG);

// 0x48 bytes (sizeof)
typedef struct _PO_NOTIFY_ORDER_LEVEL {
  ULONG DeviceCount;             // offset: 0x0 ordinal: 0x0
  ULONG ActiveCount;             // offset: 0x4 ordinal: 0x1
  struct _LIST_ENTRY WaitSleep;  // offset: 0x8 ordinal: 0x2
  struct _LIST_ENTRY ReadySleep; // offset: 0x18 ordinal: 0x3
  struct _LIST_ENTRY ReadyS0;    // offset: 0x28 ordinal: 0x4
  struct _LIST_ENTRY WaitS0;     // offset: 0x38 ordinal: 0x5
} _PO_NOTIFY_ORDER_LEVEL;

// 0x178 bytes (sizeof)
typedef struct _PO_DEVICE_NOTIFY_ORDER {
  UCHAR Locked;                                // offset: 0x0 ordinal: 0x0
  struct _DEVICE_OBJECT **WarmEjectPdoPointer; // offset: 0x8 ordinal: 0x1
  struct _PO_NOTIFY_ORDER_LEVEL OrderLevel[5]; // offset: 0x10 ordinal: 0x2
} _PO_DEVICE_NOTIFY_ORDER;

// 0x18 bytes (sizeof)
typedef struct _RTL_ATOM_TABLE_REFERENCE {
  struct _LIST_ENTRY LowBoxList; // offset: 0x0 ordinal: 0x0
  ULONG LowBoxID;                // offset: 0x10 ordinal: 0x1
  USHORT ReferenceCount;         // offset: 0x14 ordinal: 0x2
  USHORT Flags;                  // offset: 0x16 ordinal: 0x3
} _RTL_ATOM_TABLE_REFERENCE;

// 0x30 bytes (sizeof)
typedef struct _RTL_ATOM_TABLE_ENTRY {
  struct _RTL_ATOM_TABLE_ENTRY *HashLink;     // offset: 0x0 ordinal: 0x0
  USHORT HandleIndex;                         // offset: 0x8 ordinal: 0x1
  USHORT Atom;                                // offset: 0xa ordinal: 0x2
  struct _RTL_ATOM_TABLE_REFERENCE Reference; // offset: 0x10 ordinal: 0x3
  UCHAR NameLength;                           // offset: 0x28 ordinal: 0x4
  WCHAR Name[1];                              // offset: 0x2a ordinal: 0x5
} _RTL_ATOM_TABLE_ENTRY;

// 0x40 bytes (sizeof)
typedef struct _PNP_DEVICE_COMPLETION_REQUEST {
  struct _LIST_ENTRY ListEntry;            // offset: 0x0 ordinal: 0x0
  struct _DEVICE_NODE *DeviceNode;         // offset: 0x10 ordinal: 0x1
  VOID *Context;                           // offset: 0x18 ordinal: 0x2
  enum _PNP_DEVNODE_STATE CompletionState; // offset: 0x20 ordinal: 0x3
  ULONG IrpPended;                         // offset: 0x24 ordinal: 0x4
  LONG Status;                             // offset: 0x28 ordinal: 0x5
  VOID *Information;                       // offset: 0x30 ordinal: 0x6
  LONG ReferenceCount;                     // offset: 0x38 ordinal: 0x7
} _PNP_DEVICE_COMPLETION_REQUEST;

// 0x1c bytes (sizeof)
typedef struct _IMAGE_DEBUG_DIRECTORY {
  ULONG Characteristics;  // offset: 0x0 ordinal: 0x0
  ULONG TimeDateStamp;    // offset: 0x4 ordinal: 0x1
  USHORT MajorVersion;    // offset: 0x8 ordinal: 0x2
  USHORT MinorVersion;    // offset: 0xa ordinal: 0x3
  ULONG Type;             // offset: 0xc ordinal: 0x4
  ULONG SizeOfData;       // offset: 0x10 ordinal: 0x5
  ULONG AddressOfRawData; // offset: 0x14 ordinal: 0x6
  ULONG PointerToRawData; // offset: 0x18 ordinal: 0x7
} _IMAGE_DEBUG_DIRECTORY;

// 0x4 bytes (sizeof)
typedef union __anon_2173 {
  ULONG PhysicalAddress; // offset: 0x0 ordinal: 0x0
  ULONG VirtualSize;     // offset: 0x0 ordinal: 0x1
} __anon_2173;

// 0x28 bytes (sizeof)
typedef struct _IMAGE_SECTION_HEADER {
  UCHAR Name[8];              // offset: 0x0 ordinal: 0x0
  union __anon_2173 Misc;     // offset: 0x8 ordinal: 0x1
  ULONG VirtualAddress;       // offset: 0xc ordinal: 0x2
  ULONG SizeOfRawData;        // offset: 0x10 ordinal: 0x3
  ULONG PointerToRawData;     // offset: 0x14 ordinal: 0x4
  ULONG PointerToRelocations; // offset: 0x18 ordinal: 0x5
  ULONG PointerToLinenumbers; // offset: 0x1c ordinal: 0x6
  USHORT NumberOfRelocations; // offset: 0x20 ordinal: 0x7
  USHORT NumberOfLinenumbers; // offset: 0x22 ordinal: 0x8
  ULONG Characteristics;      // offset: 0x24 ordinal: 0x9
} _IMAGE_SECTION_HEADER;

// 0x4 bytes (sizeof)
typedef struct _OBJECT_HEADER_PADDING_INFO {
  ULONG PaddingAmount; // offset: 0x0 ordinal: 0x0
} _OBJECT_HEADER_PADDING_INFO;

// 0x8 bytes (sizeof)
typedef struct BATTERY_REPORTING_SCALE {
  ULONG Granularity; // offset: 0x0 ordinal: 0x0
  ULONG Capacity;    // offset: 0x4 ordinal: 0x1
} BATTERY_REPORTING_SCALE;

// 0x4c bytes (sizeof)
typedef struct SYSTEM_POWER_CAPABILITIES {
  UCHAR PowerButtonPresent;                       // offset: 0x0 ordinal: 0x0
  UCHAR SleepButtonPresent;                       // offset: 0x1 ordinal: 0x1
  UCHAR LidPresent;                               // offset: 0x2 ordinal: 0x2
  UCHAR SystemS1;                                 // offset: 0x3 ordinal: 0x3
  UCHAR SystemS2;                                 // offset: 0x4 ordinal: 0x4
  UCHAR SystemS3;                                 // offset: 0x5 ordinal: 0x5
  UCHAR SystemS4;                                 // offset: 0x6 ordinal: 0x6
  UCHAR SystemS5;                                 // offset: 0x7 ordinal: 0x7
  UCHAR HiberFilePresent;                         // offset: 0x8 ordinal: 0x8
  UCHAR FullWake;                                 // offset: 0x9 ordinal: 0x9
  UCHAR VideoDimPresent;                          // offset: 0xa ordinal: 0xa
  UCHAR ApmPresent;                               // offset: 0xb ordinal: 0xb
  UCHAR UpsPresent;                               // offset: 0xc ordinal: 0xc
  UCHAR ThermalControl;                           // offset: 0xd ordinal: 0xd
  UCHAR ProcessorThrottle;                        // offset: 0xe ordinal: 0xe
  UCHAR ProcessorMinThrottle;                     // offset: 0xf ordinal: 0xf
  UCHAR ProcessorMaxThrottle;                     // offset: 0x10 ordinal: 0x10
  UCHAR FastSystemS4;                             // offset: 0x11 ordinal: 0x11
  UCHAR Hiberboot;                                // offset: 0x12 ordinal: 0x12
  UCHAR WakeAlarmPresent;                         // offset: 0x13 ordinal: 0x13
  UCHAR AoAc;                                     // offset: 0x14 ordinal: 0x14
  UCHAR DiskSpinDown;                             // offset: 0x15 ordinal: 0x15
  UCHAR HiberFileType;                            // offset: 0x16 ordinal: 0x16
  UCHAR AoAcConnectivitySupported;                // offset: 0x17 ordinal: 0x17
  UCHAR spare3[6];                                // offset: 0x18 ordinal: 0x18
  UCHAR SystemBatteriesPresent;                   // offset: 0x1e ordinal: 0x19
  UCHAR BatteriesAreShortTerm;                    // offset: 0x1f ordinal: 0x1a
  struct BATTERY_REPORTING_SCALE BatteryScale[3]; // offset: 0x20 ordinal: 0x1b
  enum _SYSTEM_POWER_STATE AcOnLineWake;          // offset: 0x38 ordinal: 0x1c
  enum _SYSTEM_POWER_STATE SoftLidWake;           // offset: 0x3c ordinal: 0x1d
  enum _SYSTEM_POWER_STATE RtcWake;               // offset: 0x40 ordinal: 0x1e
  enum _SYSTEM_POWER_STATE MinDeviceWakeState;    // offset: 0x44 ordinal: 0x1f
  enum _SYSTEM_POWER_STATE DefaultLowLatencyWake; // offset: 0x48 ordinal: 0x20
} SYSTEM_POWER_CAPABILITIES;

// 0x1c bytes (sizeof)
typedef struct PROCESSOR_PERFSTATE_POLICY {
  ULONG Revision;         // offset: 0x0 ordinal: 0x0
  UCHAR MaxThrottle;      // offset: 0x4 ordinal: 0x1
  UCHAR MinThrottle;      // offset: 0x5 ordinal: 0x2
  UCHAR BusyAdjThreshold; // offset: 0x6 ordinal: 0x3
  union {
    UCHAR Spare;             // offset: 0x7 ordinal: 0x4
    union __anon_2150 Flags; // offset: 0x7 ordinal: 0x5
  };
  ULONG TimeCheck;       // offset: 0x8 ordinal: 0x6
  ULONG IncreaseTime;    // offset: 0xc ordinal: 0x7
  ULONG DecreaseTime;    // offset: 0x10 ordinal: 0x8
  ULONG IncreasePercent; // offset: 0x14 ordinal: 0x9
  ULONG DecreasePercent; // offset: 0x18 ordinal: 0xa
} PROCESSOR_PERFSTATE_POLICY;

// 0x4 bytes (sizeof)
typedef struct __anon_2149 {
  ULONG MissedEtwRegistration : 1; // offset: 0x0 ordinal: 0x0
  ULONG Spare : 31;                // offset: 0x0 ordinal: 0x1
} __anon_2149;

// 0x28 bytes (sizeof)
typedef struct _VF_SUSPECT_DRIVER_ENTRY {
  struct _LIST_ENTRY Links;        // offset: 0x0 ordinal: 0x0
  ULONG Loads;                     // offset: 0x10 ordinal: 0x1
  ULONG Unloads;                   // offset: 0x14 ordinal: 0x2
  struct _UNICODE_STRING BaseName; // offset: 0x18 ordinal: 0x3
} _VF_SUSPECT_DRIVER_ENTRY;

// 0x4 bytes (sizeof)
typedef union __anon_2147 {
  struct __anon_2149 Flags; // offset: 0x0 ordinal: 0x0
  ULONG Whole;              // offset: 0x0 ordinal: 0x1
} __anon_2147;

// 0x4 bytes (sizeof)
typedef struct __anon_2137 {
  ULONG SnapSharedExportsFailed : 1; // offset: 0x0 ordinal: 0x0
  ULONG Spare : 31;                  // offset: 0x0 ordinal: 0x1
} __anon_2137;

// 0x20 bytes (sizeof)
typedef union __anon_2138 {
  struct _VF_TARGET_ALL_SHARED_EXPORT_THUNKS
      AllSharedExportThunks; // offset: 0x0 ordinal: 0x0
  struct __anon_2137 Flags;  // offset: 0x0 ordinal: 0x1
} __anon_2138;

// 0x18 bytes (sizeof)
typedef struct _THERMAL_POLICY {
  ULONG Version;           // offset: 0x0 ordinal: 0x0
  UCHAR WaitForUpdate;     // offset: 0x4 ordinal: 0x1
  UCHAR Hibernate;         // offset: 0x5 ordinal: 0x2
  UCHAR Critical;          // offset: 0x6 ordinal: 0x3
  UCHAR ThermalStandby;    // offset: 0x7 ordinal: 0x4
  ULONG ActivationReasons; // offset: 0x8 ordinal: 0x5
  ULONG PassiveLimit;      // offset: 0xc ordinal: 0x6
  ULONG ActiveLevel;       // offset: 0x10 ordinal: 0x7
  UCHAR OverThrottled;     // offset: 0x14 ordinal: 0x8
} _THERMAL_POLICY;

// 0x8 bytes (sizeof)
typedef struct _MI_FORCED_COMMITS {
  ULONG Regular; // offset: 0x0 ordinal: 0x0
  ULONG Wrap;    // offset: 0x4 ordinal: 0x1
} _MI_FORCED_COMMITS;

// 0x3c bytes (sizeof)
typedef struct _MI_PROBE_RAISE_TRACKER {
  ULONG UserRangeInKernel;              // offset: 0x0 ordinal: 0x0
  ULONG FaultFailed;                    // offset: 0x4 ordinal: 0x1
  ULONG WriteFaultFailed;               // offset: 0x8 ordinal: 0x2
  ULONG LargePageFailed;                // offset: 0xc ordinal: 0x3
  ULONG UserAccessToKernelPte;          // offset: 0x10 ordinal: 0x4
  ULONG BadPageLocation;                // offset: 0x14 ordinal: 0x5
  ULONG InsufficientCharge;             // offset: 0x18 ordinal: 0x6
  ULONG PageTableCharge;                // offset: 0x1c ordinal: 0x7
  ULONG NoPhysicalMapping;              // offset: 0x20 ordinal: 0x8
  ULONG NoIoReference;                  // offset: 0x24 ordinal: 0x9
  ULONG ProbeFailed;                    // offset: 0x28 ordinal: 0xa
  ULONG PteIsZero;                      // offset: 0x2c ordinal: 0xb
  ULONG StrongCodeWrite;                // offset: 0x30 ordinal: 0xc
  ULONG ReducedCloneCommitChargeFailed; // offset: 0x34 ordinal: 0xd
  ULONG CopyOnWriteAtDispatchNoPages;   // offset: 0x38 ordinal: 0xe
} _MI_PROBE_RAISE_TRACKER;

// 0x10 bytes (sizeof)
typedef struct _MM_SYSTEM_PAGE_COUNTS {
  ULONG SystemCodePage;        // offset: 0x0 ordinal: 0x0
  ULONG SystemDriverPage;      // offset: 0x4 ordinal: 0x1
  LONG TotalSystemCodePages;   // offset: 0x8 ordinal: 0x2
  LONG TotalSystemDriverPages; // offset: 0xc ordinal: 0x3
} _MM_SYSTEM_PAGE_COUNTS;

// 0x20 bytes (sizeof)
typedef struct _RTL_RANGE_LIST {
  struct _LIST_ENTRY ListHead; // offset: 0x0 ordinal: 0x0
  ULONG Flags;                 // offset: 0x10 ordinal: 0x1
  ULONG Count;                 // offset: 0x14 ordinal: 0x2
  ULONG Stamp;                 // offset: 0x18 ordinal: 0x3
} _RTL_RANGE_LIST;

// 0xc bytes (sizeof)
typedef struct _KSYSTEM_TIME {
  ULONG LowPart;  // offset: 0x0 ordinal: 0x0
  LONG High1Time; // offset: 0x4 ordinal: 0x1
  LONG High2Time; // offset: 0x8 ordinal: 0x2
} _KSYSTEM_TIME;

// 0x10 bytes (sizeof)
typedef struct _TEB_ACTIVE_FRAME_CONTEXT {
  ULONG Flags;     // offset: 0x0 ordinal: 0x0
  CHAR *FrameName; // offset: 0x8 ordinal: 0x1
} _TEB_ACTIVE_FRAME_CONTEXT;

// 0x38 bytes (sizeof)
typedef struct _VI_TRACK_IRQL {
  VOID *Thread;        // offset: 0x0 ordinal: 0x0
  UCHAR OldIrql;       // offset: 0x8 ordinal: 0x1
  UCHAR NewIrql;       // offset: 0x9 ordinal: 0x2
  USHORT Processor;    // offset: 0xa ordinal: 0x3
  ULONG TickCount;     // offset: 0xc ordinal: 0x4
  VOID *StackTrace[5]; // offset: 0x10 ordinal: 0x5
} _VI_TRACK_IRQL;

// 0x28 bytes (sizeof)
typedef struct _CALL_HASH_ENTRY {
  struct _LIST_ENTRY ListEntry; // offset: 0x0 ordinal: 0x0
  VOID *CallersAddress;         // offset: 0x10 ordinal: 0x1
  VOID *CallersCaller;          // offset: 0x18 ordinal: 0x2
  ULONG CallCount;              // offset: 0x20 ordinal: 0x3
} _CALL_HASH_ENTRY;

// 0x4 bytes (sizeof)
typedef struct _HEAP_STOP_ON_TAG {
  union {
    ULONG HeapAndTagIndex; // offset: 0x0 ordinal: 0x0
    USHORT TagIndex;       // offset: 0x0 ordinal: 0x1
  };
  USHORT HeapIndex; // offset: 0x2 ordinal: 0x2
} _HEAP_STOP_ON_TAG;

// 0x70 bytes (sizeof)
typedef struct _PI_BUS_EXTENSION {
  ULONG Flags;                                // offset: 0x0 ordinal: 0x0
  UCHAR NumberCSNs;                           // offset: 0x4 ordinal: 0x1
  UCHAR *ReadDataPort;                        // offset: 0x8 ordinal: 0x2
  UCHAR DataPortMapped;                       // offset: 0x10 ordinal: 0x3
  UCHAR *AddressPort;                         // offset: 0x18 ordinal: 0x4
  UCHAR AddrPortMapped;                       // offset: 0x20 ordinal: 0x5
  UCHAR *CommandPort;                         // offset: 0x28 ordinal: 0x6
  UCHAR CmdPortMapped;                        // offset: 0x30 ordinal: 0x7
  ULONG NextSlotNumber;                       // offset: 0x34 ordinal: 0x8
  struct _SINGLE_LIST_ENTRY DeviceList;       // offset: 0x38 ordinal: 0x9
  struct _SINGLE_LIST_ENTRY CardList;         // offset: 0x40 ordinal: 0xa
  struct _DEVICE_OBJECT *PhysicalBusDevice;   // offset: 0x48 ordinal: 0xb
  struct _DEVICE_OBJECT *FunctionalBusDevice; // offset: 0x50 ordinal: 0xc
  struct _DEVICE_OBJECT *AttachedDevice;      // offset: 0x58 ordinal: 0xd
  ULONG BusNumber;                            // offset: 0x60 ordinal: 0xe
  enum _SYSTEM_POWER_STATE SystemPowerState;  // offset: 0x64 ordinal: 0xf
  enum _DEVICE_POWER_STATE DevicePowerState;  // offset: 0x68 ordinal: 0x10
} _PI_BUS_EXTENSION;

// 0x10 bytes (sizeof)
typedef struct _BUS_EXTENSION_LIST {
  VOID *Next;                             // offset: 0x0 ordinal: 0x0
  struct _PI_BUS_EXTENSION *BusExtension; // offset: 0x8 ordinal: 0x1
} _BUS_EXTENSION_LIST;

// 0x4 bytes (sizeof)
typedef union _MI_FLAGS {
  LONG EntireFlags;                        // offset: 0x0 ordinal: 0x0
  ULONG VerifierEnabled : 1;               // offset: 0x0 ordinal: 0x1
  ULONG KernelVerifierEnabled : 1;         // offset: 0x0 ordinal: 0x2
  ULONG LargePageKernel : 1;               // offset: 0x0 ordinal: 0x3
  ULONG StopOn4d : 1;                      // offset: 0x0 ordinal: 0x4
  ULONG InitializationPhase : 2;           // offset: 0x0 ordinal: 0x5
  ULONG PageKernelStacks : 1;              // offset: 0x0 ordinal: 0x6
  ULONG CheckZeroPages : 1;                // offset: 0x0 ordinal: 0x7
  ULONG ProcessorPrewalks : 1;             // offset: 0x0 ordinal: 0x8
  ULONG ProcessorPostwalks : 1;            // offset: 0x0 ordinal: 0x9
  ULONG CoverageBuild : 1;                 // offset: 0x0 ordinal: 0xa
  ULONG AccessBitReplacementDisabled : 1;  // offset: 0x0 ordinal: 0xb
  ULONG CheckExecute : 1;                  // offset: 0x0 ordinal: 0xc
  ULONG ZeroNonCachedByConverting : 1;     // offset: 0x0 ordinal: 0xd
  ULONG ZeroWriteCombinedByConverting : 1; // offset: 0x0 ordinal: 0xe
  ULONG ProtectedPagesEnabled : 1;         // offset: 0x0 ordinal: 0xf
  ULONG StrongCodeGuarantees : 2;          // offset: 0x0 ordinal: 0x10
  ULONG HardCodeGuarantees : 1;            // offset: 0x0 ordinal: 0x11
  ULONG StrongPageIdentity : 1;            // offset: 0x0 ordinal: 0x12
  ULONG SecureRelocations : 1;             // offset: 0x0 ordinal: 0x13
} _MI_FLAGS;

// 0xc bytes (sizeof)
typedef struct _IOP_IRP_EXTENSION_STATUS {
  ULONG Flags;      // offset: 0x0 ordinal: 0x0
  ULONG ActivityId; // offset: 0x4 ordinal: 0x1
  ULONG IoTracking; // offset: 0x8 ordinal: 0x2
} _IOP_IRP_EXTENSION_STATUS;

// 0x8 bytes (sizeof)
typedef struct _LEARNING_MODE_DATA {
  ULONG Settings;              // offset: 0x0 ordinal: 0x0
  UCHAR Enabled;               // offset: 0x4 ordinal: 0x1
  UCHAR PermissiveModeEnabled; // offset: 0x5 ordinal: 0x2
} _LEARNING_MODE_DATA;

// 0xc bytes (sizeof)
typedef struct _OBJECT_REF_STACK_INFO {
  ULONG Sequence;   // offset: 0x0 ordinal: 0x0
  USHORT Index;     // offset: 0x4 ordinal: 0x1
  USHORT NumTraces; // offset: 0x6 ordinal: 0x2
  ULONG Tag;        // offset: 0x8 ordinal: 0x3
} _OBJECT_REF_STACK_INFO;

// 0x58 bytes (sizeof)
typedef struct _THERMAL_INFORMATION_EX {
  ULONG ThermalStamp;            // offset: 0x0 ordinal: 0x0
  ULONG ThermalConstant1;        // offset: 0x4 ordinal: 0x1
  ULONG ThermalConstant2;        // offset: 0x8 ordinal: 0x2
  ULONG SamplingPeriod;          // offset: 0xc ordinal: 0x3
  ULONG CurrentTemperature;      // offset: 0x10 ordinal: 0x4
  ULONG PassiveTripPoint;        // offset: 0x14 ordinal: 0x5
  ULONG ThermalStandbyTripPoint; // offset: 0x18 ordinal: 0x6
  ULONG CriticalTripPoint;       // offset: 0x1c ordinal: 0x7
  UCHAR ActiveTripPointCount;    // offset: 0x20 ordinal: 0x8
  ULONG ActiveTripPoint[10];     // offset: 0x24 ordinal: 0x9
  ULONG S4TransitionTripPoint;   // offset: 0x4c ordinal: 0xa
  ULONG MinimumThrottle;         // offset: 0x50 ordinal: 0xb
  ULONG OverThrottleThreshold;   // offset: 0x54 ordinal: 0xc
} _THERMAL_INFORMATION_EX;

// 0x8 bytes (sizeof)
typedef struct __anon_1908 {
  ULONG Context1; // offset: 0x0 ordinal: 0x0
  ULONG Context2; // offset: 0x4 ordinal: 0x1
} __anon_1908;

// 0x8 bytes (sizeof)
typedef struct __anon_1907 {
  ULONG RangeCount;  // offset: 0x0 ordinal: 0x0
  ULONG SetBitCount; // offset: 0x4 ordinal: 0x1
} __anon_1907;

// 0x8 bytes (sizeof)
typedef struct __anon_1906 {
  ULONG Start;  // offset: 0x0 ordinal: 0x0
  ULONG Length; // offset: 0x4 ordinal: 0x1
} __anon_1906;

// 0x8 bytes (sizeof)
typedef union __anon_1902 {
  struct __anon_1906 DirtyVectorModifiedContext; // offset: 0x0 ordinal: 0x0
  struct __anon_1907 DirtyDataCaptureContext;    // offset: 0x0 ordinal: 0x1
  struct __anon_1908 Raw;                        // offset: 0x0 ordinal: 0x2
} __anon_1902;

// 0x48 bytes (sizeof)
typedef struct _CM_DIRTY_VECTOR_LOG_ENTRY {
  struct _ETHREAD *Thread;                   // offset: 0x0 ordinal: 0x0
  enum _CM_DIRTY_VECTOR_OPERATION Operation; // offset: 0x8 ordinal: 0x1
  union __anon_1902 Data;                    // offset: 0xc ordinal: 0x2
  VOID *Stack[6];                            // offset: 0x18 ordinal: 0x3
} _CM_DIRTY_VECTOR_LOG_ENTRY;

// 0x8 bytes (sizeof)
typedef struct _KTRANSACTION_HISTORY {
  enum __anon_1900 RecordType; // offset: 0x0 ordinal: 0x0
  ULONG Payload;               // offset: 0x4 ordinal: 0x1
} _KTRANSACTION_HISTORY;

// 0x8 bytes (sizeof)
typedef struct __anon_1892 {
  ULONG idxRecord;    // offset: 0x0 ordinal: 0x0
  ULONG cidContainer; // offset: 0x4 ordinal: 0x1
} __anon_1892;

// 0x68 bytes (sizeof)
typedef struct _RTL_AVL_TABLE {
  struct _RTL_BALANCED_LINKS BalancedRoot; // offset: 0x0 ordinal: 0x0
  VOID *OrderedPointer;                    // offset: 0x20 ordinal: 0x1
  ULONG WhichOrderedElement;               // offset: 0x28 ordinal: 0x2
  ULONG NumberGenericTableElements;        // offset: 0x2c ordinal: 0x3
  ULONG DepthOfTree;                       // offset: 0x30 ordinal: 0x4
  struct _RTL_BALANCED_LINKS *RestartKey;  // offset: 0x38 ordinal: 0x5
  ULONG DeleteCount;                       // offset: 0x40 ordinal: 0x6
  enum _RTL_GENERIC_COMPARE_RESULTS (*CompareRoutine)(
      struct _RTL_AVL_TABLE *, VOID *, VOID *); // offset: 0x48 ordinal: 0x7
  VOID *(*AllocateRoutine)(struct _RTL_AVL_TABLE *,
                           ULONG); // offset: 0x50 ordinal: 0x8
  VOID(*FreeRoutine)
  (struct _RTL_AVL_TABLE *, VOID *); // offset: 0x58 ordinal: 0x9
  VOID *TableContext;                // offset: 0x60 ordinal: 0xa
} _RTL_AVL_TABLE;

typedef VOID (*__anon_1905)(struct _RTL_AVL_TABLE *, VOID *);

typedef VOID *(*__anon_1904)(struct _RTL_AVL_TABLE *, ULONG);

typedef enum _RTL_GENERIC_COMPARE_RESULTS (*__anon_1903)(
    struct _RTL_AVL_TABLE *, VOID *, VOID *);

// 0xa8 bytes (sizeof)
typedef struct _KTMOBJECT_NAMESPACE {
  struct _RTL_AVL_TABLE Table; // offset: 0x0 ordinal: 0x0
  struct _KMUTANT Mutex;       // offset: 0x68 ordinal: 0x1
  USHORT LinksOffset;          // offset: 0xa0 ordinal: 0x2
  USHORT GuidOffset;           // offset: 0xa2 ordinal: 0x3
  UCHAR Expired;               // offset: 0xa4 ordinal: 0x4
} _KTMOBJECT_NAMESPACE;

// 0x8 bytes (sizeof)
typedef struct _CM_CELL_REMAP_BLOCK {
  ULONG OldCell; // offset: 0x0 ordinal: 0x0
  ULONG NewCell; // offset: 0x4 ordinal: 0x1
} _CM_CELL_REMAP_BLOCK;

// 0x488 bytes (sizeof)
typedef struct _CM_DIRTY_VECTOR_LOG {
  ULONG Next;                                // offset: 0x0 ordinal: 0x0
  ULONG Size;                                // offset: 0x4 ordinal: 0x1
  struct _CM_DIRTY_VECTOR_LOG_ENTRY Log[16]; // offset: 0x8 ordinal: 0x2
} _CM_DIRTY_VECTOR_LOG;

// 0x28 bytes (sizeof)
typedef struct _CM_WORKITEM {
  struct _LIST_ENTRY ListEntry;  // offset: 0x0 ordinal: 0x0
  ULONG Private;                 // offset: 0x10 ordinal: 0x1
  VOID (*WorkerRoutine)(VOID *); // offset: 0x18 ordinal: 0x2
  VOID *Parameter;               // offset: 0x20 ordinal: 0x3
} _CM_WORKITEM;

// 0x8 bytes (sizeof)
typedef struct _KENLISTMENT_HISTORY {
  ULONG Notification;               // offset: 0x0 ordinal: 0x0
  enum _KENLISTMENT_STATE NewState; // offset: 0x4 ordinal: 0x1
} _KENLISTMENT_HISTORY;

// 0x18 bytes (sizeof)
typedef struct _CM_NAME_HASH {
  ULONG ConvKey;                  // offset: 0x0 ordinal: 0x0
  struct _CM_NAME_HASH *NextHash; // offset: 0x8 ordinal: 0x1
  USHORT NameLength;              // offset: 0x10 ordinal: 0x2
  WCHAR Name[1];                  // offset: 0x12 ordinal: 0x3
} _CM_NAME_HASH;

// 0x20 bytes (sizeof)
typedef struct _CM_NAME_CONTROL_BLOCK {
  ULONG Compressed : 1; // offset: 0x0 ordinal: 0x0
  ULONG RefCount : 31;  // offset: 0x0 ordinal: 0x1
  union {
    struct _CM_NAME_HASH NameHash; // offset: 0x8 ordinal: 0x2
    ULONG ConvKey;                 // offset: 0x8 ordinal: 0x3
  };
  struct _CM_KEY_HASH *NextHash; // offset: 0x10 ordinal: 0x4
  USHORT NameLength;             // offset: 0x18 ordinal: 0x5
  WCHAR Name[1];                 // offset: 0x1a ordinal: 0x6
} _CM_NAME_CONTROL_BLOCK;

// 0x4 bytes (sizeof)
typedef union _KSTACK_COUNT {
  LONG Value;            // offset: 0x0 ordinal: 0x0
  ULONG State : 3;       // offset: 0x0 ordinal: 0x1
  ULONG StackCount : 29; // offset: 0x0 ordinal: 0x2
} _KSTACK_COUNT;

// 0x4 bytes (sizeof)
typedef struct __anon_1804 {
  ULONG ExtendedDestination : 24; // offset: 0x0 ordinal: 0x0
  ULONG Reserved : 6;             // offset: 0x0 ordinal: 0x1
  ULONG PassPW : 1;               // offset: 0x0 ordinal: 0x2
  ULONG WaitingForEOI : 1;        // offset: 0x0 ordinal: 0x3
} __anon_1804;

// 0x4 bytes (sizeof)
typedef struct __anon_1803 {
  ULONG Mask : 1;            // offset: 0x0 ordinal: 0x0
  ULONG Polarity : 1;        // offset: 0x0 ordinal: 0x1
  ULONG MessageType : 3;     // offset: 0x0 ordinal: 0x2
  ULONG RequestEOI : 1;      // offset: 0x0 ordinal: 0x3
  ULONG DestinationMode : 1; // offset: 0x0 ordinal: 0x4
  ULONG MessageType3 : 1;    // offset: 0x0 ordinal: 0x5
  ULONG Destination : 8;     // offset: 0x0 ordinal: 0x6
  ULONG Vector : 8;          // offset: 0x0 ordinal: 0x7
  ULONG ExtendedAddress : 8; // offset: 0x0 ordinal: 0x8
} __anon_1803;

// 0x4 bytes (sizeof)
typedef union __anon_1802 {
  struct __anon_1804 bits; // offset: 0x0 ordinal: 0x0
  ULONG AsULONG;           // offset: 0x0 ordinal: 0x1
} __anon_1802;

// 0x4 bytes (sizeof)
typedef union __anon_1801 {
  struct __anon_1803 bits; // offset: 0x0 ordinal: 0x0
  ULONG AsULONG;           // offset: 0x0 ordinal: 0x1
} __anon_1801;

// 0x8 bytes (sizeof)
typedef struct _INTERRUPT_HT_INTR_INFO {
  union __anon_1801 LowPart;  // offset: 0x0 ordinal: 0x0
  union __anon_1802 HighPart; // offset: 0x4 ordinal: 0x1
} _INTERRUPT_HT_INTR_INFO;

// 0x8 bytes (sizeof)
typedef struct __anon_1795 {
  struct _INTERRUPT_HT_INTR_INFO IntrInfo; // offset: 0x0 ordinal: 0x0
} __anon_1795;

// 0x8 bytes (sizeof)
typedef struct __anon_1800 {
  ULONG MessageAddressLow; // offset: 0x0 ordinal: 0x0
  USHORT MessageData;      // offset: 0x4 ordinal: 0x1
  USHORT Reserved;         // offset: 0x6 ordinal: 0x2
} __anon_1800;

// 0x8 bytes (sizeof)
typedef struct __anon_1793 {
  ULONG Gsiv;               // offset: 0x0 ordinal: 0x0
  ULONG WakeInterrupt : 1;  // offset: 0x4 ordinal: 0x1
  ULONG ReservedFlags : 31; // offset: 0x4 ordinal: 0x2
} __anon_1793;

// 0x4 bytes (sizeof)
typedef struct __anon_1777 {
  ULONG DeviceNumber : 5;   // offset: 0x0 ordinal: 0x0
  ULONG FunctionNumber : 3; // offset: 0x0 ordinal: 0x1
  ULONG Reserved : 24;      // offset: 0x0 ordinal: 0x2
} __anon_1777;

// 0x18 bytes (sizeof)
typedef struct __anon_1776 {
  ULONG PollInterval;             // offset: 0x0 ordinal: 0x0
  ULONG Vector;                   // offset: 0x4 ordinal: 0x1
  ULONG SwitchToPollingThreshold; // offset: 0x8 ordinal: 0x2
  ULONG SwitchToPollingWindow;    // offset: 0xc ordinal: 0x3
  ULONG ErrorThreshold;           // offset: 0x10 ordinal: 0x4
  ULONG ErrorThresholdWindow;     // offset: 0x14 ordinal: 0x5
} __anon_1776;

// 0x4 bytes (sizeof)
typedef struct __anon_1775 {
  ULONG PollInterval; // offset: 0x0 ordinal: 0x0
} __anon_1775;

// 0x18 bytes (sizeof)
typedef union __anon_1772 {
  struct __anon_1775 Polled;         // offset: 0x0 ordinal: 0x0
  struct __anon_1776 Interrupt;      // offset: 0x0 ordinal: 0x1
  struct __anon_1776 LocalInterrupt; // offset: 0x0 ordinal: 0x2
  struct __anon_1776 Sci;            // offset: 0x0 ordinal: 0x3
  struct __anon_1776 Nmi;            // offset: 0x0 ordinal: 0x4
} __anon_1772;

// 0x1c bytes (sizeof)
typedef struct _WHEA_NOTIFICATION_DESCRIPTOR {
  UCHAR Type;                           // offset: 0x0 ordinal: 0x0
  UCHAR Length;                         // offset: 0x1 ordinal: 0x1
  union _WHEA_NOTIFICATION_FLAGS Flags; // offset: 0x2 ordinal: 0x2
  union __anon_1772 u;                  // offset: 0x4 ordinal: 0x3
} _WHEA_NOTIFICATION_DESCRIPTOR;

// 0x4 bytes (sizeof)
typedef union __anon_1773 {
  struct __anon_1777 bits; // offset: 0x0 ordinal: 0x0
  ULONG AsULONG;           // offset: 0x0 ordinal: 0x1
} __anon_1773;

// 0x4 bytes (sizeof)
typedef struct _WHEA_PCI_SLOT_NUMBER {
  union __anon_1773 u; // offset: 0x0 ordinal: 0x0
} _WHEA_PCI_SLOT_NUMBER;

// 0x4 bytes (sizeof)
typedef union _XPF_MCE_FLAGS {
  ULONG MCG_CapabilityRW : 1;    // offset: 0x0 ordinal: 0x0
  ULONG MCG_GlobalControlRW : 1; // offset: 0x0 ordinal: 0x1
  ULONG Reserved : 30;           // offset: 0x0 ordinal: 0x2
  ULONG AsULONG;                 // offset: 0x0 ordinal: 0x3
} _XPF_MCE_FLAGS;

// 0x2c bytes (sizeof)
typedef struct _WHEA_AER_BRIDGE_DESCRIPTOR {
  USHORT Type;                              // offset: 0x0 ordinal: 0x0
  UCHAR Enabled;                            // offset: 0x2 ordinal: 0x1
  UCHAR Reserved;                           // offset: 0x3 ordinal: 0x2
  ULONG BusNumber;                          // offset: 0x4 ordinal: 0x3
  struct _WHEA_PCI_SLOT_NUMBER Slot;        // offset: 0x8 ordinal: 0x4
  USHORT DeviceControl;                     // offset: 0xc ordinal: 0x5
  union _AER_BRIDGE_DESCRIPTOR_FLAGS Flags; // offset: 0xe ordinal: 0x6
  ULONG UncorrectableErrorMask;             // offset: 0x10 ordinal: 0x7
  ULONG UncorrectableErrorSeverity;         // offset: 0x14 ordinal: 0x8
  ULONG CorrectableErrorMask;               // offset: 0x18 ordinal: 0x9
  ULONG AdvancedCapsAndControl;             // offset: 0x1c ordinal: 0xa
  ULONG SecondaryUncorrectableErrorMask;    // offset: 0x20 ordinal: 0xb
  ULONG SecondaryUncorrectableErrorSev;     // offset: 0x24 ordinal: 0xc
  ULONG SecondaryCapsAndControl;            // offset: 0x28 ordinal: 0xd
} _WHEA_AER_BRIDGE_DESCRIPTOR;

// 0x20 bytes (sizeof)
typedef struct _WHEA_AER_ENDPOINT_DESCRIPTOR {
  USHORT Type;                                // offset: 0x0 ordinal: 0x0
  UCHAR Enabled;                              // offset: 0x2 ordinal: 0x1
  UCHAR Reserved;                             // offset: 0x3 ordinal: 0x2
  ULONG BusNumber;                            // offset: 0x4 ordinal: 0x3
  struct _WHEA_PCI_SLOT_NUMBER Slot;          // offset: 0x8 ordinal: 0x4
  USHORT DeviceControl;                       // offset: 0xc ordinal: 0x5
  union _AER_ENDPOINT_DESCRIPTOR_FLAGS Flags; // offset: 0xe ordinal: 0x6
  ULONG UncorrectableErrorMask;               // offset: 0x10 ordinal: 0x7
  ULONG UncorrectableErrorSeverity;           // offset: 0x14 ordinal: 0x8
  ULONG CorrectableErrorMask;                 // offset: 0x18 ordinal: 0x9
  ULONG AdvancedCapsAndControl;               // offset: 0x1c ordinal: 0xa
} _WHEA_AER_ENDPOINT_DESCRIPTOR;

// 0x24 bytes (sizeof)
typedef struct _WHEA_AER_ROOTPORT_DESCRIPTOR {
  USHORT Type;                                // offset: 0x0 ordinal: 0x0
  UCHAR Enabled;                              // offset: 0x2 ordinal: 0x1
  UCHAR Reserved;                             // offset: 0x3 ordinal: 0x2
  ULONG BusNumber;                            // offset: 0x4 ordinal: 0x3
  struct _WHEA_PCI_SLOT_NUMBER Slot;          // offset: 0x8 ordinal: 0x4
  USHORT DeviceControl;                       // offset: 0xc ordinal: 0x5
  union _AER_ROOTPORT_DESCRIPTOR_FLAGS Flags; // offset: 0xe ordinal: 0x6
  ULONG UncorrectableErrorMask;               // offset: 0x10 ordinal: 0x7
  ULONG UncorrectableErrorSeverity;           // offset: 0x14 ordinal: 0x8
  ULONG CorrectableErrorMask;                 // offset: 0x18 ordinal: 0x9
  ULONG AdvancedCapsAndControl;               // offset: 0x1c ordinal: 0xa
  ULONG RootErrorCommand;                     // offset: 0x20 ordinal: 0xb
} _WHEA_AER_ROOTPORT_DESCRIPTOR;

// 0x4 bytes (sizeof)
typedef union _WHEAP_ERROR_RECORD_WRAPPER_FLAGS {
  ULONG Preallocated : 1;            // offset: 0x0 ordinal: 0x0
  ULONG FromPersistentStore : 1;     // offset: 0x0 ordinal: 0x1
  ULONG PlatformPfaControl : 1;      // offset: 0x0 ordinal: 0x2
  ULONG PlatformDirectedOffline : 1; // offset: 0x0 ordinal: 0x3
  ULONG Reserved : 28;               // offset: 0x0 ordinal: 0x4
  ULONG AsULONG;                     // offset: 0x0 ordinal: 0x5
} _WHEAP_ERROR_RECORD_WRAPPER_FLAGS;

// 0x30 bytes (sizeof)
typedef struct _WHEAP_ERROR_SOURCE_TABLE {
  ULONG Signature;           // offset: 0x0 ordinal: 0x0
  LONG Count;                // offset: 0x4 ordinal: 0x1
  struct _LIST_ENTRY Items;  // offset: 0x8 ordinal: 0x2
  struct _KEVENT InsertLock; // offset: 0x18 ordinal: 0x3
} _WHEAP_ERROR_SOURCE_TABLE;

// 0x28 bytes (sizeof)
typedef struct _OBP_LOOKUP_CONTEXT {
  struct _OBJECT_DIRECTORY *Directory;        // offset: 0x0 ordinal: 0x0
  VOID *Object;                               // offset: 0x8 ordinal: 0x1
  struct _OBJECT_DIRECTORY_ENTRY **EntryLink; // offset: 0x10 ordinal: 0x2
  ULONG HashValue;                            // offset: 0x18 ordinal: 0x3
  USHORT HashIndex;                           // offset: 0x1c ordinal: 0x4
  UCHAR DirectoryLocked;                      // offset: 0x1e ordinal: 0x5
  UCHAR LockedExclusive;                      // offset: 0x1f ordinal: 0x6
  ULONG LockStateSignature;                   // offset: 0x20 ordinal: 0x7
} _OBP_LOOKUP_CONTEXT;

// 0x18 bytes (sizeof)
typedef struct _OBJECT_DIRECTORY_ENTRY {
  struct _OBJECT_DIRECTORY_ENTRY *ChainLink; // offset: 0x0 ordinal: 0x0
  VOID *Object;                              // offset: 0x8 ordinal: 0x1
  ULONG HashValue;                           // offset: 0x10 ordinal: 0x2
} _OBJECT_DIRECTORY_ENTRY;

// 0x40 bytes (sizeof)
typedef struct _DEVICE_MAP {
  struct _OBJECT_DIRECTORY *DosDevicesDirectory; // offset: 0x0 ordinal: 0x0
  struct _OBJECT_DIRECTORY
      *GlobalDosDevicesDirectory;  // offset: 0x8 ordinal: 0x1
  VOID *DosDevicesDirectoryHandle; // offset: 0x10 ordinal: 0x2
  LONG ReferenceCount;             // offset: 0x18 ordinal: 0x3
  ULONG DriveMap;                  // offset: 0x1c ordinal: 0x4
  UCHAR DriveType[32];             // offset: 0x20 ordinal: 0x5
} _DEVICE_MAP;

// 0x30 bytes (sizeof)
typedef struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION {
  ULONG SecurityAttributeCount;                     // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY SecurityAttributesList;        // offset: 0x8 ordinal: 0x1
  ULONG WorkingSecurityAttributeCount;              // offset: 0x18 ordinal: 0x2
  struct _LIST_ENTRY WorkingSecurityAttributesList; // offset: 0x20 ordinal: 0x3
} _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION;

// 0x10 bytes (sizeof)
typedef struct _SID_AND_ATTRIBUTES {
  VOID *Sid;        // offset: 0x0 ordinal: 0x0
  ULONG Attributes; // offset: 0x8 ordinal: 0x1
} _SID_AND_ATTRIBUTES;

// 0x4 bytes (sizeof)
typedef struct _TOKEN_MANDATORY_POLICY {
  ULONG Policy; // offset: 0x0 ordinal: 0x0
} _TOKEN_MANDATORY_POLICY;

// 0x48 bytes (sizeof)
typedef struct _IOP_FILE_OBJECT_EXTENSION {
  ULONG FoExtFlags;                         // offset: 0x0 ordinal: 0x0
  VOID *FoExtPerTypeExtension[7];           // offset: 0x8 ordinal: 0x1
  enum _IOP_PRIORITY_HINT FoIoPriorityHint; // offset: 0x40 ordinal: 0x2
} _IOP_FILE_OBJECT_EXTENSION;

// 0x10 bytes (sizeof)
typedef struct _OBJECT_DUMP_CONTROL {
  VOID *Stream; // offset: 0x0 ordinal: 0x0
  ULONG Detail; // offset: 0x8 ordinal: 0x1
} _OBJECT_DUMP_CONTROL;

typedef VOID (*__anon_1591)(VOID *, struct _OBJECT_DUMP_CONTROL *);

// 0x30 bytes (sizeof)
typedef struct _OBJECT_ATTRIBUTES {
  ULONG Length;                       // offset: 0x0 ordinal: 0x0
  VOID *RootDirectory;                // offset: 0x8 ordinal: 0x1
  struct _UNICODE_STRING *ObjectName; // offset: 0x10 ordinal: 0x2
  ULONG Attributes;                   // offset: 0x18 ordinal: 0x3
  VOID *SecurityDescriptor;           // offset: 0x20 ordinal: 0x4
  VOID *SecurityQualityOfService;     // offset: 0x28 ordinal: 0x5
} _OBJECT_ATTRIBUTES;

// 0x4 bytes (sizeof)
typedef struct __anon_1580 {
  ULONG Secure : 1; // offset: 0x0 ordinal: 0x0
} __anon_1580;

// 0x4 bytes (sizeof)
typedef union __anon_1579 {
  struct __anon_1580 s1; // offset: 0x0 ordinal: 0x0
} __anon_1579;

// 0x4 bytes (sizeof)
typedef struct __anon_1577 {
  ULONG WriteAccess : 1; // offset: 0x0 ordinal: 0x0
  ULONG AutoRelease : 1; // offset: 0x0 ordinal: 0x1
  ULONG ForceUnlink : 1; // offset: 0x0 ordinal: 0x2
} __anon_1577;

// 0x4 bytes (sizeof)
typedef union __anon_1572 {
  struct __anon_1577 s1; // offset: 0x0 ordinal: 0x0
} __anon_1572;

// 0x4 bytes (sizeof)
typedef struct __anon_1575 {
  ULONG Revoked : 1;      // offset: 0x0 ordinal: 0x0
  ULONG Impersonated : 1; // offset: 0x0 ordinal: 0x1
} __anon_1575;

// 0x4 bytes (sizeof)
typedef union __anon_1570 {
  struct __anon_1575 s1; // offset: 0x0 ordinal: 0x0
} __anon_1570;

// 0x4 bytes (sizeof)
typedef struct __anon_1558 {
  ULONG QueueType : 3;              // offset: 0x0 ordinal: 0x0
  ULONG QueuePortType : 4;          // offset: 0x0 ordinal: 0x1
  ULONG Canceled : 1;               // offset: 0x0 ordinal: 0x2
  ULONG Ready : 1;                  // offset: 0x0 ordinal: 0x3
  ULONG ReleaseMessage : 1;         // offset: 0x0 ordinal: 0x4
  ULONG SharedQuota : 1;            // offset: 0x0 ordinal: 0x5
  ULONG ReplyWaitReply : 1;         // offset: 0x0 ordinal: 0x6
  ULONG OwnerPortReference : 1;     // offset: 0x0 ordinal: 0x7
  ULONG ReserveReference : 1;       // offset: 0x0 ordinal: 0x8
  ULONG ReceiverReference : 1;      // offset: 0x0 ordinal: 0x9
  ULONG ViewAttributeRetrieved : 1; // offset: 0x0 ordinal: 0xa
  ULONG InDispatch : 1;             // offset: 0x0 ordinal: 0xb
} __anon_1558;

// 0x4 bytes (sizeof)
typedef union __anon_1552 {
  struct __anon_1558 s1; // offset: 0x0 ordinal: 0x0
  ULONG State;           // offset: 0x0 ordinal: 0x1
} __anon_1552;

// 0x4 bytes (sizeof)
typedef struct __anon_1547 {
  ULONG Initialized : 1;          // offset: 0x0 ordinal: 0x0
  ULONG Type : 2;                 // offset: 0x0 ordinal: 0x1
  ULONG ConnectionPending : 1;    // offset: 0x0 ordinal: 0x2
  ULONG ConnectionRefused : 1;    // offset: 0x0 ordinal: 0x3
  ULONG Disconnected : 1;         // offset: 0x0 ordinal: 0x4
  ULONG Closed : 1;               // offset: 0x0 ordinal: 0x5
  ULONG NoFlushOnClose : 1;       // offset: 0x0 ordinal: 0x6
  ULONG ReturnExtendedInfo : 1;   // offset: 0x0 ordinal: 0x7
  ULONG Waitable : 1;             // offset: 0x0 ordinal: 0x8
  ULONG DynamicSecurity : 1;      // offset: 0x0 ordinal: 0x9
  ULONG Wow64CompletionList : 1;  // offset: 0x0 ordinal: 0xa
  ULONG Lpc : 1;                  // offset: 0x0 ordinal: 0xb
  ULONG LpcToLpc : 1;             // offset: 0x0 ordinal: 0xc
  ULONG HasCompletionList : 1;    // offset: 0x0 ordinal: 0xd
  ULONG HadCompletionList : 1;    // offset: 0x0 ordinal: 0xe
  ULONG EnableCompletionList : 1; // offset: 0x0 ordinal: 0xf
} __anon_1547;

// 0x4 bytes (sizeof)
typedef union __anon_1539 {
  struct __anon_1547 s1; // offset: 0x0 ordinal: 0x0
  ULONG State;           // offset: 0x0 ordinal: 0x1
} __anon_1539;

// 0x4 bytes (sizeof)
typedef struct __anon_1523 {
  ULONG Internal : 1; // offset: 0x0 ordinal: 0x0
  ULONG Secure : 1;   // offset: 0x0 ordinal: 0x1
} __anon_1523;

// 0x4 bytes (sizeof)
typedef union __anon_1524 {
  struct __anon_1523 s1; // offset: 0x0 ordinal: 0x0
} __anon_1524;

// 0x8 bytes (sizeof)
typedef struct _BLOB_COUNTERS {
  ULONG CreatedObjects; // offset: 0x0 ordinal: 0x0
  ULONG DeletedObjects; // offset: 0x4 ordinal: 0x1
} _BLOB_COUNTERS;

// 0x8 bytes (sizeof)
typedef struct _ALPC_MESSAGE_ATTRIBUTES {
  ULONG AllocatedAttributes; // offset: 0x0 ordinal: 0x0
  ULONG ValidAttributes;     // offset: 0x4 ordinal: 0x1
} _ALPC_MESSAGE_ATTRIBUTES;

// 0x4 bytes (sizeof)
typedef union __anon_1510 {
  struct __anon_1509 s2; // offset: 0x0 ordinal: 0x0
  ULONG ZeroInit;        // offset: 0x0 ordinal: 0x1
} __anon_1510;

// 0x4 bytes (sizeof)
typedef union __anon_1508 {
  struct __anon_1507 s1; // offset: 0x0 ordinal: 0x0
  ULONG Length;          // offset: 0x0 ordinal: 0x1
} __anon_1508;

// 0x10 bytes (sizeof)
typedef struct _HEAP_EXTENDED_ENTRY {
  VOID *Reserved;               // offset: 0x0 ordinal: 0x0
  USHORT FunctionIndex;         // offset: 0x8 ordinal: 0x1
  USHORT ContextValue;          // offset: 0xa ordinal: 0x2
  ULONG InterceptorValue;       // offset: 0x8 ordinal: 0x3
  USHORT UnusedBytesLength;     // offset: 0xc ordinal: 0x4
  UCHAR EntryOffset;            // offset: 0xe ordinal: 0x5
  UCHAR ExtendedBlockSignature; // offset: 0xf ordinal: 0x6
} _HEAP_EXTENDED_ENTRY;

// 0x20 bytes (sizeof)
typedef struct VACB_LEVEL_ALLOCATION_LIST {
  struct _LIST_ENTRY VacbLevelList; // offset: 0x0 ordinal: 0x0
  VOID *VacbLevelWithBcbListHeads;  // offset: 0x10 ordinal: 0x1
  ULONG VacbLevelsAllocated;        // offset: 0x18 ordinal: 0x2
} VACB_LEVEL_ALLOCATION_LIST;

// 0x20 bytes (sizeof)
typedef struct _CC_ASYNC_READ_CONTEXT {
  UCHAR (*CompletionRoutine)(VOID *); // offset: 0x0 ordinal: 0x0
  VOID *Context;                      // offset: 0x8 ordinal: 0x1
  struct _MDL *Mdl;                   // offset: 0x10 ordinal: 0x2
  CHAR RequestorMode;                 // offset: 0x18 ordinal: 0x3
  ULONG NestingLevel;                 // offset: 0x1c ordinal: 0x4
} _CC_ASYNC_READ_CONTEXT;

// 0x4 bytes (sizeof)
typedef struct __anon_1469 {
  ULONG Reason; // offset: 0x0 ordinal: 0x0
} __anon_1469;

// 0x10 bytes (sizeof)
typedef struct _VACB_ARRAY_HEADER {
  ULONG VacbArrayIndex;     // offset: 0x0 ordinal: 0x0
  ULONG MappingCount;       // offset: 0x4 ordinal: 0x1
  ULONG HighestMappedIndex; // offset: 0x8 ordinal: 0x2
  ULONG Reserved;           // offset: 0xc ordinal: 0x3
} _VACB_ARRAY_HEADER;

// 0x4 bytes (sizeof)
typedef struct _PRIVATE_CACHE_MAP_FLAGS {
  ULONG DontUse : 16;           // offset: 0x0 ordinal: 0x0
  ULONG ReadAheadActive : 1;    // offset: 0x0 ordinal: 0x1
  ULONG ReadAheadEnabled : 1;   // offset: 0x0 ordinal: 0x2
  ULONG PagePriority : 3;       // offset: 0x0 ordinal: 0x3
  ULONG PipelineReadAheads : 1; // offset: 0x0 ordinal: 0x4
  ULONG Available : 10;         // offset: 0x0 ordinal: 0x5
} _PRIVATE_CACHE_MAP_FLAGS;

// 0x4 bytes (sizeof)
typedef union _POP_FX_DEVICE_STATUS {
  LONG Value;                     // offset: 0x0 ordinal: 0x0
  ULONG SystemTransition : 1;     // offset: 0x0 ordinal: 0x1
  ULONG PepD0Notify : 1;          // offset: 0x0 ordinal: 0x2
  ULONG IdleTimerOn : 1;          // offset: 0x0 ordinal: 0x3
  ULONG IgnoreIdleTimeout : 1;    // offset: 0x0 ordinal: 0x4
  ULONG IrpInUse : 1;             // offset: 0x0 ordinal: 0x5
  ULONG IrpPending : 1;           // offset: 0x0 ordinal: 0x6
  ULONG DPNRDeviceNotified : 1;   // offset: 0x0 ordinal: 0x7
  ULONG DPNRReceivedFromPep : 1;  // offset: 0x0 ordinal: 0x8
  ULONG IrpFirstPendingIndex : 1; // offset: 0x0 ordinal: 0x9
  ULONG IrpLastPendingIndex : 1;  // offset: 0x0 ordinal: 0xa
  ULONG Reserved : 22;            // offset: 0x0 ordinal: 0xb
} _POP_FX_DEVICE_STATUS;

// 0x4 bytes (sizeof)
typedef union _POP_FX_PERF_FLAGS {
  LONG Value;                    // offset: 0x0 ordinal: 0x0
  ULONG Progress : 3;            // offset: 0x0 ordinal: 0x1
  ULONG Reserved : 24;           // offset: 0x0 ordinal: 0x2
  ULONG Synchronicity : 2;       // offset: 0x0 ordinal: 0x3
  ULONG RequestPepCompleted : 1; // offset: 0x0 ordinal: 0x4
  ULONG RequestSucceeded : 1;    // offset: 0x0 ordinal: 0x5
  ULONG NestedCallback : 1;      // offset: 0x0 ordinal: 0x6
} _POP_FX_PERF_FLAGS;

// 0x8 bytes (sizeof)
typedef union _POP_FX_COMPONENT_FLAGS {
  LONG Value;                     // offset: 0x0 ordinal: 0x0
  LONG Value2;                    // offset: 0x4 ordinal: 0x1
  ULONG RefCount : 30;            // offset: 0x0 ordinal: 0x2
  ULONG Idling : 1;               // offset: 0x0 ordinal: 0x3
  ULONG Active : 1;               // offset: 0x0 ordinal: 0x4
  ULONG CriticalIdleOverride : 1; // offset: 0x4 ordinal: 0x5
  ULONG ResidentOverride : 1;     // offset: 0x4 ordinal: 0x6
  ULONG Reserved : 30;            // offset: 0x4 ordinal: 0x7
} _POP_FX_COMPONENT_FLAGS;

// 0x10 bytes (sizeof)
typedef union _CPU_INFO {
  ULONG AsUINT32[4]; // offset: 0x0 ordinal: 0x0
  ULONG Eax;         // offset: 0x0 ordinal: 0x1
  ULONG Ebx;         // offset: 0x4 ordinal: 0x2
  ULONG Ecx;         // offset: 0x8 ordinal: 0x3
  ULONG Edx;         // offset: 0xc ordinal: 0x4
} _CPU_INFO;

// 0x4 bytes (sizeof)
typedef union _PEP_ACPI_RESOURCE_FLAGS {
  ULONG AsULong;            // offset: 0x0 ordinal: 0x0
  ULONG Shared : 1;         // offset: 0x0 ordinal: 0x1
  ULONG Wake : 1;           // offset: 0x0 ordinal: 0x2
  ULONG ResourceUsage : 1;  // offset: 0x0 ordinal: 0x3
  ULONG SlaveMode : 1;      // offset: 0x0 ordinal: 0x4
  ULONG AddressingMode : 1; // offset: 0x0 ordinal: 0x5
  ULONG SharedMode : 1;     // offset: 0x0 ordinal: 0x6
  ULONG Reserved : 26;      // offset: 0x0 ordinal: 0x7
} _PEP_ACPI_RESOURCE_FLAGS;

// 0x28 bytes (sizeof)
typedef struct _PEP_ACPI_SPB_RESOURCE {
  enum _PEP_ACPI_RESOURCE_TYPE Type;          // offset: 0x0 ordinal: 0x0
  union _PEP_ACPI_RESOURCE_FLAGS Flags;       // offset: 0x4 ordinal: 0x1
  USHORT TypeSpecificFlags;                   // offset: 0x8 ordinal: 0x2
  UCHAR ResourceSourceIndex;                  // offset: 0xa ordinal: 0x3
  struct _UNICODE_STRING *ResourceSourceName; // offset: 0x10 ordinal: 0x4
  CHAR *VendorData;                           // offset: 0x18 ordinal: 0x5
  USHORT VendorDataLength;                    // offset: 0x20 ordinal: 0x6
} _PEP_ACPI_SPB_RESOURCE;

// 0x48 bytes (sizeof)
typedef struct _PEP_ACPI_GPIO_RESOURCE {
  enum _PEP_ACPI_RESOURCE_TYPE Type;           // offset: 0x0 ordinal: 0x0
  union _PEP_ACPI_RESOURCE_FLAGS Flags;        // offset: 0x4 ordinal: 0x1
  enum _KINTERRUPT_MODE InterruptType;         // offset: 0x8 ordinal: 0x2
  enum _KINTERRUPT_POLARITY InterruptPolarity; // offset: 0xc ordinal: 0x3
  enum _GPIO_PIN_CONFIG_TYPE PinConfig;        // offset: 0x10 ordinal: 0x4
  enum _GPIO_PIN_IORESTRICTION_TYPE
      IoRestrictionType;                      // offset: 0x14 ordinal: 0x5
  USHORT DriveStrength;                       // offset: 0x18 ordinal: 0x6
  USHORT DebounceTimeout;                     // offset: 0x1a ordinal: 0x7
  USHORT *PinTable;                           // offset: 0x20 ordinal: 0x8
  USHORT PinCount;                            // offset: 0x28 ordinal: 0x9
  UCHAR ResourceSourceIndex;                  // offset: 0x2a ordinal: 0xa
  struct _UNICODE_STRING *ResourceSourceName; // offset: 0x30 ordinal: 0xb
  UCHAR *VendorData;                          // offset: 0x38 ordinal: 0xc
  USHORT VendorDataLength;                    // offset: 0x40 ordinal: 0xd
} _PEP_ACPI_GPIO_RESOURCE;

// 0x38 bytes (sizeof)
typedef struct _PEP_ACPI_SPB_UART_RESOURCE {
  struct _PEP_ACPI_SPB_RESOURCE SpbCommon; // offset: 0x0 ordinal: 0x0
  ULONG BaudRate;                          // offset: 0x28 ordinal: 0x1
  USHORT RxBufferSize;                     // offset: 0x2c ordinal: 0x2
  USHORT TxBufferSize;                     // offset: 0x2e ordinal: 0x3
  UCHAR Parity;                            // offset: 0x30 ordinal: 0x4
  UCHAR LinesInUse;                        // offset: 0x31 ordinal: 0x5
} _PEP_ACPI_SPB_UART_RESOURCE;

// 0x38 bytes (sizeof)
typedef struct _PEP_ACPI_SPB_SPI_RESOURCE {
  struct _PEP_ACPI_SPB_RESOURCE SpbCommon; // offset: 0x0 ordinal: 0x0
  ULONG ConnectionSpeed;                   // offset: 0x28 ordinal: 0x1
  UCHAR DataBitLength;                     // offset: 0x2c ordinal: 0x2
  UCHAR Phase;                             // offset: 0x2d ordinal: 0x3
  UCHAR Polarity;                          // offset: 0x2e ordinal: 0x4
  USHORT DeviceSelection;                  // offset: 0x30 ordinal: 0x5
} _PEP_ACPI_SPB_SPI_RESOURCE;

// 0x30 bytes (sizeof)
typedef struct _PEP_ACPI_SPB_I2C_RESOURCE {
  struct _PEP_ACPI_SPB_RESOURCE SpbCommon; // offset: 0x0 ordinal: 0x0
  ULONG ConnectionSpeed;                   // offset: 0x28 ordinal: 0x1
  USHORT SlaveAddress;                     // offset: 0x2c ordinal: 0x2
} _PEP_ACPI_SPB_I2C_RESOURCE;

// 0x28 bytes (sizeof)
typedef struct _DBGKD_GET_VERSION32 {
  USHORT MajorVersion;            // offset: 0x0 ordinal: 0x0
  USHORT MinorVersion;            // offset: 0x2 ordinal: 0x1
  USHORT ProtocolVersion;         // offset: 0x4 ordinal: 0x2
  USHORT Flags;                   // offset: 0x6 ordinal: 0x3
  ULONG KernBase;                 // offset: 0x8 ordinal: 0x4
  ULONG PsLoadedModuleList;       // offset: 0xc ordinal: 0x5
  USHORT MachineType;             // offset: 0x10 ordinal: 0x6
  USHORT ThCallbackStack;         // offset: 0x12 ordinal: 0x7
  USHORT NextCallback;            // offset: 0x14 ordinal: 0x8
  USHORT FramePointer;            // offset: 0x16 ordinal: 0x9
  ULONG KiCallUserMode;           // offset: 0x18 ordinal: 0xa
  ULONG KeUserCallbackDispatcher; // offset: 0x1c ordinal: 0xb
  ULONG BreakpointWithStatus;     // offset: 0x20 ordinal: 0xc
  ULONG DebuggerDataList;         // offset: 0x24 ordinal: 0xd
} _DBGKD_GET_VERSION32;

// 0xc bytes (sizeof)
typedef struct _PPC_DBGKD_CONTROL_SET {
  ULONG Continue;           // offset: 0x0 ordinal: 0x0
  ULONG CurrentSymbolStart; // offset: 0x4 ordinal: 0x1
  ULONG CurrentSymbolEnd;   // offset: 0x8 ordinal: 0x2
} _PPC_DBGKD_CONTROL_SET;

// 0xc bytes (sizeof)
typedef struct _ARMCE_DBGKD_CONTROL_SET {
  ULONG Continue;           // offset: 0x0 ordinal: 0x0
  ULONG CurrentSymbolStart; // offset: 0x4 ordinal: 0x1
  ULONG CurrentSymbolEnd;   // offset: 0x8 ordinal: 0x2
} _ARMCE_DBGKD_CONTROL_SET;

// 0xc bytes (sizeof)
typedef struct _ARM_DBGKD_CONTROL_SET {
  ULONG Continue;           // offset: 0x0 ordinal: 0x0
  ULONG CurrentSymbolStart; // offset: 0x4 ordinal: 0x1
  ULONG CurrentSymbolEnd;   // offset: 0x8 ordinal: 0x2
} _ARM_DBGKD_CONTROL_SET;

// 0x10 bytes (sizeof)
typedef struct _X86_DBGKD_CONTROL_SET {
  ULONG TraceFlag;          // offset: 0x0 ordinal: 0x0
  ULONG Dr7;                // offset: 0x4 ordinal: 0x1
  ULONG CurrentSymbolStart; // offset: 0x8 ordinal: 0x2
  ULONG CurrentSymbolEnd;   // offset: 0xc ordinal: 0x3
} _X86_DBGKD_CONTROL_SET;

// 0xc bytes (sizeof)
typedef struct _DBGKD_CONTEXT_EX {
  ULONG Offset;      // offset: 0x0 ordinal: 0x0
  ULONG ByteCount;   // offset: 0x4 ordinal: 0x1
  ULONG BytesCopied; // offset: 0x8 ordinal: 0x2
} _DBGKD_CONTEXT_EX;

// 0x4 bytes (sizeof)
typedef struct _DBGKD_SWITCH_PARTITION {
  ULONG Partition; // offset: 0x0 ordinal: 0x0
} _DBGKD_SWITCH_PARTITION;

// 0x14 bytes (sizeof)
typedef struct _DBGKD_GET_SET_BUS_DATA {
  ULONG BusDataType; // offset: 0x0 ordinal: 0x0
  ULONG BusNumber;   // offset: 0x4 ordinal: 0x1
  ULONG SlotNumber;  // offset: 0x8 ordinal: 0x2
  ULONG Offset;      // offset: 0xc ordinal: 0x3
  ULONG Length;      // offset: 0x10 ordinal: 0x4
} _DBGKD_GET_SET_BUS_DATA;

// 0xc bytes (sizeof)
typedef struct _DBGKD_READ_WRITE_MSR {
  ULONG Msr;           // offset: 0x0 ordinal: 0x0
  ULONG DataValueLow;  // offset: 0x4 ordinal: 0x1
  ULONG DataValueHigh; // offset: 0x8 ordinal: 0x2
} _DBGKD_READ_WRITE_MSR;

// 0x8 bytes (sizeof)
typedef struct _DBGKD_BREAKPOINTEX {
  ULONG BreakPointCount; // offset: 0x0 ordinal: 0x0
  LONG ContinueStatus;   // offset: 0x4 ordinal: 0x1
} _DBGKD_BREAKPOINTEX;

// 0x4 bytes (sizeof)
typedef struct _DBGKD_QUERY_SPECIAL_CALLS {
  ULONG NumberOfSpecialCalls; // offset: 0x0 ordinal: 0x0
} _DBGKD_QUERY_SPECIAL_CALLS;

// 0x4 bytes (sizeof)
typedef struct _DBGKD_RESTORE_BREAKPOINT {
  ULONG BreakPointHandle; // offset: 0x0 ordinal: 0x0
} _DBGKD_RESTORE_BREAKPOINT;

// 0x4 bytes (sizeof)
typedef struct _DBGKD_SET_CONTEXT {
  ULONG ContextFlags; // offset: 0x0 ordinal: 0x0
} _DBGKD_SET_CONTEXT;

// 0x4 bytes (sizeof)
typedef struct _DBGKD_GET_CONTEXT {
  ULONG Unused; // offset: 0x0 ordinal: 0x0
} _DBGKD_GET_CONTEXT;

// 0x1c bytes (sizeof)
typedef struct _DBGKD_GET_INTERNAL_BREAKPOINT32 {
  ULONG BreakpointAddress; // offset: 0x0 ordinal: 0x0
  ULONG Flags;             // offset: 0x4 ordinal: 0x1
  ULONG Calls;             // offset: 0x8 ordinal: 0x2
  ULONG MaxCallsPerPeriod; // offset: 0xc ordinal: 0x3
  ULONG MinInstructions;   // offset: 0x10 ordinal: 0x4
  ULONG MaxInstructions;   // offset: 0x14 ordinal: 0x5
  ULONG TotalInstructions; // offset: 0x18 ordinal: 0x6
} _DBGKD_GET_INTERNAL_BREAKPOINT32;

// 0x8 bytes (sizeof)
typedef struct _DBGKD_SET_INTERNAL_BREAKPOINT32 {
  ULONG BreakpointAddress; // offset: 0x0 ordinal: 0x0
  ULONG Flags;             // offset: 0x4 ordinal: 0x1
} _DBGKD_SET_INTERNAL_BREAKPOINT32;

// 0x4 bytes (sizeof)
typedef struct _DBGKD_SET_SPECIAL_CALL32 {
  ULONG SpecialCall; // offset: 0x0 ordinal: 0x0
} _DBGKD_SET_SPECIAL_CALL32;

// 0x18 bytes (sizeof)
typedef struct _DBGKD_READ_WRITE_IO_EXTENDED32 {
  ULONG DataSize;      // offset: 0x0 ordinal: 0x0
  ULONG InterfaceType; // offset: 0x4 ordinal: 0x1
  ULONG BusNumber;     // offset: 0x8 ordinal: 0x2
  ULONG AddressSpace;  // offset: 0xc ordinal: 0x3
  ULONG IoAddress;     // offset: 0x10 ordinal: 0x4
  ULONG DataValue;     // offset: 0x14 ordinal: 0x5
} _DBGKD_READ_WRITE_IO_EXTENDED32;

// 0xc bytes (sizeof)
typedef struct _DBGKD_READ_WRITE_IO32 {
  ULONG DataSize;  // offset: 0x0 ordinal: 0x0
  ULONG IoAddress; // offset: 0x4 ordinal: 0x1
  ULONG DataValue; // offset: 0x8 ordinal: 0x2
} _DBGKD_READ_WRITE_IO32;

// 0x8 bytes (sizeof)
typedef struct _DBGKD_WRITE_BREAKPOINT32 {
  ULONG BreakPointAddress; // offset: 0x0 ordinal: 0x0
  ULONG BreakPointHandle;  // offset: 0x4 ordinal: 0x1
} _DBGKD_WRITE_BREAKPOINT32;

// 0xc bytes (sizeof)
typedef struct _DBGKD_WRITE_MEMORY32 {
  ULONG TargetBaseAddress;  // offset: 0x0 ordinal: 0x0
  ULONG TransferCount;      // offset: 0x4 ordinal: 0x1
  ULONG ActualBytesWritten; // offset: 0x8 ordinal: 0x2
} _DBGKD_WRITE_MEMORY32;

// 0xc bytes (sizeof)
typedef struct _DBGKD_READ_MEMORY32 {
  ULONG TargetBaseAddress; // offset: 0x0 ordinal: 0x0
  ULONG TransferCount;     // offset: 0x4 ordinal: 0x1
  ULONG ActualBytesRead;   // offset: 0x8 ordinal: 0x2
} _DBGKD_READ_MEMORY32;

// 0x18 bytes (sizeof)
typedef struct _DBGKD_LOAD_SYMBOLS32 {
  ULONG PathNameLength; // offset: 0x0 ordinal: 0x0
  ULONG BaseOfDll;      // offset: 0x4 ordinal: 0x1
  ULONG ProcessId;      // offset: 0x8 ordinal: 0x2
  ULONG CheckSum;       // offset: 0xc ordinal: 0x3
  ULONG SizeOfImage;    // offset: 0x10 ordinal: 0x4
  UCHAR UnloadSymbols;  // offset: 0x14 ordinal: 0x5
} _DBGKD_LOAD_SYMBOLS32;

// 0x8c bytes (sizeof)
typedef struct _X86_KTRAP_FRAME_BLUE {
  ULONG DbgEbp;               // offset: 0x0 ordinal: 0x0
  ULONG DbgEip;               // offset: 0x4 ordinal: 0x1
  ULONG DbgArgMark;           // offset: 0x8 ordinal: 0x2
  USHORT TempSegCs;           // offset: 0xc ordinal: 0x3
  UCHAR Logging;              // offset: 0xe ordinal: 0x4
  UCHAR FrameType;            // offset: 0xf ordinal: 0x5
  ULONG TempEsp;              // offset: 0x10 ordinal: 0x6
  ULONG Dr0;                  // offset: 0x14 ordinal: 0x7
  ULONG Dr1;                  // offset: 0x18 ordinal: 0x8
  ULONG Dr2;                  // offset: 0x1c ordinal: 0x9
  ULONG Dr3;                  // offset: 0x20 ordinal: 0xa
  ULONG Dr6;                  // offset: 0x24 ordinal: 0xb
  ULONG Dr7;                  // offset: 0x28 ordinal: 0xc
  ULONG SegGs;                // offset: 0x2c ordinal: 0xd
  ULONG SegEs;                // offset: 0x30 ordinal: 0xe
  ULONG SegDs;                // offset: 0x34 ordinal: 0xf
  ULONG Edx;                  // offset: 0x38 ordinal: 0x10
  ULONG Ecx;                  // offset: 0x3c ordinal: 0x11
  ULONG Eax;                  // offset: 0x40 ordinal: 0x12
  UCHAR PreviousPreviousMode; // offset: 0x44 ordinal: 0x13
  UCHAR EntropyQueueDpc;      // offset: 0x45 ordinal: 0x14
  UCHAR Reserved[2];          // offset: 0x46 ordinal: 0x15
  ULONG MxCsr;                // offset: 0x48 ordinal: 0x16
  ULONG ExceptionList;        // offset: 0x4c ordinal: 0x17
  ULONG SegFs;                // offset: 0x50 ordinal: 0x18
  ULONG Edi;                  // offset: 0x54 ordinal: 0x19
  ULONG Esi;                  // offset: 0x58 ordinal: 0x1a
  ULONG Ebx;                  // offset: 0x5c ordinal: 0x1b
  ULONG Ebp;                  // offset: 0x60 ordinal: 0x1c
  ULONG ErrCode;              // offset: 0x64 ordinal: 0x1d
  ULONG Eip;                  // offset: 0x68 ordinal: 0x1e
  ULONG SegCs;                // offset: 0x6c ordinal: 0x1f
  ULONG EFlags;               // offset: 0x70 ordinal: 0x20
  ULONG HardwareEsp;          // offset: 0x74 ordinal: 0x21
  ULONG HardwareSegSs;        // offset: 0x78 ordinal: 0x22
  ULONG V86Es;                // offset: 0x7c ordinal: 0x23
  ULONG V86Ds;                // offset: 0x80 ordinal: 0x24
  ULONG V86Fs;                // offset: 0x84 ordinal: 0x25
  ULONG V86Gs;                // offset: 0x88 ordinal: 0x26
} _X86_KTRAP_FRAME_BLUE;

// 0x8c bytes (sizeof)
typedef struct _X86_KTRAP_FRAME {
  ULONG DbgEbp;               // offset: 0x0 ordinal: 0x0
  ULONG DbgEip;               // offset: 0x4 ordinal: 0x1
  ULONG DbgArgMark;           // offset: 0x8 ordinal: 0x2
  ULONG DbgArgPointer;        // offset: 0xc ordinal: 0x3
  ULONG TempSegCs;            // offset: 0x10 ordinal: 0x4
  ULONG TempEsp;              // offset: 0x14 ordinal: 0x5
  ULONG Dr0;                  // offset: 0x18 ordinal: 0x6
  ULONG Dr1;                  // offset: 0x1c ordinal: 0x7
  ULONG Dr2;                  // offset: 0x20 ordinal: 0x8
  ULONG Dr3;                  // offset: 0x24 ordinal: 0x9
  ULONG Dr6;                  // offset: 0x28 ordinal: 0xa
  ULONG Dr7;                  // offset: 0x2c ordinal: 0xb
  ULONG SegGs;                // offset: 0x30 ordinal: 0xc
  ULONG SegEs;                // offset: 0x34 ordinal: 0xd
  ULONG SegDs;                // offset: 0x38 ordinal: 0xe
  ULONG Edx;                  // offset: 0x3c ordinal: 0xf
  ULONG Ecx;                  // offset: 0x40 ordinal: 0x10
  ULONG Eax;                  // offset: 0x44 ordinal: 0x11
  UCHAR PreviousPreviousMode; // offset: 0x48 ordinal: 0x12
  UCHAR EntropyQueueDpc;      // offset: 0x49 ordinal: 0x13
  UCHAR Reserved[2];          // offset: 0x4a ordinal: 0x14
  ULONG ExceptionList;        // offset: 0x4c ordinal: 0x15
  ULONG SegFs;                // offset: 0x50 ordinal: 0x16
  ULONG Edi;                  // offset: 0x54 ordinal: 0x17
  ULONG Esi;                  // offset: 0x58 ordinal: 0x18
  ULONG Ebx;                  // offset: 0x5c ordinal: 0x19
  ULONG Ebp;                  // offset: 0x60 ordinal: 0x1a
  ULONG ErrCode;              // offset: 0x64 ordinal: 0x1b
  ULONG Eip;                  // offset: 0x68 ordinal: 0x1c
  ULONG SegCs;                // offset: 0x6c ordinal: 0x1d
  ULONG EFlags;               // offset: 0x70 ordinal: 0x1e
  ULONG HardwareEsp;          // offset: 0x74 ordinal: 0x1f
  ULONG HardwareSegSs;        // offset: 0x78 ordinal: 0x20
  ULONG V86Es;                // offset: 0x7c ordinal: 0x21
  ULONG V86Ds;                // offset: 0x80 ordinal: 0x22
  ULONG V86Fs;                // offset: 0x84 ordinal: 0x23
  ULONG V86Gs;                // offset: 0x88 ordinal: 0x24
} _X86_KTRAP_FRAME;

// 0x10 bytes (sizeof)
typedef struct _PNP_ASSIGN_RESOURCES_CONTEXT {
  ULONG IncludeFailedDevices;           // offset: 0x0 ordinal: 0x0
  ULONG DeviceCount;                    // offset: 0x4 ordinal: 0x1
  struct _DEVICE_OBJECT *DeviceList[1]; // offset: 0x8 ordinal: 0x2
} _PNP_ASSIGN_RESOURCES_CONTEXT;

typedef VOID (*__anon_1316)(VOID *, ULONG, UCHAR, VOID *);

// 0x8 bytes (sizeof)
typedef struct __anon_1306 {
  ULONG NotificationCode; // offset: 0x0 ordinal: 0x0
  ULONG NotificationData; // offset: 0x4 ordinal: 0x1
} __anon_1306;

// 0x8 bytes (sizeof)
typedef struct _POP_FX_DEPENDENT {
  ULONG Index;         // offset: 0x0 ordinal: 0x0
  ULONG ProviderIndex; // offset: 0x4 ordinal: 0x1
} _POP_FX_DEPENDENT;

// 0x8 bytes (sizeof)
typedef struct _POP_FX_PROVIDER {
  ULONG Index;      // offset: 0x0 ordinal: 0x0
  UCHAR Activating; // offset: 0x4 ordinal: 0x1
} _POP_FX_PROVIDER;

typedef ULONG (*__anon_1297)(VOID *);

typedef ULONG (*__anon_1296)(VOID *, enum PROFILE_DEPARTURE_STYLE);

// 0x30 bytes (sizeof)
typedef struct DOCK_INTERFACE {
  USHORT Size;                          // offset: 0x0 ordinal: 0x0
  USHORT Version;                       // offset: 0x2 ordinal: 0x1
  VOID *Context;                        // offset: 0x8 ordinal: 0x2
  VOID (*InterfaceReference)(VOID *);   // offset: 0x10 ordinal: 0x3
  VOID (*InterfaceDereference)(VOID *); // offset: 0x18 ordinal: 0x4
  ULONG(*ProfileDepartureSetMode)
  (VOID *, enum PROFILE_DEPARTURE_STYLE);  // offset: 0x20 ordinal: 0x5
  ULONG (*ProfileDepartureUpdate)(VOID *); // offset: 0x28 ordinal: 0x6
} DOCK_INTERFACE;

typedef VOID (*__anon_1274)(VOID *, ULONG, UCHAR);

typedef VOID (*__anon_1272)(VOID *, ULONG, ULONG);

typedef UCHAR (*__anon_1266)(struct PEPHANDLE__ *, ULONG, VOID *);

typedef UCHAR (*__anon_1265)(ULONG, VOID *);

// 0x68 bytes (sizeof)
typedef struct _PO_DEVICE_NOTIFY {
  struct _LIST_ENTRY Link;             // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY PowerChildren;    // offset: 0x10 ordinal: 0x1
  struct _LIST_ENTRY PowerParents;     // offset: 0x20 ordinal: 0x2
  struct _DEVICE_OBJECT *TargetDevice; // offset: 0x30 ordinal: 0x3
  UCHAR OrderLevel;                    // offset: 0x38 ordinal: 0x4
  struct _DEVICE_OBJECT *DeviceObject; // offset: 0x40 ordinal: 0x5
  USHORT *DeviceName;                  // offset: 0x48 ordinal: 0x6
  USHORT *DriverName;                  // offset: 0x50 ordinal: 0x7
  ULONG ChildCount;                    // offset: 0x58 ordinal: 0x8
  ULONG ActiveChild;                   // offset: 0x5c ordinal: 0x9
  ULONG ParentCount;                   // offset: 0x60 ordinal: 0xa
  ULONG ActiveParent;                  // offset: 0x64 ordinal: 0xb
} _PO_DEVICE_NOTIFY;

// 0x10 bytes (sizeof)
typedef struct __anon_1271 {
  struct _PO_DEVICE_NOTIFY *NotifyDevice; // offset: 0x0 ordinal: 0x0
  UCHAR FxDeviceActivated;                // offset: 0x8 ordinal: 0x1
} __anon_1271;

// 0x10 bytes (sizeof)
typedef struct _DEVICE_RELATIONS {
  ULONG Count;                       // offset: 0x0 ordinal: 0x0
  struct _DEVICE_OBJECT *Objects[1]; // offset: 0x8 ordinal: 0x1
} _DEVICE_RELATIONS;

// 0x8 bytes (sizeof)
typedef union __anon_1215 {
  struct _DEVICE_NODE *LegacyDeviceNode;            // offset: 0x0 ordinal: 0x0
  struct _DEVICE_RELATIONS *PendingDeviceRelations; // offset: 0x0 ordinal: 0x1
  VOID *Information;                                // offset: 0x0 ordinal: 0x2
} __anon_1215;

// 0x8 bytes (sizeof)
typedef struct _STRING32 {
  USHORT Length;        // offset: 0x0 ordinal: 0x0
  USHORT MaximumLength; // offset: 0x2 ordinal: 0x1
  ULONG Buffer;         // offset: 0x4 ordinal: 0x2
} _STRING32;

// 0x8 bytes (sizeof)
typedef struct _CLIENT_ID32 {
  ULONG UniqueProcess; // offset: 0x0 ordinal: 0x0
  ULONG UniqueThread;  // offset: 0x4 ordinal: 0x1
} _CLIENT_ID32;

// 0x18 bytes (sizeof)
typedef struct _PORT_MESSAGE32 {
  union __anon_1508 u1; // offset: 0x0 ordinal: 0x0
  union __anon_1510 u2; // offset: 0x4 ordinal: 0x1
  union {
    struct _CLIENT_ID32 ClientId; // offset: 0x8 ordinal: 0x2
    double DoNotUseThisField;     // offset: 0x8 ordinal: 0x3
  };
  ULONG MessageId; // offset: 0x10 ordinal: 0x4
  union {
    ULONG ClientViewSize; // offset: 0x14 ordinal: 0x5
    ULONG CallbackId;     // offset: 0x14 ordinal: 0x6
  };
} _PORT_MESSAGE32;

// 0x1c bytes (sizeof)
typedef struct _NT_TIB32 {
  ULONG ExceptionList; // offset: 0x0 ordinal: 0x0
  ULONG StackBase;     // offset: 0x4 ordinal: 0x1
  ULONG StackLimit;    // offset: 0x8 ordinal: 0x2
  ULONG SubSystemTib;  // offset: 0xc ordinal: 0x3
  union {
    ULONG FiberData; // offset: 0x10 ordinal: 0x4
    ULONG Version;   // offset: 0x10 ordinal: 0x5
  };
  ULONG ArbitraryUserPointer; // offset: 0x14 ordinal: 0x6
  ULONG Self;                 // offset: 0x18 ordinal: 0x7
} _NT_TIB32;

// 0xc bytes (sizeof)
typedef struct _THERMAL_ZONE_COUNTERS {
  ULONG Temperature;     // offset: 0x0 ordinal: 0x0
  ULONG ThrottleLimit;   // offset: 0x4 ordinal: 0x1
  ULONG ThrottleReasons; // offset: 0x8 ordinal: 0x2
} _THERMAL_ZONE_COUNTERS;

// 0xb8 bytes (sizeof)
typedef struct _SYNCH_COUNTERS {
  ULONG SpinLockAcquireCount;                   // offset: 0x0 ordinal: 0x0
  ULONG SpinLockContentionCount;                // offset: 0x4 ordinal: 0x1
  ULONG SpinLockSpinCount;                      // offset: 0x8 ordinal: 0x2
  ULONG IpiSendRequestBroadcastCount;           // offset: 0xc ordinal: 0x3
  ULONG IpiSendRequestRoutineCount;             // offset: 0x10 ordinal: 0x4
  ULONG IpiSendSoftwareInterruptCount;          // offset: 0x14 ordinal: 0x5
  ULONG ExInitializeResourceCount;              // offset: 0x18 ordinal: 0x6
  ULONG ExReInitializeResourceCount;            // offset: 0x1c ordinal: 0x7
  ULONG ExDeleteResourceCount;                  // offset: 0x20 ordinal: 0x8
  ULONG ExecutiveResourceAcquiresCount;         // offset: 0x24 ordinal: 0x9
  ULONG ExecutiveResourceContentionsCount;      // offset: 0x28 ordinal: 0xa
  ULONG ExecutiveResourceReleaseExclusiveCount; // offset: 0x2c ordinal: 0xb
  ULONG ExecutiveResourceReleaseSharedCount;    // offset: 0x30 ordinal: 0xc
  ULONG ExecutiveResourceConvertsCount;         // offset: 0x34 ordinal: 0xd
  ULONG ExAcqResExclusiveAttempts;              // offset: 0x38 ordinal: 0xe
  ULONG ExAcqResExclusiveAcquiresExclusive;     // offset: 0x3c ordinal: 0xf
  ULONG
  ExAcqResExclusiveAcquiresExclusiveRecursive; // offset: 0x40 ordinal: 0x10
  ULONG ExAcqResExclusiveWaits;                // offset: 0x44 ordinal: 0x11
  ULONG ExAcqResExclusiveNotAcquires;          // offset: 0x48 ordinal: 0x12
  ULONG ExAcqResSharedAttempts;                // offset: 0x4c ordinal: 0x13
  ULONG ExAcqResSharedAcquiresExclusive;       // offset: 0x50 ordinal: 0x14
  ULONG ExAcqResSharedAcquiresShared;          // offset: 0x54 ordinal: 0x15
  ULONG ExAcqResSharedAcquiresSharedRecursive; // offset: 0x58 ordinal: 0x16
  ULONG ExAcqResSharedWaits;                   // offset: 0x5c ordinal: 0x17
  ULONG ExAcqResSharedNotAcquires;             // offset: 0x60 ordinal: 0x18
  ULONG ExAcqResSharedStarveExclusiveAttempts; // offset: 0x64 ordinal: 0x19
  ULONG ExAcqResSharedStarveExclusiveAcquiresExclusive; // offset: 0x68 ordinal:
                                                        // 0x1a
  ULONG
  ExAcqResSharedStarveExclusiveAcquiresShared; // offset: 0x6c ordinal: 0x1b
  ULONG ExAcqResSharedStarveExclusiveAcquiresSharedRecursive; // offset: 0x70
                                                              // ordinal: 0x1c
  ULONG ExAcqResSharedStarveExclusiveWaits;       // offset: 0x74 ordinal: 0x1d
  ULONG ExAcqResSharedStarveExclusiveNotAcquires; // offset: 0x78 ordinal: 0x1e
  ULONG ExAcqResSharedWaitForExclusiveAttempts;   // offset: 0x7c ordinal: 0x1f
  ULONG ExAcqResSharedWaitForExclusiveAcquiresExclusive; // offset: 0x80
                                                         // ordinal: 0x20
  ULONG ExAcqResSharedWaitForExclusiveAcquiresShared; // offset: 0x84 ordinal:
                                                      // 0x21
  ULONG ExAcqResSharedWaitForExclusiveAcquiresSharedRecursive; // offset: 0x88
                                                               // ordinal: 0x22
  ULONG ExAcqResSharedWaitForExclusiveWaits;       // offset: 0x8c ordinal: 0x23
  ULONG ExAcqResSharedWaitForExclusiveNotAcquires; // offset: 0x90 ordinal: 0x24
  ULONG ExSetResOwnerPointerExclusive;             // offset: 0x94 ordinal: 0x25
  ULONG ExSetResOwnerPointerSharedNew;             // offset: 0x98 ordinal: 0x26
  ULONG ExSetResOwnerPointerSharedOld;             // offset: 0x9c ordinal: 0x27
  ULONG ExTryToAcqExclusiveAttempts;               // offset: 0xa0 ordinal: 0x28
  ULONG ExTryToAcqExclusiveAcquires;               // offset: 0xa4 ordinal: 0x29
  ULONG ExBoostExclusiveOwner;                     // offset: 0xa8 ordinal: 0x2a
  ULONG ExBoostSharedOwners;                       // offset: 0xac ordinal: 0x2b
  ULONG ExEtwSynchTrackingNotificationsCount;      // offset: 0xb0 ordinal: 0x2c
  ULONG ExEtwSynchTrackingNotificationsAccountedCount; // offset: 0xb4 ordinal:
                                                       // 0x2d
} _SYNCH_COUNTERS;

// 0x10 bytes (sizeof)
typedef struct _PCW_DATA {
  VOID *Data; // offset: 0x0 ordinal: 0x0
  ULONG Size; // offset: 0x8 ordinal: 0x1
} _PCW_DATA;

// 0x4 bytes (sizeof)
typedef struct __anon_1163 {
  ULONG FileOffset; // offset: 0x0 ordinal: 0x0
} __anon_1163;

// 0x4 bytes (sizeof)
typedef union __anon_1162 {
  ULONG UserData; // offset: 0x0 ordinal: 0x0
  ULONG Next;     // offset: 0x0 ordinal: 0x1
} __anon_1162;

// 0x4 bytes (sizeof)
typedef struct __anon_1161 {
  union __anon_1162 u; // offset: 0x0 ordinal: 0x0
} __anon_1161;

// 0x4 bytes (sizeof)
typedef union __anon_1160 {
  struct __anon_1161 NewCell; // offset: 0x0 ordinal: 0x0
} __anon_1160;

// 0x8 bytes (sizeof)
typedef struct _HCELL {
  LONG Size;           // offset: 0x0 ordinal: 0x0
  union __anon_1160 u; // offset: 0x4 ordinal: 0x1
} _HCELL;

// 0x18 bytes (sizeof)
typedef struct CMP_OFFSET_ARRAY {
  ULONG FileOffset; // offset: 0x0 ordinal: 0x0
  VOID *DataBuffer; // offset: 0x8 ordinal: 0x1
  ULONG DataLength; // offset: 0x10 ordinal: 0x2
} CMP_OFFSET_ARRAY;

// 0x4 bytes (sizeof)
typedef struct _HV_GET_CELL_CONTEXT {
  union {
    ULONG Cell;            // offset: 0x0 ordinal: 0x0
    ULONG IsInTempBin : 1; // offset: 0x0 ordinal: 0x1
  };
  ULONG Reserved : 31; // offset: 0x0 ordinal: 0x2
} _HV_GET_CELL_CONTEXT;

typedef VOID *(*__anon_1122)(ULONG, UCHAR, ULONG);

// 0x14 bytes (sizeof)
typedef struct _SECURITY_DESCRIPTOR_RELATIVE {
  UCHAR Revision; // offset: 0x0 ordinal: 0x0
  UCHAR Sbz1;     // offset: 0x1 ordinal: 0x1
  USHORT Control; // offset: 0x2 ordinal: 0x2
  ULONG Owner;    // offset: 0x4 ordinal: 0x3
  ULONG Group;    // offset: 0x8 ordinal: 0x4
  ULONG Sacl;     // offset: 0xc ordinal: 0x5
  ULONG Dacl;     // offset: 0x10 ordinal: 0x6
} _SECURITY_DESCRIPTOR_RELATIVE;

// 0x38 bytes (sizeof)
typedef struct _CM_KEY_SECURITY_CACHE {
  ULONG Cell;                                      // offset: 0x0 ordinal: 0x0
  ULONG ConvKey;                                   // offset: 0x4 ordinal: 0x1
  struct _LIST_ENTRY List;                         // offset: 0x8 ordinal: 0x2
  ULONG DescriptorLength;                          // offset: 0x18 ordinal: 0x3
  ULONG RealRefCount;                              // offset: 0x1c ordinal: 0x4
  struct _SECURITY_DESCRIPTOR_RELATIVE Descriptor; // offset: 0x20 ordinal: 0x5
} _CM_KEY_SECURITY_CACHE;

// 0x10 bytes (sizeof)
typedef struct _CM_KEY_SECURITY_CACHE_ENTRY {
  ULONG Cell;                                    // offset: 0x0 ordinal: 0x0
  struct _CM_KEY_SECURITY_CACHE *CachedSecurity; // offset: 0x8 ordinal: 0x1
} _CM_KEY_SECURITY_CACHE_ENTRY;

// 0x8 bytes (sizeof)
typedef struct _CHILD_LIST {
  ULONG Count; // offset: 0x0 ordinal: 0x0
  ULONG List;  // offset: 0x4 ordinal: 0x1
} _CHILD_LIST;

// 0x8 bytes (sizeof)
typedef struct _CM_BIG_DATA {
  USHORT Signature; // offset: 0x0 ordinal: 0x0
  USHORT Count;     // offset: 0x2 ordinal: 0x1
  ULONG List;       // offset: 0x4 ordinal: 0x2
} _CM_BIG_DATA;

// 0x28 bytes (sizeof)
typedef struct _CM_KEY_SECURITY {
  USHORT Signature;                                // offset: 0x0 ordinal: 0x0
  USHORT Reserved;                                 // offset: 0x2 ordinal: 0x1
  ULONG Flink;                                     // offset: 0x4 ordinal: 0x2
  ULONG Blink;                                     // offset: 0x8 ordinal: 0x3
  ULONG ReferenceCount;                            // offset: 0xc ordinal: 0x4
  ULONG DescriptorLength;                          // offset: 0x10 ordinal: 0x5
  struct _SECURITY_DESCRIPTOR_RELATIVE Descriptor; // offset: 0x14 ordinal: 0x6
} _CM_KEY_SECURITY;

// 0x18 bytes (sizeof)
typedef struct _CM_KEY_VALUE {
  USHORT Signature;  // offset: 0x0 ordinal: 0x0
  USHORT NameLength; // offset: 0x2 ordinal: 0x1
  ULONG DataLength;  // offset: 0x4 ordinal: 0x2
  ULONG Data;        // offset: 0x8 ordinal: 0x3
  ULONG Type;        // offset: 0xc ordinal: 0x4
  USHORT Flags;      // offset: 0x10 ordinal: 0x5
  USHORT Spare;      // offset: 0x12 ordinal: 0x6
  WCHAR Name[1];     // offset: 0x14 ordinal: 0x7
} _CM_KEY_VALUE;

// 0x18 bytes (sizeof)
typedef struct __anon_1095 {
  ULONG Action; // offset: 0x0 ordinal: 0x0
  VOID *Handle; // offset: 0x8 ordinal: 0x1
  LONG Status;  // offset: 0x10 ordinal: 0x2
} __anon_1095;

// 0xc bytes (sizeof)
typedef struct __anon_1093 {
  enum _CM_LOAD_FAILURE_TYPE Failure; // offset: 0x0 ordinal: 0x0
  LONG Status;                        // offset: 0x4 ordinal: 0x1
  ULONG Point;                        // offset: 0x8 ordinal: 0x2
} __anon_1093;

// 0x8 bytes (sizeof)
typedef struct _MI_CACHED_PTE {
  ULONG GlobalTimeStamp; // offset: 0x0 ordinal: 0x0
  ULONG PteIndex;        // offset: 0x4 ordinal: 0x1
  LONGLONG Long;         // offset: 0x0 ordinal: 0x2
} _MI_CACHED_PTE;

// 0x48 bytes (sizeof)
typedef struct _MI_CACHED_PTES {
  struct _MI_CACHED_PTE Bins[8]; // offset: 0x0 ordinal: 0x0
  LONG CachedPteCount;           // offset: 0x40 ordinal: 0x1
} _MI_CACHED_PTES;

// 0x4 bytes (sizeof)
typedef struct _EX_PUSH_LOCK_AUTO_EXPAND_STATE {
  ULONG Expanded : 1;      // offset: 0x0 ordinal: 0x0
  ULONG Transitioning : 1; // offset: 0x0 ordinal: 0x1
  ULONG Pageable : 1;      // offset: 0x0 ordinal: 0x2
  ULONG Value;             // offset: 0x0 ordinal: 0x3
} _EX_PUSH_LOCK_AUTO_EXPAND_STATE;

// 0x10 bytes (sizeof)
typedef struct _GUID {
  ULONG Data1;    // offset: 0x0 ordinal: 0x0
  USHORT Data2;   // offset: 0x4 ordinal: 0x1
  USHORT Data3;   // offset: 0x6 ordinal: 0x2
  UCHAR Data4[8]; // offset: 0x8 ordinal: 0x3
} _GUID;

// 0x4 bytes (sizeof)
typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS {
  ULONG Primary : 1;              // offset: 0x0 ordinal: 0x0
  ULONG ContainmentWarning : 1;   // offset: 0x0 ordinal: 0x1
  ULONG Reset : 1;                // offset: 0x0 ordinal: 0x2
  ULONG ThresholdExceeded : 1;    // offset: 0x0 ordinal: 0x3
  ULONG ResourceNotAvailable : 1; // offset: 0x0 ordinal: 0x4
  ULONG LatentError : 1;          // offset: 0x0 ordinal: 0x5
  ULONG Reserved : 26;            // offset: 0x0 ordinal: 0x6
  ULONG AsULONG;                  // offset: 0x0 ordinal: 0x7
} _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS;

// 0x4 bytes (sizeof)
typedef union _WHEA_ERROR_RECORD_HEADER_FLAGS {
  ULONG Recovered : 1;     // offset: 0x0 ordinal: 0x0
  ULONG PreviousError : 1; // offset: 0x0 ordinal: 0x1
  ULONG Simulated : 1;     // offset: 0x0 ordinal: 0x2
  ULONG Reserved : 29;     // offset: 0x0 ordinal: 0x3
  ULONG AsULONG;           // offset: 0x0 ordinal: 0x4
} _WHEA_ERROR_RECORD_HEADER_FLAGS;

// 0x4 bytes (sizeof)
typedef union _WHEA_ERROR_RECORD_HEADER_VALIDBITS {
  ULONG PlatformId : 1;  // offset: 0x0 ordinal: 0x0
  ULONG Timestamp : 1;   // offset: 0x0 ordinal: 0x1
  ULONG PartitionId : 1; // offset: 0x0 ordinal: 0x2
  ULONG Reserved : 29;   // offset: 0x0 ordinal: 0x3
  ULONG AsULONG;         // offset: 0x0 ordinal: 0x4
} _WHEA_ERROR_RECORD_HEADER_VALIDBITS;

// 0x4 bytes (sizeof)
typedef union _WHEA_ERROR_PACKET_FLAGS {
  ULONG PreviousError : 1;           // offset: 0x0 ordinal: 0x0
  ULONG Reserved1 : 1;               // offset: 0x0 ordinal: 0x1
  ULONG HypervisorError : 1;         // offset: 0x0 ordinal: 0x2
  ULONG Simulated : 1;               // offset: 0x0 ordinal: 0x3
  ULONG PlatformPfaControl : 1;      // offset: 0x0 ordinal: 0x4
  ULONG PlatformDirectedOffline : 1; // offset: 0x0 ordinal: 0x5
  ULONG Reserved2 : 26;              // offset: 0x0 ordinal: 0x6
  ULONG AsULONG;                     // offset: 0x0 ordinal: 0x7
} _WHEA_ERROR_PACKET_FLAGS;

// 0x4 bytes (sizeof)
typedef struct __anon_1031 {
  ULONG FilePointerIndex : 9; // offset: 0x0 ordinal: 0x0
  ULONG HardFault : 1;        // offset: 0x0 ordinal: 0x1
  ULONG Spare1 : 2;           // offset: 0x0 ordinal: 0x2
} __anon_1031;

// 0x4 bytes (sizeof)
typedef struct __anon_1030 {
  ULONG FilePointerIndex : 9; // offset: 0x0 ordinal: 0x0
  ULONG HardFault : 1;        // offset: 0x0 ordinal: 0x1
  ULONG Image : 1;            // offset: 0x0 ordinal: 0x2
  ULONG Spare0 : 1;           // offset: 0x0 ordinal: 0x3
} __anon_1030;

// 0x4 bytes (sizeof)
typedef union _MM_PAGE_ACCESS_INFO_FLAGS {
  struct __anon_1030 File;    // offset: 0x0 ordinal: 0x0
  struct __anon_1031 Private; // offset: 0x0 ordinal: 0x1
} _MM_PAGE_ACCESS_INFO_FLAGS;

// 0x10 bytes (sizeof)
typedef struct _IO_PRIORITY_INFO {
  ULONG Size;                        // offset: 0x0 ordinal: 0x0
  ULONG ThreadPriority;              // offset: 0x4 ordinal: 0x1
  ULONG PagePriority;                // offset: 0x8 ordinal: 0x2
  enum _IO_PRIORITY_HINT IoPriority; // offset: 0xc ordinal: 0x3
} _IO_PRIORITY_INFO;

// 0x18 bytes (sizeof)
typedef struct _ECP_LIST {
  ULONG Signature;            // offset: 0x0 ordinal: 0x0
  ULONG Flags;                // offset: 0x4 ordinal: 0x1
  struct _LIST_ENTRY EcpList; // offset: 0x8 ordinal: 0x2
} _ECP_LIST;

// 0x20 bytes (sizeof)
typedef struct _IO_DRIVER_CREATE_CONTEXT {
  SHORT Size;                                 // offset: 0x0 ordinal: 0x0
  struct _ECP_LIST *ExtraCreateParameter;     // offset: 0x8 ordinal: 0x1
  VOID *DeviceObjectHint;                     // offset: 0x10 ordinal: 0x2
  struct _TXN_PARAMETER_BLOCK *TxnParameters; // offset: 0x18 ordinal: 0x3
} _IO_DRIVER_CREATE_CONTEXT;

// 0x8 bytes (sizeof)
typedef struct _OBJECT_HANDLE_INFORMATION {
  ULONG HandleAttributes; // offset: 0x0 ordinal: 0x0
  ULONG GrantedAccess;    // offset: 0x4 ordinal: 0x1
} _OBJECT_HANDLE_INFORMATION;

// 0x10 bytes (sizeof)
typedef struct _GENERIC_MAPPING {
  ULONG GenericRead;    // offset: 0x0 ordinal: 0x0
  ULONG GenericWrite;   // offset: 0x4 ordinal: 0x1
  ULONG GenericExecute; // offset: 0x8 ordinal: 0x2
  ULONG GenericAll;     // offset: 0xc ordinal: 0x3
} _GENERIC_MAPPING;

// 0x4 bytes (sizeof)
typedef struct __anon_989 {
  ULONG ChannelsHotCold : 1; // offset: 0x0 ordinal: 0x0
  ULONG Spare : 31;          // offset: 0x0 ordinal: 0x1
} __anon_989;

// 0x20 bytes (sizeof)
typedef struct _MI_AVAILABLE_PAGE_WAIT_STATES {
  struct _KEVENT Event; // offset: 0x0 ordinal: 0x0
  ULONG EventSets;      // offset: 0x18 ordinal: 0x1
} _MI_AVAILABLE_PAGE_WAIT_STATES;

// 0x4 bytes (sizeof)
typedef struct _MI_PARTITION_FLAGS {
  ULONG BeingDeleted : 1;      // offset: 0x0 ordinal: 0x0
  ULONG ObjectInitialized : 1; // offset: 0x0 ordinal: 0x1
} _MI_PARTITION_FLAGS;

// 0x50 bytes (sizeof)
typedef struct _MI_PARTITION_STATISTICS {
  ULONG DeleteYield;                  // offset: 0x0 ordinal: 0x0
  ULONG DeleteBad;                    // offset: 0x4 ordinal: 0x1
  ULONG DeleteTrulyBad;               // offset: 0x8 ordinal: 0x2
  ULONG DeleteLargePage;              // offset: 0xc ordinal: 0x3
  ULONG DeleteLargePageRetry;         // offset: 0x10 ordinal: 0x4
  ULONG DeleteZeroFree;               // offset: 0x14 ordinal: 0x5
  ULONG DeleteTransition;             // offset: 0x18 ordinal: 0x6
  ULONG DeleteStandbyReferenced;      // offset: 0x1c ordinal: 0x7
  ULONG DeleteStandbyRelinkFailed;    // offset: 0x20 ordinal: 0x8
  ULONG DeleteStandbySharedPagefile;  // offset: 0x24 ordinal: 0x9
  ULONG DeleteStandbySharedFile;      // offset: 0x28 ordinal: 0xa
  ULONG DeleteModifiedReferenced;     // offset: 0x2c ordinal: 0xb
  ULONG DeleteModified;               // offset: 0x30 ordinal: 0xc
  ULONG DeleteModifiedNoWrite;        // offset: 0x34 ordinal: 0xd
  ULONG DeleteModifiedSharedPagefile; // offset: 0x38 ordinal: 0xe
  ULONG DeleteModifiedSharedFile;     // offset: 0x3c ordinal: 0xf
  ULONG DeleteActiveSharedPagefile1;  // offset: 0x40 ordinal: 0x10
  ULONG DeleteActiveSharedPagefile2;  // offset: 0x44 ordinal: 0x11
  ULONG DeleteActiveSharedFile;       // offset: 0x48 ordinal: 0x12
  ULONG DeleteWriteDelay;             // offset: 0x4c ordinal: 0x13
} _MI_PARTITION_STATISTICS;

// 0x4 bytes (sizeof)
typedef union __anon_939 {
  ULONG LongFlags;                  // offset: 0x0 ordinal: 0x0
  struct _MI_PARTITION_FLAGS Flags; // offset: 0x0 ordinal: 0x1
} __anon_939;

// 0x4 bytes (sizeof)
typedef struct _MODWRITER_FLAGS {
  ULONG KeepForever : 1;        // offset: 0x0 ordinal: 0x0
  ULONG Networked : 1;          // offset: 0x0 ordinal: 0x1
  ULONG IoPriority : 3;         // offset: 0x0 ordinal: 0x2
  ULONG ModifiedStoreWrite : 1; // offset: 0x0 ordinal: 0x3
} _MODWRITER_FLAGS;

// 0x8 bytes (sizeof)
typedef struct _MI_EXTRA_IMAGE_INFORMATION {
  ULONG SizeOfHeaders; // offset: 0x0 ordinal: 0x0
  ULONG SizeOfImage;   // offset: 0x4 ordinal: 0x1
} _MI_EXTRA_IMAGE_INFORMATION;

// 0x28 bytes (sizeof)
typedef struct _MI_CONTROL_AREA_WAIT_BLOCK {
  struct _MI_CONTROL_AREA_WAIT_BLOCK *Next; // offset: 0x0 ordinal: 0x0
  ULONG WaitReason;                         // offset: 0x8 ordinal: 0x1
  ULONG WaitResponse;                       // offset: 0xc ordinal: 0x2
  struct _KGATE Gate;                       // offset: 0x10 ordinal: 0x3
} _MI_CONTROL_AREA_WAIT_BLOCK;

// 0x4 bytes (sizeof)
typedef struct _MMSECTION_FLAGS2 {
  ULONG PartitionId : 10;        // offset: 0x0 ordinal: 0x0
  ULONG NumberOfChildViews : 22; // offset: 0x0 ordinal: 0x1
} _MMSECTION_FLAGS2;

// 0x4 bytes (sizeof)
typedef union __anon_889 {
  struct _MMINPAGE_FLAGS e1; // offset: 0x0 ordinal: 0x0
  ULONG LongFlags;           // offset: 0x0 ordinal: 0x1
} __anon_889;

// 0x4 bytes (sizeof)
typedef union __anon_888 {
  ULONG ImagePteOffset; // offset: 0x0 ordinal: 0x0
  ULONG TossPage;       // offset: 0x0 ordinal: 0x1
} __anon_888;

// 0x4 bytes (sizeof)
typedef struct _MMSECURE_FLAGS {
  ULONG ReadOnly : 1;            // offset: 0x0 ordinal: 0x0
  ULONG ReadWrite : 1;           // offset: 0x0 ordinal: 0x1
  ULONG SecNoChange : 1;         // offset: 0x0 ordinal: 0x2
  ULONG NoDelete : 1;            // offset: 0x0 ordinal: 0x3
  ULONG RequiresPteReversal : 1; // offset: 0x0 ordinal: 0x4
  ULONG ExclusiveSecure : 1;     // offset: 0x0 ordinal: 0x5
  ULONG Spare : 6;               // offset: 0x0 ordinal: 0x6
} _MMSECURE_FLAGS;

// 0x4 bytes (sizeof)
typedef union __anon_885 {
  ULONG ReferenceCount;     // offset: 0x0 ordinal: 0x0
  ULONG NumberOfPtesToFree; // offset: 0x0 ordinal: 0x1
} __anon_885;

// 0x4 bytes (sizeof)
typedef union __anon_881 {
  ULONG LongFlags;                // offset: 0x0 ordinal: 0x0
  struct _MMSECTION_FLAGS2 Flags; // offset: 0x0 ordinal: 0x1
} __anon_881;

// 0x4 bytes (sizeof)
typedef union __anon_880 {
  ULONG LongFlags;               // offset: 0x0 ordinal: 0x0
  struct _MMSECTION_FLAGS Flags; // offset: 0x0 ordinal: 0x1
} __anon_880;

// 0x8 bytes (sizeof)
typedef union __anon_876 {
  struct _MMSECURE_FLAGS Flags; // offset: 0x0 ordinal: 0x0
  ULONG FlagsLong;              // offset: 0x0 ordinal: 0x1
  VOID *StartVa;                // offset: 0x0 ordinal: 0x2
} __anon_876;

// 0x10 bytes (sizeof)
typedef struct _MMADDRESS_LIST {
  union __anon_876 u1; // offset: 0x0 ordinal: 0x0
  VOID *EndVa;         // offset: 0x8 ordinal: 0x1
} _MMADDRESS_LIST;

// 0xc bytes (sizeof)
typedef struct __anon_855 {
  ULONG DataSize;  // offset: 0x0 ordinal: 0x0
  ULONG Reserved1; // offset: 0x4 ordinal: 0x1
  ULONG Reserved2; // offset: 0x8 ordinal: 0x2
} __anon_855;

// 0xc bytes (sizeof)
typedef struct __anon_854 {
  ULONG Start;    // offset: 0x0 ordinal: 0x0
  ULONG Length;   // offset: 0x4 ordinal: 0x1
  ULONG Reserved; // offset: 0x8 ordinal: 0x2
} __anon_854;

// 0xc bytes (sizeof)
typedef struct __anon_853 {
  ULONG Channel;       // offset: 0x0 ordinal: 0x0
  ULONG RequestLine;   // offset: 0x4 ordinal: 0x1
  UCHAR TransferWidth; // offset: 0x8 ordinal: 0x2
  UCHAR Reserved1;     // offset: 0x9 ordinal: 0x3
  UCHAR Reserved2;     // offset: 0xa ordinal: 0x4
  UCHAR Reserved3;     // offset: 0xb ordinal: 0x5
} __anon_853;

// 0xc bytes (sizeof)
typedef struct __anon_852 {
  ULONG Channel;   // offset: 0x0 ordinal: 0x0
  ULONG Port;      // offset: 0x4 ordinal: 0x1
  ULONG Reserved1; // offset: 0x8 ordinal: 0x2
} __anon_852;

// 0x4 bytes (sizeof)
typedef union __anon_845 {
  ULONG NumberOfChildViews; // offset: 0x0 ordinal: 0x0
} __anon_845;

// 0x4 bytes (sizeof)
typedef union __anon_844 {
  ULONG LongFlags;                            // offset: 0x0 ordinal: 0x0
  struct _MMSUBSECTION_FLAGS SubsectionFlags; // offset: 0x0 ordinal: 0x1
} __anon_844;

// 0x4 bytes (sizeof)
typedef struct _MMVAD_FLAGS1 {
  ULONG CommitCharge : 31; // offset: 0x0 ordinal: 0x0
  ULONG MemCommit : 1;     // offset: 0x0 ordinal: 0x1
} _MMVAD_FLAGS1;

// 0x4 bytes (sizeof)
typedef struct _MMVAD_FLAGS {
  ULONG VadType : 3;          // offset: 0x0 ordinal: 0x0
  ULONG Protection : 5;       // offset: 0x0 ordinal: 0x1
  ULONG PreferredNode : 6;    // offset: 0x0 ordinal: 0x2
  ULONG NoChange : 1;         // offset: 0x0 ordinal: 0x3
  ULONG PrivateMemory : 1;    // offset: 0x0 ordinal: 0x4
  ULONG Teb : 1;              // offset: 0x0 ordinal: 0x5
  ULONG PrivateFixup : 1;     // offset: 0x0 ordinal: 0x6
  ULONG ManySubsections : 1;  // offset: 0x0 ordinal: 0x7
  ULONG Spare : 12;           // offset: 0x0 ordinal: 0x8
  ULONG DeleteInProgress : 1; // offset: 0x0 ordinal: 0x9
} _MMVAD_FLAGS;

// 0xc bytes (sizeof)
typedef struct __anon_836 {
  UCHAR Class;      // offset: 0x0 ordinal: 0x0
  UCHAR Type;       // offset: 0x1 ordinal: 0x1
  UCHAR Reserved1;  // offset: 0x2 ordinal: 0x2
  UCHAR Reserved2;  // offset: 0x3 ordinal: 0x3
  ULONG IdLowPart;  // offset: 0x4 ordinal: 0x4
  ULONG IdHighPart; // offset: 0x8 ordinal: 0x5
} __anon_836;

// 0xc bytes (sizeof)
typedef struct __anon_832 {
  ULONG Priority;  // offset: 0x0 ordinal: 0x0
  ULONG Reserved1; // offset: 0x4 ordinal: 0x1
  ULONG Reserved2; // offset: 0x8 ordinal: 0x2
} __anon_832;

// 0x10 bytes (sizeof)
typedef struct __anon_831 {
  ULONG Length;       // offset: 0x0 ordinal: 0x0
  ULONG MinBusNumber; // offset: 0x4 ordinal: 0x1
  ULONG MaxBusNumber; // offset: 0x8 ordinal: 0x2
  ULONG Reserved;     // offset: 0xc ordinal: 0x3
} __anon_831;

// 0x10 bytes (sizeof)
typedef struct __anon_829 {
  ULONG RequestLine;   // offset: 0x0 ordinal: 0x0
  ULONG Reserved;      // offset: 0x4 ordinal: 0x1
  ULONG Channel;       // offset: 0x8 ordinal: 0x2
  ULONG TransferWidth; // offset: 0xc ordinal: 0x3
} __anon_829;

// 0x8 bytes (sizeof)
typedef struct __anon_828 {
  ULONG MinimumChannel; // offset: 0x0 ordinal: 0x0
  ULONG MaximumChannel; // offset: 0x4 ordinal: 0x1
} __anon_828;

// 0x4 bytes (sizeof)
typedef struct _MMVAD_FLAGS2 {
  ULONG FileOffset : 24;        // offset: 0x0 ordinal: 0x0
  ULONG Large : 1;              // offset: 0x0 ordinal: 0x1
  ULONG TrimBehind : 1;         // offset: 0x0 ordinal: 0x2
  ULONG Inherit : 1;            // offset: 0x0 ordinal: 0x3
  ULONG CopyOnWrite : 1;        // offset: 0x0 ordinal: 0x4
  ULONG NoValidationNeeded : 1; // offset: 0x0 ordinal: 0x5
  ULONG PrivateDemandZero : 1;  // offset: 0x0 ordinal: 0x6
  ULONG Spare : 2;              // offset: 0x0 ordinal: 0x7
} _MMVAD_FLAGS2;

// 0x4 bytes (sizeof)
typedef union __anon_818 {
  ULONG LongFlags1;               // offset: 0x0 ordinal: 0x0
  struct _MMVAD_FLAGS1 VadFlags1; // offset: 0x0 ordinal: 0x1
} __anon_818;

// 0x4 bytes (sizeof)
typedef union __anon_817 {
  ULONG LongFlags;              // offset: 0x0 ordinal: 0x0
  struct _MMVAD_FLAGS VadFlags; // offset: 0x0 ordinal: 0x1
} __anon_817;

// 0x4 bytes (sizeof)
typedef union __anon_808 {
  ULONG LongFlags2;               // offset: 0x0 ordinal: 0x0
  struct _MMVAD_FLAGS2 VadFlags2; // offset: 0x0 ordinal: 0x1
} __anon_808;

// 0x4 bytes (sizeof)
typedef struct _HANDLE_TABLE_ENTRY_INFO {
  ULONG AuditMask; // offset: 0x0 ordinal: 0x0
} _HANDLE_TABLE_ENTRY_INFO;

// 0x10 bytes (sizeof)
typedef struct _FS_FILTER_SECTION_SYNC_OUTPUT {
  ULONG StructureSize;        // offset: 0x0 ordinal: 0x0
  ULONG SizeReturned;         // offset: 0x4 ordinal: 0x1
  ULONG Flags;                // offset: 0x8 ordinal: 0x2
  ULONG DesiredReadAlignment; // offset: 0xc ordinal: 0x3
} _FS_FILTER_SECTION_SYNC_OUTPUT;

// 0xc bytes (sizeof)
typedef struct _SECURITY_QUALITY_OF_SERVICE {
  ULONG Length; // offset: 0x0 ordinal: 0x0
  enum _SECURITY_IMPERSONATION_LEVEL
      ImpersonationLevel;    // offset: 0x4 ordinal: 0x1
  UCHAR ContextTrackingMode; // offset: 0x8 ordinal: 0x2
  UCHAR EffectiveOnly;       // offset: 0x9 ordinal: 0x3
} _SECURITY_QUALITY_OF_SERVICE;

// 0x40 bytes (sizeof)
typedef struct _OBJECT_CREATE_INFORMATION {
  ULONG Attributes;                                 // offset: 0x0 ordinal: 0x0
  VOID *RootDirectory;                              // offset: 0x8 ordinal: 0x1
  CHAR ProbeMode;                                   // offset: 0x10 ordinal: 0x2
  ULONG PagedPoolCharge;                            // offset: 0x14 ordinal: 0x3
  ULONG NonPagedPoolCharge;                         // offset: 0x18 ordinal: 0x4
  ULONG SecurityDescriptorCharge;                   // offset: 0x1c ordinal: 0x5
  VOID *SecurityDescriptor;                         // offset: 0x20 ordinal: 0x6
  struct _SECURITY_QUALITY_OF_SERVICE *SecurityQos; // offset: 0x28 ordinal: 0x7
  struct _SECURITY_QUALITY_OF_SERVICE
      SecurityQualityOfService; // offset: 0x30 ordinal: 0x8
} _OBJECT_CREATE_INFORMATION;

// 0xc bytes (sizeof)
typedef struct _IMAGE_RUNTIME_FUNCTION_ENTRY {
  ULONG BeginAddress; // offset: 0x0 ordinal: 0x0
  ULONG EndAddress;   // offset: 0x4 ordinal: 0x1
  union {
    ULONG UnwindInfoAddress; // offset: 0x8 ordinal: 0x2
    ULONG UnwindData;        // offset: 0x8 ordinal: 0x3
  };
} _IMAGE_RUNTIME_FUNCTION_ENTRY;

// 0xa0 bytes (sizeof)
typedef struct _HANDLE_TRACE_DB_ENTRY {
  struct _CLIENT_ID ClientId; // offset: 0x0 ordinal: 0x0
  VOID *Handle;               // offset: 0x10 ordinal: 0x1
  ULONG Type;                 // offset: 0x18 ordinal: 0x2
  VOID *StackTrace[16];       // offset: 0x20 ordinal: 0x3
} _HANDLE_TRACE_DB_ENTRY;

// 0x10 bytes (sizeof)
typedef struct __anon_769 {
  enum _FS_FILTER_SECTION_SYNC_TYPE SyncType; // offset: 0x0 ordinal: 0x0
  ULONG PageProtection;                       // offset: 0x4 ordinal: 0x1
  struct _FS_FILTER_SECTION_SYNC_OUTPUT
      *OutputInformation; // offset: 0x8 ordinal: 0x2
} __anon_769;

// 0x24 bytes (sizeof)
typedef struct _ETW_FILTER_PID {
  ULONG Count;   // offset: 0x0 ordinal: 0x0
  ULONG Pids[8]; // offset: 0x4 ordinal: 0x1
} _ETW_FILTER_PID;

// 0x20 bytes (sizeof)
typedef struct _PERFINFO_GROUPMASK {
  ULONG Masks[8]; // offset: 0x0 ordinal: 0x0
} _PERFINFO_GROUPMASK;

// 0xc bytes (sizeof)
typedef struct _POWER_SEQUENCE {
  ULONG SequenceD1; // offset: 0x0 ordinal: 0x0
  ULONG SequenceD2; // offset: 0x4 ordinal: 0x1
  ULONG SequenceD3; // offset: 0x8 ordinal: 0x2
} _POWER_SEQUENCE;

// 0x8 bytes (sizeof)
typedef struct __anon_667 {
  struct _POWER_SEQUENCE *PowerSequence; // offset: 0x0 ordinal: 0x0
} __anon_667;

// 0x40 bytes (sizeof)
typedef struct _DEVICE_CAPABILITIES {
  USHORT Size;                             // offset: 0x0 ordinal: 0x0
  USHORT Version;                          // offset: 0x2 ordinal: 0x1
  ULONG DeviceD1 : 1;                      // offset: 0x4 ordinal: 0x2
  ULONG DeviceD2 : 1;                      // offset: 0x4 ordinal: 0x3
  ULONG LockSupported : 1;                 // offset: 0x4 ordinal: 0x4
  ULONG EjectSupported : 1;                // offset: 0x4 ordinal: 0x5
  ULONG Removable : 1;                     // offset: 0x4 ordinal: 0x6
  ULONG DockDevice : 1;                    // offset: 0x4 ordinal: 0x7
  ULONG UniqueID : 1;                      // offset: 0x4 ordinal: 0x8
  ULONG SilentInstall : 1;                 // offset: 0x4 ordinal: 0x9
  ULONG RawDeviceOK : 1;                   // offset: 0x4 ordinal: 0xa
  ULONG SurpriseRemovalOK : 1;             // offset: 0x4 ordinal: 0xb
  ULONG WakeFromD0 : 1;                    // offset: 0x4 ordinal: 0xc
  ULONG WakeFromD1 : 1;                    // offset: 0x4 ordinal: 0xd
  ULONG WakeFromD2 : 1;                    // offset: 0x4 ordinal: 0xe
  ULONG WakeFromD3 : 1;                    // offset: 0x4 ordinal: 0xf
  ULONG HardwareDisabled : 1;              // offset: 0x4 ordinal: 0x10
  ULONG NonDynamic : 1;                    // offset: 0x4 ordinal: 0x11
  ULONG WarmEjectSupported : 1;            // offset: 0x4 ordinal: 0x12
  ULONG NoDisplayInUI : 1;                 // offset: 0x4 ordinal: 0x13
  ULONG Reserved1 : 1;                     // offset: 0x4 ordinal: 0x14
  ULONG WakeFromInterrupt : 1;             // offset: 0x4 ordinal: 0x15
  ULONG Reserved : 12;                     // offset: 0x4 ordinal: 0x16
  ULONG Address;                           // offset: 0x8 ordinal: 0x17
  ULONG UINumber;                          // offset: 0xc ordinal: 0x18
  enum _DEVICE_POWER_STATE DeviceState[7]; // offset: 0x10 ordinal: 0x19
  enum _SYSTEM_POWER_STATE SystemWake;     // offset: 0x2c ordinal: 0x1a
  enum _DEVICE_POWER_STATE DeviceWake;     // offset: 0x30 ordinal: 0x1b
  ULONG D1Latency;                         // offset: 0x34 ordinal: 0x1c
  ULONG D2Latency;                         // offset: 0x38 ordinal: 0x1d
  ULONG D3Latency;                         // offset: 0x3c ordinal: 0x1e
} _DEVICE_CAPABILITIES;

// 0x8 bytes (sizeof)
typedef struct __anon_659 {
  struct _DEVICE_CAPABILITIES *Capabilities; // offset: 0x0 ordinal: 0x0
} __anon_659;

// 0x4 bytes (sizeof)
typedef struct _SYSTEM_POWER_STATE_CONTEXT {
  ULONG Reserved1 : 8;             // offset: 0x0 ordinal: 0x0
  ULONG TargetSystemState : 4;     // offset: 0x0 ordinal: 0x1
  ULONG EffectiveSystemState : 4;  // offset: 0x0 ordinal: 0x2
  ULONG CurrentSystemState : 4;    // offset: 0x0 ordinal: 0x3
  ULONG IgnoreHibernationPath : 1; // offset: 0x0 ordinal: 0x4
  ULONG PseudoTransition : 1;      // offset: 0x0 ordinal: 0x5
  ULONG Reserved2 : 10;            // offset: 0x0 ordinal: 0x6
  ULONG ContextAsUlong;            // offset: 0x0 ordinal: 0x7
} _SYSTEM_POWER_STATE_CONTEXT;

// 0x8 bytes (sizeof)
typedef struct _JOBOBJECT_WAKE_FILTER {
  ULONG HighEdgeFilter; // offset: 0x0 ordinal: 0x0
  ULONG LowEdgeFilter;  // offset: 0x4 ordinal: 0x1
} _JOBOBJECT_WAKE_FILTER;

// 0x20 bytes (sizeof)
typedef struct __anon_668 {
  union {
    ULONG SystemContext; // offset: 0x0 ordinal: 0x0
    struct _SYSTEM_POWER_STATE_CONTEXT
        SystemPowerStateContext; // offset: 0x0 ordinal: 0x1
  };
  enum _POWER_STATE_TYPE Type;    // offset: 0x8 ordinal: 0x2
  union _POWER_STATE State;       // offset: 0x10 ordinal: 0x3
  enum POWER_ACTION ShutdownType; // offset: 0x18 ordinal: 0x4
} __anon_668;

// 0x10 bytes (sizeof)
typedef struct __anon_664 {
  enum DEVICE_TEXT_TYPE DeviceTextType; // offset: 0x0 ordinal: 0x0
  ULONG LocaleId;                       // offset: 0x8 ordinal: 0x1
} __anon_664;

// 0x20 bytes (sizeof)
typedef struct __anon_661 {
  ULONG WhichSpace; // offset: 0x0 ordinal: 0x0
  VOID *Buffer;     // offset: 0x8 ordinal: 0x1
  ULONG Offset;     // offset: 0x10 ordinal: 0x2
  ULONG Length;     // offset: 0x18 ordinal: 0x3
} __anon_661;

// 0x10 bytes (sizeof)
typedef struct __anon_653 {
  ULONG SecurityInformation; // offset: 0x0 ordinal: 0x0
  VOID *SecurityDescriptor;  // offset: 0x8 ordinal: 0x1
} __anon_653;

// 0x10 bytes (sizeof)
typedef struct __anon_652 {
  ULONG SecurityInformation; // offset: 0x0 ordinal: 0x0
  ULONG Length;              // offset: 0x8 ordinal: 0x1
} __anon_652;

// 0x20 bytes (sizeof)
typedef struct __anon_651 {
  ULONG OutputBufferLength; // offset: 0x0 ordinal: 0x0
  ULONG InputBufferLength;  // offset: 0x8 ordinal: 0x1
  ULONG IoControlCode;      // offset: 0x10 ordinal: 0x2
  VOID *Type3InputBuffer;   // offset: 0x18 ordinal: 0x3
} __anon_651;

// 0x20 bytes (sizeof)
typedef struct __anon_649 {
  ULONG OutputBufferLength; // offset: 0x0 ordinal: 0x0
  ULONG InputBufferLength;  // offset: 0x8 ordinal: 0x1
  ULONG FsControlCode;      // offset: 0x10 ordinal: 0x2
  VOID *Type3InputBuffer;   // offset: 0x18 ordinal: 0x3
} __anon_649;

// 0x10 bytes (sizeof)
typedef struct __anon_648 {
  ULONG Length;                         // offset: 0x0 ordinal: 0x0
  enum _FSINFOCLASS FsInformationClass; // offset: 0x8 ordinal: 0x1
} __anon_648;

// 0x4 bytes (sizeof)
typedef struct __anon_647 {
  ULONG Length; // offset: 0x0 ordinal: 0x0
} __anon_647;

// 0x20 bytes (sizeof)
typedef struct __anon_646 {
  ULONG Length;       // offset: 0x0 ordinal: 0x0
  VOID *EaList;       // offset: 0x8 ordinal: 0x1
  ULONG EaListLength; // offset: 0x10 ordinal: 0x2
  ULONG EaIndex;      // offset: 0x18 ordinal: 0x3
} __anon_646;

// 0x20 bytes (sizeof)
typedef struct __anon_645 {
  ULONG Length;                                      // offset: 0x0 ordinal: 0x0
  enum _FILE_INFORMATION_CLASS FileInformationClass; // offset: 0x8 ordinal: 0x1
  struct _FILE_OBJECT *FileObject; // offset: 0x10 ordinal: 0x2
  UCHAR ReplaceIfExists;           // offset: 0x18 ordinal: 0x3
  UCHAR AdvanceOnly;               // offset: 0x19 ordinal: 0x4
  union {
    ULONG ClusterCount; // offset: 0x18 ordinal: 0x5
    VOID *DeleteHandle; // offset: 0x18 ordinal: 0x6
  };
} __anon_645;

// 0x10 bytes (sizeof)
typedef struct __anon_644 {
  ULONG Length;                                      // offset: 0x0 ordinal: 0x0
  enum _FILE_INFORMATION_CLASS FileInformationClass; // offset: 0x8 ordinal: 0x1
} __anon_644;

// 0x10 bytes (sizeof)
typedef struct __anon_643 {
  ULONG Length;           // offset: 0x0 ordinal: 0x0
  ULONG CompletionFilter; // offset: 0x8 ordinal: 0x1
} __anon_643;

// 0x20 bytes (sizeof)
typedef struct __anon_642 {
  ULONG Length;                     // offset: 0x0 ordinal: 0x0
  struct _UNICODE_STRING *FileName; // offset: 0x8 ordinal: 0x1
  enum _FILE_INFORMATION_CLASS
      FileInformationClass; // offset: 0x10 ordinal: 0x2
  ULONG FileIndex;          // offset: 0x18 ordinal: 0x3
} __anon_642;

// 0x10 bytes (sizeof)
typedef struct _PO_DIAG_STACK_RECORD {
  ULONG StackDepth; // offset: 0x0 ordinal: 0x0
  VOID *Stack[1];   // offset: 0x8 ordinal: 0x1
} _PO_DIAG_STACK_RECORD;

// 0x8 bytes (sizeof)
typedef struct __anon_587 {
  ULONG IdleTime;    // offset: 0x0 ordinal: 0x0
  ULONG NonIdleTime; // offset: 0x4 ordinal: 0x1
} __anon_587;

// 0x8 bytes (sizeof)
typedef union __anon_558 {
  struct __anon_587 Disk; // offset: 0x0 ordinal: 0x0
} __anon_558;

// 0x18 bytes (sizeof)
typedef struct _KDEVICE_QUEUE_ENTRY {
  struct _LIST_ENTRY DeviceListEntry; // offset: 0x0 ordinal: 0x0
  ULONG SortKey;                      // offset: 0x10 ordinal: 0x1
  UCHAR Inserted;                     // offset: 0x14 ordinal: 0x2
} _KDEVICE_QUEUE_ENTRY;

// 0x60 bytes (sizeof)
typedef struct _VPB {
  SHORT Type;                          // offset: 0x0 ordinal: 0x0
  SHORT Size;                          // offset: 0x2 ordinal: 0x1
  USHORT Flags;                        // offset: 0x4 ordinal: 0x2
  USHORT VolumeLabelLength;            // offset: 0x6 ordinal: 0x3
  struct _DEVICE_OBJECT *DeviceObject; // offset: 0x8 ordinal: 0x4
  struct _DEVICE_OBJECT *RealDevice;   // offset: 0x10 ordinal: 0x5
  ULONG SerialNumber;                  // offset: 0x18 ordinal: 0x6
  ULONG ReferenceCount;                // offset: 0x1c ordinal: 0x7
  WCHAR VolumeLabel[32];               // offset: 0x20 ordinal: 0x8
} _VPB;

// 0x10 bytes (sizeof)
typedef struct __anon_654 {
  struct _VPB *Vpb;                    // offset: 0x0 ordinal: 0x0
  struct _DEVICE_OBJECT *DeviceObject; // offset: 0x8 ordinal: 0x1
} __anon_654;

// 0x20 bytes (sizeof)
typedef struct __anon_658 {
  struct _GUID *InterfaceType;  // offset: 0x0 ordinal: 0x0
  USHORT Size;                  // offset: 0x8 ordinal: 0x1
  USHORT Version;               // offset: 0xa ordinal: 0x2
  struct _INTERFACE *Interface; // offset: 0x10 ordinal: 0x3
  VOID *InterfaceSpecificData;  // offset: 0x18 ordinal: 0x4
} __anon_658;

// 0x2b0 bytes (sizeof)
typedef struct _KPRIQUEUE {
  struct _DISPATCHER_HEADER Header;     // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY EntryListHead[32]; // offset: 0x18 ordinal: 0x1
  LONG CurrentCount[32];                // offset: 0x218 ordinal: 0x2
  ULONG MaximumCount;                   // offset: 0x298 ordinal: 0x3
  struct _LIST_ENTRY ThreadListHead;    // offset: 0x2a0 ordinal: 0x4
} _KPRIQUEUE;

// 0x2b0 bytes (sizeof)
typedef struct _TRIAGE_EX_WORK_QUEUE {
  struct _KPRIQUEUE WorkPriQueue; // offset: 0x0 ordinal: 0x0
} _TRIAGE_EX_WORK_QUEUE;

// 0x20 bytes (sizeof)
typedef struct _TRIAGE_9F_POWER {
  USHORT Signature;                               // offset: 0x0 ordinal: 0x0
  USHORT Revision;                                // offset: 0x2 ordinal: 0x1
  struct _LIST_ENTRY *IrpList;                    // offset: 0x8 ordinal: 0x2
  struct _LIST_ENTRY *ThreadList;                 // offset: 0x10 ordinal: 0x3
  struct _TRIAGE_EX_WORK_QUEUE *DelayedWorkQueue; // offset: 0x18 ordinal: 0x4
} _TRIAGE_9F_POWER;

// 0x18 bytes (sizeof)
typedef struct _TRIAGE_9F_PNP {
  USHORT Signature; // offset: 0x0 ordinal: 0x0
  USHORT Revision;  // offset: 0x2 ordinal: 0x1
  struct _TRIAGE_PNP_DEVICE_COMPLETION_QUEUE
      *CompletionQueue;                           // offset: 0x8 ordinal: 0x2
  struct _TRIAGE_EX_WORK_QUEUE *DelayedWorkQueue; // offset: 0x10 ordinal: 0x3
} _TRIAGE_9F_PNP;

// 0x2d0 bytes (sizeof)
typedef struct _EX_WORK_QUEUE {
  struct _KPRIQUEUE WorkPriQueue;   // offset: 0x0 ordinal: 0x0
  struct _ENODE *Node;              // offset: 0x2b0 ordinal: 0x1
  ULONG WorkItemsProcessed;         // offset: 0x2b8 ordinal: 0x2
  ULONG WorkItemsProcessedLastPass; // offset: 0x2bc ordinal: 0x3
  LONG ThreadCount;                 // offset: 0x2c0 ordinal: 0x4
  LONG MinThreads : 31;             // offset: 0x2c4 ordinal: 0x5
  ULONG TryFailed : 1;              // offset: 0x2c4 ordinal: 0x6
  LONG MaxThreads;                  // offset: 0x2c8 ordinal: 0x7
  enum _EXQUEUEINDEX QueueIndex;    // offset: 0x2cc ordinal: 0x8
} _EX_WORK_QUEUE;

// 0x18 bytes (sizeof)
typedef struct _EXT_DELETE_PARAMETERS {
  ULONG Version;                  // offset: 0x0 ordinal: 0x0
  ULONG Reserved;                 // offset: 0x4 ordinal: 0x1
  VOID (*DeleteCallback)(VOID *); // offset: 0x8 ordinal: 0x2
  VOID *DeleteContext;            // offset: 0x10 ordinal: 0x3
} _EXT_DELETE_PARAMETERS;

// 0x10 bytes (sizeof)
typedef struct _EXT_SET_PARAMETERS_V0 {
  ULONG Version;            // offset: 0x0 ordinal: 0x0
  ULONG Reserved;           // offset: 0x4 ordinal: 0x1
  LONGLONG NoWakeTolerance; // offset: 0x8 ordinal: 0x2
} _EXT_SET_PARAMETERS_V0;

// 0x4 bytes (sizeof)
typedef struct _SINGLE_LIST_ENTRY32 {
  ULONG Next; // offset: 0x0 ordinal: 0x0
} _SINGLE_LIST_ENTRY32;

// 0x4 bytes (sizeof)
typedef struct _KFLOATING_SAVE {
  ULONG Dummy; // offset: 0x0 ordinal: 0x0
} _KFLOATING_SAVE;

// 0x18 bytes (sizeof)
typedef struct _PPM_VETO_ENTRY {
  struct _LIST_ENTRY Link; // offset: 0x0 ordinal: 0x0
  ULONG VetoReason;        // offset: 0x10 ordinal: 0x1
  ULONG ReferenceCount;    // offset: 0x14 ordinal: 0x2
} _PPM_VETO_ENTRY;

// 0x28 bytes (sizeof)
typedef struct _PPM_VETO_ACCOUNTING {
  LONG VetoPresent;                             // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY VetoListHead;              // offset: 0x8 ordinal: 0x1
  ULONG PreallocatedVetoCount;                  // offset: 0x18 ordinal: 0x2
  struct _PPM_VETO_ENTRY *PreallocatedVetoList; // offset: 0x20 ordinal: 0x3
} _PPM_VETO_ACCOUNTING;

// 0x8 bytes (sizeof)
typedef struct _PROCESSOR_IDLE_DEPENDENCY {
  ULONG ProcessorIndex;    // offset: 0x0 ordinal: 0x0
  UCHAR ExpectedState;     // offset: 0x4 ordinal: 0x1
  UCHAR AllowDeeperStates; // offset: 0x5 ordinal: 0x2
  UCHAR LooseDependency;   // offset: 0x6 ordinal: 0x3
} _PROCESSOR_IDLE_DEPENDENCY;

typedef VOID (*__anon_396)(VOID *, ULONG);

// 0x38 bytes (sizeof)
typedef struct _THERMAL_COOLING_INTERFACE {
  USHORT Size;                           // offset: 0x0 ordinal: 0x0
  USHORT Version;                        // offset: 0x2 ordinal: 0x1
  VOID *Context;                         // offset: 0x8 ordinal: 0x2
  VOID (*InterfaceReference)(VOID *);    // offset: 0x10 ordinal: 0x3
  VOID (*InterfaceDereference)(VOID *);  // offset: 0x18 ordinal: 0x4
  ULONG Flags;                           // offset: 0x20 ordinal: 0x5
  VOID (*ActiveCooling)(VOID *, UCHAR);  // offset: 0x28 ordinal: 0x6
  VOID (*PassiveCooling)(VOID *, ULONG); // offset: 0x30 ordinal: 0x7
} _THERMAL_COOLING_INTERFACE;

typedef ULONG (*__anon_394)(VOID *, ULONG);

typedef ULONG (*__anon_393)(VOID *, ULONG, ULONG);

// 0x38 bytes (sizeof)
typedef struct _FAST_MUTEX {
  LONG Count;           // offset: 0x0 ordinal: 0x0
  VOID *Owner;          // offset: 0x8 ordinal: 0x1
  ULONG Contention;     // offset: 0x10 ordinal: 0x2
  struct _KEVENT Event; // offset: 0x18 ordinal: 0x3
  ULONG OldIrql;        // offset: 0x30 ordinal: 0x4
} _FAST_MUTEX;

// 0x88 bytes (sizeof)
typedef struct _PNP_DEVICE_EVENT_LIST {
  LONG Status;                     // offset: 0x0 ordinal: 0x0
  struct _KMUTANT EventQueueMutex; // offset: 0x8 ordinal: 0x1
  struct _FAST_MUTEX Lock;         // offset: 0x40 ordinal: 0x2
  struct _LIST_ENTRY List;         // offset: 0x78 ordinal: 0x3
} _PNP_DEVICE_EVENT_LIST;

// 0xf0 bytes (sizeof)
typedef struct _HANDLE_TRACE_DEBUG_INFO {
  LONG RefCount;                            // offset: 0x0 ordinal: 0x0
  ULONG TableSize;                          // offset: 0x4 ordinal: 0x1
  ULONG BitMaskFlags;                       // offset: 0x8 ordinal: 0x2
  struct _FAST_MUTEX CloseCompactionLock;   // offset: 0x10 ordinal: 0x3
  ULONG CurrentStackIndex;                  // offset: 0x48 ordinal: 0x4
  struct _HANDLE_TRACE_DB_ENTRY TraceDb[1]; // offset: 0x50 ordinal: 0x5
} _HANDLE_TRACE_DEBUG_INFO;

// 0x40 bytes (sizeof)
typedef struct _KQUEUE {
  struct _DISPATCHER_HEADER Header;  // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY EntryListHead;  // offset: 0x18 ordinal: 0x1
  ULONG CurrentCount;                // offset: 0x28 ordinal: 0x2
  ULONG MaximumCount;                // offset: 0x2c ordinal: 0x3
  struct _LIST_ENTRY ThreadListHead; // offset: 0x30 ordinal: 0x4
} _KQUEUE;

// 0x48 bytes (sizeof)
typedef struct _ETW_REPLY_QUEUE {
  struct _KQUEUE Queue; // offset: 0x0 ordinal: 0x0
  LONG EventsLost;      // offset: 0x40 ordinal: 0x1
} _ETW_REPLY_QUEUE;

// 0x30 bytes (sizeof)
typedef struct _KWAIT_BLOCK {
  struct _LIST_ENTRY WaitListEntry; // offset: 0x0 ordinal: 0x0
  UCHAR WaitType;                   // offset: 0x10 ordinal: 0x1
  UCHAR BlockState;                 // offset: 0x11 ordinal: 0x2
  USHORT WaitKey;                   // offset: 0x12 ordinal: 0x3
  LONG SpareLong;                   // offset: 0x14 ordinal: 0x4
  union {
    struct _KTHREAD *Thread;           // offset: 0x18 ordinal: 0x5
    struct _KQUEUE *NotificationQueue; // offset: 0x18 ordinal: 0x6
  };
  VOID *Object;   // offset: 0x20 ordinal: 0x7
  VOID *SparePtr; // offset: 0x28 ordinal: 0x8
} _KWAIT_BLOCK;

// 0x8 bytes (sizeof)
typedef struct _KSCHEDULING_GROUP_POLICY {
  union {
    ULONG Value;    // offset: 0x0 ordinal: 0x0
    USHORT Weight;  // offset: 0x0 ordinal: 0x1
    USHORT MinRate; // offset: 0x0 ordinal: 0x2
  };
  USHORT MaxRate; // offset: 0x2 ordinal: 0x3
  union {
    ULONG AllFlags; // offset: 0x4 ordinal: 0x4
    ULONG Type : 1; // offset: 0x4 ordinal: 0x5
  };
  ULONG Disabled : 1; // offset: 0x4 ordinal: 0x6
  ULONG Spare1 : 30;  // offset: 0x4 ordinal: 0x7
} _KSCHEDULING_GROUP_POLICY;

// 0x10 bytes (sizeof)
typedef struct _PPM_SELECTION_MENU {
  ULONG Count;                               // offset: 0x0 ordinal: 0x0
  struct _PPM_SELECTION_MENU_ENTRY *Entries; // offset: 0x8 ordinal: 0x1
} _PPM_SELECTION_MENU;

// 0x18 bytes (sizeof)
typedef struct _PPM_SELECTION_DEPENDENCY {
  ULONG Processor;                 // offset: 0x0 ordinal: 0x0
  struct _PPM_SELECTION_MENU Menu; // offset: 0x8 ordinal: 0x1
} _PPM_SELECTION_DEPENDENCY;

// 0x18 bytes (sizeof)
typedef struct _PPM_SELECTION_MENU_ENTRY {
  UCHAR StrictDependency;                           // offset: 0x0 ordinal: 0x0
  UCHAR InitiatingState;                            // offset: 0x1 ordinal: 0x1
  UCHAR DependentState;                             // offset: 0x2 ordinal: 0x2
  ULONG StateIndex;                                 // offset: 0x4 ordinal: 0x3
  ULONG Dependencies;                               // offset: 0x8 ordinal: 0x4
  struct _PPM_SELECTION_DEPENDENCY *DependencyList; // offset: 0x10 ordinal: 0x5
} _PPM_SELECTION_MENU_ENTRY;

// 0x90 bytes (sizeof)
typedef struct _UMS_CONTROL_BLOCK {
  struct _RTL_UMS_CONTEXT *UmsContext;            // offset: 0x0 ordinal: 0x0
  struct _SINGLE_LIST_ENTRY *CompletionListEntry; // offset: 0x8 ordinal: 0x1
  struct _KEVENT *CompletionListEvent;            // offset: 0x10 ordinal: 0x2
  ULONG ServiceSequenceNumber;                    // offset: 0x18 ordinal: 0x3
  struct _KQUEUE UmsQueue;                        // offset: 0x20 ordinal: 0x4
  struct _LIST_ENTRY QueueEntry;                  // offset: 0x60 ordinal: 0x5
  struct _RTL_UMS_CONTEXT *YieldingUmsContext;    // offset: 0x70 ordinal: 0x6
  VOID *YieldingParam;                            // offset: 0x78 ordinal: 0x7
  VOID *UmsTeb;                                   // offset: 0x80 ordinal: 0x8
  struct _KQUEUE *UmsAssociatedQueue;             // offset: 0x20 ordinal: 0x9
  struct _LIST_ENTRY *UmsQueueListEntry;          // offset: 0x28 ordinal: 0xa
  struct _KEVENT UmsWaitEvent;                    // offset: 0x30 ordinal: 0xb
  VOID *StagingArea;                              // offset: 0x48 ordinal: 0xc
  ULONG UmsPrimaryDeliveredContext : 1;           // offset: 0x50 ordinal: 0xd
  ULONG UmsAssociatedQueueUsed : 1;               // offset: 0x50 ordinal: 0xe
  ULONG UmsThreadParked : 1;                      // offset: 0x50 ordinal: 0xf
  ULONG UmsFlags;                                 // offset: 0x50 ordinal: 0x10
  USHORT TebSelector;                             // offset: 0x88 ordinal: 0x11
} _UMS_CONTROL_BLOCK;

// 0x58 bytes (sizeof)
typedef struct _KAPC {
  UCHAR Type;                      // offset: 0x0 ordinal: 0x0
  UCHAR SpareByte0;                // offset: 0x1 ordinal: 0x1
  UCHAR Size;                      // offset: 0x2 ordinal: 0x2
  UCHAR SpareByte1;                // offset: 0x3 ordinal: 0x3
  ULONG SpareLong0;                // offset: 0x4 ordinal: 0x4
  struct _KTHREAD *Thread;         // offset: 0x8 ordinal: 0x5
  struct _LIST_ENTRY ApcListEntry; // offset: 0x10 ordinal: 0x6
  VOID(*KernelRoutine)
  (struct _KAPC *, VOID (**)(VOID *, VOID *, VOID *), VOID **, VOID **,
   VOID **);                                     // offset: 0x20 ordinal: 0x7
  VOID (*RundownRoutine)(struct _KAPC *);        // offset: 0x28 ordinal: 0x8
  VOID (*NormalRoutine)(VOID *, VOID *, VOID *); // offset: 0x30 ordinal: 0x9
  VOID *Reserved[3];                             // offset: 0x20 ordinal: 0xa
  VOID *NormalContext;                           // offset: 0x38 ordinal: 0xb
  VOID *SystemArgument1;                         // offset: 0x40 ordinal: 0xc
  VOID *SystemArgument2;                         // offset: 0x48 ordinal: 0xd
  CHAR ApcStateIndex;                            // offset: 0x50 ordinal: 0xe
  CHAR ApcMode;                                  // offset: 0x51 ordinal: 0xf
  UCHAR Inserted;                                // offset: 0x52 ordinal: 0x10
} _KAPC;

// 0x58 bytes (sizeof)
typedef struct __anon_521 {
  union {
    struct _KDEVICE_QUEUE_ENTRY DeviceQueueEntry; // offset: 0x0 ordinal: 0x0
    VOID *DriverContext[4];                       // offset: 0x0 ordinal: 0x1
  };
  struct _ETHREAD *Thread;      // offset: 0x20 ordinal: 0x2
  CHAR *AuxiliaryBuffer;        // offset: 0x28 ordinal: 0x3
  struct _LIST_ENTRY ListEntry; // offset: 0x30 ordinal: 0x4
  union {
    struct _IO_STACK_LOCATION
        *CurrentStackLocation; // offset: 0x40 ordinal: 0x5
    ULONG PacketType;          // offset: 0x40 ordinal: 0x6
  };
  struct _FILE_OBJECT *OriginalFileObject; // offset: 0x48 ordinal: 0x7
  VOID *IrpExtension;                      // offset: 0x50 ordinal: 0x8
} __anon_521;

// 0x58 bytes (sizeof)
typedef union __anon_507 {
  struct __anon_521 Overlay; // offset: 0x0 ordinal: 0x0
  struct _KAPC Apc;          // offset: 0x0 ordinal: 0x1
  VOID *CompletionKey;       // offset: 0x0 ordinal: 0x2
} __anon_507;

typedef VOID (*__anon_385)(struct _KAPC *);

typedef VOID (*__anon_384)(struct _KAPC *, VOID (**)(VOID *, VOID *, VOID *),
                           VOID **, VOID **, VOID **);

// 0xc bytes (sizeof)
typedef struct _CACHE_DESCRIPTOR {
  UCHAR Level;                     // offset: 0x0 ordinal: 0x0
  UCHAR Associativity;             // offset: 0x1 ordinal: 0x1
  USHORT LineSize;                 // offset: 0x2 ordinal: 0x2
  ULONG Size;                      // offset: 0x4 ordinal: 0x3
  enum _PROCESSOR_CACHE_TYPE Type; // offset: 0x8 ordinal: 0x4
} _CACHE_DESCRIPTOR;

// 0x4 bytes (sizeof)
typedef struct __anon_221 {
  ULONG BaseMiddle : 8;  // offset: 0x0 ordinal: 0x0
  ULONG Type : 5;        // offset: 0x0 ordinal: 0x1
  ULONG Dpl : 2;         // offset: 0x0 ordinal: 0x2
  ULONG Present : 1;     // offset: 0x0 ordinal: 0x3
  ULONG LimitHigh : 4;   // offset: 0x0 ordinal: 0x4
  ULONG System : 1;      // offset: 0x0 ordinal: 0x5
  ULONG LongMode : 1;    // offset: 0x0 ordinal: 0x6
  ULONG DefaultBig : 1;  // offset: 0x0 ordinal: 0x7
  ULONG Granularity : 1; // offset: 0x0 ordinal: 0x8
  ULONG BaseHigh : 8;    // offset: 0x0 ordinal: 0x9
} __anon_221;

// 0x54 bytes (sizeof)
typedef struct _IOP_IRP_STACK_PROFILER {
  ULONG Profile[20]; // offset: 0x0 ordinal: 0x0
  ULONG TotalIrps;   // offset: 0x50 ordinal: 0x1
} _IOP_IRP_STACK_PROFILER;

// 0x10 bytes (sizeof)
typedef union _KGDTENTRY64 {
  USHORT LimitLow;         // offset: 0x0 ordinal: 0x0
  USHORT BaseLow;          // offset: 0x2 ordinal: 0x1
  struct __anon_220 Bytes; // offset: 0x4 ordinal: 0x2
  struct __anon_221 Bits;  // offset: 0x4 ordinal: 0x3
  ULONG BaseUpper;         // offset: 0x8 ordinal: 0x4
  ULONG MustBeZero;        // offset: 0xc ordinal: 0x5
  LONGLONG DataLow;        // offset: 0x0 ordinal: 0x6
  LONGLONG DataHigh;       // offset: 0x8 ordinal: 0x7
} _KGDTENTRY64;

// 0x50 bytes (sizeof)
typedef struct _EXCEPTION_RECORD32 {
  LONG ExceptionCode;             // offset: 0x0 ordinal: 0x0
  ULONG ExceptionFlags;           // offset: 0x4 ordinal: 0x1
  ULONG ExceptionRecord;          // offset: 0x8 ordinal: 0x2
  ULONG ExceptionAddress;         // offset: 0xc ordinal: 0x3
  ULONG NumberParameters;         // offset: 0x10 ordinal: 0x4
  ULONG ExceptionInformation[15]; // offset: 0x14 ordinal: 0x5
} _EXCEPTION_RECORD32;

// 0x54 bytes (sizeof)
typedef struct _DBGKM_EXCEPTION32 {
  struct _EXCEPTION_RECORD32 ExceptionRecord; // offset: 0x0 ordinal: 0x0
  ULONG FirstChance;                          // offset: 0x50 ordinal: 0x1
} _DBGKM_EXCEPTION32;

// 0x8 bytes (sizeof)
typedef struct _IMAGE_DATA_DIRECTORY {
  ULONG VirtualAddress; // offset: 0x0 ordinal: 0x0
  ULONG Size;           // offset: 0x4 ordinal: 0x1
} _IMAGE_DATA_DIRECTORY;

// 0x14 bytes (sizeof)
typedef struct _IMAGE_FILE_HEADER {
  USHORT Machine;              // offset: 0x0 ordinal: 0x0
  USHORT NumberOfSections;     // offset: 0x2 ordinal: 0x1
  ULONG TimeDateStamp;         // offset: 0x4 ordinal: 0x2
  ULONG PointerToSymbolTable;  // offset: 0x8 ordinal: 0x3
  ULONG NumberOfSymbols;       // offset: 0xc ordinal: 0x4
  USHORT SizeOfOptionalHeader; // offset: 0x10 ordinal: 0x5
  USHORT Characteristics;      // offset: 0x12 ordinal: 0x6
} _IMAGE_FILE_HEADER;

// 0x8 bytes (sizeof)
typedef struct _LUID {
  ULONG LowPart; // offset: 0x0 ordinal: 0x0
  LONG HighPart; // offset: 0x4 ordinal: 0x1
} _LUID;

// 0x10 bytes (sizeof)
typedef struct _TOKEN_SOURCE {
  CHAR SourceName[8];            // offset: 0x0 ordinal: 0x0
  struct _LUID SourceIdentifier; // offset: 0x8 ordinal: 0x1
} _TOKEN_SOURCE;

// 0x28 bytes (sizeof)
typedef struct _TOKEN_CONTROL {
  struct _LUID TokenId;             // offset: 0x0 ordinal: 0x0
  struct _LUID AuthenticationId;    // offset: 0x8 ordinal: 0x1
  struct _LUID ModifiedId;          // offset: 0x10 ordinal: 0x2
  struct _TOKEN_SOURCE TokenSource; // offset: 0x18 ordinal: 0x3
} _TOKEN_CONTROL;

// 0x48 bytes (sizeof)
typedef struct _SECURITY_CLIENT_CONTEXT {
  struct _SECURITY_QUALITY_OF_SERVICE SecurityQos; // offset: 0x0 ordinal: 0x0
  VOID *ClientToken;                               // offset: 0x10 ordinal: 0x1
  UCHAR DirectlyAccessClientToken;                 // offset: 0x18 ordinal: 0x2
  UCHAR DirectAccessEffectiveOnly;                 // offset: 0x19 ordinal: 0x3
  UCHAR ServerIsRemote;                            // offset: 0x1a ordinal: 0x4
  struct _TOKEN_CONTROL ClientTokenControl;        // offset: 0x1c ordinal: 0x5
} _SECURITY_CLIENT_CONTEXT;

// 0xc bytes (sizeof)
typedef struct _LUID_AND_ATTRIBUTES {
  struct _LUID Luid; // offset: 0x0 ordinal: 0x0
  ULONG Attributes;  // offset: 0x8 ordinal: 0x1
} _LUID_AND_ATTRIBUTES;

// 0x10 bytes (sizeof)
typedef struct _TOKEN_PRIVILEGES {
  ULONG PrivilegeCount;                      // offset: 0x0 ordinal: 0x0
  struct _LUID_AND_ATTRIBUTES Privileges[1]; // offset: 0x4 ordinal: 0x1
} _TOKEN_PRIVILEGES;

// 0x14 bytes (sizeof)
typedef struct _PRIVILEGE_SET {
  ULONG PrivilegeCount;                     // offset: 0x0 ordinal: 0x0
  ULONG Control;                            // offset: 0x4 ordinal: 0x1
  struct _LUID_AND_ATTRIBUTES Privilege[1]; // offset: 0x8 ordinal: 0x2
} _PRIVILEGE_SET;

// 0x2c bytes (sizeof)
typedef struct _INITIAL_PRIVILEGE_SET {
  ULONG PrivilegeCount;                     // offset: 0x0 ordinal: 0x0
  ULONG Control;                            // offset: 0x4 ordinal: 0x1
  struct _LUID_AND_ATTRIBUTES Privilege[3]; // offset: 0x8 ordinal: 0x2
} _INITIAL_PRIVILEGE_SET;

// 0x2c bytes (sizeof)
typedef union __anon_796 {
  struct _INITIAL_PRIVILEGE_SET InitialPrivilegeSet; // offset: 0x0 ordinal: 0x0
  struct _PRIVILEGE_SET PrivilegeSet;                // offset: 0x0 ordinal: 0x1
} __anon_796;

// 0xa0 bytes (sizeof)
typedef struct _ACCESS_STATE {
  struct _LUID OperationID;      // offset: 0x0 ordinal: 0x0
  UCHAR SecurityEvaluated;       // offset: 0x8 ordinal: 0x1
  UCHAR GenerateAudit;           // offset: 0x9 ordinal: 0x2
  UCHAR GenerateOnClose;         // offset: 0xa ordinal: 0x3
  UCHAR PrivilegesAllocated;     // offset: 0xb ordinal: 0x4
  ULONG Flags;                   // offset: 0xc ordinal: 0x5
  ULONG RemainingDesiredAccess;  // offset: 0x10 ordinal: 0x6
  ULONG PreviouslyGrantedAccess; // offset: 0x14 ordinal: 0x7
  ULONG OriginalDesiredAccess;   // offset: 0x18 ordinal: 0x8
  struct _SECURITY_SUBJECT_CONTEXT
      SubjectSecurityContext;            // offset: 0x20 ordinal: 0x9
  VOID *SecurityDescriptor;              // offset: 0x40 ordinal: 0xa
  VOID *AuxData;                         // offset: 0x48 ordinal: 0xb
  union __anon_796 Privileges;           // offset: 0x50 ordinal: 0xc
  UCHAR AuditPrivileges;                 // offset: 0x7c ordinal: 0xd
  struct _UNICODE_STRING ObjectName;     // offset: 0x80 ordinal: 0xe
  struct _UNICODE_STRING ObjectTypeName; // offset: 0x90 ordinal: 0xf
} _ACCESS_STATE;

typedef LONG (*__anon_1594)(VOID *, VOID *, struct _ACCESS_STATE *, CHAR, ULONG,
                            struct _UNICODE_STRING *, struct _UNICODE_STRING *,
                            VOID *, struct _SECURITY_QUALITY_OF_SERVICE *,
                            VOID **);

// 0x18 bytes (sizeof)
typedef struct _IO_SECURITY_CONTEXT {
  struct _SECURITY_QUALITY_OF_SERVICE *SecurityQos; // offset: 0x0 ordinal: 0x0
  struct _ACCESS_STATE *AccessState;                // offset: 0x8 ordinal: 0x1
  ULONG DesiredAccess;                              // offset: 0x10 ordinal: 0x2
  ULONG FullCreateOptions;                          // offset: 0x14 ordinal: 0x3
} _IO_SECURITY_CONTEXT;

// 0x20 bytes (sizeof)
typedef struct __anon_638 {
  struct _IO_SECURITY_CONTEXT *SecurityContext; // offset: 0x0 ordinal: 0x0
  ULONG Options;                                // offset: 0x8 ordinal: 0x1
  USHORT FileAttributes;                        // offset: 0x10 ordinal: 0x2
  USHORT ShareAccess;                           // offset: 0x12 ordinal: 0x3
  ULONG EaLength;                               // offset: 0x18 ordinal: 0x4
} __anon_638;

typedef VOID (*__anon_2240)(ULONG *, ULONG *);

typedef LONG (*__anon_1596)(VOID *, UCHAR, struct _OBJECT_NAME_INFORMATION *,
                            ULONG, ULONG *, CHAR);

typedef LONG (*__anon_1595)(VOID *, enum _SECURITY_OPERATION_CODE, ULONG *,
                            VOID *, ULONG *, VOID **, enum _POOL_TYPE,
                            struct _GENERIC_MAPPING *, CHAR);

// 0x38 bytes (sizeof)
typedef struct _HEAP_LIST_LOOKUP {
  struct _HEAP_LIST_LOOKUP *ExtendedLookup; // offset: 0x0 ordinal: 0x0
  ULONG ArraySize;                          // offset: 0x8 ordinal: 0x1
  ULONG ExtraItem;                          // offset: 0xc ordinal: 0x2
  ULONG ItemCount;                          // offset: 0x10 ordinal: 0x3
  ULONG OutOfRangeItems;                    // offset: 0x14 ordinal: 0x4
  ULONG BaseIndex;                          // offset: 0x18 ordinal: 0x5
  struct _LIST_ENTRY *ListHead;             // offset: 0x20 ordinal: 0x6
  ULONG *ListsInUseUlong;                   // offset: 0x28 ordinal: 0x7
  struct _LIST_ENTRY **ListHints;           // offset: 0x30 ordinal: 0x8
} _HEAP_LIST_LOOKUP;

// 0x30 bytes (sizeof)
typedef struct _BITMAP_RANGE {
  struct _LIST_ENTRY Links; // offset: 0x0 ordinal: 0x0
  LONGLONG BasePage;        // offset: 0x10 ordinal: 0x1
  ULONG FirstDirtyPage;     // offset: 0x18 ordinal: 0x2
  ULONG LastDirtyPage;      // offset: 0x1c ordinal: 0x3
  ULONG DirtyPages;         // offset: 0x20 ordinal: 0x4
  ULONG *Bitmap;            // offset: 0x28 ordinal: 0x5
} _BITMAP_RANGE;

// 0xc0 bytes (sizeof)
typedef struct _MBCB {
  SHORT NodeTypeCode;                // offset: 0x0 ordinal: 0x0
  SHORT NodeIsInZone;                // offset: 0x2 ordinal: 0x1
  ULONG PagesToWrite;                // offset: 0x4 ordinal: 0x2
  ULONG DirtyPages;                  // offset: 0x8 ordinal: 0x3
  ULONG Reserved;                    // offset: 0xc ordinal: 0x4
  struct _LIST_ENTRY BitmapRanges;   // offset: 0x10 ordinal: 0x5
  LONGLONG ResumeWritePage;          // offset: 0x20 ordinal: 0x6
  LONGLONG MostRecentlyDirtiedPage;  // offset: 0x28 ordinal: 0x7
  struct _BITMAP_RANGE BitmapRange1; // offset: 0x30 ordinal: 0x8
  struct _BITMAP_RANGE BitmapRange2; // offset: 0x60 ordinal: 0x9
  struct _BITMAP_RANGE BitmapRange3; // offset: 0x90 ordinal: 0xa
} _MBCB;

// 0x20 bytes (sizeof)
typedef struct _PEP_ACPI_INTERRUPT_RESOURCE {
  enum _PEP_ACPI_RESOURCE_TYPE Type;           // offset: 0x0 ordinal: 0x0
  enum _KINTERRUPT_MODE InterruptType;         // offset: 0x4 ordinal: 0x1
  enum _KINTERRUPT_POLARITY InterruptPolarity; // offset: 0x8 ordinal: 0x2
  union _PEP_ACPI_RESOURCE_FLAGS Flags;        // offset: 0xc ordinal: 0x3
  UCHAR Count;                                 // offset: 0x10 ordinal: 0x4
  ULONG *Pins;                                 // offset: 0x18 ordinal: 0x5
} _PEP_ACPI_INTERRUPT_RESOURCE;

typedef VOID (*__anon_395)(VOID *, ULONG, ULONG, ULONG, ULONG *);

typedef LONG (*__anon_391)(VOID *, ULONG, ULONG, ULONG, ULONG *);

// 0x18 bytes (sizeof)
typedef struct _PPM_COORDINATED_SELECTION {
  ULONG MaximumStates;    // offset: 0x0 ordinal: 0x0
  ULONG SelectedStates;   // offset: 0x4 ordinal: 0x1
  ULONG DefaultSelection; // offset: 0x8 ordinal: 0x2
  ULONG *Selection;       // offset: 0x10 ordinal: 0x3
} _PPM_COORDINATED_SELECTION;

// 0x10 bytes (sizeof)
typedef struct _RTL_BITMAP {
  ULONG SizeOfBitMap; // offset: 0x0 ordinal: 0x0
  ULONG *Buffer;      // offset: 0x8 ordinal: 0x1
} _RTL_BITMAP;

// 0x18 bytes (sizeof)
typedef struct _FREE_DISPLAY {
  ULONG RealVectorSize;       // offset: 0x0 ordinal: 0x0
  ULONG Hint;                 // offset: 0x4 ordinal: 0x1
  struct _RTL_BITMAP Display; // offset: 0x8 ordinal: 0x2
} _FREE_DISPLAY;

// 0x28 bytes (sizeof)
typedef struct _MI_PAGING_FILE_SPACE_BITMAPS {
  union {
    ULONG RefCount;                               // offset: 0x0 ordinal: 0x0
    struct _MI_PAGING_FILE_SPACE_BITMAPS *Anchor; // offset: 0x0 ordinal: 0x1
  };
  struct _RTL_BITMAP AllocationBitmap; // offset: 0x8 ordinal: 0x2
  union {
    struct _RTL_BITMAP ReservationBitmap; // offset: 0x18 ordinal: 0x3
    struct _RTL_BITMAP EvictedBitmap;     // offset: 0x18 ordinal: 0x4
  };
} _MI_PAGING_FILE_SPACE_BITMAPS;

// 0x28 bytes (sizeof)
typedef struct _RTL_DYNAMIC_HASH_TABLE {
  ULONG Flags;           // offset: 0x0 ordinal: 0x0
  ULONG Shift;           // offset: 0x4 ordinal: 0x1
  ULONG TableSize;       // offset: 0x8 ordinal: 0x2
  ULONG Pivot;           // offset: 0xc ordinal: 0x3
  ULONG DivisorMask;     // offset: 0x10 ordinal: 0x4
  ULONG NumEntries;      // offset: 0x14 ordinal: 0x5
  ULONG NonEmptyBuckets; // offset: 0x18 ordinal: 0x6
  ULONG NumEnumerators;  // offset: 0x1c ordinal: 0x7
  VOID *Directory;       // offset: 0x20 ordinal: 0x8
} _RTL_DYNAMIC_HASH_TABLE;

// 0x18 bytes (sizeof)
typedef struct _RTL_DRIVE_LETTER_CURDIR {
  USHORT Flags;           // offset: 0x0 ordinal: 0x0
  USHORT Length;          // offset: 0x2 ordinal: 0x1
  ULONG TimeStamp;        // offset: 0x4 ordinal: 0x2
  struct _STRING DosPath; // offset: 0x8 ordinal: 0x3
} _RTL_DRIVE_LETTER_CURDIR;

// 0x18 bytes (sizeof)
typedef struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME {
  struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME
      *Previous;                                 // offset: 0x0 ordinal: 0x0
  struct _ACTIVATION_CONTEXT *ActivationContext; // offset: 0x8 ordinal: 0x1
  ULONG Flags;                                   // offset: 0x10 ordinal: 0x2
} _RTL_ACTIVATION_CONTEXT_STACK_FRAME;

// 0x58 bytes (sizeof)
typedef struct _PEB_LDR_DATA {
  ULONG Length;                               // offset: 0x0 ordinal: 0x0
  UCHAR Initialized;                          // offset: 0x4 ordinal: 0x1
  VOID *SsHandle;                             // offset: 0x8 ordinal: 0x2
  struct _LIST_ENTRY InLoadOrderModuleList;   // offset: 0x10 ordinal: 0x3
  struct _LIST_ENTRY InMemoryOrderModuleList; // offset: 0x20 ordinal: 0x4
  struct _LIST_ENTRY
      InInitializationOrderModuleList; // offset: 0x30 ordinal: 0x5
  VOID *EntryInProgress;               // offset: 0x40 ordinal: 0x6
  UCHAR ShutdownInProgress;            // offset: 0x48 ordinal: 0x7
  VOID *ShutdownThreadId;              // offset: 0x50 ordinal: 0x8
} _PEB_LDR_DATA;

// 0x38 bytes (sizeof)
typedef struct _IMAGE_ROM_OPTIONAL_HEADER {
  USHORT Magic;                  // offset: 0x0 ordinal: 0x0
  UCHAR MajorLinkerVersion;      // offset: 0x2 ordinal: 0x1
  UCHAR MinorLinkerVersion;      // offset: 0x3 ordinal: 0x2
  ULONG SizeOfCode;              // offset: 0x4 ordinal: 0x3
  ULONG SizeOfInitializedData;   // offset: 0x8 ordinal: 0x4
  ULONG SizeOfUninitializedData; // offset: 0xc ordinal: 0x5
  ULONG AddressOfEntryPoint;     // offset: 0x10 ordinal: 0x6
  ULONG BaseOfCode;              // offset: 0x14 ordinal: 0x7
  ULONG BaseOfData;              // offset: 0x18 ordinal: 0x8
  ULONG BaseOfBss;               // offset: 0x1c ordinal: 0x9
  ULONG GprMask;                 // offset: 0x20 ordinal: 0xa
  ULONG CprMask[4];              // offset: 0x24 ordinal: 0xb
  ULONG GpValue;                 // offset: 0x34 ordinal: 0xc
} _IMAGE_ROM_OPTIONAL_HEADER;

// 0x80 bytes (sizeof)
typedef struct _ACCESS_REASONS {
  ULONG Data[32]; // offset: 0x0 ordinal: 0x0
} _ACCESS_REASONS;

// 0x8 bytes (sizeof)
typedef struct _WNF_STATE_NAME {
  ULONG Data[2]; // offset: 0x0 ordinal: 0x0
} _WNF_STATE_NAME;

// 0x24 bytes (sizeof)
typedef struct _PROC_PERF_HISTORY {
  ULONG Count;                                    // offset: 0x0 ordinal: 0x0
  ULONG Slot;                                     // offset: 0x4 ordinal: 0x1
  ULONG UtilityTotal;                             // offset: 0x8 ordinal: 0x2
  ULONG AffinitizedUtilityTotal;                  // offset: 0xc ordinal: 0x3
  ULONG FrequencyTotal;                           // offset: 0x10 ordinal: 0x4
  ULONG TaggedPercentTotal[2];                    // offset: 0x14 ordinal: 0x5
  struct _PROC_PERF_HISTORY_ENTRY HistoryList[1]; // offset: 0x1c ordinal: 0x6
} _PROC_PERF_HISTORY;

// 0x18 bytes (sizeof)
typedef struct _TEB_ACTIVE_FRAME {
  ULONG Flags;                               // offset: 0x0 ordinal: 0x0
  struct _TEB_ACTIVE_FRAME *Previous;        // offset: 0x8 ordinal: 0x1
  struct _TEB_ACTIVE_FRAME_CONTEXT *Context; // offset: 0x10 ordinal: 0x2
} _TEB_ACTIVE_FRAME;

// 0x4e0 bytes (sizeof)
typedef struct _GDI_TEB_BATCH32 {
  ULONG Offset : 31;             // offset: 0x0 ordinal: 0x0
  ULONG HasRenderingCommand : 1; // offset: 0x0 ordinal: 0x1
  ULONG HDC;                     // offset: 0x4 ordinal: 0x2
  ULONG Buffer[310];             // offset: 0x8 ordinal: 0x3
} _GDI_TEB_BATCH32;

// 0x28 bytes (sizeof)
typedef struct _ACTIVATION_CONTEXT_STACK {
  struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME
      *ActiveFrame;                  // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY FrameListCache; // offset: 0x8 ordinal: 0x1
  ULONG Flags;                       // offset: 0x18 ordinal: 0x2
  ULONG NextCookieSequenceNumber;    // offset: 0x1c ordinal: 0x3
  ULONG StackId;                     // offset: 0x20 ordinal: 0x4
} _ACTIVATION_CONTEXT_STACK;

// 0x1c bytes (sizeof)
typedef struct _RSDS {
  ULONG Signature;   // offset: 0x0 ordinal: 0x0
  struct _GUID Guid; // offset: 0x4 ordinal: 0x1
  ULONG Age;         // offset: 0x14 ordinal: 0x2
  CHAR PdbName[1];   // offset: 0x18 ordinal: 0x3
} _RSDS;

// 0x1c bytes (sizeof)
typedef union _CVDD {
  ULONG Signature;   // offset: 0x0 ordinal: 0x0
  struct _NB10 NB10; // offset: 0x0 ordinal: 0x1
  struct _RSDS RsDs; // offset: 0x0 ordinal: 0x2
} _CVDD;

// 0x38 bytes (sizeof)
typedef struct _PROVIDER_BINARY_ENTRY {
  struct _LIST_ENTRY ListEntry; // offset: 0x0 ordinal: 0x0
  UCHAR ConsumersNotified;      // offset: 0x10 ordinal: 0x1
  UCHAR Spare[3];               // offset: 0x11 ordinal: 0x2
  ULONG DebugIdSize;            // offset: 0x14 ordinal: 0x3
  union _CVDD DebugId;          // offset: 0x18 ordinal: 0x4
} _PROVIDER_BINARY_ENTRY;

// 0x10 bytes (sizeof)
typedef struct __anon_2237 {
  struct _GUID DiskId; // offset: 0x0 ordinal: 0x0
} __anon_2237;

// 0x10 bytes (sizeof)
typedef union __anon_2226 {
  struct __anon_2236 Mbr; // offset: 0x0 ordinal: 0x0
  struct __anon_2237 Gpt; // offset: 0x0 ordinal: 0x1
} __anon_2226;

// 0x58 bytes (sizeof)
typedef struct _IO_WORKITEM {
  struct _WORK_QUEUE_ITEM WorkItem; // offset: 0x0 ordinal: 0x0
  VOID(*Routine)
  (VOID *, VOID *, struct _IO_WORKITEM *); // offset: 0x20 ordinal: 0x1
  VOID *IoObject;                          // offset: 0x28 ordinal: 0x2
  VOID *Context;                           // offset: 0x30 ordinal: 0x3
  VOID *WorkingOnBehalfClient;             // offset: 0x38 ordinal: 0x4
  ULONG Type;                              // offset: 0x40 ordinal: 0x5
  struct _GUID ActivityId;                 // offset: 0x44 ordinal: 0x6
} _IO_WORKITEM;

typedef VOID (*__anon_1941)(VOID *, VOID *, struct _IO_WORKITEM *);

// 0x58 bytes (sizeof)
typedef struct _CM_KEY_BODY {
  ULONG Type;                                    // offset: 0x0 ordinal: 0x0
  struct _CM_KEY_CONTROL_BLOCK *KeyControlBlock; // offset: 0x8 ordinal: 0x1
  struct _CM_NOTIFY_BLOCK *NotifyBlock;          // offset: 0x10 ordinal: 0x2
  VOID *ProcessID;                               // offset: 0x18 ordinal: 0x3
  struct _LIST_ENTRY KeyBodyList;                // offset: 0x20 ordinal: 0x4
  ULONG Flags : 16;                              // offset: 0x30 ordinal: 0x5
  ULONG HandleTags : 16;                         // offset: 0x30 ordinal: 0x6
  VOID *KtmTrans;                                // offset: 0x38 ordinal: 0x7
  struct _GUID *KtmUow;                          // offset: 0x40 ordinal: 0x8
  struct _LIST_ENTRY ContextListHead;            // offset: 0x48 ordinal: 0x9
} _CM_KEY_BODY;

// 0x58 bytes (sizeof)
typedef struct _CM_NOTIFY_BLOCK {
  struct _LIST_ENTRY HiveList;                     // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY PostList;                     // offset: 0x10 ordinal: 0x1
  struct _CM_KEY_CONTROL_BLOCK *KeyControlBlock;   // offset: 0x20 ordinal: 0x2
  struct _CM_KEY_BODY *KeyBody;                    // offset: 0x28 ordinal: 0x3
  ULONG Filter : 30;                               // offset: 0x30 ordinal: 0x4
  ULONG WatchTree : 1;                             // offset: 0x30 ordinal: 0x5
  ULONG NotifyPending : 1;                         // offset: 0x30 ordinal: 0x6
  struct _SECURITY_SUBJECT_CONTEXT SubjectContext; // offset: 0x38 ordinal: 0x7
} _CM_NOTIFY_BLOCK;

// 0x10 bytes (sizeof)
typedef struct _DISALLOWED_GUIDS {
  USHORT Count;        // offset: 0x0 ordinal: 0x0
  struct _GUID *Guids; // offset: 0x8 ordinal: 0x1
} _DISALLOWED_GUIDS;

// 0x20 bytes (sizeof)
typedef struct __anon_1310 {
  struct _GUID PowerSettingGuid; // offset: 0x0 ordinal: 0x0
  ULONG Flags;                   // offset: 0x10 ordinal: 0x1
  ULONG SessionId;               // offset: 0x14 ordinal: 0x2
  ULONG DataLength;              // offset: 0x18 ordinal: 0x3
  UCHAR Data[1];                 // offset: 0x1c ordinal: 0x4
} __anon_1310;

// 0x10 bytes (sizeof)
typedef struct __anon_1308 {
  struct _GUID BlockedDriverGuid; // offset: 0x0 ordinal: 0x0
} __anon_1308;

// 0x14 bytes (sizeof)
typedef struct __anon_1302 {
  struct _GUID ClassGuid;    // offset: 0x0 ordinal: 0x0
  WCHAR SymbolicLinkName[1]; // offset: 0x10 ordinal: 0x1
} __anon_1302;

// 0x20 bytes (sizeof)
typedef union __anon_1294 {
  struct __anon_1302 DeviceClass;                // offset: 0x0 ordinal: 0x0
  struct __anon_1303 TargetDevice;               // offset: 0x0 ordinal: 0x1
  struct __anon_1303 InstallDevice;              // offset: 0x0 ordinal: 0x2
  struct __anon_1304 CustomNotification;         // offset: 0x0 ordinal: 0x3
  struct __anon_1305 ProfileNotification;        // offset: 0x0 ordinal: 0x4
  struct __anon_1306 PowerNotification;          // offset: 0x0 ordinal: 0x5
  struct __anon_1307 VetoNotification;           // offset: 0x0 ordinal: 0x6
  struct __anon_1308 BlockedDriverNotification;  // offset: 0x0 ordinal: 0x7
  struct __anon_1309 InvalidIDNotification;      // offset: 0x0 ordinal: 0x8
  struct __anon_1310 PowerSettingNotification;   // offset: 0x0 ordinal: 0x9
  struct __anon_1303 PropertyChangeNotification; // offset: 0x0 ordinal: 0xa
  struct __anon_1303 DeviceInstanceNotification; // offset: 0x0 ordinal: 0xb
} __anon_1294;

// 0x50 bytes (sizeof)
typedef struct _PLUGPLAY_EVENT_BLOCK {
  struct _GUID EventGuid;                      // offset: 0x0 ordinal: 0x0
  enum _PLUGPLAY_EVENT_CATEGORY EventCategory; // offset: 0x10 ordinal: 0x1
  ULONG *Result;                               // offset: 0x18 ordinal: 0x2
  ULONG Flags;                                 // offset: 0x20 ordinal: 0x3
  ULONG TotalSize;                             // offset: 0x24 ordinal: 0x4
  VOID *DeviceObject;                          // offset: 0x28 ordinal: 0x5
  union __anon_1294 u;                         // offset: 0x30 ordinal: 0x6
} _PLUGPLAY_EVENT_BLOCK;

// 0xb8 bytes (sizeof)
typedef struct _PNP_DEVICE_EVENT_ENTRY {
  struct _LIST_ENTRY ListEntry;           // offset: 0x0 ordinal: 0x0
  ULONG Argument;                         // offset: 0x10 ordinal: 0x1
  struct _KEVENT *CallerEvent;            // offset: 0x18 ordinal: 0x2
  VOID (*Callback)(VOID *);               // offset: 0x20 ordinal: 0x3
  VOID *Context;                          // offset: 0x28 ordinal: 0x4
  enum _PNP_VETO_TYPE *VetoType;          // offset: 0x30 ordinal: 0x5
  struct _UNICODE_STRING *VetoName;       // offset: 0x38 ordinal: 0x6
  ULONG RefCount;                         // offset: 0x40 ordinal: 0x7
  ULONG Lock;                             // offset: 0x44 ordinal: 0x8
  UCHAR Cancel;                           // offset: 0x48 ordinal: 0x9
  struct _PNP_DEVICE_EVENT_ENTRY *Parent; // offset: 0x50 ordinal: 0xa
  struct _GUID ActivityId;                // offset: 0x58 ordinal: 0xb
  struct _PLUGPLAY_EVENT_BLOCK Data;      // offset: 0x68 ordinal: 0xc
} _PNP_DEVICE_EVENT_ENTRY;

// 0x13 bytes (sizeof)
typedef struct _TlgProviderMetadata_t {
  UCHAR Type;              // offset: 0x0 ordinal: 0x0
  struct _GUID ProviderId; // offset: 0x1 ordinal: 0x1
  USHORT RemainingSize;    // offset: 0x11 ordinal: 0x2
} _TlgProviderMetadata_t;

// 0x48 bytes (sizeof)
typedef struct _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR {
  ULONG SectionOffset;           // offset: 0x0 ordinal: 0x0
  ULONG SectionLength;           // offset: 0x4 ordinal: 0x1
  union _WHEA_REVISION Revision; // offset: 0x8 ordinal: 0x2
  union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS
      ValidBits;  // offset: 0xa ordinal: 0x3
  UCHAR Reserved; // offset: 0xb ordinal: 0x4
  union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS
      Flags;                                 // offset: 0xc ordinal: 0x5
  struct _GUID SectionType;                  // offset: 0x10 ordinal: 0x6
  struct _GUID FRUId;                        // offset: 0x20 ordinal: 0x7
  enum _WHEA_ERROR_SEVERITY SectionSeverity; // offset: 0x30 ordinal: 0x8
  CHAR FRUText[20];                          // offset: 0x34 ordinal: 0x9
} _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR;

// 0xe0 bytes (sizeof)
typedef struct _AUX_ACCESS_DATA {
  struct _PRIVILEGE_SET *PrivilegesUsed;           // offset: 0x0 ordinal: 0x0
  struct _GENERIC_MAPPING GenericMapping;          // offset: 0x8 ordinal: 0x1
  ULONG AccessesToAudit;                           // offset: 0x18 ordinal: 0x2
  ULONG MaximumAuditMask;                          // offset: 0x1c ordinal: 0x3
  struct _GUID TransactionId;                      // offset: 0x20 ordinal: 0x4
  VOID *NewSecurityDescriptor;                     // offset: 0x30 ordinal: 0x5
  VOID *ExistingSecurityDescriptor;                // offset: 0x38 ordinal: 0x6
  VOID *ParentSecurityDescriptor;                  // offset: 0x40 ordinal: 0x7
  VOID (*DeRefSecurityDescriptor)(VOID *, VOID *); // offset: 0x48 ordinal: 0x8
  VOID *SDLock;                                    // offset: 0x50 ordinal: 0x9
  struct _ACCESS_REASONS AccessReasons;            // offset: 0x58 ordinal: 0xa
  UCHAR GenerateStagingEvents;                     // offset: 0xd8 ordinal: 0xb
} _AUX_ACCESS_DATA;

// 0x6c bytes (sizeof)
typedef struct _OBP_SYSTEM_DOS_DEVICE_STATE {
  ULONG GlobalDeviceMap;      // offset: 0x0 ordinal: 0x0
  ULONG LocalDeviceCount[26]; // offset: 0x4 ordinal: 0x1
} _OBP_SYSTEM_DOS_DEVICE_STATE;

// 0x38 bytes (sizeof)
typedef struct _NT_TIB {
  struct _EXCEPTION_REGISTRATION_RECORD
      *ExceptionList; // offset: 0x0 ordinal: 0x0
  VOID *StackBase;    // offset: 0x8 ordinal: 0x1
  VOID *StackLimit;   // offset: 0x10 ordinal: 0x2
  VOID *SubSystemTib; // offset: 0x18 ordinal: 0x3
  union {
    VOID *FiberData; // offset: 0x20 ordinal: 0x4
    ULONG Version;   // offset: 0x20 ordinal: 0x5
  };
  VOID *ArbitraryUserPointer; // offset: 0x28 ordinal: 0x6
  struct _NT_TIB *Self;       // offset: 0x30 ordinal: 0x7
} _NT_TIB;

// 0x4 bytes (sizeof)
typedef struct __anon_41 {
  ULONG LongFunction : 1; // offset: 0x0 ordinal: 0x0
  ULONG Persistent : 1;   // offset: 0x0 ordinal: 0x1
  ULONG Private : 30;     // offset: 0x0 ordinal: 0x2
} __anon_41;

// 0x4 bytes (sizeof)
typedef union __anon_42 {
  ULONG Flags;        // offset: 0x0 ordinal: 0x0
  struct __anon_41 s; // offset: 0x0 ordinal: 0x1
} __anon_42;

// 0x48 bytes (sizeof)
typedef struct _TP_CALLBACK_ENVIRON_V3 {
  ULONG Version;                          // offset: 0x0 ordinal: 0x0
  struct _TP_POOL *Pool;                  // offset: 0x8 ordinal: 0x1
  struct _TP_CLEANUP_GROUP *CleanupGroup; // offset: 0x10 ordinal: 0x2
  VOID(*CleanupGroupCancelCallback)
  (VOID *, VOID *);                              // offset: 0x18 ordinal: 0x3
  VOID *RaceDll;                                 // offset: 0x20 ordinal: 0x4
  struct _ACTIVATION_CONTEXT *ActivationContext; // offset: 0x28 ordinal: 0x5
  VOID(*FinalizationCallback)
  (struct _TP_CALLBACK_INSTANCE *, VOID *);    // offset: 0x30 ordinal: 0x6
  union __anon_42 u;                           // offset: 0x38 ordinal: 0x7
  enum _TP_CALLBACK_PRIORITY CallbackPriority; // offset: 0x3c ordinal: 0x8
  ULONG Size;                                  // offset: 0x40 ordinal: 0x9
} _TP_CALLBACK_ENVIRON_V3;

// 0x8 bytes (sizeof)
typedef struct __anon_35 {
  ULONG LowPart;  // offset: 0x0 ordinal: 0x0
  ULONG HighPart; // offset: 0x4 ordinal: 0x1
} __anon_35;

// 0x8 bytes (sizeof)
typedef struct _XSTATE_FEATURE {
  ULONG Offset; // offset: 0x0 ordinal: 0x0
  ULONG Size;   // offset: 0x4 ordinal: 0x1
} _XSTATE_FEATURE;

// 0x8 bytes (sizeof)
typedef struct __anon_31 {
  ULONG LowPart; // offset: 0x0 ordinal: 0x0
  LONG HighPart; // offset: 0x4 ordinal: 0x1
} __anon_31;

// 0x8 bytes (sizeof)
typedef union _LARGE_INTEGER {
  ULONG LowPart;      // offset: 0x0 ordinal: 0x0
  LONG HighPart;      // offset: 0x4 ordinal: 0x1
  struct __anon_31 u; // offset: 0x0 ordinal: 0x2
  LONGLONG QuadPart;  // offset: 0x0 ordinal: 0x3
} _LARGE_INTEGER;

// 0xe8 bytes (sizeof)
typedef struct _SYSTEM_POWER_POLICY {
  ULONG Revision;                               // offset: 0x0 ordinal: 0x0
  struct POWER_ACTION_POLICY PowerButton;       // offset: 0x4 ordinal: 0x1
  struct POWER_ACTION_POLICY SleepButton;       // offset: 0x10 ordinal: 0x2
  struct POWER_ACTION_POLICY LidClose;          // offset: 0x1c ordinal: 0x3
  enum _SYSTEM_POWER_STATE LidOpenWake;         // offset: 0x28 ordinal: 0x4
  ULONG Reserved;                               // offset: 0x2c ordinal: 0x5
  struct POWER_ACTION_POLICY Idle;              // offset: 0x30 ordinal: 0x6
  ULONG IdleTimeout;                            // offset: 0x3c ordinal: 0x7
  UCHAR IdleSensitivity;                        // offset: 0x40 ordinal: 0x8
  UCHAR DynamicThrottle;                        // offset: 0x41 ordinal: 0x9
  UCHAR Spare2[2];                              // offset: 0x42 ordinal: 0xa
  enum _SYSTEM_POWER_STATE MinSleep;            // offset: 0x44 ordinal: 0xb
  enum _SYSTEM_POWER_STATE MaxSleep;            // offset: 0x48 ordinal: 0xc
  enum _SYSTEM_POWER_STATE ReducedLatencySleep; // offset: 0x4c ordinal: 0xd
  ULONG WinLogonFlags;                          // offset: 0x50 ordinal: 0xe
  ULONG Spare3;                                 // offset: 0x54 ordinal: 0xf
  ULONG DozeS4Timeout;                          // offset: 0x58 ordinal: 0x10
  ULONG BroadcastCapacityResolution;            // offset: 0x5c ordinal: 0x11
  struct SYSTEM_POWER_LEVEL DischargePolicy[4]; // offset: 0x60 ordinal: 0x12
  ULONG VideoTimeout;                           // offset: 0xc0 ordinal: 0x13
  UCHAR VideoDimDisplay;                        // offset: 0xc4 ordinal: 0x14
  ULONG VideoReserved[3];                       // offset: 0xc8 ordinal: 0x15
  ULONG SpindownTimeout;                        // offset: 0xd4 ordinal: 0x16
  UCHAR OptimizeForPower;                       // offset: 0xd8 ordinal: 0x17
  UCHAR FanThrottleTolerance;                   // offset: 0xd9 ordinal: 0x18
  UCHAR ForcedThrottle;                         // offset: 0xda ordinal: 0x19
  UCHAR MinThrottle;                            // offset: 0xdb ordinal: 0x1a
  struct POWER_ACTION_POLICY OverThrottled;     // offset: 0xdc ordinal: 0x1b
} _SYSTEM_POWER_POLICY;

// 0x13c bytes (sizeof)
typedef struct _POP_POWER_SETTING_VALUES {
  ULONG StructureSize;                   // offset: 0x0 ordinal: 0x0
  struct _SYSTEM_POWER_POLICY PopPolicy; // offset: 0x4 ordinal: 0x1
  enum SYSTEM_POWER_CONDITION
      CurrentAcDcPowerState;      // offset: 0xec ordinal: 0x2
  UCHAR AwayModeEnabled;          // offset: 0xf0 ordinal: 0x3
  UCHAR AwayModeEngaged;          // offset: 0xf1 ordinal: 0x4
  UCHAR AwayModePolicyAllowed;    // offset: 0xf2 ordinal: 0x5
  LONG AwayModeIgnoreUserPresent; // offset: 0xf4 ordinal: 0x6
  LONG AwayModeIgnoreAction;      // offset: 0xf8 ordinal: 0x7
  UCHAR DisableFastS4;            // offset: 0xfc ordinal: 0x8
  UCHAR DisableStandbyStates;     // offset: 0xfd ordinal: 0x9
  ULONG UnattendSleepTimeout;     // offset: 0x100 ordinal: 0xa
  ULONG DiskIgnoreTime;           // offset: 0x104 ordinal: 0xb
  ULONG DeviceIdlePolicy;         // offset: 0x108 ordinal: 0xc
  ULONG VideoDimTimeout;          // offset: 0x10c ordinal: 0xd
  ULONG VideoNormalBrightness;    // offset: 0x110 ordinal: 0xe
  ULONG VideoDimBrightness;       // offset: 0x114 ordinal: 0xf
  ULONG AlsOffset;                // offset: 0x118 ordinal: 0x10
  ULONG AlsEnabled;               // offset: 0x11c ordinal: 0x11
  ULONG EsBrightness;             // offset: 0x120 ordinal: 0x12
  UCHAR SwitchShutdownForced;     // offset: 0x124 ordinal: 0x13
  ULONG SystemCoolingPolicy;      // offset: 0x128 ordinal: 0x14
  UCHAR MediaBufferingEngaged;    // offset: 0x12c ordinal: 0x15
  UCHAR OffloadedAudio;           // offset: 0x12d ordinal: 0x16
  UCHAR NonOffloadedAudio;        // offset: 0x12e ordinal: 0x17
  UCHAR FullscreenVideoPlayback;  // offset: 0x12f ordinal: 0x18
  ULONG EsBatteryThreshold;       // offset: 0x130 ordinal: 0x19
  UCHAR EsUserAwaySetting;        // offset: 0x134 ordinal: 0x1a
  ULONG WiFiInStandby;            // offset: 0x138 ordinal: 0x1b
} _POP_POWER_SETTING_VALUES;

// 0xc bytes (sizeof)
typedef struct __anon_830 {
  ULONG Data[3]; // offset: 0x0 ordinal: 0x0
} __anon_830;

// 0x8 bytes (sizeof)
typedef struct _CM_INDEX_HINT_BLOCK {
  ULONG Count;      // offset: 0x0 ordinal: 0x0
  ULONG HashKey[1]; // offset: 0x4 ordinal: 0x1
} _CM_INDEX_HINT_BLOCK;

// 0x8 bytes (sizeof)
