// 0x0 bytes (sizeof)
typedef struct _LDRP_LOAD_CONTEXT {
} _LDRP_LOAD_CONTEXT;

// 0x0 bytes (sizeof)
typedef struct _VERIFIER_SHARED_EXPORT_THUNK {
} _VERIFIER_SHARED_EXPORT_THUNK;

// 0x10 bytes (sizeof)
typedef struct _VF_TARGET_ALL_SHARED_EXPORT_THUNKS {
  struct _VERIFIER_SHARED_EXPORT_THUNK
      *SharedExportThunks; // offset: 0x0 ordinal: 0x0
  struct _VERIFIER_SHARED_EXPORT_THUNK
      *PoolSharedExportThunks; // offset: 0x4 ordinal: 0x1
  struct _VERIFIER_SHARED_EXPORT_THUNK
      *OrderDependentSharedExportThunks; // offset: 0x8 ordinal: 0x2
  struct _VERIFIER_SHARED_EXPORT_THUNK
      *XdvSharedExportThunks; // offset: 0xc ordinal: 0x3
} _VF_TARGET_ALL_SHARED_EXPORT_THUNKS;

// 0x0 bytes (sizeof)
typedef struct _ACTIVATION_CONTEXT_DATA {
} _ACTIVATION_CONTEXT_DATA;

// 0x0 bytes (sizeof)
typedef struct __WIL__WNF_USER_SUBSCRIPTION {
} __WIL__WNF_USER_SUBSCRIPTION;

// 0x0 bytes (sizeof)
typedef struct _IOMMU_DMA_DOMAIN {
} _IOMMU_DMA_DOMAIN;

// 0x0 bytes (sizeof)
typedef struct _ADAPTER_OBJECT {
} _ADAPTER_OBJECT;

// 0x0 bytes (sizeof)
typedef struct _CALLBACK_OBJECT {
} _CALLBACK_OBJECT;

// 0x4 bytes (sizeof)
typedef struct __anon_1945 {
  struct _SHARED_CACHE_MAP *SharedCacheMap; // offset: 0x0 ordinal: 0x0
} __anon_1945;

typedef unsigned char UCHAR;

typedef unsigned long long ULONGLONG;

typedef void VOID;

// 0x0 bytes (sizeof)
typedef struct _PCW_INSTANCE {
} _PCW_INSTANCE;

// 0x0 bytes (sizeof)
typedef struct _PCW_BUFFER {
} _PCW_BUFFER;

// 0x0 bytes (sizeof)
typedef struct _PCW_REGISTRATION {
} _PCW_REGISTRATION;

// 0x0 bytes (sizeof)
typedef struct _KTMNOTIFICATION_PACKET {
} _KTMNOTIFICATION_PACKET;

// 0x0 bytes (sizeof)
typedef struct _MI_SLAB_ALLOCATOR_ENTRY {
} _MI_SLAB_ALLOCATOR_ENTRY;

// 0x0 bytes (sizeof)
typedef struct _MI_ZERO_THREAD_CONTEXT {
} _MI_ZERO_THREAD_CONTEXT;

// 0x0 bytes (sizeof)
typedef struct wil_StagingConfig {
} wil_StagingConfig;

typedef unsigned short USHORT;

typedef unsigned long ULONG;

// 0x4 bytes (sizeof)
typedef struct _EXT_IOMMU_DEVICE_ID_GIC {
  ULONG LineNumber; // offset: 0x0 ordinal: 0x0
} _EXT_IOMMU_DEVICE_ID_GIC;

// 0x8 bytes (sizeof)
typedef struct wil_details_StagingConfigWnfStateName {
  ULONG Data[2]; // offset: 0x0 ordinal: 0x0
} wil_details_StagingConfigWnfStateName;

// 0x4 bytes (sizeof)
typedef struct wil_details_StagingConfigHeaderProperties {
  ULONG ignoreServiceState : 1; // offset: 0x0 ordinal: 0x0
  ULONG ignoreUserState : 1;    // offset: 0x0 ordinal: 0x1
  ULONG ignoreTestState : 1;    // offset: 0x0 ordinal: 0x2
  ULONG ignoreVariants : 1;     // offset: 0x0 ordinal: 0x3
  ULONG unused : 28;            // offset: 0x0 ordinal: 0x4
} wil_details_StagingConfigHeaderProperties;

// 0x10 bytes (sizeof)
typedef struct wil_details_StagingConfigUsageTrigger {
  ULONG featureId; // offset: 0x0 ordinal: 0x0
  struct wil_details_StagingConfigWnfStateName
      trigger;                     // offset: 0x4 ordinal: 0x1
  ULONG serviceReportingKind : 16; // offset: 0xc ordinal: 0x2
  ULONG isVariantConfig : 1;       // offset: 0xc ordinal: 0x3
  ULONG unused : 15;               // offset: 0xc ordinal: 0x4
} wil_details_StagingConfigUsageTrigger;

// 0xc bytes (sizeof)
typedef struct wil_details_StagingConfigFeature {
  ULONG featureId;            // offset: 0x0 ordinal: 0x0
  ULONG changedInSession : 1; // offset: 0x4 ordinal: 0x1
  ULONG isVariantConfig : 1;  // offset: 0x4 ordinal: 0x2
  ULONG unused1 : 6;          // offset: 0x4 ordinal: 0x3
  ULONG serviceState : 2;     // offset: 0x4 ordinal: 0x4
  ULONG userState : 2;        // offset: 0x4 ordinal: 0x5
  ULONG testState : 2;        // offset: 0x4 ordinal: 0x6
  ULONG unused2 : 2;          // offset: 0x4 ordinal: 0x7
  ULONG unused3 : 8;          // offset: 0x4 ordinal: 0x8
  ULONG variant : 6;          // offset: 0x4 ordinal: 0x9
  ULONG payloadKind : 2;      // offset: 0x4 ordinal: 0xa
  ULONG payload;              // offset: 0x8 ordinal: 0xb
} wil_details_StagingConfigFeature;

// 0x4 bytes (sizeof)
typedef struct wil_details_VariantProperties {
  ULONG enabledState : 2;         // offset: 0x0 ordinal: 0x0
  ULONG isVariant : 1;            // offset: 0x0 ordinal: 0x1
  ULONG queuedForReporting : 1;   // offset: 0x0 ordinal: 0x2
  ULONG hasNotificationState : 2; // offset: 0x0 ordinal: 0x3
  ULONG recordedDeviceUsage : 1;  // offset: 0x0 ordinal: 0x4
  ULONG variant : 6;              // offset: 0x0 ordinal: 0x5
  ULONG unused : 19;              // offset: 0x0 ordinal: 0x6
} wil_details_VariantProperties;

// 0x4 bytes (sizeof)
typedef struct wil_details_FeatureProperties {
  ULONG enabledState : 2;                        // offset: 0x0 ordinal: 0x0
  ULONG isVariant : 1;                           // offset: 0x0 ordinal: 0x1
  ULONG queuedForReporting : 1;                  // offset: 0x0 ordinal: 0x2
  ULONG hasNotificationState : 2;                // offset: 0x0 ordinal: 0x3
  ULONG usageCount : 9;                          // offset: 0x0 ordinal: 0x4
  ULONG usageCountRepresentsPotential : 1;       // offset: 0x0 ordinal: 0x5
  ULONG reportedDeviceUsage : 1;                 // offset: 0x0 ordinal: 0x6
  ULONG reportedDevicePotential : 1;             // offset: 0x0 ordinal: 0x7
  ULONG reportedDeviceOpportunity : 1;           // offset: 0x0 ordinal: 0x8
  ULONG reportedDevicePotentialOpportunity : 1;  // offset: 0x0 ordinal: 0x9
  ULONG recordedDeviceUsage : 1;                 // offset: 0x0 ordinal: 0xa
  ULONG recordedDevicePotential : 1;             // offset: 0x0 ordinal: 0xb
  ULONG recordedDeviceOpportunity : 1;           // offset: 0x0 ordinal: 0xc
  ULONG recordedDevicePotentialOpportunity : 1;  // offset: 0x0 ordinal: 0xd
  ULONG opportunityCount : 7;                    // offset: 0x0 ordinal: 0xe
  ULONG opportunityCountRepresentsPotential : 1; // offset: 0x0 ordinal: 0xf
} wil_details_FeatureProperties;

// 0x0 bytes (sizeof)
typedef struct _HAL_PMC_COUNTERS {
} _HAL_PMC_COUNTERS;

// 0x0 bytes (sizeof)
typedef struct _ETW_EVENT_CALLBACK_CONTEXT {
} _ETW_EVENT_CALLBACK_CONTEXT;

// 0x0 bytes (sizeof)
typedef struct _ETW_SOFT_RESTART_CONTEXT {
} _ETW_SOFT_RESTART_CONTEXT;

// 0x0 bytes (sizeof)
typedef struct _EX_TIMER {
} _EX_TIMER;

// 0x0 bytes (sizeof)
typedef struct _ETW_STACK_CACHE {
} _ETW_STACK_CACHE;

// 0x0 bytes (sizeof)
typedef struct _ETW_PERFECT_HASH_FUNCTION {
} _ETW_PERFECT_HASH_FUNCTION;

// 0x0 bytes (sizeof)
typedef struct _EX_WNF_SUBSCRIPTION {
} _EX_WNF_SUBSCRIPTION;

// 0x0 bytes (sizeof)
typedef struct _DBGKP_ERROR_PORT {
} _DBGKP_ERROR_PORT;

// 0x0 bytes (sizeof)
typedef struct _CI_NGEN_PATHS {
} _CI_NGEN_PATHS;

// 0x0 bytes (sizeof)
typedef struct _SCSI_REQUEST_BLOCK {
} _SCSI_REQUEST_BLOCK;

// 0x0 bytes (sizeof)
typedef struct _JOB_NET_RATE_CONTROL {
} _JOB_NET_RATE_CONTROL;

// 0x0 bytes (sizeof)
typedef struct _PSP_STORAGE {
} _PSP_STORAGE;

// 0x0 bytes (sizeof)
typedef struct _JOB_CPU_RATE_CONTROL {
} _JOB_CPU_RATE_CONTROL;

// 0x0 bytes (sizeof)
typedef struct _JOB_NOTIFICATION_INFORMATION {
} _JOB_NOTIFICATION_INFORMATION;

// 0x0 bytes (sizeof)
typedef struct _JOB_ACCESS_STATE {
} _JOB_ACCESS_STATE;

// 0x4 bytes (sizeof)
typedef struct __anon_818 {
  struct _SCSI_REQUEST_BLOCK *Srb; // offset: 0x0 ordinal: 0x0
} __anon_818;

// 0x0 bytes (sizeof)
typedef struct _PO_PROCESS_ENERGY_CONTEXT {
} _PO_PROCESS_ENERGY_CONTEXT;

// 0x0 bytes (sizeof)
typedef struct _EPROCESS_QUOTA_BLOCK {
} _EPROCESS_QUOTA_BLOCK;

// 0x0 bytes (sizeof)
typedef struct _PAGEFAULT_HISTORY {
} _PAGEFAULT_HISTORY;

// 0x8 bytes (sizeof)
typedef struct _HIVE_WRITE_WAIT_QUEUE {
  struct _ETHREAD *ActiveThread;      // offset: 0x0 ordinal: 0x0
  struct _HIVE_WAIT_PACKET *WaitList; // offset: 0x4 ordinal: 0x1
} _HIVE_WRITE_WAIT_QUEUE;

// 0x0 bytes (sizeof)
typedef struct _DEVICE_NODE_IOMMU_EXTENSION {
} _DEVICE_NODE_IOMMU_EXTENSION;

// 0x4 bytes (sizeof)
typedef struct _ARBITER_ADD_RESERVED_PARAMETERS {
  struct _DEVICE_OBJECT *ReserveDevice; // offset: 0x0 ordinal: 0x0
} _ARBITER_ADD_RESERVED_PARAMETERS;

// 0x4 bytes (sizeof)
typedef union __anon_523 {
  struct _DEVICE_NODE *NextResourceDeviceNode; // offset: 0x0 ordinal: 0x0
} __anon_523;

typedef long long LONGLONG;

typedef short SHORT;

// 0x10 bytes (sizeof)
typedef struct _TIME_FIELDS {
  SHORT Year;         // offset: 0x0 ordinal: 0x0
  SHORT Month;        // offset: 0x2 ordinal: 0x1
  SHORT Day;          // offset: 0x4 ordinal: 0x2
  SHORT Hour;         // offset: 0x6 ordinal: 0x3
  SHORT Minute;       // offset: 0x8 ordinal: 0x4
  SHORT Second;       // offset: 0xa ordinal: 0x5
  SHORT Milliseconds; // offset: 0xc ordinal: 0x6
  SHORT Weekday;      // offset: 0xe ordinal: 0x7
} _TIME_FIELDS;

// 0x4 bytes (sizeof)
typedef struct __anon_2069 {
  SHORT Type;           // offset: 0x0 ordinal: 0x0
  SHORT DataInfoOffset; // offset: 0x2 ordinal: 0x1
} __anon_2069;

// 0x4 bytes (sizeof)
typedef struct __anon_2067 {
  SHORT DataLength;  // offset: 0x0 ordinal: 0x0
  SHORT TotalLength; // offset: 0x2 ordinal: 0x1
} __anon_2067;

// 0x4 bytes (sizeof)
typedef struct _RTL_AVL_TREE {
  struct _RTL_BALANCED_NODE *Root; // offset: 0x0 ordinal: 0x0
} _RTL_AVL_TREE;

typedef unsigned short WCHAR;

// 0xc bytes (sizeof)
typedef struct _RTL_SPLAY_LINKS {
  struct _RTL_SPLAY_LINKS *Parent;     // offset: 0x0 ordinal: 0x0
  struct _RTL_SPLAY_LINKS *LeftChild;  // offset: 0x4 ordinal: 0x1
  struct _RTL_SPLAY_LINKS *RightChild; // offset: 0x8 ordinal: 0x2
} _RTL_SPLAY_LINKS;

typedef char CHAR;

// 0x4 bytes (sizeof)
typedef struct _LDRP_CSLIST {
  struct _SINGLE_LIST_ENTRY *Tail; // offset: 0x0 ordinal: 0x0
} _LDRP_CSLIST;

// 0x4 bytes (sizeof)
typedef struct _SINGLE_LIST_ENTRY {
  struct _SINGLE_LIST_ENTRY *Next; // offset: 0x0 ordinal: 0x0
} _SINGLE_LIST_ENTRY;

// 0x4 bytes (sizeof)
typedef struct _EXT_IOMMU_DEVICE_ID_ACPI {
  CHAR *ObjectName; // offset: 0x0 ordinal: 0x0
} _EXT_IOMMU_DEVICE_ID_ACPI;

// 0x8 bytes (sizeof)
typedef struct _ETW_BUFFER_QUEUE {
  struct _SINGLE_LIST_ENTRY *QueueTail; // offset: 0x0 ordinal: 0x0
  struct _SINGLE_LIST_ENTRY QueueEntry; // offset: 0x4 ordinal: 0x1
} _ETW_BUFFER_QUEUE;

// 0x8 bytes (sizeof)
typedef struct _KDPC_LIST {
  struct _SINGLE_LIST_ENTRY ListHead;   // offset: 0x0 ordinal: 0x0
  struct _SINGLE_LIST_ENTRY *LastEntry; // offset: 0x4 ordinal: 0x1
} _KDPC_LIST;

// 0x0 bytes (sizeof)
typedef struct _ASSEMBLY_STORAGE_MAP {
} _ASSEMBLY_STORAGE_MAP;

// 0x4 bytes (sizeof)
typedef struct _ARBITER_QUERY_ARBITRATE_PARAMETERS {
  struct _LIST_ENTRY *ArbitrationList; // offset: 0x0 ordinal: 0x0
} _ARBITER_QUERY_ARBITRATE_PARAMETERS;

// 0x4 bytes (sizeof)
typedef struct _ARBITER_BOOT_ALLOCATION_PARAMETERS {
  struct _LIST_ENTRY *ArbitrationList; // offset: 0x0 ordinal: 0x0
} _ARBITER_BOOT_ALLOCATION_PARAMETERS;

// 0x8 bytes (sizeof)
typedef struct _LIST_ENTRY {
  struct _LIST_ENTRY *Flink; // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY *Blink; // offset: 0x4 ordinal: 0x1
} _LIST_ENTRY;

// 0x8 bytes (sizeof)
typedef struct __anon_3230 {
  struct _LIST_ENTRY ListHead; // offset: 0x0 ordinal: 0x0
} __anon_3230;

// 0xc bytes (sizeof)
typedef struct _TRIAGE_PNP_DEVICE_COMPLETION_REQUEST {
  struct _LIST_ENTRY ListEntry;           // offset: 0x0 ordinal: 0x0
  struct _TRIAGE_DEVICE_NODE *DeviceNode; // offset: 0x8 ordinal: 0x1
} _TRIAGE_PNP_DEVICE_COMPLETION_REQUEST;

// 0x8 bytes (sizeof)
typedef struct _ARC_DISK_INFORMATION {
  struct _LIST_ENTRY DiskSignatures; // offset: 0x0 ordinal: 0x0
} _ARC_DISK_INFORMATION;

// 0xc bytes (sizeof)
typedef struct _DELAY_ACK_FO {
  struct _LIST_ENTRY Links;                // offset: 0x0 ordinal: 0x0
  struct _FILE_OBJECT *OriginalFileObject; // offset: 0x8 ordinal: 0x1
} _DELAY_ACK_FO;

// 0x8 bytes (sizeof)
typedef struct _TRIAGE_PNP_DEVICE_COMPLETION_QUEUE {
  struct _LIST_ENTRY DispatchedList; // offset: 0x0 ordinal: 0x0
} _TRIAGE_PNP_DEVICE_COMPLETION_QUEUE;

// 0x18 bytes (sizeof)
typedef struct _CM_KCB_LAYER_INFO {
  struct _LIST_ENTRY LayerListEntry;     // offset: 0x0 ordinal: 0x0
  struct _CM_KEY_CONTROL_BLOCK *Kcb;     // offset: 0x8 ordinal: 0x1
  struct _CM_KCB_LAYER_INFO *LowerLayer; // offset: 0xc ordinal: 0x2
  struct _LIST_ENTRY UpperLayerListHead; // offset: 0x10 ordinal: 0x3
} _CM_KCB_LAYER_INFO;

// 0x8 bytes (sizeof)
typedef struct _MMWORKING_SET_EXPANSION_HEAD {
  struct _LIST_ENTRY ListHead; // offset: 0x0 ordinal: 0x0
} _MMWORKING_SET_EXPANSION_HEAD;

typedef VOID (*__anon_2491)(struct _HAL_PMC_COUNTERS *);

typedef VOID (*__anon_711)(struct _DEVICE_OBJECT *, struct _DEVICE_OBJECT *);

typedef VOID (*__anon_710)(struct _FILE_OBJECT *);

typedef VOID (*__anon_115)();

// 0x8 bytes (sizeof)
typedef struct __anon_3229 {
  VOID *UserData; // offset: 0x0 ordinal: 0x0
  VOID *Owner;    // offset: 0x4 ordinal: 0x1
} __anon_3229;

// 0x4 bytes (sizeof)
typedef struct _KWAIT_CHAIN {
  VOID *Head; // offset: 0x0 ordinal: 0x0
} _KWAIT_CHAIN;

// 0x8 bytes (sizeof)
typedef struct _MI_DLL_OVERFLOW_AREA {
  VOID *RangeStart; // offset: 0x0 ordinal: 0x0
  VOID *NextVa;     // offset: 0x4 ordinal: 0x1
} _MI_DLL_OVERFLOW_AREA;

// 0xc bytes (sizeof)
typedef struct _NLS_DATA_BLOCK {
  VOID *AnsiCodePageData;     // offset: 0x0 ordinal: 0x0
  VOID *OemCodePageData;      // offset: 0x4 ordinal: 0x1
  VOID *UnicodeCaseTableData; // offset: 0x8 ordinal: 0x2
} _NLS_DATA_BLOCK;

// 0xc bytes (sizeof)
typedef struct _HAL_LBR_ENTRY {
  VOID *FromAddress; // offset: 0x0 ordinal: 0x0
  VOID *ToAddress;   // offset: 0x4 ordinal: 0x1
  VOID *Reserved;    // offset: 0x8 ordinal: 0x2
} _HAL_LBR_ENTRY;

typedef VOID *(*__anon_2504)();

// 0x24 bytes (sizeof)
typedef struct _VI_FAULT_TRACE {
  struct _ETHREAD *Thread; // offset: 0x0 ordinal: 0x0
  VOID *StackTrace[8];     // offset: 0x4 ordinal: 0x1
} _VI_FAULT_TRACE;

// 0x20 bytes (sizeof)
typedef struct _VF_KE_CRITICAL_REGION_TRACE {
  struct _ETHREAD *Thread; // offset: 0x0 ordinal: 0x0
  VOID *StackTrace[7];     // offset: 0x4 ordinal: 0x1
} _VF_KE_CRITICAL_REGION_TRACE;

// 0x8 bytes (sizeof)
typedef struct _OB_EXTENDED_USER_INFO {
  VOID *Context1; // offset: 0x0 ordinal: 0x0
  VOID *Context2; // offset: 0x4 ordinal: 0x1
} _OB_EXTENDED_USER_INFO;

// 0x4 bytes (sizeof)
typedef struct _ALPC_HANDLE_ENTRY {
  VOID *Object; // offset: 0x0 ordinal: 0x0
} _ALPC_HANDLE_ENTRY;

// 0x8 bytes (sizeof)
typedef struct __anon_1944 {
  struct _FILE_OBJECT *FileObject; // offset: 0x0 ordinal: 0x0
  VOID *DiskIoAttribution;         // offset: 0x4 ordinal: 0x1
} __anon_1944;

// 0x4 bytes (sizeof)
typedef struct __anon_1726 {
  VOID *CheckStack; // offset: 0x0 ordinal: 0x0
} __anon_1726;

// 0x8 bytes (sizeof)
typedef struct _CMSI_PROCESS_TUPLE {
  VOID *ProcessHandle;    // offset: 0x0 ordinal: 0x0
  VOID *ProcessReference; // offset: 0x4 ordinal: 0x1
} _CMSI_PROCESS_TUPLE;

// 0x4 bytes (sizeof)
typedef struct _CMSI_RW_LOCK {
  VOID *Reserved; // offset: 0x0 ordinal: 0x0
} _CMSI_RW_LOCK;

// 0xc bytes (sizeof)
typedef struct _CMP_VOLUME_MANAGER {
  struct _CMSI_RW_LOCK VolumeContextListLock; // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY VolumeContextListHead;   // offset: 0x4 ordinal: 0x1
} _CMP_VOLUME_MANAGER;

// 0x14 bytes (sizeof)
typedef struct __anon_1046 {
  VOID *Argument1; // offset: 0x0 ordinal: 0x0
  VOID *Argument2; // offset: 0x4 ordinal: 0x1
  VOID *Argument3; // offset: 0x8 ordinal: 0x2
  VOID *Argument4; // offset: 0xc ordinal: 0x3
  VOID *Argument5; // offset: 0x10 ordinal: 0x4
} __anon_1046;

// 0x4 bytes (sizeof)
typedef struct __anon_916 {
  VOID *Notification; // offset: 0x0 ordinal: 0x0
} __anon_916;

// 0x8 bytes (sizeof)
typedef struct _IO_COMPLETION_CONTEXT {
  VOID *Port; // offset: 0x0 ordinal: 0x0
  VOID *Key;  // offset: 0x4 ordinal: 0x1
} _IO_COMPLETION_CONTEXT;

// 0xc bytes (sizeof)
typedef struct _SECTION_OBJECT_POINTERS {
  VOID *DataSectionObject;  // offset: 0x0 ordinal: 0x0
  VOID *SharedCacheMap;     // offset: 0x4 ordinal: 0x1
  VOID *ImageSectionObject; // offset: 0x8 ordinal: 0x2
} _SECTION_OBJECT_POINTERS;

// 0x10 bytes (sizeof)
typedef struct __anon_834 {
  VOID *Argument1; // offset: 0x0 ordinal: 0x0
  VOID *Argument2; // offset: 0x4 ordinal: 0x1
  VOID *Argument3; // offset: 0x8 ordinal: 0x2
  VOID *Argument4; // offset: 0xc ordinal: 0x3
} __anon_834;

// 0x8 bytes (sizeof)
typedef struct _TERMINATION_PORT {
  struct _TERMINATION_PORT *Next; // offset: 0x0 ordinal: 0x0
  VOID *Port;                     // offset: 0x4 ordinal: 0x1
} _TERMINATION_PORT;

// 0x8 bytes (sizeof)
typedef struct _IO_CLIENT_EXTENSION {
  struct _IO_CLIENT_EXTENSION *NextExtension; // offset: 0x0 ordinal: 0x0
  VOID *ClientIdentificationAddress;          // offset: 0x4 ordinal: 0x1
} _IO_CLIENT_EXTENSION;

typedef VOID (*__anon_690)(struct _DEVICE_OBJECT *, VOID *);

// 0x18 bytes (sizeof)
typedef struct _IO_TIMER {
  SHORT Type;                   // offset: 0x0 ordinal: 0x0
  SHORT TimerFlag;              // offset: 0x2 ordinal: 0x1
  struct _LIST_ENTRY TimerList; // offset: 0x4 ordinal: 0x2
  VOID(*TimerRoutine)
  (struct _DEVICE_OBJECT *, VOID *);   // offset: 0xc ordinal: 0x3
  VOID *Context;                       // offset: 0x10 ordinal: 0x4
  struct _DEVICE_OBJECT *DeviceObject; // offset: 0x14 ordinal: 0x5
} _IO_TIMER;

typedef VOID (*__anon_427)(VOID *, VOID *, VOID *);

typedef VOID (*__anon_349)(VOID *);

// 0x10 bytes (sizeof)
typedef struct _WORK_QUEUE_ITEM {
  struct _LIST_ENTRY List;       // offset: 0x0 ordinal: 0x0
  VOID (*WorkerRoutine)(VOID *); // offset: 0x8 ordinal: 0x1
  VOID *Parameter;               // offset: 0xc ordinal: 0x2
} _WORK_QUEUE_ITEM;

// 0x14 bytes (sizeof)
typedef struct _MI_COMBINE_WORKITEM {
  VOID *NextEntry;                  // offset: 0x0 ordinal: 0x0
  struct _WORK_QUEUE_ITEM WorkItem; // offset: 0x4 ordinal: 0x1
} _MI_COMBINE_WORKITEM;

typedef VOID (*__anon_233)(VOID *, VOID *, VOID *, VOID *);

// 0x10 bytes (sizeof)
typedef struct _KREQUEST_PACKET {
  VOID *CurrentPacket[3]; // offset: 0x0 ordinal: 0x0
  VOID(*WorkerRoutine)
  (VOID *, VOID *, VOID *, VOID *); // offset: 0xc ordinal: 0x1
} _KREQUEST_PACKET;

// 0x24 bytes (sizeof)
typedef struct _FAST_OWNER_ENTRY {
  VOID *Reserved[9]; // offset: 0x0 ordinal: 0x0
} _FAST_OWNER_ENTRY;

// 0x34 bytes (sizeof)
typedef struct _VF_BTS_DATA_MANAGEMENT_AREA {
  VOID *BTSBufferBase;          // offset: 0x0 ordinal: 0x0
  VOID *BTSIndex;               // offset: 0x4 ordinal: 0x1
  VOID *BTSMax;                 // offset: 0x8 ordinal: 0x2
  VOID *BTSInterruptThreshold;  // offset: 0xc ordinal: 0x3
  VOID *PEBSBufferBase;         // offset: 0x10 ordinal: 0x4
  VOID *PEBSIndex;              // offset: 0x14 ordinal: 0x5
  VOID *PEBSMax;                // offset: 0x18 ordinal: 0x6
  VOID *PEBSInterruptThreshold; // offset: 0x1c ordinal: 0x7
  VOID *PEBSCounterReset[2];    // offset: 0x20 ordinal: 0x8
  CHAR Reserved[12];            // offset: 0x28 ordinal: 0x9
} _VF_BTS_DATA_MANAGEMENT_AREA;

// 0x8 bytes (sizeof)
typedef struct RTL_HP_ENV_HANDLE {
  VOID *h[2]; // offset: 0x0 ordinal: 0x0
} RTL_HP_ENV_HANDLE;

// 0x40 bytes (sizeof)
typedef struct _OBJECT_REF_TRACE {
  VOID *StackTrace[16]; // offset: 0x0 ordinal: 0x0
} _OBJECT_REF_TRACE;

// 0x8 bytes (sizeof)
typedef struct _CLIENT_ID {
  VOID *UniqueProcess; // offset: 0x0 ordinal: 0x0
  VOID *UniqueThread;  // offset: 0x4 ordinal: 0x1
} _CLIENT_ID;

typedef VOID (*__anon_52)(VOID *, VOID *);

// 0x0 bytes (sizeof)
typedef struct _TP_CALLBACK_INSTANCE {
} _TP_CALLBACK_INSTANCE;

typedef VOID (*__anon_54)(struct _TP_CALLBACK_INSTANCE *, VOID *);

// 0x0 bytes (sizeof)
typedef struct _ACTIVATION_CONTEXT {
} _ACTIVATION_CONTEXT;

// 0x0 bytes (sizeof)
typedef struct _TP_CLEANUP_GROUP {
} _TP_CLEANUP_GROUP;

// 0x0 bytes (sizeof)
typedef struct _TP_POOL {
} _TP_POOL;

typedef long LONG;

typedef enum _CM_SHARE_DISPOSITION {
  CmResourceShareUndetermined = 0,    // ordinal: 0x0
  CmResourceShareDeviceExclusive = 1, // ordinal: 0x1
  CmResourceShareDriverExclusive = 2, // ordinal: 0x2
  CmResourceShareShared = 3,          // ordinal: 0x3
} _CM_SHARE_DISPOSITION;

typedef enum _ETW_HEADER_TYPE {
  EtwHeaderTypeNative = 0, // ordinal: 0x0
  EtwHeaderTypeMax = 1,    // ordinal: 0x1
} _ETW_HEADER_TYPE;

typedef enum _MI_AVAILABLE_PAGE_WAIT_TYPES {
  AvailablePagesWaitLow = 0,      // ordinal: 0x0
  AvailablePagesWaitHigh = 1,     // ordinal: 0x1
  AvailablePagesWaitVeryHigh = 2, // ordinal: 0x2
  AvailablePagesWaitMaximum = 3,  // ordinal: 0x3
} _MI_AVAILABLE_PAGE_WAIT_TYPES;

typedef enum _PO_MODERN_SLEEP_ACTION {
  PoModernSleepActionGlobalActivatorsVeto = 0,               // ordinal: 0x0
  PoModernSleepActionNonBlockingPhases = 1,                  // ordinal: 0x1
  PoModernSleepActionForceIdle = 2,                          // ordinal: 0x2
  PoModernSleepActionMinimalBlockingNotificationClients = 3, // ordinal: 0x3
  PoModernSleepActionMax = 4,                                // ordinal: 0x4
} _PO_MODERN_SLEEP_ACTION;

typedef enum _MI_MIRROR_BITMAP_TYPES {
  MirrorBitmapTypeNormal = 0,      // ordinal: 0x0
  MirrorBitmapTypeInterlocked = 1, // ordinal: 0x1
  MirrorBitmapTypeMaximum = 2,     // ordinal: 0x2
} _MI_MIRROR_BITMAP_TYPES;

typedef enum JOB_OBJECT_NET_RATE_CONTROL_FLAGS {
  JOB_OBJECT_NET_RATE_CONTROL_ENABLE = 1,        // ordinal: 0x0
  JOB_OBJECT_NET_RATE_CONTROL_MAX_BANDWIDTH = 2, // ordinal: 0x1
  JOB_OBJECT_NET_RATE_CONTROL_DSCP_TAG = 4,      // ordinal: 0x2
  JOB_OBJECT_NET_RATE_CONTROL_VALID_FLAGS = 7,   // ordinal: 0x3
} JOB_OBJECT_NET_RATE_CONTROL_FLAGS;

typedef enum PDC_ACTIVITY_TYPE {
  PdcNetwork = 0,         // ordinal: 0x0
  PdcSystem = 1,          // ordinal: 0x1
  PdcTimer = 2,           // ordinal: 0x2
  PdcAllNetworks = 3,     // ordinal: 0x3
  PdcAnyNetwork = 4,      // ordinal: 0x4
  PdcInvalidActivity = 5, // ordinal: 0x5
  PdcMaxActivity = 5,     // ordinal: 0x6
} PDC_ACTIVITY_TYPE;

typedef enum ReplacesCorHdrNumericDefines {
  COMIMAGE_FLAGS_ILONLY = 1,                      // ordinal: 0x0
  COMIMAGE_FLAGS_32BITREQUIRED = 2,               // ordinal: 0x1
  COMIMAGE_FLAGS_IL_LIBRARY = 4,                  // ordinal: 0x2
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,            // ordinal: 0x3
  COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 16,          // ordinal: 0x4
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 65536,          // ordinal: 0x5
  COMIMAGE_FLAGS_32BITPREFERRED = 131072,         // ordinal: 0x6
  COR_VERSION_MAJOR_V2 = 2,                       // ordinal: 0x7
  COR_VERSION_MAJOR = 2,                          // ordinal: 0x8
  COR_VERSION_MINOR = 5,                          // ordinal: 0x9
  COR_DELETED_NAME_LENGTH = 8,                    // ordinal: 0xa
  COR_VTABLEGAP_NAME_LENGTH = 8,                  // ordinal: 0xb
  NATIVE_TYPE_MAX_CB = 1,                         // ordinal: 0xc
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,     // ordinal: 0xd
  IMAGE_COR_MIH_METHODRVA = 1,                    // ordinal: 0xe
  IMAGE_COR_MIH_EHRVA = 2,                        // ordinal: 0xf
  IMAGE_COR_MIH_BASICBLOCK = 8,                   // ordinal: 0x10
  COR_VTABLE_32BIT = 1,                           // ordinal: 0x11
  COR_VTABLE_64BIT = 2,                           // ordinal: 0x12
  COR_VTABLE_FROM_UNMANAGED = 4,                  // ordinal: 0x13
  COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8, // ordinal: 0x14
  COR_VTABLE_CALL_MOST_DERIVED = 16,              // ordinal: 0x15
  IMAGE_COR_EATJ_THUNK_SIZE = 32,                 // ordinal: 0x16
  MAX_CLASS_NAME = 1024,                          // ordinal: 0x17
  MAX_PACKAGE_NAME = 1024,                        // ordinal: 0x18
} ReplacesCorHdrNumericDefines;

typedef enum _VRF_TRIAGE_CONTEXT {
  VRF_TRIAGE_CONTEXT_NONE = 0,               // ordinal: 0x0
  VRF_TRIAGE_CONTEXT_DEFAULT = 1,            // ordinal: 0x1
  VRF_TRIAGE_CONTEXT_DEVELOPMENT = 1,        // ordinal: 0x2
  VRF_TRIAGE_CONTEXT_CERTIFICATION = 2,      // ordinal: 0x3
  VRF_TRIAGE_CONTEXT_FLIGHT_TARGETED = 3,    // ordinal: 0x4
  VRF_TRIAGE_CONTEXT_FLIGHT_DIAGNOSTICS = 4, // ordinal: 0x5
  VRF_TRIAGE_CONTEXT_FLIGHT_MONITORING = 5,  // ordinal: 0x6
  NUM_VRF_TRIAGE_CONTEXTS = 6,               // ordinal: 0x7
} _VRF_TRIAGE_CONTEXT;

typedef enum _PROCESS_TERMINATE_REQUEST_REASON {
  ProcessTerminateRequestReasonNone = 0,            // ordinal: 0x0
  ProcessTerminateCommitFail = 1,                   // ordinal: 0x1
  ProcessTerminateWriteToExecuteMemory = 2,         // ordinal: 0x2
  ProcessTerminateAttachedWriteToExecuteMemory = 3, // ordinal: 0x3
  ProcessTerminateRequestReasonMax = 4,             // ordinal: 0x4
} _PROCESS_TERMINATE_REQUEST_REASON;

typedef enum _ConnectionResourceConsumerDesc {
  ConnectionResourceConsumerDescIsUndefined = 0, // ordinal: 0x0
  ConnectionResourceConsumerDescIsDevice = 1,    // ordinal: 0x1
  ConnectionResourceConsumerDescIsOpregion = 2,  // ordinal: 0x2
  ConnectionResourceConsumerDescMax = 3,         // ordinal: 0x3
} _ConnectionResourceConsumerDesc;

typedef enum _MI_VAD_ALLOCATION_CELL_TYPE {
  MiVadBottomUp = 0,              // ordinal: 0x0
  MiVadStackPebTeb = 1,           // ordinal: 0x1
  MiVadAllocationCellMaximum = 2, // ordinal: 0x2
} _MI_VAD_ALLOCATION_CELL_TYPE;

typedef enum _PPM_PERF_QOS_DISABLE_REASON {
  PpmPerfQosDisableInternal = 0,           // ordinal: 0x0
  PpmPerfQosDisableNoProfile = 1,          // ordinal: 0x1
  PpmPerfQosDisableNoPolicy = 2,           // ordinal: 0x2
  PpmPerfQosDisableInsufficientPolicy = 3, // ordinal: 0x3
  PpmPerfQosDisableMaxOverride = 4,        // ordinal: 0x4
  PpmPerfQosDisableLowLatency = 5,         // ordinal: 0x5
  PpmPerfQosDisableSmtScheduler = 6,       // ordinal: 0x6
  PpmPerfQosDisableNoHardwareSupport = 7,  // ordinal: 0x7
  PpmPerfQosDisableGroupPolicy = 8,        // ordinal: 0x8
  PpmPerfQosDisableMax = 9,                // ordinal: 0x9
} _PPM_PERF_QOS_DISABLE_REASON;

typedef enum _HV_EXT_EPF_MODE {
  HvExtEpfModeMin = 0, // ordinal: 0x0
  HvExtEpfModeNt = 0,  // ordinal: 0x1
  HvExtEpfModeMax = 1, // ordinal: 0x2
} _HV_EXT_EPF_MODE;

typedef enum _MI_CROSS_PARTITION_CHARGE_TYPE {
  MiCrossPartitionSectionResAvailCharge = 0,     // ordinal: 0x0
  MiCrossPartitionSectionCommitCharge = 1,       // ordinal: 0x1
  MiCrossPartitionPageCombineResAvailCharge = 2, // ordinal: 0x2
  MiCrossPartitionPageCombineCommitCharge = 3,   // ordinal: 0x3
  MiCrossPartitionLargePageResAvailCharge = 4,   // ordinal: 0x4
  MiCrossPartitionLargePageCommitCharge = 5,     // ordinal: 0x5
  MiCrossPartitionPageCloneResAvailCharge = 6,   // ordinal: 0x6
  MiCrossPartitionMaximumCharge = 7,             // ordinal: 0x7
} _MI_CROSS_PARTITION_CHARGE_TYPE;

typedef enum _THREAD_WORKLOAD_CLASS {
  ThreadWorkloadClassDefault = 0,  // ordinal: 0x0
  ThreadWorkloadClassGraphics = 1, // ordinal: 0x1
  MaxThreadWorkloadClass = 2,      // ordinal: 0x2
} _THREAD_WORKLOAD_CLASS;

typedef enum LSA_FOREST_TRUST_RECORD_TYPE {
  ForestTrustTopLevelName = 0,   // ordinal: 0x0
  ForestTrustTopLevelNameEx = 1, // ordinal: 0x1
  ForestTrustDomainInfo = 2,     // ordinal: 0x2
  ForestTrustRecordTypeLast = 2, // ordinal: 0x3
} LSA_FOREST_TRUST_RECORD_TYPE;

typedef enum SLEEPSTUDY_SPM_SCENARIO_CS_EXIT {
  SpmScenarioStopReasonUnspecified = 16, // ordinal: 0x0
  SpmScenarioStopReasonCsExit = 17,      // ordinal: 0x1
  SpmScenarioStopReasonMax = 18,         // ordinal: 0x2
} SLEEPSTUDY_SPM_SCENARIO_CS_EXIT;

typedef enum PDCCLIENTID {
  PDC_INVALID_CLIENT = 0,                             // ordinal: 0x0
  PDC_PLM_CLIENT = 1,                                 // ordinal: 0x1
  PDC_NQM_CLIENT = 2,                                 // ordinal: 0x2
  PDC_WNS_CLIENT = 3,                                 // ordinal: 0x3
  PDC_DAM_CLIENT = 4,                                 // ordinal: 0x4
  PDC_WCM_CLIENT = 5,                                 // ordinal: 0x5
  PDC_NCSI_CLIENT = 7,                                // ordinal: 0x6
  PDC_DHCP_CLIENT = 8,                                // ordinal: 0x7
  PDC_TCPIP_CLIENT = 9,                               // ordinal: 0x8
  PDC_WU_CLIENT = 11,                                 // ordinal: 0x9
  PDC_GP_CLIENT = 12,                                 // ordinal: 0xa
  PDC_NCA_CLIENT = 14,                                // ordinal: 0xb
  PDC_BI_CLIENT = 15,                                 // ordinal: 0xc
  PDC_MSCHED_CLIENT = 16,                             // ordinal: 0xd
  PDC_SUSPENDRESUME_CLIENT = 17,                      // ordinal: 0xe
  PDC_INTERNAL_CLIENT = 18,                           // ordinal: 0xf
  PDC_ACTIVATION_TEST_CLIENT = 19,                    // ordinal: 0x10
  PDC_PLM_PHASE_TEST_CLIENT = 20,                     // ordinal: 0x11
  PDC_DAM_PHASE_TEST_CLIENT = 21,                     // ordinal: 0x12
  PDC_LOW_POWER_PHASE_TEST_CLIENT = 22,               // ordinal: 0x13
  PDC_RESILIENCY_NOTIFICATION_PHASE_TEST_CLIENT = 23, // ordinal: 0x14
  PDC_NQM_RESILIENCY_TEST_CLIENT = 24,                // ordinal: 0x15
  PDC_DAM_RESILIENCY_TEST_CLIENT = 25,                // ordinal: 0x16
  PDC_DAM_KM_TEST_CLIENT = 26,                        // ordinal: 0x17
  PDC_DAM_UM_TEST_CLIENT = 27,                        // ordinal: 0x18
  PDC_SINGLETON_TEST_CLIENT = 28,                     // ordinal: 0x19
  PDC_NETWORK_SERVICE_TEST_CLIENT = 29,               // ordinal: 0x1a
  PDC_NETWORK_SERVICE2_TEST_CLIENT = 30,              // ordinal: 0x1b
  PDC_SYSTEM_SERVICE_TEST_CLIENT = 31,                // ordinal: 0x1c
  PDC_ACTIV_NOTIF_DAM_RESIL_TEST_CLIENT = 32,         // ordinal: 0x1d
  PDC_ACTIV_NOTIF_NET_RESIL_TEST_CLIENT = 33,         // ordinal: 0x1e
  PDC_SHELL_CLIENT = 34,                              // ordinal: 0x1f
  PDC_MAINTENANCE_CLIENT = 35,                        // ordinal: 0x20
  PDC_SYNC_CLIENT = 36,                               // ordinal: 0x21
  PDC_IDM_CLIENT = 37,                                // ordinal: 0x22
  PDC_CORTANA_VOICE_ACTIVATION_CLIENT = 38,           // ordinal: 0x23
  PDC_TETHERING_CLIENT = 39,                          // ordinal: 0x24
  PDC_AUDIO_CLIENT = 40,                              // ordinal: 0x25
  PDC_LOCK_SCREEN = 41,                               // ordinal: 0x26
  PDC_LREC_CLIENT = 42,                               // ordinal: 0x27
  PDC_WP_BW_CLIENT = 43,                              // ordinal: 0x28
  PDC_WP_MEDIA_STREAMING_CLIENT = 44,                 // ordinal: 0x29
  PDC_WP_MAPS_CLIENT = 46,                            // ordinal: 0x2a
  PDC_WP_SYNC_CLIENT = 47,                            // ordinal: 0x2b
  PDC_SETTING_SYNC_CLIENT = 48,                       // ordinal: 0x2c
  PDC_WP_EDM_CLIENT = 49,                             // ordinal: 0x2d
  PDC_WP_WALLET_CLIENT = 50,                          // ordinal: 0x2e
  PDC_WP_LOCATION_CLIENT = 51,                        // ordinal: 0x2f
  PDC_WP_CM_CLIENT = 53,                              // ordinal: 0x30
  PDC_WP_DCP_CLIENT = 54,                             // ordinal: 0x31
  PDC_WP_WIFIAUTO_CLIENT = 55,                        // ordinal: 0x32
  PDC_BITLOCKER_CLIENT = 56,                          // ordinal: 0x33
  PDC_MDM_CERTINSTALLER_CLIENT = 57,                  // ordinal: 0x34
  PDC_WP_IM_CLIENT = 58,                              // ordinal: 0x35
  PDC_WP_MMS_CLIENT = 59,                             // ordinal: 0x36
  PDC_DEVICEENROLLER_CLIENT = 60,                     // ordinal: 0x37
  PDC_WP_WIFI_SCANNING_CLIENT = 61,                   // ordinal: 0x38
  PDC_WP_OMADM_CLIENT = 62,                           // ordinal: 0x39
  PDC_WP_TELEMETRY_CHECK_CLIENT = 63,                 // ordinal: 0x3a
  PDC_WP_DIS_CLIENT = 64,                             // ordinal: 0x3b
  PDC_BITS_CLIENT = 65,                               // ordinal: 0x3c
  PDC_WP_VOIP_EXECUTION_CLIENT = 66,                  // ordinal: 0x3d
  PDC_WP_RESERVED_CLIENT3 = 67,                       // ordinal: 0x3e
  PDC_SLEEP_STUDY_CLIENT = 68,                        // ordinal: 0x3f
  PDC_WP_AUTOTIMEUPDATE_CLIENT = 69,                  // ordinal: 0x40
  PDC_HYPERV_CLIENT = 70,                             // ordinal: 0x41
  PDC_KM_SIGNAL_CLIENT = 71,                          // ordinal: 0x42
  PDC_UM_SIGNAL_CLIENT = 72,                          // ordinal: 0x43
  PDC_DEVICE_HEALTH_ATTESTATION_CLIENT = 73,          // ordinal: 0x44
  PDC_XB_SYSTEM_CLIENT = 74,                          // ordinal: 0x45
  PDC_XB_HOST_CLIENT = 75,                            // ordinal: 0x46
  PDC_PRINT_JOB_MANAGER_CLIENT = 76,                  // ordinal: 0x47
  PDC_TELEMETRY_CLIENT = 77,                          // ordinal: 0x48
  PDC_ERROR_REPORTING_CLIENT = 78,                    // ordinal: 0x49
  PDC_XBOX_NTM = 79,                                  // ordinal: 0x4a
  PDC_CBE_CLIENT = 80,                                // ordinal: 0x4b
  PDC_FIND_MY_PHONE_CLIENT = 81,                      // ordinal: 0x4c
  PDC_COMMAND_CHANNEL_CLIENT = 82,                    // ordinal: 0x4d
  PDC_PPM_PROFILES_CLIENT = 83,                       // ordinal: 0x4e
  PDC_WIFI_CALLING_CLIENT = 84,                       // ordinal: 0x4f
  PDC_WU_REBOOT_CLIENT = 85,                          // ordinal: 0x50
  PDC_SYSMAIN_CLIENT = 86,                            // ordinal: 0x51
  PDC_XBOX_UPDATE_CLIENT = 87,                        // ordinal: 0x52
  PDC_CHAT_SERVICE_CLIENT = 88,                       // ordinal: 0x53
  PDC_FIND_MY_DEVICE_CLIENT = 89,                     // ordinal: 0x54
  PDC_NOTIFICATION_FORWARDING_AND_ACTION_CLIENT = 90, // ordinal: 0x55
  PDC_INSTALL_AGENT_CLIENT = 91,                      // ordinal: 0x56
  PDC_XBOX_WAKE_ON_VOICE = 92,                        // ordinal: 0x57
  PDC_PLM_AUDIO_CLIENT = 93,                          // ordinal: 0x58
  PDC_WP_BCKAUDIO_CLIENT = 94,                        // ordinal: 0x59
  PDC_WAKE_ON_LAN_CLIENT = 95,                        // ordinal: 0x5a
  PDC_WP_CLOUD_MESSAGING_CLIENT = 96,                 // ordinal: 0x5b
  PDC_DATA_MIGRATION_MANAGER = 97,                    // ordinal: 0x5c
  PDC_EVENT_SOUND_MANAGER_CLIENT = 98,                // ordinal: 0x5d
  PDC_WWAN_DORMANCY_HINT_CLIENT = 99,                 // ordinal: 0x5e
  PDC_HAM_CLIENT = 100,                               // ordinal: 0x5f
  PDC_FILESHARINGSERVER_CLIENT = 101,                 // ordinal: 0x60
  PDC_DIRECTED_DRIPS_TASK_CLIENT = 102,               // ordinal: 0x61
  PDC_DIRECTED_DRIPS_LPE_CLIENT = 103,                // ordinal: 0x62
  PDC_DIRECTED_DRIPS_PLM_CLIENT = 104,                // ordinal: 0x63
  PDC_HTTPSDATASOURCE_CLIENT = 105,                   // ordinal: 0x64
  PDC_TERMINALSERVER_CONNECTION_CLIENT = 106,         // ordinal: 0x65
  PDC_TERMINALSERVER_SESSION_CLIENT = 107,            // ordinal: 0x66
  PDC_ANYNETWORK_RESILIENCY_CLIENT = 108,             // ordinal: 0x67
  PDC_XBOX_NUI_CLIENT = 110,                          // ordinal: 0x68
  PDC_WIFI_CALLING_IMS_CLIENT = 111,                  // ordinal: 0x69
  PDC_SLEEPSTUDY_HELPER_USER_CLIENT = 112,            // ordinal: 0x6a
  PDC_SLEEPSTUDY_HELPER_KERNEL_CLIENT = 113,          // ordinal: 0x6b
  PDC_NUMBER_OF_CLIENTS = 114,                        // ordinal: 0x6c
} PDCCLIENTID;

typedef enum _PERFINFO_MM_STAT {
  PerfInfoMMStatNotUsed = 0,              // ordinal: 0x0
  PerfInfoMMStatAggregatePageCombine = 1, // ordinal: 0x1
  PerfInfoMMStatIterationPageCombine = 2, // ordinal: 0x2
  PerfInfoMMStatMax = 3,                  // ordinal: 0x3
} _PERFINFO_MM_STAT;

typedef enum _MI_PARTITION_THREAD {
  MiZeroPageThreadSlot = 0,             // ordinal: 0x0
  MiPartitionWorkingSetManagerSlot = 1, // ordinal: 0x1
  MiDereferenceSegmentThreadSlot = 2,   // ordinal: 0x2
  MiModifiedPageWriterSlot = 3,         // ordinal: 0x3
  MiMappedPageWriterSlot = 4,           // ordinal: 0x4
  MiNumberOfPartitionThreads = 5,       // ordinal: 0x5
} _MI_PARTITION_THREAD;

typedef enum _TRACE_INFORMATION_CLASS {
  TraceIdClass = 0,                    // ordinal: 0x0
  TraceHandleClass = 1,                // ordinal: 0x1
  TraceEnableFlagsClass = 2,           // ordinal: 0x2
  TraceEnableLevelClass = 3,           // ordinal: 0x3
  GlobalLoggerHandleClass = 4,         // ordinal: 0x4
  EventLoggerHandleClass = 5,          // ordinal: 0x5
  AllLoggerHandlesClass = 6,           // ordinal: 0x6
  TraceHandleByNameClass = 7,          // ordinal: 0x7
  LoggerEventsLostClass = 8,           // ordinal: 0x8
  TraceSessionSettingsClass = 9,       // ordinal: 0x9
  LoggerEventsLoggedClass = 10,        // ordinal: 0xa
  DiskIoNotifyRoutinesClass = 11,      // ordinal: 0xb
  TraceInformationClassReserved1 = 12, // ordinal: 0xc
  AllPossibleNotifyRoutinesClass = 12, // ordinal: 0xd
  FltIoNotifyRoutinesClass = 13,       // ordinal: 0xe
  TraceInformationClassReserved2 = 14, // ordinal: 0xf
  WdfNotifyRoutinesClass = 15,         // ordinal: 0x10
  MaxTraceInformationClass = 16,       // ordinal: 0x11
} _TRACE_INFORMATION_CLASS;

typedef enum _MI_IO_PFN_TYPE {
  MiIoPfnProbes = 0,      // ordinal: 0x0
  MiIoPfnMaps = 1,        // ordinal: 0x1
  MiIoPfnUnmapped = 2,    // ordinal: 0x2
  MiMaximumIoPfnType = 3, // ordinal: 0x3
} _MI_IO_PFN_TYPE;

typedef enum TlgOut_t {
  TlgOutNULL = 0,                  // ordinal: 0x0
  TlgOutNOPRINT = 1,               // ordinal: 0x1
  TlgOutSTRING = 2,                // ordinal: 0x2
  TlgOutBOOLEAN = 3,               // ordinal: 0x3
  TlgOutHEX = 4,                   // ordinal: 0x4
  TlgOutPID = 5,                   // ordinal: 0x5
  TlgOutTID = 6,                   // ordinal: 0x6
  TlgOutPORT = 7,                  // ordinal: 0x7
  TlgOutIPV4 = 8,                  // ordinal: 0x8
  TlgOutIPV6 = 9,                  // ordinal: 0x9
  TlgOutSOCKETADDRESS = 10,        // ordinal: 0xa
  TlgOutXML = 11,                  // ordinal: 0xb
  TlgOutJSON = 12,                 // ordinal: 0xc
  TlgOutWIN32ERROR = 13,           // ordinal: 0xd
  TlgOutNTSTATUS = 14,             // ordinal: 0xe
  TlgOutHRESULT = 15,              // ordinal: 0xf
  TlgOutFILETIME = 16,             // ordinal: 0x10
  TlgOutSIGNED = 17,               // ordinal: 0x11
  TlgOutUNSIGNED = 18,             // ordinal: 0x12
  TlgOutUTF8 = 35,                 // ordinal: 0x13
  TlgOutPKCS7_WITH_TYPE_INFO = 36, // ordinal: 0x14
  TlgOutCODE_POINTER = 37,         // ordinal: 0x15
  TlgOutDATETIME_UTC = 38,         // ordinal: 0x16
  _TlgOutMax = 39,                 // ordinal: 0x17
  _TlgOutChain = 128,              // ordinal: 0x18
  _TlgOutTypeMask = 127,           // ordinal: 0x19
} TlgOut_t;

typedef enum _ADD_DRIVER_STAGE {
  ClassConfigFilters = 0, // ordinal: 0x0
  LowerDeviceFilters = 1, // ordinal: 0x1
  LowerClassFilters = 2,  // ordinal: 0x2
  DeviceService = 3,      // ordinal: 0x3
  UpperDeviceFilters = 4, // ordinal: 0x4
  UpperClassFilters = 5,  // ordinal: 0x5
  MaximumAddStage = 6,    // ordinal: 0x6
} _ADD_DRIVER_STAGE;

typedef enum _KPROCESS_STATE {
  ProcessInMemory = 0,      // ordinal: 0x0
  ProcessOutOfMemory = 1,   // ordinal: 0x1
  ProcessInTransition = 2,  // ordinal: 0x2
  ProcessOutTransition = 3, // ordinal: 0x3
  ProcessInSwap = 4,        // ordinal: 0x4
  ProcessOutSwap = 5,       // ordinal: 0x5
  ProcessRetryOutSwap = 6,  // ordinal: 0x6
  ProcessAllSwapStates = 7, // ordinal: 0x7
} _KPROCESS_STATE;

typedef enum _MI_VAD_64K_TYPES {
  MiVad64KPrivate = 0, // ordinal: 0x0
  MiVad64KShared = 1,  // ordinal: 0x1
  MiVad64KTypes = 2,   // ordinal: 0x2
} _MI_VAD_64K_TYPES;

typedef enum _PO_CS_DEVICE_NOTIFICATION_TYPE {
  PoCsDeviceNotificationStorage = 0,  // ordinal: 0x0
  PoCsDeviceNotificationWiFi = 1,     // ordinal: 0x1
  PoCsDeviceNotificationMbn = 2,      // ordinal: 0x2
  PoCsDeviceNotificationAudio = 3,    // ordinal: 0x3
  PoCsDeviceNotificationEthernet = 4, // ordinal: 0x4
  PoCsDeviceNotificationMaximum = 5,  // ordinal: 0x5
} _PO_CS_DEVICE_NOTIFICATION_TYPE;

typedef enum _USER_ACTIVITY_PRESENCE {
  PowerUserPresent = 0,    // ordinal: 0x0
  PowerUserNotPresent = 1, // ordinal: 0x1
  PowerUserInactive = 2,   // ordinal: 0x2
  PowerUserMaximum = 3,    // ordinal: 0x3
  PowerUserInvalid = 3,    // ordinal: 0x4
} _USER_ACTIVITY_PRESENCE;

typedef enum _POLICY_AUDIT_EVENT_TYPE {
  AuditCategorySystem = 0,                 // ordinal: 0x0
  AuditCategoryLogon = 1,                  // ordinal: 0x1
  AuditCategoryObjectAccess = 2,           // ordinal: 0x2
  AuditCategoryPrivilegeUse = 3,           // ordinal: 0x3
  AuditCategoryDetailedTracking = 4,       // ordinal: 0x4
  AuditCategoryPolicyChange = 5,           // ordinal: 0x5
  AuditCategoryAccountManagement = 6,      // ordinal: 0x6
  AuditCategoryDirectoryServiceAccess = 7, // ordinal: 0x7
  AuditCategoryAccountLogon = 8,           // ordinal: 0x8
} _POLICY_AUDIT_EVENT_TYPE;

typedef enum _MI_SUBVAD_LISTS {
  MiSubVadPebTebAny = 0, // ordinal: 0x0
  MiSubVadMaximum = 1,   // ordinal: 0x1
} _MI_SUBVAD_LISTS;

typedef enum _KWAIT_STATE {
  WaitInProgress = 0,        // ordinal: 0x0
  WaitCommitted = 1,         // ordinal: 0x1
  WaitAborted = 2,           // ordinal: 0x2
  WaitSuspendInProgress = 3, // ordinal: 0x3
  WaitSuspended = 4,         // ordinal: 0x4
  WaitResumeInProgress = 5,  // ordinal: 0x5
  WaitResumeAborted = 6,     // ordinal: 0x6
  WaitFirstSuspendState = 3, // ordinal: 0x7
  WaitLastSuspendState = 6,  // ordinal: 0x8
  MaximumWaitState = 7,      // ordinal: 0x9
} _KWAIT_STATE;

typedef enum _POP_DEEP_SLEEP_DISENGAGE_REASON {
  PopDeepSleepDisengageReasonInactive = 0,                // ordinal: 0x0
  PopDeepSleepDisengageReasonNonAoAc = 1,                 // ordinal: 0x1
  PopDeepSleepDisengageReasonPendingIrps = 2,             // ordinal: 0x2
  PopDeepSleepDisengageReasonPowerSettings = 3,           // ordinal: 0x3
  PopDeepSleepDisengageReasonDozeS4WorkerQueued = 4,      // ordinal: 0x4
  PopDeepSleepDisengageReasonSystemPowerTransition = 5,   // ordinal: 0x5
  PopDeepSleepDisengageReasonDeviceBlockingDrips = 6,     // ordinal: 0x6
  PopDeepSleepDisengageReasonAcpi = 7,                    // ordinal: 0x7
  PopDeepSleepDisengageReasonDirectedDripsTransition = 8, // ordinal: 0x8
  PopDeepSleepDisengageReasonPepPreVeto = 9,              // ordinal: 0x9
  PopDeepSleepDisengageReasonMax = 10,                    // ordinal: 0xa
} _POP_DEEP_SLEEP_DISENGAGE_REASON;

typedef enum _ETW_GUID_TYPE {
  EtwTraceGuidType = 0,        // ordinal: 0x0
  EtwNotificationGuidType = 1, // ordinal: 0x1
  EtwGroupGuidType = 2,        // ordinal: 0x2
  EtwGuidTypeMax = 3,          // ordinal: 0x3
} _ETW_GUID_TYPE;

typedef enum _MI_KSTACK_TYPE {
  MiRegularKstack = 0,    // ordinal: 0x0
  MiShortLivedKstack = 1, // ordinal: 0x1
  MiMaximumKstack = 2,    // ordinal: 0x2
} _MI_KSTACK_TYPE;

typedef enum _WOW64_SHARED_INFORMATION {
  SharedNtdll32LdrInitializeThunk = 0,                  // ordinal: 0x0
  SharedNtdll32KiUserExceptionDispatcher = 1,           // ordinal: 0x1
  SharedNtdll32KiUserApcDispatcher = 2,                 // ordinal: 0x2
  SharedNtdll32KiUserCallbackDispatcher = 3,            // ordinal: 0x3
  SharedNtdll32RtlUserThreadStart = 4,                  // ordinal: 0x4
  SharedNtdll32pQueryProcessDebugInformationRemote = 5, // ordinal: 0x5
  SharedNtdll32BaseAddress = 6,                         // ordinal: 0x6
  SharedNtdll32LdrSystemDllInitBlock = 7,               // ordinal: 0x7
  SharedNtdll32RtlpFreezeTimeBias = 8,                  // ordinal: 0x8
  Wow64SharedPageEntriesCount = 9,                      // ordinal: 0x9
} _WOW64_SHARED_INFORMATION;

typedef enum _PO_HIBER_FORCE_DISABLE_REASON {
  PoHiberForceDisableReasonPolicy = 0,      // ordinal: 0x0
  PoHiberForceDisableReasonGuardedHost = 1, // ordinal: 0x1
  PoHiberForceDisableReasonMax = 2,         // ordinal: 0x2
} _PO_HIBER_FORCE_DISABLE_REASON;

typedef enum _SYSTEM_PROCESS_CLASSIFICATION {
  SystemProcessClassificationNormal = 0,         // ordinal: 0x0
  SystemProcessClassificationSystem = 1,         // ordinal: 0x1
  SystemProcessClassificationSecureSystem = 2,   // ordinal: 0x2
  SystemProcessClassificationMemCompression = 3, // ordinal: 0x3
  SystemProcessClassificationRegistry = 4,       // ordinal: 0x4
  SystemProcessClassificationMaximum = 5,        // ordinal: 0x5
} _SYSTEM_PROCESS_CLASSIFICATION;

typedef enum _KTHREAD_STATE {
  Initialized = 0,             // ordinal: 0x0
  Ready = 1,                   // ordinal: 0x1
  Running = 2,                 // ordinal: 0x2
  Standby = 3,                 // ordinal: 0x3
  Terminated = 4,              // ordinal: 0x4
  Waiting = 5,                 // ordinal: 0x5
  Transition = 6,              // ordinal: 0x6
  DeferredReady = 7,           // ordinal: 0x7
  GateWaitObsolete = 8,        // ordinal: 0x8
  WaitingForProcessInSwap = 9, // ordinal: 0x9
} _KTHREAD_STATE;

typedef enum _TlgBlob_t {
  _TlgBlobNone = 0,      // ordinal: 0x0
  _TlgBlobEnd = 1,       // ordinal: 0x1
  _TlgBlobProvider = 2,  // ordinal: 0x2
  _TlgBlobEvent3 = 3,    // ordinal: 0x3
  _TlgBlobProvider3 = 4, // ordinal: 0x4
  _TlgBlobEvent2 = 5,    // ordinal: 0x5
  _TlgBlobEvent4 = 6,    // ordinal: 0x6
  _TlgBlobMax = 7,       // ordinal: 0x7
} _TlgBlob_t;

typedef enum _MI_SHARED_USER_PAGE_TYPES {
  MiSharedUserPageKernel = 0,     // ordinal: 0x0
  MiSharedUserPageHypervisor = 1, // ordinal: 0x1
  MiSharedUserPageMaximum = 2,    // ordinal: 0x2
} _MI_SHARED_USER_PAGE_TYPES;

typedef enum _MEMORY_CACHING_TYPE_ORIG {
  MmFrameBufferCached = 2, // ordinal: 0x0
} _MEMORY_CACHING_TYPE_ORIG;

typedef enum _KPROCESS_PPM_POLICY {
  ProcessPpmDefault = 0,         // ordinal: 0x0
  ProcessPpmThrottle = 1,        // ordinal: 0x1
  ProcessPpmSemiThrottle = 2,    // ordinal: 0x2
  ProcessPpmNoThrottle = 3,      // ordinal: 0x3
  ProcessPpmWindowMinimized = 4, // ordinal: 0x4
  ProcessPpmWindowOccluded = 5,  // ordinal: 0x5
  ProcessPpmWindowVisible = 6,   // ordinal: 0x6
  ProcessPpmWindowInFocus = 7,   // ordinal: 0x7
  MaxProcessPpmPolicy = 8,       // ordinal: 0x8
} _KPROCESS_PPM_POLICY;

typedef enum _VRF_RULE_CLASS_ID {
  VrfSpecialPoolRuleClass = 0,             // ordinal: 0x0
  VrfForceIrqlRuleClass = 1,               // ordinal: 0x1
  VrfAllocationFailuresRuleClass = 2,      // ordinal: 0x2
  VrfTrackingPoolAllocationsRuleClass = 3, // ordinal: 0x3
  VrfIORuleClass = 4,                      // ordinal: 0x4
  VrfDeadlockPreventionRuleClass = 5,      // ordinal: 0x5
  VrfEnhancedIORuleClass = 6,              // ordinal: 0x6
  VrfDMARuleClass = 7,                     // ordinal: 0x7
  VrfSecurityRuleClass = 8,                // ordinal: 0x8
  VrfForcePendingIORequestRuleClass = 9,   // ordinal: 0x9
  VrfIRPTrackingRuleClass = 10,            // ordinal: 0xa
  VrfMiscellaneousRuleClass = 11,          // ordinal: 0xb
  VrfMoreDebuggingRuleClass = 12,          // ordinal: 0xc
  VrfMDLInvariantStackRuleClass = 13,      // ordinal: 0xd
  VrfMDLInvariantDriverRuleClass = 14,     // ordinal: 0xe
  VrfPowerDelayFuzzingRuleClass = 15,      // ordinal: 0xf
  VrfPortMiniportRuleClass = 16,           // ordinal: 0x10
  VrfStandardDDIRuleClass = 17,            // ordinal: 0x11
  VrfAutoFailRuleClass = 18,               // ordinal: 0x12
  VrfAdditionalDDIRuleClass = 19,          // ordinal: 0x13
  VrfRuleClassBase = 20,                   // ordinal: 0x14
  VrfNdisWifiRuleClass = 21,               // ordinal: 0x15
  VrfDriverLoggingRuleClass = 22,          // ordinal: 0x16
  VrfSyncDelayFuzzingRuleClass = 23,       // ordinal: 0x17
  VrfVMSwitchingRuleClass = 24,            // ordinal: 0x18
  VrfCodeIntegrityRuleClass = 25,          // ordinal: 0x19
  VrfBelow4GBAllocationRuleClass = 26,     // ordinal: 0x1a
  VrfProcessorBranchTraceRuleClass = 27,   // ordinal: 0x1b
  VrfAdvancedMMRuleClass = 28,             // ordinal: 0x1c
  VrfExtendingXDVTimeLimit = 29,           // ordinal: 0x1d
  VrfSystemBIOSRuleClass = 30,             // ordinal: 0x1e
  VrfHardwareRuleClass = 31,               // ordinal: 0x1f
  VrfStateSepRuleClass = 32,               // ordinal: 0x20
  VrfWDFRuleClass = 33,                    // ordinal: 0x21
  VrfMoreIrqlRuleClass = 34,               // ordinal: 0x22
  VrfXDVPlatformMode = 35,                 // ordinal: 0x23
  VrfStandalonePlatformMode = 36,          // ordinal: 0x24
  VrfPlatformModeTest = 37,                // ordinal: 0x25
  ReservedForDVRF38 = 38,                  // ordinal: 0x26
  ReservedForDVRF39 = 39,                  // ordinal: 0x27
  ReservedForDVRF40 = 40,                  // ordinal: 0x28
  ReservedForDVRF41 = 41,                  // ordinal: 0x29
  ReservedForDVRF42 = 42,                  // ordinal: 0x2a
  ReservedForDVRF43 = 43,                  // ordinal: 0x2b
  ReservedForDVRF44 = 44,                  // ordinal: 0x2c
  ReservedForDVRF45 = 45,                  // ordinal: 0x2d
  ReservedForDVRF46 = 46,                  // ordinal: 0x2e
  ReservedForDVRF47 = 47,                  // ordinal: 0x2f
  ReservedForDVRF48 = 48,                  // ordinal: 0x30
  ReservedForDVRF49 = 49,                  // ordinal: 0x31
  ReservedForDVRF50 = 50,                  // ordinal: 0x32
  ReservedForDVRF51 = 51,                  // ordinal: 0x33
  ReservedForDVRF52 = 52,                  // ordinal: 0x34
  ReservedForDVRF53 = 53,                  // ordinal: 0x35
  ReservedForDVRF54 = 54,                  // ordinal: 0x36
  ReservedForDVRF55 = 55,                  // ordinal: 0x37
  ReservedForDVRF56 = 56,                  // ordinal: 0x38
  ReservedForDVRF57 = 57,                  // ordinal: 0x39
  ReservedForDVRF58 = 58,                  // ordinal: 0x3a
  ReservedForDVRF59 = 59,                  // ordinal: 0x3b
  ReservedForDVRF60 = 60,                  // ordinal: 0x3c
  ReservedForDVRF61 = 61,                  // ordinal: 0x3d
  ReservedForDVRF62 = 62,                  // ordinal: 0x3e
  ReservedForDVRF63 = 63,                  // ordinal: 0x3f
  VrfRuleClassSizeMax = 64,                // ordinal: 0x40
} _VRF_RULE_CLASS_ID;

typedef enum _KTHREAD_PPM_POLICY {
  ThreadPpmDefault = 0,      // ordinal: 0x0
  ThreadPpmThrottle = 1,     // ordinal: 0x1
  ThreadPpmSemiThrottle = 2, // ordinal: 0x2
  ThreadPpmNoThrottle = 3,   // ordinal: 0x3
  MaxThreadPpmPolicy = 4,    // ordinal: 0x4
} _KTHREAD_PPM_POLICY;

typedef enum _MI_DYNAMICBASE_BITMAP {
  DynamicBaseBitMapNative = 0,  // ordinal: 0x0
  DynamicBaseBitMapInvalid = 1, // ordinal: 0x1
  DynamicBaseBitMapMax = 1,     // ordinal: 0x2
} _MI_DYNAMICBASE_BITMAP;

typedef enum _POP_SYSTEM_IDLE_EVENT_TYPE {
  PopSystemIdleEventTypeMonitorOffUserInput = 0,          // ordinal: 0x0
  PopSystemIdleEventTypeMonitorOnUserInput = 1,           // ordinal: 0x1
  PopSystemIdleEventTypeUserPresence = 2,                 // ordinal: 0x2
  PopSystemIdleEventTypeResumeFromSxSystemPowerState = 3, // ordinal: 0x3
  PopSystemIdleEventTypeMax = 4,                          // ordinal: 0x4
  PopSystemIdleEventTypeInvalid = 4,                      // ordinal: 0x5
} _POP_SYSTEM_IDLE_EVENT_TYPE;

typedef enum _MODE {
  KernelMode = 0,  // ordinal: 0x0
  UserMode = 1,    // ordinal: 0x1
  MaximumMode = 2, // ordinal: 0x2
} _MODE;

typedef enum _ETW_STRING_TOKEN_TYPE {
  ETW_STRING_TOKEN_EXE = 0,        // ordinal: 0x0
  ETW_STRING_TOKEN_PACKAGE_ID = 1, // ordinal: 0x1
  ETW_STRING_TOKEN_PKG_APP_ID = 2, // ordinal: 0x2
  ETW_STRING_TOKEN_MAX_COUNT = 3,  // ordinal: 0x3
} _ETW_STRING_TOKEN_TYPE;

typedef enum _WORKING_SET_TYPE {
  WorkingSetTypeUser = 0,           // ordinal: 0x0
  WorkingSetTypeSession = 1,        // ordinal: 0x1
  WorkingSetTypeSystemTypes = 2,    // ordinal: 0x2
  WorkingSetTypeSystemCache = 2,    // ordinal: 0x3
  WorkingSetTypePagedPool = 3,      // ordinal: 0x4
  WorkingSetTypeSystemViews = 4,    // ordinal: 0x5
  WorkingSetTypePagableMaximum = 4, // ordinal: 0x6
  WorkingSetTypeSystemPtes = 5,     // ordinal: 0x7
  WorkingSetTypeKernelStacks = 6,   // ordinal: 0x8
  WorkingSetTypeNonPagedPool = 7,   // ordinal: 0x9
  WorkingSetTypeMaximum = 8,        // ordinal: 0xa
} _WORKING_SET_TYPE;

typedef enum _PS_PROTECTED_SIGNER {
  PsProtectedSignerNone = 0,         // ordinal: 0x0
  PsProtectedSignerAuthenticode = 1, // ordinal: 0x1
  PsProtectedSignerCodeGen = 2,      // ordinal: 0x2
  PsProtectedSignerAntimalware = 3,  // ordinal: 0x3
  PsProtectedSignerLsa = 4,          // ordinal: 0x4
  PsProtectedSignerWindows = 5,      // ordinal: 0x5
  PsProtectedSignerWinTcb = 6,       // ordinal: 0x6
  PsProtectedSignerWinSystem = 7,    // ordinal: 0x7
  PsProtectedSignerApp = 8,          // ordinal: 0x8
  PsProtectedSignerMax = 9,          // ordinal: 0x9
} _PS_PROTECTED_SIGNER;

typedef enum _MI_MEMORY_HIGHLOW {
  MiMemoryHigh = 0,    // ordinal: 0x0
  MiMemoryLow = 1,     // ordinal: 0x1
  MiMemoryHighLow = 2, // ordinal: 0x2
} _MI_MEMORY_HIGHLOW;

typedef enum FEATURE_ENABLED_STATE {
  FEATURE_ENABLED_STATE_DEFAULT = 0,                    // ordinal: 0x0
  FEATURE_ENABLED_STATE_DISABLED = 1,                   // ordinal: 0x1
  FEATURE_ENABLED_STATE_ENABLED = 2,                    // ordinal: 0x2
  FEATURE_ENABLED_STATE_HAS_NOTIFICATION = 128,         // ordinal: 0x3
  FEATURE_ENABLED_STATE_HAS_VARIANT_CONFIGURATION = 64, // ordinal: 0x4
} FEATURE_ENABLED_STATE;

typedef enum _PERFINFO_KERNELMEMORY_USAGE_TYPE {
  PerfInfoMemUsagePfnMetadata = 0, // ordinal: 0x0
  PerfInfoMemUsageMax = 1,         // ordinal: 0x1
} _PERFINFO_KERNELMEMORY_USAGE_TYPE;

typedef enum _HEAP_SEGMGR_LARGE_PAGE_POLICY {
  HeapSegMgrNoLargePages = 0,       // ordinal: 0x0
  HeapSegMgrEnableLargePages = 1,   // ordinal: 0x1
  HeapSegMgrNormalPolicy = 1,       // ordinal: 0x2
  HeapSegMgrForceSmall = 2,         // ordinal: 0x3
  HeapSegMgrForceLarge = 3,         // ordinal: 0x4
  HeapSegMgrForceRandom = 4,        // ordinal: 0x5
  HeapSegMgrLargePagePolicyMax = 5, // ordinal: 0x6
} _HEAP_SEGMGR_LARGE_PAGE_POLICY;

typedef enum _PS_RESOURCE_TYPE {
  PsResourceNonPagedPool = 0, // ordinal: 0x0
  PsResourcePagedPool = 1,    // ordinal: 0x1
  PsResourcePageFile = 2,     // ordinal: 0x2
  PsResourceWorkingSet = 3,   // ordinal: 0x3
  PsResourceMax = 4,          // ordinal: 0x4
} _PS_RESOURCE_TYPE;

typedef enum _PROCESS_VA_TYPE {
  ProcessVAImage = 0,   // ordinal: 0x0
  ProcessVASection = 1, // ordinal: 0x1
  ProcessVAPrivate = 2, // ordinal: 0x2
  ProcessVAMax = 3,     // ordinal: 0x3
} _PROCESS_VA_TYPE;

typedef enum _MI_CFG_BITMAP_TYPE {
  CfgBitMapNative = 0, // ordinal: 0x0
  CfgBitMapMax = 1,    // ordinal: 0x1
} _MI_CFG_BITMAP_TYPE;

typedef enum CPU_VENDORS {
  CPU_NONE = 0,      // ordinal: 0x0
  CPU_INTEL = 1,     // ordinal: 0x1
  CPU_AMD = 2,       // ordinal: 0x2
  CPU_CYRIX = 3,     // ordinal: 0x3
  CPU_TRANSMETA = 4, // ordinal: 0x4
  CPU_VIA = 5,       // ordinal: 0x5
  CPU_CENTAUR = 5,   // ordinal: 0x6
  CPU_RISE = 6,      // ordinal: 0x7
  CPU_UNKNOWN = 7,   // ordinal: 0x8
} CPU_VENDORS;

typedef enum _KTIMER2_COLLECTION_INDEX {
  KTimer2CollectionNoWake = 0,       // ordinal: 0x0
  KTimer2CollectionHr = 1,           // ordinal: 0x1
  KTimer2CollectionFinite = 2,       // ordinal: 0x2
  KTimer2CollectionIr = 3,           // ordinal: 0x3
  KTimer2CollectionNotInserted = 16, // ordinal: 0x4
  KTimer2CollectionInvalid = 20,     // ordinal: 0x5
  KTimer2CollectionOptional = 32,    // ordinal: 0x6
  KTimer2CollectionMin = 0,          // ordinal: 0x7
  KTimer2CollectionMax = 4,          // ordinal: 0x8
  KTimer2CollectionNode1 = 2,        // ordinal: 0x9
} _KTIMER2_COLLECTION_INDEX;

typedef enum _MI_WORKING_SET_TYPE {
  MiWorkingSetTypeSystemCache = 0,      // ordinal: 0x0
  MiWorkingSetTypeSystemViews = 1,      // ordinal: 0x1
  MiWorkingSetTypePartitionMaximum = 1, // ordinal: 0x2
  MiWorkingSetTypePagedPool = 2,        // ordinal: 0x3
  MiWorkingSetTypePagableMaximum = 2,   // ordinal: 0x4
  MiWorkingSetTypeSystemPtes = 3,       // ordinal: 0x5
  MiWorkingSetTypeKernelStacks = 4,     // ordinal: 0x6
  MiWorkingSetTypeNonPagedPool = 5,     // ordinal: 0x7
  MiWorkingSetTypeMaximum = 6,          // ordinal: 0x8
} _MI_WORKING_SET_TYPE;

typedef enum _KE_WAKE_SOURCE_TYPE {
  KeWakeSourceTypeSpuriousWake = 0,      // ordinal: 0x0
  KeWakeSourceTypeSpuriousClock = 1,     // ordinal: 0x1
  KeWakeSourceTypeSpuriousInterrupt = 2, // ordinal: 0x2
  KeWakeSourceTypeQueryFailure = 3,      // ordinal: 0x3
  KeWakeSourceTypeAccountingFailure = 4, // ordinal: 0x4
  KeWakeSourceTypeStaticSourceMax = 4,   // ordinal: 0x5
  KeWakeSourceTypeInterrupt = 5,         // ordinal: 0x6
  KeWakeSourceTypeIRTimer = 6,           // ordinal: 0x7
  KeWakeSourceTypeMax = 7,               // ordinal: 0x8
} _KE_WAKE_SOURCE_TYPE;

typedef enum _MI_ENCLAVE_TYPE {
  MiEnclaveNone = 0,     // ordinal: 0x0
  MiEnclaveHardware = 1, // ordinal: 0x1
  MiEnclaveVsm = 2,      // ordinal: 0x2
  MiEnclaveMax = 3,      // ordinal: 0x3
} _MI_ENCLAVE_TYPE;

typedef enum _ETW_PERFECT_HASH_FUNCTION_TYPE {
  ETW_PHF_EVENT_ID = 0,   // ordinal: 0x0
  ETW_PHF_STACK_WALK = 1, // ordinal: 0x1
  ETW_PHF_MAX_COUNT = 2,  // ordinal: 0x2
} _ETW_PERFECT_HASH_FUNCTION_TYPE;

typedef enum _KTHREAD_TAG {
  KThreadTagNone = 0,           // ordinal: 0x0
  KThreadTagMediaBuffering = 1, // ordinal: 0x1
  KThreadTagMax = 2,            // ordinal: 0x2
} _KTHREAD_TAG;

typedef enum _REG_NOTIFY_CLASS {
  RegNtDeleteKey = 0,                     // ordinal: 0x0
  RegNtPreDeleteKey = 0,                  // ordinal: 0x1
  RegNtSetValueKey = 1,                   // ordinal: 0x2
  RegNtPreSetValueKey = 1,                // ordinal: 0x3
  RegNtDeleteValueKey = 2,                // ordinal: 0x4
  RegNtPreDeleteValueKey = 2,             // ordinal: 0x5
  RegNtSetInformationKey = 3,             // ordinal: 0x6
  RegNtPreSetInformationKey = 3,          // ordinal: 0x7
  RegNtRenameKey = 4,                     // ordinal: 0x8
  RegNtPreRenameKey = 4,                  // ordinal: 0x9
  RegNtEnumerateKey = 5,                  // ordinal: 0xa
  RegNtPreEnumerateKey = 5,               // ordinal: 0xb
  RegNtEnumerateValueKey = 6,             // ordinal: 0xc
  RegNtPreEnumerateValueKey = 6,          // ordinal: 0xd
  RegNtQueryKey = 7,                      // ordinal: 0xe
  RegNtPreQueryKey = 7,                   // ordinal: 0xf
  RegNtQueryValueKey = 8,                 // ordinal: 0x10
  RegNtPreQueryValueKey = 8,              // ordinal: 0x11
  RegNtQueryMultipleValueKey = 9,         // ordinal: 0x12
  RegNtPreQueryMultipleValueKey = 9,      // ordinal: 0x13
  RegNtPreCreateKey = 10,                 // ordinal: 0x14
  RegNtPostCreateKey = 11,                // ordinal: 0x15
  RegNtPreOpenKey = 12,                   // ordinal: 0x16
  RegNtPostOpenKey = 13,                  // ordinal: 0x17
  RegNtKeyHandleClose = 14,               // ordinal: 0x18
  RegNtPreKeyHandleClose = 14,            // ordinal: 0x19
  RegNtPostDeleteKey = 15,                // ordinal: 0x1a
  RegNtPostSetValueKey = 16,              // ordinal: 0x1b
  RegNtPostDeleteValueKey = 17,           // ordinal: 0x1c
  RegNtPostSetInformationKey = 18,        // ordinal: 0x1d
  RegNtPostRenameKey = 19,                // ordinal: 0x1e
  RegNtPostEnumerateKey = 20,             // ordinal: 0x1f
  RegNtPostEnumerateValueKey = 21,        // ordinal: 0x20
  RegNtPostQueryKey = 22,                 // ordinal: 0x21
  RegNtPostQueryValueKey = 23,            // ordinal: 0x22
  RegNtPostQueryMultipleValueKey = 24,    // ordinal: 0x23
  RegNtPostKeyHandleClose = 25,           // ordinal: 0x24
  RegNtPreCreateKeyEx = 26,               // ordinal: 0x25
  RegNtPostCreateKeyEx = 27,              // ordinal: 0x26
  RegNtPreOpenKeyEx = 28,                 // ordinal: 0x27
  RegNtPostOpenKeyEx = 29,                // ordinal: 0x28
  RegNtPreFlushKey = 30,                  // ordinal: 0x29
  RegNtPostFlushKey = 31,                 // ordinal: 0x2a
  RegNtPreLoadKey = 32,                   // ordinal: 0x2b
  RegNtPostLoadKey = 33,                  // ordinal: 0x2c
  RegNtPreUnLoadKey = 34,                 // ordinal: 0x2d
  RegNtPostUnLoadKey = 35,                // ordinal: 0x2e
  RegNtPreQueryKeySecurity = 36,          // ordinal: 0x2f
  RegNtPostQueryKeySecurity = 37,         // ordinal: 0x30
  RegNtPreSetKeySecurity = 38,            // ordinal: 0x31
  RegNtPostSetKeySecurity = 39,           // ordinal: 0x32
  RegNtCallbackObjectContextCleanup = 40, // ordinal: 0x33
  RegNtPreRestoreKey = 41,                // ordinal: 0x34
  RegNtPostRestoreKey = 42,               // ordinal: 0x35
  RegNtPreSaveKey = 43,                   // ordinal: 0x36
  RegNtPostSaveKey = 44,                  // ordinal: 0x37
  RegNtPreReplaceKey = 45,                // ordinal: 0x38
  RegNtPostReplaceKey = 46,               // ordinal: 0x39
  RegNtPreQueryKeyName = 47,              // ordinal: 0x3a
  RegNtPostQueryKeyName = 48,             // ordinal: 0x3b
  MaxRegNtNotifyClass = 49,               // ordinal: 0x3c
} _REG_NOTIFY_CLASS;

typedef enum _KHETERO_RUNNING_TYPE {
  KHeteroShortRunning = 0,   // ordinal: 0x0
  KHeteroLongRunning = 1,    // ordinal: 0x1
  KHeteroRunningTypeMax = 2, // ordinal: 0x2
} _KHETERO_RUNNING_TYPE;

typedef enum wil_FeatureStage {
  wil_FeatureStage_AlwaysDisabled = 0,    // ordinal: 0x0
  wil_FeatureStage_DisabledByDefault = 1, // ordinal: 0x1
  wil_FeatureStage_EnabledByDefault = 2,  // ordinal: 0x2
  wil_FeatureStage_AlwaysEnabled = 3,     // ordinal: 0x3
} wil_FeatureStage;

typedef enum _RTL_MEMORY_TYPE {
  MemoryTypePaged = 0,     // ordinal: 0x0
  MemoryTypeNonPaged = 1,  // ordinal: 0x1
  MemoryTypeLargePage = 2, // ordinal: 0x2
  MemoryTypeHugePage = 3,  // ordinal: 0x3
  MemoryTypeMax = 4,       // ordinal: 0x4
} _RTL_MEMORY_TYPE;

typedef enum _POWER_INFORMATION_LEVEL_INTERNAL_TTMTCAPI {
  PowerInformationInternalTtmFirst = 4096,           // ordinal: 0x0
  PowerInternalTtmOpenTerminal = 4096,               // ordinal: 0x1
  PowerInternalTtmCreateTerminal = 4097,             // ordinal: 0x2
  PowerInternalTtmEvacuateDevices = 4098,            // ordinal: 0x3
  PowerInternalTtmCreateTerminalEventQueue = 4099,   // ordinal: 0x4
  PowerInternalTtmGetTerminalEvent = 4100,           // ordinal: 0x5
  PowerInternalTtmSetDefaultDeviceAssignment = 4101, // ordinal: 0x6
  PowerInternalTtmAssignDevice = 4102,               // ordinal: 0x7
  PowerInternalTtmSetDisplayState = 4103,            // ordinal: 0x8
  PowerInternalTtmSetDisplayTimeouts = 4104,         // ordinal: 0x9
  PowerInternalTtmSetDisplayPowerRequest = 4105,     // ordinal: 0xa
  PowerInformationInternalTtmLast = 4105,            // ordinal: 0xb
} _POWER_INFORMATION_LEVEL_INTERNAL_TTMTCAPI;

typedef enum _PS_WAKE_REASON {
  PsWakeReasonUser = 0,              // ordinal: 0x0
  PsWakeReasonExecutionRequired = 1, // ordinal: 0x1
  PsWakeReasonKernel = 2,            // ordinal: 0x2
  PsWakeReasonInstrumentation = 3,   // ordinal: 0x3
  PsWakeReasonPreserveProcess = 4,   // ordinal: 0x4
  PsWakeReasonActivityReference = 5, // ordinal: 0x5
  PsWakeReasonWorkOnBehalf = 6,      // ordinal: 0x6
  PsMaxWakeReasons = 7,              // ordinal: 0x7
} _PS_WAKE_REASON;

typedef enum _POWER_INFORMATION_LEVEL_INTERNAL {
  PowerInternalAcpiInterfaceRegister = 0,                    // ordinal: 0x0
  PowerInternalS0LowPowerIdleInfo = 1,                       // ordinal: 0x1
  PowerInternalReapplyBrightnessSettings = 2,                // ordinal: 0x2
  PowerInternalUserAbsencePrediction = 3,                    // ordinal: 0x3
  PowerInternalUserAbsencePredictionCapability = 4,          // ordinal: 0x4
  PowerInternalPoProcessorLatencyHint = 5,                   // ordinal: 0x5
  PowerInternalStandbyNetworkRequest = 6,                    // ordinal: 0x6
  PowerInternalDirtyTransitionInformation = 7,               // ordinal: 0x7
  PowerInternalSetBackgroundTaskState = 8,                   // ordinal: 0x8
  PowerInternalReservedDoNotUseEnum9 = 9,                    // ordinal: 0x9
  PowerInternalReservedDoNotUseEnum10 = 10,                  // ordinal: 0xa
  PowerInternalReservedDoNotUseEnum11 = 11,                  // ordinal: 0xb
  PowerInternalReservedDoNotUseEnum12 = 12,                  // ordinal: 0xc
  PowerInternalReservedDoNotUseEnum13 = 13,                  // ordinal: 0xd
  PowerInternalReservedDoNotUseEnum14 = 14,                  // ordinal: 0xe
  PowerInternalReservedDoNotUseEnum15 = 15,                  // ordinal: 0xf
  PowerInternalReservedDoNotUseEnum16 = 16,                  // ordinal: 0x10
  PowerInternalReservedDoNotUseEnum17 = 17,                  // ordinal: 0x11
  PowerInternalBootSessionStandbyActivationInformation = 18, // ordinal: 0x12
  PowerInternalSessionPowerState = 19,                       // ordinal: 0x13
  PowerInternalSessionTerminalInput = 20,                    // ordinal: 0x14
  PowerInternalSetWatchdog = 21,                             // ordinal: 0x15
  PowerInternalPhysicalPowerButtonPressInfoAtBoot = 22,      // ordinal: 0x16
  PowerInternalExternalMonitorConnected = 23,                // ordinal: 0x17
  PowerInternalHighPrecisionBrightnessSettings = 24,         // ordinal: 0x18
  PowerInternalWinrtScreenToggle = 25,                       // ordinal: 0x19
  PowerInternalPpmQosDisable = 26,                           // ordinal: 0x1a
  PowerInternalTransitionCheckpoint = 27,                    // ordinal: 0x1b
  PowerInternalInputControllerState = 28,                    // ordinal: 0x1c
  PowerInternalFirmwareResetReason = 29,                     // ordinal: 0x1d
  PowerInternalPpmSchedulerQosSupport = 30,                  // ordinal: 0x1e
  PowerInternalBootStatGet = 31,                             // ordinal: 0x1f
  PowerInternalBootStatSet = 32,                             // ordinal: 0x20
  PowerInternalCallHasNotReturnedWatchdog = 33,              // ordinal: 0x21
  PowerInternalBootStatCheckIntegrity = 34,                  // ordinal: 0x22
  PowerInternalBootStatRestoreDefaults = 35,                 // ordinal: 0x23
  PowerInternalHostEsStateUpdate = 36,                       // ordinal: 0x24
  PowerInternalGetPowerActionState = 37,                     // ordinal: 0x25
  PowerInternalBootStatUnlock = 38,                          // ordinal: 0x26
  PowerInternalWakeOnVoiceState = 39,                        // ordinal: 0x27
  PowerInternalDeepSleepBlock = 40,                          // ordinal: 0x28
  PowerInternalIsPoFxDevice = 41,                            // ordinal: 0x29
  PowerInternalPowerTransitionExtensionAtBoot = 42,          // ordinal: 0x2a
  PowerInternalProcessorBrandedFrequency = 43,               // ordinal: 0x2b
  PowerInternalTimeBrokerExpirationReason = 44,              // ordinal: 0x2c
  PowerInternalNotifyUserShutdownStatus = 45,                // ordinal: 0x2d
  PowerInternalPowerRequestTerminalCoreWindow = 46,          // ordinal: 0x2e
  PowerInternalProcessorIdleVeto = 47,                       // ordinal: 0x2f
  PowerInternalPlatformIdleVeto = 48,                        // ordinal: 0x30
  PowerInternalIsLongPowerButtonBugcheckEnabled = 49,        // ordinal: 0x31
  PowerInternalAutoChkCausedReboot = 50,                     // ordinal: 0x32
  PowerInternalSetWakeAlarmOverride = 51,                    // ordinal: 0x33
  PowerInternalDirectedFxAddTestDevice = 53,                 // ordinal: 0x34
  PowerInternalDirectedFxRemoveTestDevice = 54,              // ordinal: 0x35
  PowerInternalDirectedFxSetMode = 56,                       // ordinal: 0x36
  PowerInternalRegisterPowerPlane = 57,                      // ordinal: 0x37
  PowerInternalSetDirectedDripsFlags = 58,                   // ordinal: 0x38
  PowerInternalClearDirectedDripsFlags = 59,                 // ordinal: 0x39
  PowerInternalRetrieveHiberFileResumeContext = 60,          // ordinal: 0x3a
  PowerInternalReadHiberFilePage = 61,                       // ordinal: 0x3b
  PowerInformationInternalMaximum = 62,                      // ordinal: 0x3c
} _POWER_INFORMATION_LEVEL_INTERNAL;

typedef enum TlgIn_t {
  TlgInNULL = 0,                  // ordinal: 0x0
  TlgInUNICODESTRING = 1,         // ordinal: 0x1
  TlgInANSISTRING = 2,            // ordinal: 0x2
  TlgInINT8 = 3,                  // ordinal: 0x3
  TlgInUINT8 = 4,                 // ordinal: 0x4
  TlgInINT16 = 5,                 // ordinal: 0x5
  TlgInUINT16 = 6,                // ordinal: 0x6
  TlgInINT32 = 7,                 // ordinal: 0x7
  TlgInUINT32 = 8,                // ordinal: 0x8
  TlgInINT64 = 9,                 // ordinal: 0x9
  TlgInUINT64 = 10,               // ordinal: 0xa
  TlgInFLOAT = 11,                // ordinal: 0xb
  TlgInDOUBLE = 12,               // ordinal: 0xc
  TlgInBOOL32 = 13,               // ordinal: 0xd
  TlgInBINARY = 14,               // ordinal: 0xe
  TlgInGUID = 15,                 // ordinal: 0xf
  _TlgInPOINTER_unsupported = 16, // ordinal: 0x10
  TlgInFILETIME = 17,             // ordinal: 0x11
  TlgInSYSTEMTIME = 18,           // ordinal: 0x12
  TlgInSID = 19,                  // ordinal: 0x13
  TlgInHEXINT32 = 20,             // ordinal: 0x14
  TlgInHEXINT64 = 21,             // ordinal: 0x15
  TlgInCOUNTEDSTRING = 22,        // ordinal: 0x16
  TlgInCOUNTEDANSISTRING = 23,    // ordinal: 0x17
  _TlgInSTRUCT = 24,              // ordinal: 0x18
  TlgInCOUNTEDBINARY = 25,        // ordinal: 0x19
  _TlgInMax = 26,                 // ordinal: 0x1a
  TlgInINTPTR = 7,                // ordinal: 0x1b
  TlgInUINTPTR = 8,               // ordinal: 0x1c
  TlgInPOINTER = 20,              // ordinal: 0x1d
  _TlgInCcount = 32,              // ordinal: 0x1e
  TlgInVcount = 64,               // ordinal: 0x1f
  _TlgInChain = 128,              // ordinal: 0x20
  _TlgInCustom = 96,              // ordinal: 0x21
  _TlgInTypeMask = 31,            // ordinal: 0x22
  _TlgInCountMask = 96,           // ordinal: 0x23
  _TlgInFlagMask = 224,           // ordinal: 0x24
} TlgIn_t;

typedef enum PDC_RESOURCE {
  PdcResourceSystemForeground = 0,      // ordinal: 0x0
  PdcResourceUniversalApplications = 1, // ordinal: 0x1
  PdcResourceWin32 = 2,                 // ordinal: 0x2
  PdcResourceNetwork = 3,               // ordinal: 0x3
  PdcResourceSystemBackground = 4,      // ordinal: 0x4
  PdcResourceMin = 0,                   // ordinal: 0x5
  PdcResourceMax = 4,                   // ordinal: 0x6
} PDC_RESOURCE;

typedef enum _POP_SLEEP_CHECKPOINT_STATUS {
  PopSleepCheckpointStatusDisabled = 0,                  // ordinal: 0x0
  PopSleepCheckpointStatusEnabledDueToDirtyShutdown = 1, // ordinal: 0x1
  PopSleepCheckpointStatusEnabledManually = 4,           // ordinal: 0x2
  PopSleepCheckpointStatusEnabledExperiment = 4,         // ordinal: 0x3
  PopSleepCheckpointStatusEnabledMax = 7,                // ordinal: 0x4
  PopSleepCheckpointStatusFailedNotEfiSystem = 8,        // ordinal: 0x5
  PopSleepCheckpointStatusFailedInsufficientSpace = 9,   // ordinal: 0x6
  PopSleepCheckpointStatusFailedTooSlow = 10,            // ordinal: 0x7
  PopSleepCheckpointStatusFailedOtherError = 15,         // ordinal: 0x8
  PopSleepCheckpointStatusMax = 15,                      // ordinal: 0x9
} _POP_SLEEP_CHECKPOINT_STATUS;

typedef enum _KOBJECTS {
  EventNotificationObject = 0,      // ordinal: 0x0
  EventSynchronizationObject = 1,   // ordinal: 0x1
  MutantObject = 2,                 // ordinal: 0x2
  ProcessObject = 3,                // ordinal: 0x3
  QueueObject = 4,                  // ordinal: 0x4
  SemaphoreObject = 5,              // ordinal: 0x5
  ThreadObject = 6,                 // ordinal: 0x6
  GateObject = 7,                   // ordinal: 0x7
  TimerNotificationObject = 8,      // ordinal: 0x8
  TimerSynchronizationObject = 9,   // ordinal: 0x9
  Spare2Object = 10,                // ordinal: 0xa
  Spare3Object = 11,                // ordinal: 0xb
  Spare4Object = 12,                // ordinal: 0xc
  Spare5Object = 13,                // ordinal: 0xd
  Spare6Object = 14,                // ordinal: 0xe
  Spare7Object = 15,                // ordinal: 0xf
  Spare8Object = 16,                // ordinal: 0x10
  ProfileCallbackObject = 17,       // ordinal: 0x11
  ApcObject = 18,                   // ordinal: 0x12
  DpcObject = 19,                   // ordinal: 0x13
  DeviceQueueObject = 20,           // ordinal: 0x14
  PriQueueObject = 21,              // ordinal: 0x15
  InterruptObject = 22,             // ordinal: 0x16
  ProfileObject = 23,               // ordinal: 0x17
  Timer2NotificationObject = 24,    // ordinal: 0x18
  Timer2SynchronizationObject = 25, // ordinal: 0x19
  ThreadedDpcObject = 26,           // ordinal: 0x1a
  MaximumKernelObject = 27,         // ordinal: 0x1b
} _KOBJECTS;

typedef enum JOB_OBJECT_IO_RATE_CONTROL_FLAGS {
  JOB_OBJECT_IO_RATE_CONTROL_ENABLE = 1,                        // ordinal: 0x0
  JOB_OBJECT_IO_RATE_CONTROL_STANDALONE_VOLUME = 2,             // ordinal: 0x1
  JOB_OBJECT_IO_RATE_CONTROL_FORCE_UNIT_ACCESS_ALL = 4,         // ordinal: 0x2
  JOB_OBJECT_IO_RATE_CONTROL_FORCE_UNIT_ACCESS_ON_SOFT_CAP = 8, // ordinal: 0x3
  JOB_OBJECT_IO_RATE_CONTROL_VALID_FLAGS = 15,                  // ordinal: 0x4
} JOB_OBJECT_IO_RATE_CONTROL_FLAGS;

typedef enum _MI_MEMORY_EVENT_TYPES {
  LowPagedPoolEvent = 0,          // ordinal: 0x0
  HighPagedPoolEvent = 1,         // ordinal: 0x1
  LowNonPagedPoolEvent = 2,       // ordinal: 0x2
  HighNonPagedPoolEvent = 3,      // ordinal: 0x3
  LowAvailablePagesEvent = 4,     // ordinal: 0x4
  HighAvailablePagesEvent = 5,    // ordinal: 0x5
  LowCommitEvent = 6,             // ordinal: 0x6
  HighCommitEvent = 7,            // ordinal: 0x7
  MaximumCommitEvent = 8,         // ordinal: 0x8
  BadMemoryDetectedEvent = 9,     // ordinal: 0x9
  PhysicalMemoryChangeEvent = 10, // ordinal: 0xa
  TotalNumberOfMemoryEvents = 11, // ordinal: 0xb
} _MI_MEMORY_EVENT_TYPES;

typedef enum PDC_CS_PHASE {
  PdcNoCsPhase = 0,                   // ordinal: 0x0
  PdcConnectionPhase = 1,             // ordinal: 0x1
  PdcShellPhase = 2,                  // ordinal: 0x2
  PdcPlmPhase = 3,                    // ordinal: 0x3
  PdcMaintenancePhase = 4,            // ordinal: 0x4
  PdcDamPhase = 5,                    // ordinal: 0x5
  PdcLowPowerPhase = 6,               // ordinal: 0x6
  PdcResiliencyNotificationPhase = 7, // ordinal: 0x7
  PdcResiliencyPhase = 8,             // ordinal: 0x8
  PdcInvalidPhase = 9,                // ordinal: 0x9
  PdcMaxPhase = 9,                    // ordinal: 0xa
} PDC_CS_PHASE;

typedef enum _POP_SLEEP_CHECKPOINT {
  PopSleepCheckpointInvalid = 0,                             // ordinal: 0x0
  PopSleepCheckpointPowerTransitionStart = 1,                // ordinal: 0x1
  PopSleepCheckpointSuspendAppsBefore = 2,                   // ordinal: 0x2
  PopSleepCheckpointSuspendAppsAfter = 3,                    // ordinal: 0x3
  PopSleepCheckpointSuspendServicesBefore = 4,               // ordinal: 0x4
  PopSleepCheckpointSuspendServicesAfter = 5,                // ordinal: 0x5
  PopSleepCheckpointNotifySuperfetchBefore = 6,              // ordinal: 0x6
  PopSleepCheckpointNotifySuperfetchAfter = 7,               // ordinal: 0x7
  PopSleepCheckpointNotifyCallbacksBefore = 8,               // ordinal: 0x8
  PopSleepCheckpointNotifyCallbacksAfter = 9,                // ordinal: 0x9
  PopSleepCheckpointSleepTransactionCommitted = 10,          // ordinal: 0xa
  PopSleepCheckpointQueryDriversBefore = 11,                 // ordinal: 0xb
  PopSleepCheckpointQueryDriversAfter = 12,                  // ordinal: 0xc
  PopSleepCheckpointAllocatingHiberContext = 13,             // ordinal: 0xd
  PopSleepCheckpointSuspendDriversBefore = 14,               // ordinal: 0xe
  PopSleepCheckpointPreSleepNotification = 16,               // ordinal: 0xf
  PopSleepCheckpointInterruptsDisabledBegin = 17,            // ordinal: 0x10
  PopSleepCheckpointInvokeHandlerBefore = 18,                // ordinal: 0x11
  PopSleepCheckpointSaveHiberContextBegin = 19,              // ordinal: 0x12
  PopSleepCheckpointInitializeDumpStackFailed = 20,          // ordinal: 0x13
  PopSleepCheckpointHiberWriteFailed = 21,                   // ordinal: 0x14
  PopSleepCheckpointHiberFileTooSmall = 22,                  // ordinal: 0x15
  PopSleepCheckpointSaveHiberContextFailed = 23,             // ordinal: 0x16
  PopSleepCheckpointSaveHiberContextEnd = 24,                // ordinal: 0x17
  PopSleepCheckpointHiberKernelHandoff = 25,                 // ordinal: 0x18
  PopSleepCheckpointInvokeHandlerAfter = 26,                 // ordinal: 0x19
  PopSleepCheckpointReadHiberfileBefore = 27,                // ordinal: 0x1a
  PopSleepCheckpointInitializeDumpStackForReadFailed = 28,   // ordinal: 0x1b
  PopSleepCheckpointHiberReadFailed = 29,                    // ordinal: 0x1c
  PopSleepCheckpointChecksumFailure = 30,                    // ordinal: 0x1d
  PopSleepCheckpointDecompressionFailed = 31,                // ordinal: 0x1e
  PopSleepCheckpointReadHiberfileAfter = 32,                 // ordinal: 0x1f
  PopSleepCheckpointInterruptsDisabledEnd = 33,              // ordinal: 0x20
  PopSleepCheckpointWakeDriversAfter = 36,                   // ordinal: 0x21
  PopSleepCheckpointResumeAppsBefore = 37,                   // ordinal: 0x22
  PopSleepCheckpointResumeAppsAfter = 38,                    // ordinal: 0x23
  PopSleepCheckpointResumeServicesBefore = 39,               // ordinal: 0x24
  PopSleepCheckpointResumeServicesAfter = 40,                // ordinal: 0x25
  PopSleepCheckpointPowerTransitionEnd = 41,                 // ordinal: 0x26
  PopSleepCheckpointAllocatingHiberContextNoFileObject = 42, // ordinal: 0x27
  PopSleepCheckpointAllocatingHiberContextGetDumpStackFailed =
      43, // ordinal: 0x28
  PopSleepCheckpointAllocatingHiberContextLoadResumeContextFailed =
      44,                                                     // ordinal: 0x29
  PopSleepCheckpointAllocatingHiberContextBcdOpenFailed = 45, // ordinal: 0x2a
  PopSleepCheckpointAllocatingHiberContextEstablishResumeObjectFailed =
      46, // ordinal: 0x2b
  PopSleepCheckpointAllocatingHiberContextSetPendingResumeFailed =
      47, // ordinal: 0x2c
  PopSleepCheckpointAllocatingHiberContextAllocateIoPagesPagesFailed =
      48, // ordinal: 0x2d
  PopSleepCheckpointAllocatingHiberContextAdapterBuffersInvalid1 =
      49, // ordinal: 0x2e
  PopSleepCheckpointAllocatingHiberContextAllocateDumpPagesFailed =
      50, // ordinal: 0x2f
  PopSleepCheckpointAllocatingHiberContextAdapterBuffersInvalid2 =
      51, // ordinal: 0x30
  PopSleepCheckpointAllocatingHiberContextUnHibernatedMdlFailed =
      52, // ordinal: 0x31
  PopSleepCheckpointAllocatingHiberContextSecureResourcesFailed =
      53,                                    // ordinal: 0x32
  PopSleepCheckpointPrepareSleepBefore = 54, // ordinal: 0x33
  PopSleepCheckpointPrepareSleepAfter = 55,  // ordinal: 0x34
  PopSleepCheckpointBootstatAvailable = 56,  // ordinal: 0x35
  PopSleepCheckpointMax = 57,                // ordinal: 0x36
} _POP_SLEEP_CHECKPOINT;

typedef enum _MI_ALTERNATE_LOCK_VA_TYPE {
  AlternateLockVaTypeSystemPtes = 0,   // ordinal: 0x0
  AlternateLockVaTypeNonPagedPool = 1, // ordinal: 0x1
  AlternateLockVaTypeUser = 2,         // ordinal: 0x2
  AlternateLockVaTypeSystem = 3,       // ordinal: 0x3
  AlternateLockVaTypeMaximum = 4,      // ordinal: 0x4
} _MI_ALTERNATE_LOCK_VA_TYPE;

typedef enum _KWAIT_BLOCK_STATE {
  WaitBlockBypassStart = 0,           // ordinal: 0x0
  WaitBlockBypassComplete = 1,        // ordinal: 0x1
  WaitBlockSuspendBypassStart = 2,    // ordinal: 0x2
  WaitBlockSuspendBypassComplete = 3, // ordinal: 0x3
  WaitBlockActive = 4,                // ordinal: 0x4
  WaitBlockInactive = 5,              // ordinal: 0x5
  WaitBlockSuspended = 6,             // ordinal: 0x6
  WaitBlockAllStates = 7,             // ordinal: 0x7
} _KWAIT_BLOCK_STATE;

typedef enum _DEVPROP_OPERATOR {
  DEVPROP_OPERATOR_MODIFIER_NOT = 65536,               // ordinal: 0x0
  DEVPROP_OPERATOR_MODIFIER_IGNORE_CASE = 131072,      // ordinal: 0x1
  DEVPROP_OPERATOR_NONE = 0,                           // ordinal: 0x2
  DEVPROP_OPERATOR_EXISTS = 1,                         // ordinal: 0x3
  DEVPROP_OPERATOR_NOT_EXISTS = 65537,                 // ordinal: 0x4
  DEVPROP_OPERATOR_EQUALS = 2,                         // ordinal: 0x5
  DEVPROP_OPERATOR_NOT_EQUALS = 65538,                 // ordinal: 0x6
  DEVPROP_OPERATOR_GREATER_THAN = 3,                   // ordinal: 0x7
  DEVPROP_OPERATOR_LESS_THAN = 4,                      // ordinal: 0x8
  DEVPROP_OPERATOR_GREATER_THAN_EQUALS = 5,            // ordinal: 0x9
  DEVPROP_OPERATOR_LESS_THAN_EQUALS = 6,               // ordinal: 0xa
  DEVPROP_OPERATOR_EQUALS_IGNORE_CASE = 131074,        // ordinal: 0xb
  DEVPROP_OPERATOR_NOT_EQUALS_IGNORE_CASE = 196610,    // ordinal: 0xc
  DEVPROP_OPERATOR_BITWISE_AND = 7,                    // ordinal: 0xd
  DEVPROP_OPERATOR_BITWISE_OR = 8,                     // ordinal: 0xe
  DEVPROP_OPERATOR_BEGINS_WITH = 9,                    // ordinal: 0xf
  DEVPROP_OPERATOR_ENDS_WITH = 10,                     // ordinal: 0x10
  DEVPROP_OPERATOR_CONTAINS = 11,                      // ordinal: 0x11
  DEVPROP_OPERATOR_BEGINS_WITH_IGNORE_CASE = 131081,   // ordinal: 0x12
  DEVPROP_OPERATOR_ENDS_WITH_IGNORE_CASE = 131082,     // ordinal: 0x13
  DEVPROP_OPERATOR_CONTAINS_IGNORE_CASE = 131083,      // ordinal: 0x14
  DEVPROP_OPERATOR_LIST_CONTAINS = 4096,               // ordinal: 0x15
  DEVPROP_OPERATOR_LIST_ELEMENT_BEGINS_WITH = 8192,    // ordinal: 0x16
  DEVPROP_OPERATOR_LIST_ELEMENT_ENDS_WITH = 12288,     // ordinal: 0x17
  DEVPROP_OPERATOR_LIST_ELEMENT_CONTAINS = 16384,      // ordinal: 0x18
  DEVPROP_OPERATOR_LIST_CONTAINS_IGNORE_CASE = 135168, // ordinal: 0x19
  DEVPROP_OPERATOR_LIST_ELEMENT_BEGINS_WITH_IGNORE_CASE =
      139264,                                                   // ordinal: 0x1a
  DEVPROP_OPERATOR_LIST_ELEMENT_ENDS_WITH_IGNORE_CASE = 143360, // ordinal: 0x1b
  DEVPROP_OPERATOR_LIST_ELEMENT_CONTAINS_IGNORE_CASE = 147456,  // ordinal: 0x1c
  DEVPROP_OPERATOR_AND_OPEN = 1048576,                          // ordinal: 0x1d
  DEVPROP_OPERATOR_AND_CLOSE = 2097152,                         // ordinal: 0x1e
  DEVPROP_OPERATOR_OR_OPEN = 3145728,                           // ordinal: 0x1f
  DEVPROP_OPERATOR_OR_CLOSE = 4194304,                          // ordinal: 0x20
  DEVPROP_OPERATOR_NOT_OPEN = 5242880,                          // ordinal: 0x21
  DEVPROP_OPERATOR_NOT_CLOSE = 6291456,                         // ordinal: 0x22
  DEVPROP_OPERATOR_ARRAY_CONTAINS = 268435456,                  // ordinal: 0x23
  DEVPROP_OPERATOR_MASK_EVAL = 4095,                            // ordinal: 0x24
  DEVPROP_OPERATOR_MASK_LIST = 61440,                           // ordinal: 0x25
  DEVPROP_OPERATOR_MASK_MODIFIER = 983040,                      // ordinal: 0x26
  DEVPROP_OPERATOR_MASK_NOT_LOGICAL = -267386881,               // ordinal: 0x27
  DEVPROP_OPERATOR_MASK_LOGICAL = 267386880,                    // ordinal: 0x28
  DEVPROP_OPERATOR_MASK_ARRAY = -268435456,                     // ordinal: 0x29
} _DEVPROP_OPERATOR;

typedef enum _RTLP_HP_MEMORY_TYPE {
  HeapMemoryPaged = 0,     // ordinal: 0x0
  HeapMemoryNonPaged = 1,  // ordinal: 0x1
  HeapMemoryLargePage = 2, // ordinal: 0x2
  HeapMemoryHugePage = 3,  // ordinal: 0x3
  HeapMemoryTypeMax = 4,   // ordinal: 0x4
} _RTLP_HP_MEMORY_TYPE;

typedef enum _EX_HEAP_TYPE {
  ExHeapTypeNonPagedMin = 0, // ordinal: 0x0
  ExHeapTypeNonPaged = 0,    // ordinal: 0x1
  ExHeapTypeNonPagedMax = 1, // ordinal: 0x2
  ExHeapTypeNonPagedNx = 1,  // ordinal: 0x3
  ExHeapTypePagedMin = 2,    // ordinal: 0x4
  ExHeapTypePaged = 2,       // ordinal: 0x5
  ExHeapTypePagedMax = 3,    // ordinal: 0x6
  ExHeapTypeSpecialMax = 3,  // ordinal: 0x7
  ExHeapTypeMmSt = 3,        // ordinal: 0x8
  ExHeapTypeMax = 4,         // ordinal: 0x9
} _EX_HEAP_TYPE;

typedef enum FEATURE_CHANGE_TIME {
  FEATURE_CHANGE_TIME_READ = 0,          // ordinal: 0x0
  FEATURE_CHANGE_TIME_MODULE_RELOAD = 1, // ordinal: 0x1
  FEATURE_CHANGE_TIME_SESSION = 2,       // ordinal: 0x2
  FEATURE_CHANGE_TIME_REBOOT = 3,        // ordinal: 0x3
  FEATURE_CHANGE_TIME_USER_FLAG = 128,   // ordinal: 0x4
} FEATURE_CHANGE_TIME;

typedef enum _POP_DIRECTED_DRIPS_PROBLEM_DEVICE_REASON {
  DirectedDripsProblemDeviceReasonSpecialDevice = 0,      // ordinal: 0x0
  DirectedDripsProblemDeviceReasonNoDfx = 1,              // ordinal: 0x1
  DirectedDripsProblemDeviceReasonNoPs4 = 2,              // ordinal: 0x2
  DirectedDripsProblemDeviceReasonNoPs4Root = 3,          // ordinal: 0x3
  DirectedDripsProblemDeviceReasonComponentContraint = 4, // ordinal: 0x4
  DirectedDripsProblemDeviceReasonDfxFailure = 5,         // ordinal: 0x5
  DirectedDripsProblemDeviceReasonMax = 6,                // ordinal: 0x6
} _POP_DIRECTED_DRIPS_PROBLEM_DEVICE_REASON;

typedef enum _PROCESS_SECTION_TYPE {
  ProcessSectionData = 0,           // ordinal: 0x0
  ProcessSectionImage = 1,          // ordinal: 0x1
  ProcessSectionImageNx = 2,        // ordinal: 0x2
  ProcessSectionPagefileBacked = 3, // ordinal: 0x3
  ProcessSectionMax = 4,            // ordinal: 0x4
} _PROCESS_SECTION_TYPE;

typedef enum _FILE_OBJECT_EXTENSION_TYPE {
  FoExtTypeTransactionParams = 0,   // ordinal: 0x0
  FoExtTypeInternal = 1,            // ordinal: 0x1
  FoExtTypeIosbRange = 2,           // ordinal: 0x2
  FoExtTypeGeneric = 3,             // ordinal: 0x3
  FoExtTypeSfio = 4,                // ordinal: 0x4
  FoExtTypeSymlink = 5,             // ordinal: 0x5
  FoExtTypeOplockKey = 6,           // ordinal: 0x6
  FoExtTypeSilo = 7,                // ordinal: 0x7
  FoExtTypeMemoryPartitionInfo = 8, // ordinal: 0x8
  MaxFoExtTypes = 9,                // ordinal: 0x9
} _FILE_OBJECT_EXTENSION_TYPE;

typedef enum _OBJECT_INFORMATION_CLASS {
  ObjectBasicInformation = 0,         // ordinal: 0x0
  ObjectNameInformation = 1,          // ordinal: 0x1
  ObjectTypeInformation = 2,          // ordinal: 0x2
  ObjectTypesInformation = 3,         // ordinal: 0x3
  ObjectHandleFlagInformation = 4,    // ordinal: 0x4
  ObjectSessionInformation = 5,       // ordinal: 0x5
  ObjectSessionObjectInformation = 6, // ordinal: 0x6
  MaxObjectInfoClass = 7,             // ordinal: 0x7
} _OBJECT_INFORMATION_CLASS;

typedef enum _JOBOBJECTINFOCLASS {
  JobObjectBasicAccountingInformation = 1,         // ordinal: 0x0
  JobObjectBasicLimitInformation = 2,              // ordinal: 0x1
  JobObjectBasicProcessIdList = 3,                 // ordinal: 0x2
  JobObjectBasicUIRestrictions = 4,                // ordinal: 0x3
  JobObjectSecurityLimitInformation = 5,           // ordinal: 0x4
  JobObjectEndOfJobTimeInformation = 6,            // ordinal: 0x5
  JobObjectAssociateCompletionPortInformation = 7, // ordinal: 0x6
  JobObjectBasicAndIoAccountingInformation = 8,    // ordinal: 0x7
  JobObjectExtendedLimitInformation = 9,           // ordinal: 0x8
  JobObjectJobSetInformation = 10,                 // ordinal: 0x9
  JobObjectGroupInformation = 11,                  // ordinal: 0xa
  JobObjectNotificationLimitInformation = 12,      // ordinal: 0xb
  JobObjectLimitViolationInformation = 13,         // ordinal: 0xc
  JobObjectGroupInformationEx = 14,                // ordinal: 0xd
  JobObjectCpuRateControlInformation = 15,         // ordinal: 0xe
  JobObjectCompletionFilter = 16,                  // ordinal: 0xf
  JobObjectCompletionCounter = 17,                 // ordinal: 0x10
  JobObjectFreezeInformation = 18,                 // ordinal: 0x11
  JobObjectExtendedAccountingInformation = 19,     // ordinal: 0x12
  JobObjectWakeInformation = 20,                   // ordinal: 0x13
  JobObjectBackgroundInformation = 21,             // ordinal: 0x14
  JobObjectSchedulingRankBiasInformation = 22,     // ordinal: 0x15
  JobObjectTimerVirtualizationInformation = 23,    // ordinal: 0x16
  JobObjectCycleTimeNotification = 24,             // ordinal: 0x17
  JobObjectClearEvent = 25,                        // ordinal: 0x18
  JobObjectInterferenceInformation = 26,           // ordinal: 0x19
  JobObjectClearPeakJobMemoryUsed = 27,            // ordinal: 0x1a
  JobObjectMemoryUsageInformation = 28,            // ordinal: 0x1b
  JobObjectSharedCommit = 29,                      // ordinal: 0x1c
  JobObjectContainerId = 30,                       // ordinal: 0x1d
  JobObjectIoRateControlInformation = 31,          // ordinal: 0x1e
  JobObjectSiloRootDirectory = 37,                 // ordinal: 0x1f
  JobObjectServerSiloBasicInformation = 38,        // ordinal: 0x20
  JobObjectServerSiloUserSharedData = 39,          // ordinal: 0x21
  JobObjectServerSiloInitialize = 40,              // ordinal: 0x22
  JobObjectServerSiloRunningState = 41,            // ordinal: 0x23
  JobObjectIoAttribution = 42,                     // ordinal: 0x24
  JobObjectMemoryPartitionInformation = 43,        // ordinal: 0x25
  JobObjectContainerTelemetryId = 44,              // ordinal: 0x26
  JobObjectSiloSystemRoot = 45,                    // ordinal: 0x27
  JobObjectEnergyTrackingState = 46,               // ordinal: 0x28
  JobObjectThreadImpersonationInformation = 47,    // ordinal: 0x29
  JobObjectReserved1Information = 18,              // ordinal: 0x2a
  JobObjectReserved2Information = 19,              // ordinal: 0x2b
  JobObjectReserved3Information = 20,              // ordinal: 0x2c
  JobObjectReserved4Information = 21,              // ordinal: 0x2d
  JobObjectReserved5Information = 22,              // ordinal: 0x2e
  JobObjectReserved6Information = 23,              // ordinal: 0x2f
  JobObjectReserved7Information = 24,              // ordinal: 0x30
  JobObjectReserved8Information = 25,              // ordinal: 0x31
  JobObjectReserved9Information = 26,              // ordinal: 0x32
  JobObjectReserved10Information = 27,             // ordinal: 0x33
  JobObjectReserved11Information = 28,             // ordinal: 0x34
  JobObjectReserved12Information = 29,             // ordinal: 0x35
  JobObjectReserved13Information = 30,             // ordinal: 0x36
  JobObjectReserved14Information = 31,             // ordinal: 0x37
  JobObjectNetRateControlInformation = 32,         // ordinal: 0x38
  JobObjectNotificationLimitInformation2 = 33,     // ordinal: 0x39
  JobObjectLimitViolationInformation2 = 34,        // ordinal: 0x3a
  JobObjectCreateSilo = 35,                        // ordinal: 0x3b
  JobObjectSiloBasicInformation = 36,              // ordinal: 0x3c
  JobObjectReserved15Information = 37,             // ordinal: 0x3d
  JobObjectReserved16Information = 38,             // ordinal: 0x3e
  JobObjectReserved17Information = 39,             // ordinal: 0x3f
  JobObjectReserved18Information = 40,             // ordinal: 0x40
  JobObjectReserved19Information = 41,             // ordinal: 0x41
  JobObjectReserved20Information = 42,             // ordinal: 0x42
  JobObjectReserved21Information = 43,             // ordinal: 0x43
  JobObjectReserved22Information = 44,             // ordinal: 0x44
  JobObjectReserved23Information = 45,             // ordinal: 0x45
  JobObjectReserved24Information = 46,             // ordinal: 0x46
  JobObjectReserved25Information = 47,             // ordinal: 0x47
  MaxJobObjectInfoClass = 48,                      // ordinal: 0x48
} _JOBOBJECTINFOCLASS;

typedef enum _IO_RATE_CONTROL_TYPE {
  IoRateControlTypeCapMin = 0,                         // ordinal: 0x0
  IoRateControlTypeIopsCap = 0,                        // ordinal: 0x1
  IoRateControlTypeBandwidthCap = 1,                   // ordinal: 0x2
  IoRateControlTypeTimePercentCap = 2,                 // ordinal: 0x3
  IoRateControlTypeCapMax = 2,                         // ordinal: 0x4
  IoRateControlTypeReservationMin = 3,                 // ordinal: 0x5
  IoRateControlTypeIopsReservation = 3,                // ordinal: 0x6
  IoRateControlTypeBandwidthReservation = 4,           // ordinal: 0x7
  IoRateControlTypeTimePercentReservation = 5,         // ordinal: 0x8
  IoRateControlTypeReservationMax = 5,                 // ordinal: 0x9
  IoRateControlTypeCriticalReservationMin = 6,         // ordinal: 0xa
  IoRateControlTypeIopsCriticalReservation = 6,        // ordinal: 0xb
  IoRateControlTypeBandwidthCriticalReservation = 7,   // ordinal: 0xc
  IoRateControlTypeTimePercentCriticalReservation = 8, // ordinal: 0xd
  IoRateControlTypeCriticalReservationMax = 8,         // ordinal: 0xe
  IoRateControlTypeSoftCapMin = 9,                     // ordinal: 0xf
  IoRateControlTypeIopsSoftCap = 9,                    // ordinal: 0x10
  IoRateControlTypeBandwidthSoftCap = 10,              // ordinal: 0x11
  IoRateControlTypeTimePercentSoftCap = 11,            // ordinal: 0x12
  IoRateControlTypeSoftCapMax = 11,                    // ordinal: 0x13
  IoRateControlTypeLimitExcessNotifyMin = 12,          // ordinal: 0x14
  IoRateControlTypeIopsLimitExcessNotify = 12,         // ordinal: 0x15
  IoRateControlTypeBandwidthLimitExcessNotify = 13,    // ordinal: 0x16
  IoRateControlTypeTimePercentLimitExcessNotify = 14,  // ordinal: 0x17
  IoRateControlTypeLimitExcessNotifyMax = 14,          // ordinal: 0x18
  IoRateControlTypeMax = 15,                           // ordinal: 0x19
} _IO_RATE_CONTROL_TYPE;

typedef enum _WNF_STATE_NAME_LIFETIME {
  WnfWellKnownStateName = 0,  // ordinal: 0x0
  WnfPermanentStateName = 1,  // ordinal: 0x1
  WnfPersistentStateName = 2, // ordinal: 0x2
  WnfTemporaryStateName = 3,  // ordinal: 0x3
} _WNF_STATE_NAME_LIFETIME;

typedef enum _TRANSFER_TYPE {
  ReadTransfer = 0,  // ordinal: 0x0
  WriteTransfer = 1, // ordinal: 0x1
  OtherTransfer = 2, // ordinal: 0x2
} _TRANSFER_TYPE;

typedef enum _LOCK_OPERATION {
  IoReadAccess = 0,   // ordinal: 0x0
  IoWriteAccess = 1,  // ordinal: 0x1
  IoModifyAccess = 2, // ordinal: 0x2
} _LOCK_OPERATION;

typedef enum _EX_POOL_PRIORITY {
  LowPoolPriority = 0,                        // ordinal: 0x0
  LowPoolPrioritySpecialPoolOverrun = 8,      // ordinal: 0x1
  LowPoolPrioritySpecialPoolUnderrun = 9,     // ordinal: 0x2
  NormalPoolPriority = 16,                    // ordinal: 0x3
  NormalPoolPrioritySpecialPoolOverrun = 24,  // ordinal: 0x4
  NormalPoolPrioritySpecialPoolUnderrun = 25, // ordinal: 0x5
  HighPoolPriority = 32,                      // ordinal: 0x6
  HighPoolPrioritySpecialPoolOverrun = 40,    // ordinal: 0x7
  HighPoolPrioritySpecialPoolUnderrun = 41,   // ordinal: 0x8
} _EX_POOL_PRIORITY;

typedef enum _KWAIT_REASON {
  Executive = 0,          // ordinal: 0x0
  FreePage = 1,           // ordinal: 0x1
  PageIn = 2,             // ordinal: 0x2
  PoolAllocation = 3,     // ordinal: 0x3
  DelayExecution = 4,     // ordinal: 0x4
  Suspended = 5,          // ordinal: 0x5
  UserRequest = 6,        // ordinal: 0x6
  WrExecutive = 7,        // ordinal: 0x7
  WrFreePage = 8,         // ordinal: 0x8
  WrPageIn = 9,           // ordinal: 0x9
  WrPoolAllocation = 10,  // ordinal: 0xa
  WrDelayExecution = 11,  // ordinal: 0xb
  WrSuspended = 12,       // ordinal: 0xc
  WrUserRequest = 13,     // ordinal: 0xd
  WrSpare0 = 14,          // ordinal: 0xe
  WrQueue = 15,           // ordinal: 0xf
  WrLpcReceive = 16,      // ordinal: 0x10
  WrLpcReply = 17,        // ordinal: 0x11
  WrVirtualMemory = 18,   // ordinal: 0x12
  WrPageOut = 19,         // ordinal: 0x13
  WrRendezvous = 20,      // ordinal: 0x14
  WrKeyedEvent = 21,      // ordinal: 0x15
  WrTerminated = 22,      // ordinal: 0x16
  WrProcessInSwap = 23,   // ordinal: 0x17
  WrCpuRateControl = 24,  // ordinal: 0x18
  WrCalloutStack = 25,    // ordinal: 0x19
  WrKernel = 26,          // ordinal: 0x1a
  WrResource = 27,        // ordinal: 0x1b
  WrPushLock = 28,        // ordinal: 0x1c
  WrMutex = 29,           // ordinal: 0x1d
  WrQuantumEnd = 30,      // ordinal: 0x1e
  WrDispatchInt = 31,     // ordinal: 0x1f
  WrPreempted = 32,       // ordinal: 0x20
  WrYieldExecution = 33,  // ordinal: 0x21
  WrFastMutex = 34,       // ordinal: 0x22
  WrGuardedMutex = 35,    // ordinal: 0x23
  WrRundown = 36,         // ordinal: 0x24
  WrAlertByThreadId = 37, // ordinal: 0x25
  WrDeferredPreempt = 38, // ordinal: 0x26
  WrPhysicalFault = 39,   // ordinal: 0x27
  MaximumWaitReason = 40, // ordinal: 0x28
} _KWAIT_REASON;

typedef enum _RTLP_HP_ALLOCATOR {
  RtlpHpSegmentSm = 0,     // ordinal: 0x0
  RtlpHpSegmentLg = 1,     // ordinal: 0x1
  RtlpHpSegmentTypes = 2,  // ordinal: 0x2
  RtlpHpHugeAllocator = 2, // ordinal: 0x3
  RtlpHpAllocatorMax = 3,  // ordinal: 0x4
} _RTLP_HP_ALLOCATOR;

typedef enum _HEAP_SEG_RANGE_TYPE {
  HeapSegRangeUser = 0,     // ordinal: 0x0
  HeapSegRangeInternal = 1, // ordinal: 0x1
  HeapSegRangeLFH = 2,      // ordinal: 0x2
  HeapSegRangeVS = 3,       // ordinal: 0x3
  HeapSegRangeTypeMax = 3,  // ordinal: 0x4
} _HEAP_SEG_RANGE_TYPE;

typedef enum _HEAP_LFH_LOCKMODE {
  HeapLockNotHeld = 0,   // ordinal: 0x0
  HeapLockShared = 1,    // ordinal: 0x1
  HeapLockExclusive = 2, // ordinal: 0x2
} _HEAP_LFH_LOCKMODE;

typedef enum RTLP_CSPARSE_BITMAP_STATE {
  CommitBitmapInvalid = 0, // ordinal: 0x0
  UserBitmapInvalid = 1,   // ordinal: 0x1
  UserBitmapValid = 2,     // ordinal: 0x2
} RTLP_CSPARSE_BITMAP_STATE;

typedef enum _OPENCOUNT_REASON {
  OpenCount_SkipLogging = 0,                    // ordinal: 0x0
  OpenCount_AsyncRead = 1,                      // ordinal: 0x1
  OpenCount_FlushCache = 2,                     // ordinal: 0x2
  OpenCount_GetDirtyPage = 3,                   // ordinal: 0x3
  OpenCount_GetFlushedVDL = 4,                  // ordinal: 0x4
  OpenCount_InitCachemap1 = 5,                  // ordinal: 0x5
  OpenCount_InitCachemap2 = 6,                  // ordinal: 0x6
  OpenCount_InitCachemap3 = 7,                  // ordinal: 0x7
  OpenCount_InitCachemap4 = 8,                  // ordinal: 0x8
  OpenCount_InitCachemap5 = 9,                  // ordinal: 0x9
  OpenCount_MdlWrite = 10,                      // ordinal: 0xa
  OpenCount_MdlWriteAbort = 11,                 // ordinal: 0xb
  OpenCount_NotifyMappedWrite = 12,             // ordinal: 0xc
  OpenCount_NotifyMappedWriteCompCallback = 13, // ordinal: 0xd
  OpenCount_PurgeCache = 14,                    // ordinal: 0xe
  OpenCount_PurgeCacheActiveViews = 15,         // ordinal: 0xf
  OpenCount_ReadAhead = 16,                     // ordinal: 0x10
  OpenCount_SetFileSize = 17,                   // ordinal: 0x11
  OpenCount_SetFileSizeSection = 18,            // ordinal: 0x12
  OpenCount_UninitCachemapReadAhead = 19,       // ordinal: 0x13
  OpenCount_UninitCachemapReg = 20,             // ordinal: 0x14
  OpenCount_UnmapInactiveViews = 21,            // ordinal: 0x15
  OpenCount_UnmapInactiveViews1 = 22,           // ordinal: 0x16
  OpenCount_UnmapInactiveViews2 = 23,           // ordinal: 0x17
  OpenCount_UnmapInactiveViews3 = 24,           // ordinal: 0x18
  OpenCount_WriteBehind = 25,                   // ordinal: 0x19
  OpenCount_WriteBehindComplete = 26,           // ordinal: 0x1a
  OpenCount_WriteBehindFailAcquire = 27,        // ordinal: 0x1b
} _OPENCOUNT_REASON;

typedef enum _POWER_REQUEST_TYPE_INTERNAL {
  PowerRequestDisplayRequiredInternal = 0,   // ordinal: 0x0
  PowerRequestSystemRequiredInternal = 1,    // ordinal: 0x1
  PowerRequestAwayModeRequiredInternal = 2,  // ordinal: 0x2
  PowerRequestExecutionRequiredInternal = 3, // ordinal: 0x3
  PowerRequestPerfBoostRequiredInternal = 4, // ordinal: 0x4
  PowerRequestActiveLockScreenInternal = 5,  // ordinal: 0x5
  PowerRequestInternalInvalid = 6,           // ordinal: 0x6
} _POWER_REQUEST_TYPE_INTERNAL;

typedef enum _POWER_REQUEST_TYPE {
  PowerRequestDisplayRequired = 0,   // ordinal: 0x0
  PowerRequestSystemRequired = 1,    // ordinal: 0x1
  PowerRequestAwayModeRequired = 2,  // ordinal: 0x2
  PowerRequestExecutionRequired = 3, // ordinal: 0x3
} _POWER_REQUEST_TYPE;

typedef enum _IPI_TYPE {
  IpiAffinity = 0,   // ordinal: 0x0
  IpiAllButSelf = 1, // ordinal: 0x1
  IpiAll = 2,        // ordinal: 0x2
} _IPI_TYPE;

typedef enum _CMP_FAILURE_INJECTION_POINT {
  CmpFailurePointPoolAllocation = 0,                    // ordinal: 0x0
  CmpFailurePointViewMapping = 1,                       // ordinal: 0x1
  CmpFailurePointViewPinning = 2,                       // ordinal: 0x2
  CmpFailurePointResourceCharging = 3,                  // ordinal: 0x3
  CmpFailurePointFileWrite = 4,                         // ordinal: 0x4
  CmpFailurePointFileRead = 5,                          // ordinal: 0x5
  CmpFailurePointCacheFlush = 6,                        // ordinal: 0x6
  CmpFailurePointFlush = 7,                             // ordinal: 0x7
  CmpFailurePointFlushAndPurge = 8,                     // ordinal: 0x8
  CmpFailurePointForceLargeBin = 9,                     // ordinal: 0x9
  CmpFailurePointDontFixAlignment = 10,                 // ordinal: 0xa
  CmpFailurePointAllocateCell = 11,                     // ordinal: 0xb
  CmpFailurePointMarkDirty = 12,                        // ordinal: 0xc
  CmpFailurePointForceMultiLevelMap = 13,               // ordinal: 0xd
  CmpFailurePointAllocateContiguousLogEntry = 14,       // ordinal: 0xe
  CmpFailurePointAllocateKcb = 15,                      // ordinal: 0xf
  CmpFailurePointCreateKeyBody = 16,                    // ordinal: 0x10
  CmpFailurePointForceFreeKcb = 17,                     // ordinal: 0x11
  CmpFailurePointKeyEnumResumeContextVerification = 18, // ordinal: 0x12
  CmpFailurePointKeyEnumForceRetry = 19,                // ordinal: 0x13
  CmpFailurePointForceReorganization = 20,              // ordinal: 0x14
  CmpFailurePointForceLazyCOWByPolicy = 21,             // ordinal: 0x15
  CmpFailureInjectionPointCount = 22,                   // ordinal: 0x16
} _CMP_FAILURE_INJECTION_POINT;

typedef enum wil_UsageReportingMode {
  wil_UsageReportingMode_Default = 0,           // ordinal: 0x0
  wil_UsageReportingMode_SuppressPotential = 1, // ordinal: 0x1
  wil_UsageReportingMode_SuppressImplicit = 2,  // ordinal: 0x2
} wil_UsageReportingMode;

typedef enum wil_FeatureChangeTime {
  wil_FeatureChangeTime_OnRead = 0,    // ordinal: 0x0
  wil_FeatureChangeTime_OnReload = 1,  // ordinal: 0x1
  wil_FeatureChangeTime_OnSession = 2, // ordinal: 0x2
  wil_FeatureChangeTime_OnReboot = 3,  // ordinal: 0x3
} wil_FeatureChangeTime;

typedef enum wil_FeatureStore {
  wil_FeatureStore_Machine = 0, // ordinal: 0x0
  wil_FeatureStore_User = 1,    // ordinal: 0x1
  wil_FeatureStore_All = 2,     // ordinal: 0x2
} wil_FeatureStore;

typedef enum wil_details_ServiceReportingOptions {
  wil_details_ServiceReportingOptions_None = 0,          // ordinal: 0x0
  wil_details_ServiceReportingOptions_VariantConfig = 1, // ordinal: 0x1
} wil_details_ServiceReportingOptions;

typedef enum wil_details_StagingConfigFeatureFields {
  wil_details_StagingConfigFeatureFields_None = 0,         // ordinal: 0x0
  wil_details_StagingConfigFeatureFields_ServiceState = 1, // ordinal: 0x1
  wil_details_StagingConfigFeatureFields_UserState = 2,    // ordinal: 0x2
  wil_details_StagingConfigFeatureFields_TestState = 4,    // ordinal: 0x3
  wil_details_StagingConfigFeatureFields_Variant = 8,      // ordinal: 0x4
} wil_details_StagingConfigFeatureFields;

typedef enum wil_FeatureEnabledStateKind {
  wil_FeatureEnabledStateKind_All = 0,     // ordinal: 0x0
  wil_FeatureEnabledStateKind_Service = 1, // ordinal: 0x1
  wil_FeatureEnabledStateKind_User = 2,    // ordinal: 0x2
  wil_FeatureEnabledStateKind_Test = 3,    // ordinal: 0x3
} wil_FeatureEnabledStateKind;

typedef enum wil_FeatureEnabledStateOptions {
  wil_FeatureEnabledStateOptions_None = 0,          // ordinal: 0x0
  wil_FeatureEnabledStateOptions_VariantConfig = 1, // ordinal: 0x1
} wil_FeatureEnabledStateOptions;

typedef enum wil_VariantReportingKind {
  wil_VariantReportingKind_None = 0,        // ordinal: 0x0
  wil_VariantReportingKind_UniqueUsage = 1, // ordinal: 0x1
  wil_VariantReportingKind_DeviceUsage = 2, // ordinal: 0x2
} wil_VariantReportingKind;

typedef enum wil_ReportingKind {
  wil_ReportingKind_None = 0,              // ordinal: 0x0
  wil_ReportingKind_UniqueUsage = 1,       // ordinal: 0x1
  wil_ReportingKind_UniqueOpportunity = 2, // ordinal: 0x2
  wil_ReportingKind_DeviceUsage = 3,       // ordinal: 0x3
  wil_ReportingKind_DeviceOpportunity = 4, // ordinal: 0x4
  wil_ReportingKind_TotalDuration = 5,     // ordinal: 0x5
  wil_ReportingKind_PausedDuration = 6,    // ordinal: 0x6
} wil_ReportingKind;

typedef enum wil_details_ServiceReportingKind {
  wil_details_ServiceReportingKind_UniqueUsage = 0,          // ordinal: 0x0
  wil_details_ServiceReportingKind_UniqueOpportunity = 1,    // ordinal: 0x1
  wil_details_ServiceReportingKind_DeviceUsage = 2,          // ordinal: 0x2
  wil_details_ServiceReportingKind_DeviceOpportunity = 3,    // ordinal: 0x3
  wil_details_ServiceReportingKind_PotentialUniqueUsage = 4, // ordinal: 0x4
  wil_details_ServiceReportingKind_PotentialUniqueOpportunity =
      5,                                                     // ordinal: 0x5
  wil_details_ServiceReportingKind_PotentialDeviceUsage = 6, // ordinal: 0x6
  wil_details_ServiceReportingKind_PotentialDeviceOpportunity =
      7,                                                        // ordinal: 0x7
  wil_details_ServiceReportingKind_EnabledTotalDuration = 8,    // ordinal: 0x8
  wil_details_ServiceReportingKind_EnabledPausedDuration = 9,   // ordinal: 0x9
  wil_details_ServiceReportingKind_DisabledTotalDuration = 10,  // ordinal: 0xa
  wil_details_ServiceReportingKind_DisabledPausedDuration = 11, // ordinal: 0xb
  wil_details_ServiceReportingKind_CustomEnabledBase = 100,     // ordinal: 0xc
  wil_details_ServiceReportingKind_CustomDisabledBase = 150,    // ordinal: 0xd
  wil_details_ServiceReportingKind_Store = 254,                 // ordinal: 0xe
  wil_details_ServiceReportingKind_None = 255,                  // ordinal: 0xf
  wil_details_ServiceReportingKind_VariantDevicePotentialBase =
      256, // ordinal: 0x10
  wil_details_ServiceReportingKind_VariantDeviceUsageBase =
      320, // ordinal: 0x11
  wil_details_ServiceReportingKind_VariantUniquePotentialBase =
      384, // ordinal: 0x12
  wil_details_ServiceReportingKind_VariantUniqueUsageBase =
      448, // ordinal: 0x13
} wil_details_ServiceReportingKind;

typedef enum wil_details_CachedHasNotificationState {
  wil_details_CachedHasNotificationState_Unknown = 0, // ordinal: 0x0
  wil_details_CachedHasNotificationState_DoesNotHaveNotifications =
      1,                                                      // ordinal: 0x1
  wil_details_CachedHasNotificationState_HasNotification = 2, // ordinal: 0x2
} wil_details_CachedHasNotificationState;

typedef enum wil_details_CachedFeatureEnabledState {
  wil_details_CachedFeatureEnabledState_Unknown = 0,  // ordinal: 0x0
  wil_details_CachedFeatureEnabledState_Disabled = 1, // ordinal: 0x1
  wil_details_CachedFeatureEnabledState_Enabled = 2,  // ordinal: 0x2
  wil_details_CachedFeatureEnabledState_Desired = 3,  // ordinal: 0x3
} wil_details_CachedFeatureEnabledState;

typedef enum _EVENT_INFO_CLASS {
  EventProviderBinaryTrackInfo = 0,   // ordinal: 0x0
  EventProviderSetReserved1 = 1,      // ordinal: 0x1
  EventProviderSetTraits = 2,         // ordinal: 0x2
  EventProviderUseDescriptorType = 3, // ordinal: 0x3
  MaxEventInfo = 4,                   // ordinal: 0x4
} _EVENT_INFO_CLASS;

typedef enum _DEVICE_WAKE_DEPTH {
  DeviceWakeDepthNotWakeable = 0, // ordinal: 0x0
  DeviceWakeDepthD0 = 1,          // ordinal: 0x1
  DeviceWakeDepthD1 = 2,          // ordinal: 0x2
  DeviceWakeDepthD2 = 3,          // ordinal: 0x3
  DeviceWakeDepthD3hot = 4,       // ordinal: 0x4
  DeviceWakeDepthD3cold = 5,      // ordinal: 0x5
  DeviceWakeDepthMaximum = 6,     // ordinal: 0x6
} _DEVICE_WAKE_DEPTH;

typedef enum _DEVICE_POWER_STATE {
  PowerDeviceUnspecified = 0, // ordinal: 0x0
  PowerDeviceD0 = 1,          // ordinal: 0x1
  PowerDeviceD1 = 2,          // ordinal: 0x2
  PowerDeviceD2 = 3,          // ordinal: 0x3
  PowerDeviceD3 = 4,          // ordinal: 0x4
  PowerDeviceMaximum = 5,     // ordinal: 0x5
} _DEVICE_POWER_STATE;

typedef enum _PF_FILE_ACCESS_TYPE {
  PfFileAccessTypeRead = 0,  // ordinal: 0x0
  PfFileAccessTypeWrite = 1, // ordinal: 0x1
  PfFileAccessTypeMax = 2,   // ordinal: 0x2
} _PF_FILE_ACCESS_TYPE;

typedef enum _MEMORY_CACHING_TYPE {
  MmNonCached = 0,              // ordinal: 0x0
  MmCached = 1,                 // ordinal: 0x1
  MmWriteCombined = 2,          // ordinal: 0x2
  MmHardwareCoherentCached = 3, // ordinal: 0x3
  MmNonCachedUnordered = 4,     // ordinal: 0x4
  MmUSWCCached = 5,             // ordinal: 0x5
  MmMaximumCacheType = 6,       // ordinal: 0x6
  MmNotMapped = -1,             // ordinal: 0x7
} _MEMORY_CACHING_TYPE;

typedef enum _EX_GEN_RANDOM_DOMAIN {
  ExGenRandomDomainKernel = 0,      // ordinal: 0x0
  ExGenRandomDomainFirst = 0,       // ordinal: 0x1
  ExGenRandomDomainUserVisible = 1, // ordinal: 0x2
  ExGenRandomDomainMax = 2,         // ordinal: 0x3
} _EX_GEN_RANDOM_DOMAIN;

typedef enum _PP_NPAGED_LOOKASIDE_NUMBER {
  LookasideSmallIrpList = 0,      // ordinal: 0x0
  LookasideMediumIrpList = 1,     // ordinal: 0x1
  LookasideLargeIrpList = 2,      // ordinal: 0x2
  LookasideMdlList = 3,           // ordinal: 0x3
  LookasideCreateInfoList = 4,    // ordinal: 0x4
  LookasideNameBufferList = 5,    // ordinal: 0x5
  LookasideTwilightList = 6,      // ordinal: 0x6
  LookasideCompletionList = 7,    // ordinal: 0x7
  LookasideScratchBufferList = 8, // ordinal: 0x8
  LookasideMaximumList = 9,       // ordinal: 0x9
} _PP_NPAGED_LOOKASIDE_NUMBER;

typedef enum _EVENT_TYPE {
  NotificationEvent = 0,    // ordinal: 0x0
  SynchronizationEvent = 1, // ordinal: 0x1
} _EVENT_TYPE;

typedef enum _KSPIN_LOCK_QUEUE_NUMBER {
  LockQueueUnusedSpare0 = 0,      // ordinal: 0x0
  LockQueueUnusedSpare1 = 1,      // ordinal: 0x1
  LockQueueUnusedSpare2 = 2,      // ordinal: 0x2
  LockQueueUnusedSpare3 = 3,      // ordinal: 0x3
  LockQueueVacbLock = 4,          // ordinal: 0x4
  LockQueueMasterLock = 5,        // ordinal: 0x5
  LockQueueNonPagedPoolLock = 6,  // ordinal: 0x6
  LockQueueIoCancelLock = 7,      // ordinal: 0x7
  LockQueueUnusedSpare8 = 8,      // ordinal: 0x8
  LockQueueIoVpbLock = 9,         // ordinal: 0x9
  LockQueueIoDatabaseLock = 10,   // ordinal: 0xa
  LockQueueIoCompletionLock = 11, // ordinal: 0xb
  LockQueueNtfsStructLock = 12,   // ordinal: 0xc
  LockQueueAfdWorkQueueLock = 13, // ordinal: 0xd
  LockQueueBcbLock = 14,          // ordinal: 0xe
  LockQueueUnusedSpare15 = 15,    // ordinal: 0xf
  LockQueueUnusedSpare16 = 16,    // ordinal: 0x10
  LockQueueMaximumLock = 17,      // ordinal: 0x11
} _KSPIN_LOCK_QUEUE_NUMBER;

typedef enum _PS_MITIGATION_OPTION {
  PS_MITIGATION_OPTION_NX = 0,                               // ordinal: 0x0
  PS_MITIGATION_OPTION_SEHOP = 1,                            // ordinal: 0x1
  PS_MITIGATION_OPTION_FORCE_RELOCATE_IMAGES = 2,            // ordinal: 0x2
  PS_MITIGATION_OPTION_HEAP_TERMINATE = 3,                   // ordinal: 0x3
  PS_MITIGATION_OPTION_BOTTOM_UP_ASLR = 4,                   // ordinal: 0x4
  PS_MITIGATION_OPTION_HIGH_ENTROPY_ASLR = 5,                // ordinal: 0x5
  PS_MITIGATION_OPTION_STRICT_HANDLE_CHECKS = 6,             // ordinal: 0x6
  PS_MITIGATION_OPTION_WIN32K_SYSTEM_CALL_DISABLE = 7,       // ordinal: 0x7
  PS_MITIGATION_OPTION_EXTENSION_POINT_DISABLE = 8,          // ordinal: 0x8
  PS_MITIGATION_OPTION_PROHIBIT_DYNAMIC_CODE = 9,            // ordinal: 0x9
  PS_MITIGATION_OPTION_CONTROL_FLOW_GUARD = 10,              // ordinal: 0xa
  PS_MITIGATION_OPTION_BLOCK_NON_MICROSOFT_BINARIES = 11,    // ordinal: 0xb
  PS_MITIGATION_OPTION_FONT_DISABLE = 12,                    // ordinal: 0xc
  PS_MITIGATION_OPTION_IMAGE_LOAD_NO_REMOTE = 13,            // ordinal: 0xd
  PS_MITIGATION_OPTION_IMAGE_LOAD_NO_LOW_LABEL = 14,         // ordinal: 0xe
  PS_MITIGATION_OPTION_IMAGE_LOAD_PREFER_SYSTEM32 = 15,      // ordinal: 0xf
  PS_MITIGATION_OPTION_RETURN_FLOW_GUARD = 16,               // ordinal: 0x10
  PS_MITIGATION_OPTION_LOADER_INTEGRITY_CONTINUITY = 17,     // ordinal: 0x11
  PS_MITIGATION_OPTION_STRICT_CONTROL_FLOW_GUARD = 18,       // ordinal: 0x12
  PS_MITIGATION_OPTION_RESTRICT_SET_THREAD_CONTEXT = 19,     // ordinal: 0x13
  PS_MITIGATION_OPTION_ROP_STACKPIVOT = 20,                  // ordinal: 0x14
  PS_MITIGATION_OPTION_ROP_CALLER_CHECK = 21,                // ordinal: 0x15
  PS_MITIGATION_OPTION_ROP_SIMEXEC = 22,                     // ordinal: 0x16
  PS_MITIGATION_OPTION_EXPORT_ADDRESS_FILTER = 23,           // ordinal: 0x17
  PS_MITIGATION_OPTION_EXPORT_ADDRESS_FILTER_PLUS = 24,      // ordinal: 0x18
  PS_MITIGATION_OPTION_RESTRICT_CHILD_PROCESS_CREATION = 25, // ordinal: 0x19
  PS_MITIGATION_OPTION_IMPORT_ADDRESS_FILTER = 26,           // ordinal: 0x1a
  PS_MITIGATION_OPTION_MODULE_TAMPERING_PROTECTION = 27,     // ordinal: 0x1b
  PS_MITIGATION_OPTION_RESTRICT_INDIRECT_BRANCH_PREDICTION =
      28,                                                     // ordinal: 0x1c
  PS_MITIGATION_OPTION_SPECULATIVE_STORE_BYPASS_DISABLE = 29, // ordinal: 0x1d
  PS_MITIGATION_OPTION_ALLOW_DOWNGRADE_DYNAMIC_CODE_POLICY =
      30,                                           // ordinal: 0x1e
  PS_MITIGATION_OPTION_CET_USER_SHADOW_STACKS = 31, // ordinal: 0x1f
} _PS_MITIGATION_OPTION;

typedef enum SE_WS_APPX_SIGNATURE_ORIGIN {
  SE_WS_APPX_SIGNATURE_ORIGIN_NOT_VALIDATED = 0, // ordinal: 0x0
  SE_WS_APPX_SIGNATURE_ORIGIN_UNKNOWN = 1,       // ordinal: 0x1
  SE_WS_APPX_SIGNATURE_ORIGIN_APPSTORE = 2,      // ordinal: 0x2
  SE_WS_APPX_SIGNATURE_ORIGIN_WINDOWS = 3,       // ordinal: 0x3
  SE_WS_APPX_SIGNATURE_ORIGIN_ENTERPRISE = 4,    // ordinal: 0x4
} SE_WS_APPX_SIGNATURE_ORIGIN;

typedef enum _DMA_SPEED {
  Compatible = 0,      // ordinal: 0x0
  TypeA = 1,           // ordinal: 0x1
  TypeB = 2,           // ordinal: 0x2
  TypeC = 3,           // ordinal: 0x3
  TypeF = 4,           // ordinal: 0x4
  MaximumDmaSpeed = 5, // ordinal: 0x5
} _DMA_SPEED;

typedef enum _DMA_WIDTH {
  Width8Bits = 0,      // ordinal: 0x0
  Width16Bits = 1,     // ordinal: 0x1
  Width32Bits = 2,     // ordinal: 0x2
  Width64Bits = 3,     // ordinal: 0x3
  WidthNoWrap = 4,     // ordinal: 0x4
  MaximumDmaWidth = 5, // ordinal: 0x5
} _DMA_WIDTH;

typedef enum _LDR_DDAG_STATE {
  LdrModulesMerged = -5,                // ordinal: 0x0
  LdrModulesInitError = -4,             // ordinal: 0x1
  LdrModulesSnapError = -3,             // ordinal: 0x2
  LdrModulesUnloaded = -2,              // ordinal: 0x3
  LdrModulesUnloading = -1,             // ordinal: 0x4
  LdrModulesPlaceHolder = 0,            // ordinal: 0x5
  LdrModulesMapping = 1,                // ordinal: 0x6
  LdrModulesMapped = 2,                 // ordinal: 0x7
  LdrModulesWaitingForDependencies = 3, // ordinal: 0x8
  LdrModulesSnapping = 4,               // ordinal: 0x9
  LdrModulesSnapped = 5,                // ordinal: 0xa
  LdrModulesCondensed = 6,              // ordinal: 0xb
  LdrModulesReadyToInit = 7,            // ordinal: 0xc
  LdrModulesInitializing = 8,           // ordinal: 0xd
  LdrModulesReadyToRun = 9,             // ordinal: 0xe
} _LDR_DDAG_STATE;

typedef enum _LDR_DLL_LOAD_REASON {
  LoadReasonStaticDependency = 0,           // ordinal: 0x0
  LoadReasonStaticForwarderDependency = 1,  // ordinal: 0x1
  LoadReasonDynamicForwarderDependency = 2, // ordinal: 0x2
  LoadReasonDelayloadDependency = 3,        // ordinal: 0x3
  LoadReasonDynamicLoad = 4,                // ordinal: 0x4
  LoadReasonAsImageLoad = 5,                // ordinal: 0x5
  LoadReasonAsDataLoad = 6,                 // ordinal: 0x6
  LoadReasonEnclavePrimary = 7,             // ordinal: 0x7
  LoadReasonEnclaveDependency = 8,          // ordinal: 0x8
  LoadReasonUnknown = -1,                   // ordinal: 0x9
} _LDR_DLL_LOAD_REASON;

typedef enum _KERNEL_STACK_LIMITS {
  BugcheckStackLimits = 0,     // ordinal: 0x0
  DPCStackLimits = 1,          // ordinal: 0x1
  ExpandedStackLimits = 2,     // ordinal: 0x2
  NormalStackLimits = 3,       // ordinal: 0x3
  Win32kStackLimits = 4,       // ordinal: 0x4
  SwapBusyStackLimits = 5,     // ordinal: 0x5
  IsrStackLimits = 6,          // ordinal: 0x6
  DebuggerStackLimits = 7,     // ordinal: 0x7
  NmiStackLimits = 8,          // ordinal: 0x8
  MachineCheckStackLimits = 9, // ordinal: 0x9
  ExceptionStackLimits = 10,   // ordinal: 0xa
  MaximumStackLimits = 11,     // ordinal: 0xb
} _KERNEL_STACK_LIMITS;

typedef enum _DUMP_EVENTS {
  DUMP_EVENT_NONE = 0,             // ordinal: 0x0
  DUMP_EVENT_HIBER_RESUME = 1,     // ordinal: 0x1
  DUMP_EVENT_HIBER_RESUME_END = 2, // ordinal: 0x2
} _DUMP_EVENTS;

typedef enum _POP_IO_STATUS {
  IoReady = 0,   // ordinal: 0x0
  IoPending = 1, // ordinal: 0x1
  IoDone = 2,    // ordinal: 0x2
} _POP_IO_STATUS;

typedef enum _POP_POWER_ACTION_WATCHDOG_STATE {
  PopPowerActionWatchdogStateDisabled = 0,      // ordinal: 0x0
  PopPowerActionWatchdogStateTransitioning = 1, // ordinal: 0x1
  PopPowerActionWatchdogStateResuming = 2,      // ordinal: 0x2
  PopPowerActionWatchdogStateMax = 3,           // ordinal: 0x3
} _POP_POWER_ACTION_WATCHDOG_STATE;

typedef enum SYSTEM_POWER_CONDITION {
  PoAc = 0,               // ordinal: 0x0
  PoDc = 1,               // ordinal: 0x1
  PoHot = 2,              // ordinal: 0x2
  PoConditionMaximum = 3, // ordinal: 0x3
} SYSTEM_POWER_CONDITION;

// 0x4 bytes (sizeof)
typedef struct FEATURE_STATE_CHANGE_SUBSCRIPTION__ {
  LONG unused; // offset: 0x0 ordinal: 0x0
} FEATURE_STATE_CHANGE_SUBSCRIPTION__;

typedef enum _REQUESTER_TYPE {
  KernelRequester = 0,            // ordinal: 0x0
  UserProcessRequester = 1,       // ordinal: 0x1
  UserSharedServiceRequester = 2, // ordinal: 0x2
} _REQUESTER_TYPE;

typedef enum _ETW_NOTIFICATION_TYPE {
  EtwNotificationTypeNoReply = 1,                // ordinal: 0x0
  EtwNotificationTypeLegacyEnable = 2,           // ordinal: 0x1
  EtwNotificationTypeEnable = 3,                 // ordinal: 0x2
  EtwNotificationTypePrivateLogger = 4,          // ordinal: 0x3
  EtwNotificationTypePerflib = 5,                // ordinal: 0x4
  EtwNotificationTypeAudio = 6,                  // ordinal: 0x5
  EtwNotificationTypeSession = 7,                // ordinal: 0x6
  EtwNotificationTypeReserved = 8,               // ordinal: 0x7
  EtwNotificationTypeCredentialUI = 9,           // ordinal: 0x8
  EtwNotificationTypeInProcSession = 10,         // ordinal: 0x9
  EtwNotificationTypeFilteredPrivateLogger = 11, // ordinal: 0xa
  EtwNotificationTypeMax = 12,                   // ordinal: 0xb
} _ETW_NOTIFICATION_TYPE;

typedef enum _EXQUEUEINDEX {
  ExPoolUntrusted = 0, // ordinal: 0x0
  IoPoolUntrusted = 1, // ordinal: 0x1
  ExPoolMax = 8,       // ordinal: 0x2
} _EXQUEUEINDEX;

typedef enum _PNP_DEVICE_ACTION_REQUEST {
  AssignResources = 0,                 // ordinal: 0x0
  ClearDeviceProblem = 1,              // ordinal: 0x1
  ClearProblem = 2,                    // ordinal: 0x2
  ClearEjectProblem = 3,               // ordinal: 0x3
  HaltDevice = 4,                      // ordinal: 0x4
  QueryPowerRelations = 5,             // ordinal: 0x5
  Rebalance = 6,                       // ordinal: 0x6
  ReenumerateBootDevices = 7,          // ordinal: 0x7
  ReenumerateDeviceOnly = 8,           // ordinal: 0x8
  ReenumerateDeviceTree = 9,           // ordinal: 0x9
  ReenumerateRootDevices = 10,         // ordinal: 0xa
  RequeryDeviceState = 11,             // ordinal: 0xb
  ResetDevice = 12,                    // ordinal: 0xc
  ResourceRequirementsChanged = 13,    // ordinal: 0xd
  RestartEnumeration = 14,             // ordinal: 0xe
  SetDeviceProblem = 15,               // ordinal: 0xf
  StartDevice = 16,                    // ordinal: 0x10
  StartSystemDevicesPass0 = 17,        // ordinal: 0x11
  StartSystemDevicesPass1 = 18,        // ordinal: 0x12
  NotifyTransportRelationsChange = 19, // ordinal: 0x13
  NotifyEjectionRelationsChange = 20,  // ordinal: 0x14
  ConfigureDevice = 21,                // ordinal: 0x15
  ConfigureDeviceClass = 22,           // ordinal: 0x16
  ConfigureDeviceExtensions = 23,      // ordinal: 0x17
  ConfigureDeviceReset = 24,           // ordinal: 0x18
  ClearDmaGuardProblem = 25,           // ordinal: 0x19
  PnpDeviceActionRequestMax = 26,      // ordinal: 0x1a
} _PNP_DEVICE_ACTION_REQUEST;

typedef enum POWER_POLICY_DEVICE_TYPE {
  PolicyDeviceSystemButton = 0,                    // ordinal: 0x0
  PolicyDeviceThermalZone = 1,                     // ordinal: 0x1
  PolicyDeviceBattery = 2,                         // ordinal: 0x2
  PolicyDeviceMemory = 3,                          // ordinal: 0x3
  PolicyInitiatePowerActionAPI = 4,                // ordinal: 0x4
  PolicySetPowerStateAPI = 5,                      // ordinal: 0x5
  PolicyImmediateDozeS4 = 6,                       // ordinal: 0x6
  PolicySystemIdle = 7,                            // ordinal: 0x7
  PolicyDeviceWakeAlarm = 8,                       // ordinal: 0x8
  PolicyDeviceFan = 9,                             // ordinal: 0x9
  PolicyCsBatterySaver = 10,                       // ordinal: 0xa
  PolicyImmediateDozeS4Predicted = 11,             // ordinal: 0xb
  PolicyImmediateDozeS4PredictedNoWake = 12,       // ordinal: 0xc
  PolicyImmediateDozeS4AdaptiveBudget = 13,        // ordinal: 0xd
  PolicyImmediateDozeS4AdaptiveReserveNoWake = 14, // ordinal: 0xe
  PolicySystemInitiatedShutdown = 15,              // ordinal: 0xf
  PolicyDeviceMax = 16,                            // ordinal: 0x10
} POWER_POLICY_DEVICE_TYPE;

typedef enum _ARBITER_RESULT {
  ArbiterResultUndefined = -1,       // ordinal: 0x0
  ArbiterResultSuccess = 0,          // ordinal: 0x1
  ArbiterResultExternalConflict = 1, // ordinal: 0x2
  ArbiterResultNullRequest = 2,      // ordinal: 0x3
} _ARBITER_RESULT;

typedef enum _ARBITER_ACTION {
  ArbiterActionTestAllocation = 0,          // ordinal: 0x0
  ArbiterActionRetestAllocation = 1,        // ordinal: 0x1
  ArbiterActionCommitAllocation = 2,        // ordinal: 0x2
  ArbiterActionRollbackAllocation = 3,      // ordinal: 0x3
  ArbiterActionQueryAllocatedResources = 4, // ordinal: 0x4
  ArbiterActionWriteReservedResources = 5,  // ordinal: 0x5
  ArbiterActionQueryConflict = 6,           // ordinal: 0x6
  ArbiterActionQueryArbitrate = 7,          // ordinal: 0x7
  ArbiterActionAddReserved = 8,             // ordinal: 0x8
  ArbiterActionBootAllocation = 9,          // ordinal: 0x9
} _ARBITER_ACTION;

typedef enum _MI_PFN_CACHE_ATTRIBUTE {
  MiNonCached = 0,     // ordinal: 0x0
  MiCached = 1,        // ordinal: 0x1
  MiWriteCombined = 2, // ordinal: 0x2
  MiNotMapped = 3,     // ordinal: 0x3
} _MI_PFN_CACHE_ATTRIBUTE;

typedef enum _FAULT_INFORMATION_ARM64_TYPE {
  UnsupportedUpstreamTransaction = 0, // ordinal: 0x0
  AddressSizeFault = 1,               // ordinal: 0x1
  TlbMatchConflict = 2,               // ordinal: 0x2
  ExternalFault = 3,                  // ordinal: 0x3
  PermissionFault = 4,                // ordinal: 0x4
  AccessFlagFault = 5,                // ordinal: 0x5
  TranslationFault = 6,               // ordinal: 0x6
  MaxFaultType = 7,                   // ordinal: 0x7
} _FAULT_INFORMATION_ARM64_TYPE;

typedef enum _FAULT_INFORMATION_ARCH {
  FaultInformationInvalid = 0, // ordinal: 0x0
  FaultInformationArm64 = 1,   // ordinal: 0x1
} _FAULT_INFORMATION_ARCH;

typedef enum _BOOT_ENTROPY_SOURCE_RESULT_CODE {
  BootEntropySourceStructureUninitialized = 0, // ordinal: 0x0
  BootEntropySourceDisabledByPolicy = 1,       // ordinal: 0x1
  BootEntropySourceNotPresent = 2,             // ordinal: 0x2
  BootEntropySourceError = 3,                  // ordinal: 0x3
  BootEntropySourceSuccess = 4,                // ordinal: 0x4
} _BOOT_ENTROPY_SOURCE_RESULT_CODE;

typedef enum _BOOT_ENTROPY_SOURCE_ID {
  BootEntropySourceNone = 0,       // ordinal: 0x0
  BootEntropySourceSeedfile = 1,   // ordinal: 0x1
  BootEntropySourceExternal = 2,   // ordinal: 0x2
  BootEntropySourceTpm = 3,        // ordinal: 0x3
  BootEntropySourceRdrand = 4,     // ordinal: 0x4
  BootEntropySourceTime = 5,       // ordinal: 0x5
  BootEntropySourceAcpiOem0 = 6,   // ordinal: 0x6
  BootEntropySourceUefi = 7,       // ordinal: 0x7
  BootEntropySourceCng = 8,        // ordinal: 0x8
  BootEntropySourceTcbTpm = 9,     // ordinal: 0x9
  BootEntropySourceTcbRdrand = 10, // ordinal: 0xa
  BootMaxEntropySources = 10,      // ordinal: 0xb
} _BOOT_ENTROPY_SOURCE_ID;

typedef enum _DOMAIN_CONFIGURATION_ARCH {
  DomainConfigurationArm64 = 0,   // ordinal: 0x0
  DomainConfigurationInvalid = 1, // ordinal: 0x1
} _DOMAIN_CONFIGURATION_ARCH;

typedef enum _WHEA_RECOVERY_CONTEXT_ERROR_TYPE {
  WheaRecoveryContextErrorTypeMemory = 1, // ordinal: 0x0
  WheaRecoveryContextErrorTypePmem = 2,   // ordinal: 0x1
  WheaRecoveryContextErrorTypeMax = 3,    // ordinal: 0x2
} _WHEA_RECOVERY_CONTEXT_ERROR_TYPE;

typedef enum _CONFIGURATION_TYPE {
  ArcSystem = 0,                // ordinal: 0x0
  CentralProcessor = 1,         // ordinal: 0x1
  FloatingPointProcessor = 2,   // ordinal: 0x2
  PrimaryIcache = 3,            // ordinal: 0x3
  PrimaryDcache = 4,            // ordinal: 0x4
  SecondaryIcache = 5,          // ordinal: 0x5
  SecondaryDcache = 6,          // ordinal: 0x6
  SecondaryCache = 7,           // ordinal: 0x7
  EisaAdapter = 8,              // ordinal: 0x8
  TcAdapter = 9,                // ordinal: 0x9
  ScsiAdapter = 10,             // ordinal: 0xa
  DtiAdapter = 11,              // ordinal: 0xb
  MultiFunctionAdapter = 12,    // ordinal: 0xc
  DiskController = 13,          // ordinal: 0xd
  TapeController = 14,          // ordinal: 0xe
  CdromController = 15,         // ordinal: 0xf
  WormController = 16,          // ordinal: 0x10
  SerialController = 17,        // ordinal: 0x11
  NetworkController = 18,       // ordinal: 0x12
  DisplayController = 19,       // ordinal: 0x13
  ParallelController = 20,      // ordinal: 0x14
  PointerController = 21,       // ordinal: 0x15
  KeyboardController = 22,      // ordinal: 0x16
  AudioController = 23,         // ordinal: 0x17
  OtherController = 24,         // ordinal: 0x18
  DiskPeripheral = 25,          // ordinal: 0x19
  FloppyDiskPeripheral = 26,    // ordinal: 0x1a
  TapePeripheral = 27,          // ordinal: 0x1b
  ModemPeripheral = 28,         // ordinal: 0x1c
  MonitorPeripheral = 29,       // ordinal: 0x1d
  PrinterPeripheral = 30,       // ordinal: 0x1e
  PointerPeripheral = 31,       // ordinal: 0x1f
  KeyboardPeripheral = 32,      // ordinal: 0x20
  TerminalPeripheral = 33,      // ordinal: 0x21
  OtherPeripheral = 34,         // ordinal: 0x22
  LinePeripheral = 35,          // ordinal: 0x23
  NetworkPeripheral = 36,       // ordinal: 0x24
  SystemMemory = 37,            // ordinal: 0x25
  DockingInformation = 38,      // ordinal: 0x26
  RealModeIrqRoutingTable = 39, // ordinal: 0x27
  RealModePCIEnumeration = 40,  // ordinal: 0x28
  MaximumType = 41,             // ordinal: 0x29
} _CONFIGURATION_TYPE;

typedef enum _CONFIGURATION_CLASS {
  SystemClass = 0,     // ordinal: 0x0
  ProcessorClass = 1,  // ordinal: 0x1
  CacheClass = 2,      // ordinal: 0x2
  AdapterClass = 3,    // ordinal: 0x3
  ControllerClass = 4, // ordinal: 0x4
  PeripheralClass = 5, // ordinal: 0x5
  MemoryClass = 6,     // ordinal: 0x6
  MaximumClass = 7,    // ordinal: 0x7
} _CONFIGURATION_CLASS;

typedef enum _EXT_IOMMU_DEVICE_TYPE {
  EXT_IOMMU_DEVICE_TYPE_INVALID = 0, // ordinal: 0x0
  EXT_IOMMU_DEVICE_TYPE_PCI = 1,     // ordinal: 0x1
  EXT_IOMMU_DEVICE_TYPE_ACPI = 2,    // ordinal: 0x2
  EXT_IOMMU_DEVICE_TYPE_IOAPIC = 3,  // ordinal: 0x3
  EXT_IOMMU_DEVICE_TYPE_LOGICAL = 4, // ordinal: 0x4
  EXT_IOMMU_DEVICE_TYPE_GIC = 5,     // ordinal: 0x5
  EXT_IOMMU_DEVICE_TYPE_TEST = 6,    // ordinal: 0x6
  EXT_IOMMU_DEVICE_TYPE_MAX = 7,     // ordinal: 0x7
} _EXT_IOMMU_DEVICE_TYPE;

typedef enum KD_CALLBACK_ACTION {
  KdConfigureDeviceAndContinue = 0, // ordinal: 0x0
  KdSkipDeviceAndContinue = 1,      // ordinal: 0x1
  KdConfigureDeviceAndStop = 2,     // ordinal: 0x2
  KdSkipDeviceAndStop = 3,          // ordinal: 0x3
} KD_CALLBACK_ACTION;

typedef enum _PCI_BUSMASTER_RID_TYPE {
  BusmasterRidFromDeviceRid = 0,       // ordinal: 0x0
  BusmasterRidFromBridgeRid = 1,       // ordinal: 0x1
  BusmasterRidFromMultipleBridges = 2, // ordinal: 0x2
} _PCI_BUSMASTER_RID_TYPE;

typedef enum KD_NAMESPACE_ENUM {
  KdNameSpacePCI = 0,  // ordinal: 0x0
  KdNameSpaceACPI = 1, // ordinal: 0x1
  KdNameSpaceAny = 2,  // ordinal: 0x2
  KdNameSpaceNone = 3, // ordinal: 0x3
  KdNameSpaceMax = 4,  // ordinal: 0x4
} KD_NAMESPACE_ENUM;

typedef enum _HAL_PROCESSOR_STAT_TYPE {
  HalProcessorStatResidency = 0, // ordinal: 0x0
  HalProcessorStatCount = 1,     // ordinal: 0x1
  HalProcessorStatMax = 2,       // ordinal: 0x2
} _HAL_PROCESSOR_STAT_TYPE;

typedef enum _HAL_CLOCK_TIMER_MODE {
  HalClockTimerModePeriodic = 0, // ordinal: 0x0
  HalClockTimerModeOneShot = 1,  // ordinal: 0x1
  HalClockTimerModeMax = 2,      // ordinal: 0x2
} _HAL_CLOCK_TIMER_MODE;

typedef enum _BUS_DATA_TYPE {
  ConfigurationSpaceUndefined = -1, // ordinal: 0x0
  Cmos = 0,                         // ordinal: 0x1
  EisaConfiguration = 1,            // ordinal: 0x2
  Pos = 2,                          // ordinal: 0x3
  CbusConfiguration = 3,            // ordinal: 0x4
  PCIConfiguration = 4,             // ordinal: 0x5
  VMEConfiguration = 5,             // ordinal: 0x6
  NuBusConfiguration = 6,           // ordinal: 0x7
  PCMCIAConfiguration = 7,          // ordinal: 0x8
  MPIConfiguration = 8,             // ordinal: 0x9
  MPSAConfiguration = 9,            // ordinal: 0xa
  PNPISAConfiguration = 10,         // ordinal: 0xb
  SgiInternalConfiguration = 11,    // ordinal: 0xc
  MaximumBusDataType = 12,          // ordinal: 0xd
} _BUS_DATA_TYPE;

typedef enum _TYPE_OF_MEMORY {
  LoaderExceptionBlock = 0,       // ordinal: 0x0
  LoaderSystemBlock = 1,          // ordinal: 0x1
  LoaderFree = 2,                 // ordinal: 0x2
  LoaderBad = 3,                  // ordinal: 0x3
  LoaderLoadedProgram = 4,        // ordinal: 0x4
  LoaderFirmwareTemporary = 5,    // ordinal: 0x5
  LoaderFirmwarePermanent = 6,    // ordinal: 0x6
  LoaderOsloaderHeap = 7,         // ordinal: 0x7
  LoaderOsloaderStack = 8,        // ordinal: 0x8
  LoaderSystemCode = 9,           // ordinal: 0x9
  LoaderHalCode = 10,             // ordinal: 0xa
  LoaderBootDriver = 11,          // ordinal: 0xb
  LoaderConsoleInDriver = 12,     // ordinal: 0xc
  LoaderConsoleOutDriver = 13,    // ordinal: 0xd
  LoaderStartupDpcStack = 14,     // ordinal: 0xe
  LoaderStartupKernelStack = 15,  // ordinal: 0xf
  LoaderStartupPanicStack = 16,   // ordinal: 0x10
  LoaderStartupPcrPage = 17,      // ordinal: 0x11
  LoaderStartupPdrPage = 18,      // ordinal: 0x12
  LoaderRegistryData = 19,        // ordinal: 0x13
  LoaderMemoryData = 20,          // ordinal: 0x14
  LoaderNlsData = 21,             // ordinal: 0x15
  LoaderSpecialMemory = 22,       // ordinal: 0x16
  LoaderBBTMemory = 23,           // ordinal: 0x17
  LoaderZero = 24,                // ordinal: 0x18
  LoaderXIPRom = 25,              // ordinal: 0x19
  LoaderHALCachedMemory = 26,     // ordinal: 0x1a
  LoaderLargePageFiller = 27,     // ordinal: 0x1b
  LoaderErrorLogMemory = 28,      // ordinal: 0x1c
  LoaderVsmMemory = 29,           // ordinal: 0x1d
  LoaderFirmwareCode = 30,        // ordinal: 0x1e
  LoaderFirmwareData = 31,        // ordinal: 0x1f
  LoaderFirmwareReserved = 32,    // ordinal: 0x20
  LoaderEnclaveMemory = 33,       // ordinal: 0x21
  LoaderFirmwareKsr = 34,         // ordinal: 0x22
  LoaderEnclaveKsr = 35,          // ordinal: 0x23
  LoaderSkMemory = 36,            // ordinal: 0x24
  LoaderSkFirmwareReserved = 37,  // ordinal: 0x25
  LoaderIoSpaceMemoryZeroed = 38, // ordinal: 0x26
  LoaderIoSpaceMemoryFree = 39,   // ordinal: 0x27
  LoaderIoSpaceMemoryKsr = 40,    // ordinal: 0x28
  LoaderMaximum = 41,             // ordinal: 0x29
} _TYPE_OF_MEMORY;

typedef enum _VI_DEADLOCK_RESOURCE_TYPE {
  VfDeadlockUnknown = 0,               // ordinal: 0x0
  VfDeadlockMutex = 1,                 // ordinal: 0x1
  VfDeadlockMutexAbandoned = 2,        // ordinal: 0x2
  VfDeadlockFastMutex = 3,             // ordinal: 0x3
  VfDeadlockFastMutexUnsafe = 4,       // ordinal: 0x4
  VfDeadlockSpinLock = 5,              // ordinal: 0x5
  VfDeadlockInStackQueuedSpinLock = 6, // ordinal: 0x6
  VfDeadlockUnusedSpinLock = 7,        // ordinal: 0x7
  VfDeadlockEresource = 8,             // ordinal: 0x8
  VfDeadlockTypeMaximum = 9,           // ordinal: 0x9
} _VI_DEADLOCK_RESOURCE_TYPE;

typedef enum _WNF_SUBSCRIPTION_STATE {
  WNF_SUB_STATE_QUIESCENT = 0,        // ordinal: 0x0
  WNF_SUB_STATE_READY_TO_DELIVER = 1, // ordinal: 0x1
  WNF_SUB_STATE_IN_DELIVERY = 2,      // ordinal: 0x2
  WNF_SUB_STATE_RETRY = 3,            // ordinal: 0x3
} _WNF_SUBSCRIPTION_STATE;

typedef enum _WHEA_ERROR_SOURCE_STATE {
  WheaErrSrcStateStopped = 1,       // ordinal: 0x0
  WheaErrSrcStateStarted = 2,       // ordinal: 0x1
  WheaErrSrcStateRemoved = 3,       // ordinal: 0x2
  WheaErrSrcStateRemovePending = 4, // ordinal: 0x3
} _WHEA_ERROR_SOURCE_STATE;

typedef enum _SEP_CACHED_HANDLES_ENTRY_TYPE {
  SepCachedHandlesEntryLowbox = 0,       // ordinal: 0x0
  SepCachedHandlesEntryBnoIsolation = 1, // ordinal: 0x1
} _SEP_CACHED_HANDLES_ENTRY_TYPE;

typedef enum _CREATE_FILE_TYPE {
  CreateFileTypeNone = 0,      // ordinal: 0x0
  CreateFileTypeNamedPipe = 1, // ordinal: 0x1
  CreateFileTypeMailslot = 2,  // ordinal: 0x2
} _CREATE_FILE_TYPE;

typedef enum _IOP_PRIORITY_HINT {
  IopIoPriorityNotSet = 0,   // ordinal: 0x0
  IopIoPriorityVeryLow = 1,  // ordinal: 0x1
  IopIoPriorityLow = 2,      // ordinal: 0x2
  IopIoPriorityNormal = 3,   // ordinal: 0x3
  IopIoPriorityHigh = 4,     // ordinal: 0x4
  IopIoPriorityCritical = 5, // ordinal: 0x5
  MaxIopIoPriorityTypes = 6, // ordinal: 0x6
} _IOP_PRIORITY_HINT;

typedef enum _SECURITY_OPERATION_CODE {
  SetSecurityDescriptor = 0,    // ordinal: 0x0
  QuerySecurityDescriptor = 1,  // ordinal: 0x1
  DeleteSecurityDescriptor = 2, // ordinal: 0x2
  AssignSecurityDescriptor = 3, // ordinal: 0x3
} _SECURITY_OPERATION_CODE;

typedef enum _OB_OPEN_REASON {
  ObCreateHandle = 0,    // ordinal: 0x0
  ObOpenHandle = 1,      // ordinal: 0x1
  ObDuplicateHandle = 2, // ordinal: 0x2
  ObInheritHandle = 3,   // ordinal: 0x3
  ObMaxOpenReason = 4,   // ordinal: 0x4
} _OB_OPEN_REASON;

typedef enum _BLOB_ID {
  BLOB_TYPE_UNKNOWN = 0,          // ordinal: 0x0
  BLOB_TYPE_CONNECTION_INFO = 1,  // ordinal: 0x1
  BLOB_TYPE_MESSAGE = 2,          // ordinal: 0x2
  BLOB_TYPE_SECURITY_CONTEXT = 3, // ordinal: 0x3
  BLOB_TYPE_SECTION = 4,          // ordinal: 0x4
  BLOB_TYPE_REGION = 5,           // ordinal: 0x5
  BLOB_TYPE_VIEW = 6,             // ordinal: 0x6
  BLOB_TYPE_RESERVE = 7,          // ordinal: 0x7
  BLOB_TYPE_DIRECT_TRANSFER = 8,  // ordinal: 0x8
  BLOB_TYPE_HANDLE_DATA = 9,      // ordinal: 0x9
  BLOB_TYPE_MAX_ID = 10,          // ordinal: 0xa
} _BLOB_ID;

typedef enum _RTLP_HP_LOCK_TYPE {
  HeapLockPaged = 0,    // ordinal: 0x0
  HeapLockNonPaged = 1, // ordinal: 0x1
  HeapLockTypeMax = 2,  // ordinal: 0x2
} _RTLP_HP_LOCK_TYPE;

typedef enum _HEAP_FAILURE_TYPE {
  heap_failure_internal = 0,                       // ordinal: 0x0
  heap_failure_unknown = 1,                        // ordinal: 0x1
  heap_failure_generic = 2,                        // ordinal: 0x2
  heap_failure_entry_corruption = 3,               // ordinal: 0x3
  heap_failure_multiple_entries_corruption = 4,    // ordinal: 0x4
  heap_failure_virtual_block_corruption = 5,       // ordinal: 0x5
  heap_failure_buffer_overrun = 6,                 // ordinal: 0x6
  heap_failure_buffer_underrun = 7,                // ordinal: 0x7
  heap_failure_block_not_busy = 8,                 // ordinal: 0x8
  heap_failure_invalid_argument = 9,               // ordinal: 0x9
  heap_failure_invalid_allocation_type = 10,       // ordinal: 0xa
  heap_failure_usage_after_free = 11,              // ordinal: 0xb
  heap_failure_cross_heap_operation = 12,          // ordinal: 0xc
  heap_failure_freelists_corruption = 13,          // ordinal: 0xd
  heap_failure_listentry_corruption = 14,          // ordinal: 0xe
  heap_failure_lfh_bitmap_mismatch = 15,           // ordinal: 0xf
  heap_failure_segment_lfh_bitmap_corruption = 16, // ordinal: 0x10
  heap_failure_segment_lfh_double_free = 17,       // ordinal: 0x11
  heap_failure_vs_subsegment_corruption = 18,      // ordinal: 0x12
  heap_failure_null_heap = 19,                     // ordinal: 0x13
  heap_failure_allocation_limit = 20,              // ordinal: 0x14
  heap_failure_commit_limit = 21,                  // ordinal: 0x15
  heap_failure_invalid_va_mgr_query = 22,          // ordinal: 0x16
} _HEAP_FAILURE_TYPE;

typedef enum _RTLP_HP_ADDRESS_SPACE_TYPE {
  HeapAddressUser = 0,    // ordinal: 0x0
  HeapAddressKernel = 1,  // ordinal: 0x1
  HeapAddressSession = 2, // ordinal: 0x2
  HeapAddressTypeMax = 3, // ordinal: 0x3
} _RTLP_HP_ADDRESS_SPACE_TYPE;

typedef enum _KHETERO_CPU_POLICY {
  KHeteroCpuPolicyAll = 0,         // ordinal: 0x0
  KHeteroCpuPolicyLarge = 1,       // ordinal: 0x1
  KHeteroCpuPolicyLargeOrIdle = 2, // ordinal: 0x2
  KHeteroCpuPolicySmall = 3,       // ordinal: 0x3
  KHeteroCpuPolicySmallOrIdle = 4, // ordinal: 0x4
  KHeteroCpuPolicyDynamic = 5,     // ordinal: 0x5
  KHeteroCpuPolicyStaticMax = 5,   // ordinal: 0x6
  KHeteroCpuPolicyBiasedSmall = 6, // ordinal: 0x7
  KHeteroCpuPolicyBiasedLarge = 7, // ordinal: 0x8
  KHeteroCpuPolicyDefault = 8,     // ordinal: 0x9
  KHeteroCpuPolicyMax = 9,         // ordinal: 0xa
} _KHETERO_CPU_POLICY;

typedef enum _GPIO_PIN_IORESTRICTION_TYPE {
  IoRestrictionNone = 0,            // ordinal: 0x0
  IoRestrictionInputOnly = 1,       // ordinal: 0x1
  IoRestrictionOutputOnly = 2,      // ordinal: 0x2
  IoRestrictionNoneAndPreserve = 3, // ordinal: 0x3
} _GPIO_PIN_IORESTRICTION_TYPE;

typedef enum _GPIO_PIN_CONFIG_TYPE {
  PullDefault = 0, // ordinal: 0x0
  PullUp = 1,      // ordinal: 0x1
  PullDown = 2,    // ordinal: 0x2
  PullNone = 3,    // ordinal: 0x3
} _GPIO_PIN_CONFIG_TYPE;

typedef enum _PEP_ACPI_RESOURCE_TYPE {
  PepAcpiMemory = 0,         // ordinal: 0x0
  PepAcpiIoPort = 1,         // ordinal: 0x1
  PepAcpiInterrupt = 2,      // ordinal: 0x2
  PepAcpiGpioIo = 3,         // ordinal: 0x3
  PepAcpiGpioInt = 4,        // ordinal: 0x4
  PepAcpiSpbI2c = 5,         // ordinal: 0x5
  PepAcpiSpbSpi = 6,         // ordinal: 0x6
  PepAcpiSpbUart = 7,        // ordinal: 0x7
  PepAcpiExtendedMemory = 8, // ordinal: 0x8
  PepAcpiExtendedIo = 9,     // ordinal: 0x9
} _PEP_ACPI_RESOURCE_TYPE;

typedef enum _ARBITER_REQUEST_SOURCE {
  ArbiterRequestUndefined = -1,     // ordinal: 0x0
  ArbiterRequestLegacyReported = 0, // ordinal: 0x1
  ArbiterRequestHalReported = 1,    // ordinal: 0x2
  ArbiterRequestLegacyAssigned = 2, // ordinal: 0x3
  ArbiterRequestPnpDetected = 3,    // ordinal: 0x4
  ArbiterRequestPnpEnumerated = 4,  // ordinal: 0x5
} _ARBITER_REQUEST_SOURCE;

typedef enum _PCW_CALLBACK_TYPE {
  PcwCallbackAddCounter = 0,         // ordinal: 0x0
  PcwCallbackRemoveCounter = 1,      // ordinal: 0x1
  PcwCallbackEnumerateInstances = 2, // ordinal: 0x2
  PcwCallbackCollectData = 3,        // ordinal: 0x3
} _PCW_CALLBACK_TYPE;

typedef enum _CM_LOAD_FAILURE_TYPE {
  _None = 0,                               // ordinal: 0x0
  _CmCreateHive = 1,                       // ordinal: 0x1
  _HvpBuildMap = 3,                        // ordinal: 0x2
  _HvpBuildMapForLoaderHive = 4,           // ordinal: 0x3
  _HvpInitMap = 5,                         // ordinal: 0x4
  _HvLoadHive = 6,                         // ordinal: 0x5
  _HvpMapHiveImage = 7,                    // ordinal: 0x6
  _HvpRecoverData = 8,                     // ordinal: 0x7
  _CmpValidateHiveSecurityDescriptors = 9, // ordinal: 0x8
  _HvpEnlistBinInMap = 10,                 // ordinal: 0x9
  _CmCheckRegistry = 11,                   // ordinal: 0xa
  _CmRegistryIO = 12,                      // ordinal: 0xb
  _CmCheckRegistry2 = 13,                  // ordinal: 0xc
  _CmpCheckKey = 14,                       // ordinal: 0xd
  _CmpCheckValueList = 15,                 // ordinal: 0xe
  _HvCheckHive = 16,                       // ordinal: 0xf
  _HvCheckBin = 17,                        // ordinal: 0x10
  _HvpGetLogEntryDirtyVector = 18,         // ordinal: 0x11
  _HvpReadLogEntryHeader = 19,             // ordinal: 0x12
  _HvpReadLogEntry = 20,                   // ordinal: 0x13
  _CmpMountPreloadedHives = 21,            // ordinal: 0x14
  _CmpLoadHiveThread = 22,                 // ordinal: 0x15
  _CmpCheckLeaf = 23,                      // ordinal: 0x16
  _HvHiveStartFileBacked = 24,             // ordinal: 0x17
  _HvStartHiveMemoryBacked = 25,           // ordinal: 0x18
  _HvpEnlistFreeCells = 26,                // ordinal: 0x19
  _HvpPerformLogFileRecovery = 27,         // ordinal: 0x1a
} _CM_LOAD_FAILURE_TYPE;

typedef enum _RTL_GENERIC_COMPARE_RESULTS {
  GenericLessThan = 0,    // ordinal: 0x0
  GenericGreaterThan = 1, // ordinal: 0x1
  GenericEqual = 2,       // ordinal: 0x2
} _RTL_GENERIC_COMPARE_RESULTS;

typedef enum _CM_DIRTY_VECTOR_OPERATION {
  DirtyVectorModified = 0,   // ordinal: 0x0
  DirtyDataCaptureStart = 1, // ordinal: 0x1
  DirtyDataCaptureEnd = 2,   // ordinal: 0x2
} _CM_DIRTY_VECTOR_OPERATION;

typedef enum __anon_1707 {
  KTMOH_CommitTransaction_Result = 1,   // ordinal: 0x0
  KTMOH_RollbackTransaction_Result = 2, // ordinal: 0x1
} __anon_1707;

typedef enum KTM_STATE {
  KKtmUninitialized = 0,  // ordinal: 0x0
  KKtmInitialized = 1,    // ordinal: 0x1
  KKtmRecovering = 2,     // ordinal: 0x2
  KKtmOnline = 3,         // ordinal: 0x3
  KKtmRecoveryFailed = 4, // ordinal: 0x4
  KKtmOffline = 5,        // ordinal: 0x5
} KTM_STATE;

typedef enum _KTRANSACTION_OUTCOME {
  KTxOutcomeUninitialized = 0, // ordinal: 0x0
  KTxOutcomeUndetermined = 1,  // ordinal: 0x1
  KTxOutcomeCommitted = 2,     // ordinal: 0x2
  KTxOutcomeAborted = 3,       // ordinal: 0x3
  KTxOutcomeUnavailable = 4,   // ordinal: 0x4
} _KTRANSACTION_OUTCOME;

typedef enum _KTRANSACTION_STATE {
  KTransactionUninitialized = 0, // ordinal: 0x0
  KTransactionActive = 1,        // ordinal: 0x1
  KTransactionPreparing = 2,     // ordinal: 0x2
  KTransactionPrepared = 3,      // ordinal: 0x3
  KTransactionInDoubt = 4,       // ordinal: 0x4
  KTransactionCommitted = 5,     // ordinal: 0x5
  KTransactionAborted = 6,       // ordinal: 0x6
  KTransactionDelegated = 7,     // ordinal: 0x7
  KTransactionPrePreparing = 8,  // ordinal: 0x8
  KTransactionForgotten = 9,     // ordinal: 0x9
  KTransactionRecovering = 10,   // ordinal: 0xa
  KTransactionPrePrepared = 11,  // ordinal: 0xb
} _KTRANSACTION_STATE;

typedef enum _KRESOURCEMANAGER_STATE {
  KResourceManagerUninitialized = 0, // ordinal: 0x0
  KResourceManagerOffline = 1,       // ordinal: 0x1
  KResourceManagerOnline = 2,        // ordinal: 0x2
} _KRESOURCEMANAGER_STATE;

typedef enum HSTORAGE_TYPE {
  Stable = 0,         // ordinal: 0x0
  Volatile = 1,       // ordinal: 0x1
  InvalidStorage = 2, // ordinal: 0x2
} HSTORAGE_TYPE;

typedef enum UoWActionType {
  UoWAddThisKey = 0,            // ordinal: 0x0
  UoWAddChildKey = 1,           // ordinal: 0x1
  UoWDeleteThisKey = 2,         // ordinal: 0x2
  UoWDeleteChildKey = 3,        // ordinal: 0x3
  UoWSetValueNew = 4,           // ordinal: 0x4
  UoWSetValueExisting = 5,      // ordinal: 0x5
  UoWDeleteValue = 6,           // ordinal: 0x6
  UoWSetKeyUserFlags = 7,       // ordinal: 0x7
  UoWSetLastWriteTime = 8,      // ordinal: 0x8
  UoWSetSecurityDescriptor = 9, // ordinal: 0x9
  UoWRenameSubKey = 10,         // ordinal: 0xa
  UoWRenameOldSubKey = 11,      // ordinal: 0xb
  UoWRenameNewSubKey = 12,      // ordinal: 0xc
  UoWIsolation = 13,            // ordinal: 0xd
  UoWInvalid = 14,              // ordinal: 0xe
} UoWActionType;

typedef enum _KENLISTMENT_STATE {
  KEnlistmentUninitialized = 0,           // ordinal: 0x0
  KEnlistmentActive = 256,                // ordinal: 0x1
  KEnlistmentPreparing = 257,             // ordinal: 0x2
  KEnlistmentPrepared = 258,              // ordinal: 0x3
  KEnlistmentInDoubt = 259,               // ordinal: 0x4
  KEnlistmentCommitted = 260,             // ordinal: 0x5
  KEnlistmentCommittedNotify = 261,       // ordinal: 0x6
  KEnlistmentCommitRequested = 262,       // ordinal: 0x7
  KEnlistmentAborted = 263,               // ordinal: 0x8
  KEnlistmentDelegated = 264,             // ordinal: 0x9
  KEnlistmentDelegatedDisconnected = 265, // ordinal: 0xa
  KEnlistmentPrePreparing = 266,          // ordinal: 0xb
  KEnlistmentForgotten = 267,             // ordinal: 0xc
  KEnlistmentRecovering = 268,            // ordinal: 0xd
  KEnlistmentAborting = 269,              // ordinal: 0xe
  KEnlistmentReadOnly = 270,              // ordinal: 0xf
  KEnlistmentOutcomeUnavailable = 271,    // ordinal: 0x10
  KEnlistmentOffline = 272,               // ordinal: 0x11
  KEnlistmentPrePrepared = 273,           // ordinal: 0x12
  KEnlistmentInitialized = 274,           // ordinal: 0x13
} _KENLISTMENT_STATE;

typedef enum _MI_SLAB_ALLOCATOR_PROTECTION {
  MiSlabAllocatorProtectionReadExecute = 0, // ordinal: 0x0
  MiSlabAllocatorProtectionReadOnly = 1,    // ordinal: 0x1
  MiSlabAllocatorProtectionNoAccess = 2,    // ordinal: 0x2
  MiSlabAllocatorProtectionReadWrite = 3,   // ordinal: 0x3
  MiSlabAllocatorProtectionMax = 4,         // ordinal: 0x4
} _MI_SLAB_ALLOCATOR_PROTECTION;

typedef enum _MI_SLAB_ALLOCATOR_TYPE {
  MiSlabAllocatorTypeSlatProtected = 0, // ordinal: 0x0
  MiSlabAllocatorTypeUnprotected = 1,   // ordinal: 0x1
  MiSlabAllocatorTypeMax = 2,           // ordinal: 0x2
} _MI_SLAB_ALLOCATOR_TYPE;

typedef enum _MMLISTS {
  ZeroedPageList = 0,          // ordinal: 0x0
  FreePageList = 1,            // ordinal: 0x1
  StandbyPageList = 2,         // ordinal: 0x2
  ModifiedPageList = 3,        // ordinal: 0x3
  ModifiedNoWritePageList = 4, // ordinal: 0x4
  BadPageList = 5,             // ordinal: 0x5
  ActiveAndValid = 6,          // ordinal: 0x6
  TransitionPage = 7,          // ordinal: 0x7
} _MMLISTS;

typedef enum wil_details_FeatureTestStateKind {
  wil_details_FeatureTestStateKind_EnabledState = 0, // ordinal: 0x0
  wil_details_FeatureTestStateKind_Variant = 1,      // ordinal: 0x1
} wil_details_FeatureTestStateKind;

typedef enum wil_FeatureVariantPayloadKind {
  wil_FeatureVariantPayloadKind_None = 0,     // ordinal: 0x0
  wil_FeatureVariantPayloadKind_Resident = 1, // ordinal: 0x1
  wil_FeatureVariantPayloadKind_External = 2, // ordinal: 0x2
} wil_FeatureVariantPayloadKind;

typedef enum wil_FeatureEnabledState {
  wil_FeatureEnabledState_Default = 0,  // ordinal: 0x0
  wil_FeatureEnabledState_Disabled = 1, // ordinal: 0x1
  wil_FeatureEnabledState_Enabled = 2,  // ordinal: 0x2
} wil_FeatureEnabledState;

// 0x18 bytes (sizeof)
typedef struct wil_details_RecordUsageResult {
  LONG queueBackground; // offset: 0x0 ordinal: 0x0
  ULONG countImmediate; // offset: 0x4 ordinal: 0x1
  enum wil_details_ServiceReportingKind
      kindImmediate;           // offset: 0x8 ordinal: 0x2
  ULONG payloadId;             // offset: 0xc ordinal: 0x3
  LONG ignoredUse;             // offset: 0x10 ordinal: 0x4
  LONG isVariantConfiguration; // offset: 0x14 ordinal: 0x5
} wil_details_RecordUsageResult;

// 0x20 bytes (sizeof)
typedef struct _iobuf {
  CHAR *_ptr;      // offset: 0x0 ordinal: 0x0
  LONG _cnt;       // offset: 0x4 ordinal: 0x1
  CHAR *_base;     // offset: 0x8 ordinal: 0x2
  LONG _flag;      // offset: 0xc ordinal: 0x3
  LONG _file;      // offset: 0x10 ordinal: 0x4
  LONG _charbuf;   // offset: 0x14 ordinal: 0x5
  LONG _bufsiz;    // offset: 0x18 ordinal: 0x6
  CHAR *_tmpfname; // offset: 0x1c ordinal: 0x7
} _iobuf;

typedef enum _WHEA_ERROR_PACKET_DATA_FORMAT {
  WheaDataFormatIPFSalRecord = 0, // ordinal: 0x0
  WheaDataFormatXPFMCA = 1,       // ordinal: 0x1
  WheaDataFormatMemory = 2,       // ordinal: 0x2
  WheaDataFormatPCIExpress = 3,   // ordinal: 0x3
  WheaDataFormatNMIPort = 4,      // ordinal: 0x4
  WheaDataFormatPCIXBus = 5,      // ordinal: 0x5
  WheaDataFormatPCIXDevice = 6,   // ordinal: 0x6
  WheaDataFormatGeneric = 7,      // ordinal: 0x7
  WheaDataFormatMax = 8,          // ordinal: 0x8
} _WHEA_ERROR_PACKET_DATA_FORMAT;

typedef enum _WHEA_ERROR_SOURCE_TYPE {
  WheaErrSrcTypeMCE = 0,           // ordinal: 0x0
  WheaErrSrcTypeCMC = 1,           // ordinal: 0x1
  WheaErrSrcTypeCPE = 2,           // ordinal: 0x2
  WheaErrSrcTypeNMI = 3,           // ordinal: 0x3
  WheaErrSrcTypePCIe = 4,          // ordinal: 0x4
  WheaErrSrcTypeGeneric = 5,       // ordinal: 0x5
  WheaErrSrcTypeINIT = 6,          // ordinal: 0x6
  WheaErrSrcTypeBOOT = 7,          // ordinal: 0x7
  WheaErrSrcTypeSCIGeneric = 8,    // ordinal: 0x8
  WheaErrSrcTypeIPFMCA = 9,        // ordinal: 0x9
  WheaErrSrcTypeIPFCMC = 10,       // ordinal: 0xa
  WheaErrSrcTypeIPFCPE = 11,       // ordinal: 0xb
  WheaErrSrcTypeGenericV2 = 12,    // ordinal: 0xc
  WheaErrSrcTypeSCIGenericV2 = 13, // ordinal: 0xd
  WheaErrSrcTypeBMC = 14,          // ordinal: 0xe
  WheaErrSrcTypePMEM = 15,         // ordinal: 0xf
  WheaErrSrcTypeDeviceDriver = 16, // ordinal: 0x10
  WheaErrSrcTypeMax = 17,          // ordinal: 0x11
} _WHEA_ERROR_SOURCE_TYPE;

typedef enum _WHEA_ERROR_SEVERITY {
  WheaErrSevRecoverable = 0,   // ordinal: 0x0
  WheaErrSevFatal = 1,         // ordinal: 0x1
  WheaErrSevCorrected = 2,     // ordinal: 0x2
  WheaErrSevInformational = 3, // ordinal: 0x3
} _WHEA_ERROR_SEVERITY;

typedef enum _WHEA_ERROR_TYPE {
  WheaErrTypeProcessor = 0,  // ordinal: 0x0
  WheaErrTypeMemory = 1,     // ordinal: 0x1
  WheaErrTypePCIExpress = 2, // ordinal: 0x2
  WheaErrTypeNMI = 3,        // ordinal: 0x3
  WheaErrTypePCIXBus = 4,    // ordinal: 0x4
  WheaErrTypePCIXDevice = 5, // ordinal: 0x5
  WheaErrTypeGeneric = 6,    // ordinal: 0x6
  WheaErrTypePmem = 7,       // ordinal: 0x7
} _WHEA_ERROR_TYPE;

typedef enum _WHEA_EVENT_LOG_ENTRY_ID {
  WheaEventLogEntryIdCmcPollingTimeout = -2147483647,      // ordinal: 0x0
  WheaEventLogEntryIdWheaInit = -2147483646,               // ordinal: 0x1
  WheaEventLogEntryIdCmcSwitchToPolling = -2147483645,     // ordinal: 0x2
  WheaEventLogEntryIdDroppedCorrectedError = -2147483644,  // ordinal: 0x3
  WheaEventLogEntryIdStartedReportHwError = -2147483643,   // ordinal: 0x4
  WheaEventLogEntryIdPFAMemoryOfflined = -2147483642,      // ordinal: 0x5
  WheaEventLogEntryIdPFAMemoryRemoveMonitor = -2147483641, // ordinal: 0x6
  WheaEventLogEntryIdPFAMemoryPolicy = -2147483640,        // ordinal: 0x7
  WheaEventLogEntryIdPshedInjectError = -2147483639,       // ordinal: 0x8
  WheaEventLogEntryIdOscCapabilities = -2147483638,        // ordinal: 0x9
  WheaEventLogEntryIdPshedPluginRegister = -2147483637,    // ordinal: 0xa
  WheaEventLogEntryIdAddRemoveErrorSource = -2147483636,   // ordinal: 0xb
  WheaEventLogEntryIdWorkQueueItem = -2147483635,          // ordinal: 0xc
  WheaEventLogEntryIdAttemptErrorRecovery = -2147483634,   // ordinal: 0xd
  WheaEventLogEntryIdMcaFoundErrorInBank = -2147483633,    // ordinal: 0xe
  WheaEventLogEntryIdMcaStuckErrorCheck = -2147483632,     // ordinal: 0xf
  WheaEventLogEntryIdMcaErrorCleared = -2147483631,        // ordinal: 0x10
  WheaEventLogEntryIdClearedPoison = -2147483630,          // ordinal: 0x11
  WheaEventLogEntryIdProcessEINJ = -2147483629,            // ordinal: 0x12
  WheaEventLogEntryIdProcessHEST = -2147483628,            // ordinal: 0x13
  WheaEventLogEntryIdCreateGenericRecord = -2147483627,    // ordinal: 0x14
  WheaEventLogEntryIdErrorRecord = -2147483626,            // ordinal: 0x15
  WheaEventLogEntryIdErrorRecordLimit = -2147483625,       // ordinal: 0x16
  WheaEventLogEntryIdSELEventFailed = -2147483624,         // ordinal: 0x17
  WheaEventLogEntryIdErrSrcArrayInvalid = -2147483623,     // ordinal: 0x18
  WheaEventLogEntryIdErrSrcInvalid = -2147483616,          // ordinal: 0x19
  WheaEventLogEntryIdGenericErrMemMap = -2147483615,       // ordinal: 0x1a
  WheaEventLogEntryIdPshedCallbackCollision = -2147483614, // ordinal: 0x1b
  WheaEventLogEntryIdSELBugCheckProgress = -2147483613,    // ordinal: 0x1c
} _WHEA_EVENT_LOG_ENTRY_ID;

typedef enum _WHEA_EVENT_LOG_ENTRY_TYPE {
  WheaEventLogEntryTypeInformational = 0, // ordinal: 0x0
  WheaEventLogEntryTypeWarning = 1,       // ordinal: 0x1
  WheaEventLogEntryTypeError = 2,         // ordinal: 0x2
} _WHEA_EVENT_LOG_ENTRY_TYPE;

typedef enum _MM_PAGE_ACCESS_TYPE {
  MmPteAccessType = 0,         // ordinal: 0x0
  MmCcReadAheadType = 1,       // ordinal: 0x1
  MmPfnRepurposeType = 2,      // ordinal: 0x2
  MmMaximumPageAccessType = 3, // ordinal: 0x3
} _MM_PAGE_ACCESS_TYPE;

typedef enum _IO_PRIORITY_HINT {
  IoPriorityVeryLow = 0,  // ordinal: 0x0
  IoPriorityLow = 1,      // ordinal: 0x1
  IoPriorityNormal = 2,   // ordinal: 0x2
  IoPriorityHigh = 3,     // ordinal: 0x3
  IoPriorityCritical = 4, // ordinal: 0x4
  MaxIoPriorityTypes = 5, // ordinal: 0x5
} _IO_PRIORITY_HINT;

typedef enum _KPROFILE_SOURCE {
  ProfileTime = 0,                  // ordinal: 0x0
  ProfileAlignmentFixup = 1,        // ordinal: 0x1
  ProfileTotalIssues = 2,           // ordinal: 0x2
  ProfilePipelineDry = 3,           // ordinal: 0x3
  ProfileLoadInstructions = 4,      // ordinal: 0x4
  ProfilePipelineFrozen = 5,        // ordinal: 0x5
  ProfileBranchInstructions = 6,    // ordinal: 0x6
  ProfileTotalNonissues = 7,        // ordinal: 0x7
  ProfileDcacheMisses = 8,          // ordinal: 0x8
  ProfileIcacheMisses = 9,          // ordinal: 0x9
  ProfileCacheMisses = 10,          // ordinal: 0xa
  ProfileBranchMispredictions = 11, // ordinal: 0xb
  ProfileStoreInstructions = 12,    // ordinal: 0xc
  ProfileFpInstructions = 13,       // ordinal: 0xd
  ProfileIntegerInstructions = 14,  // ordinal: 0xe
  Profile2Issue = 15,               // ordinal: 0xf
  Profile3Issue = 16,               // ordinal: 0x10
  Profile4Issue = 17,               // ordinal: 0x11
  ProfileSpecialInstructions = 18,  // ordinal: 0x12
  ProfileTotalCycles = 19,          // ordinal: 0x13
  ProfileIcacheIssues = 20,         // ordinal: 0x14
  ProfileDcacheAccesses = 21,       // ordinal: 0x15
  ProfileMemoryBarrierCycles = 22,  // ordinal: 0x16
  ProfileLoadLinkedIssues = 23,     // ordinal: 0x17
  ProfileMaximum = 24,              // ordinal: 0x18
} _KPROFILE_SOURCE;

typedef enum _TOKEN_TYPE {
  TokenPrimary = 1,       // ordinal: 0x0
  TokenImpersonation = 2, // ordinal: 0x1
} _TOKEN_TYPE;

typedef enum _ETW_BUFFER_STATE {
  EtwBufferStateFree = 0,               // ordinal: 0x0
  EtwBufferStateGeneralLogging = 1,     // ordinal: 0x1
  EtwBufferStateCSwitch = 2,            // ordinal: 0x2
  EtwBufferStateFlush = 3,              // ordinal: 0x3
  EtwBufferStatePendingCompression = 4, // ordinal: 0x4
  EtwBufferStateCompressed = 5,         // ordinal: 0x5
  EtwBufferStatePlaceholder = 6,        // ordinal: 0x6
  EtwBufferStateMaximum = 7,            // ordinal: 0x7
} _ETW_BUFFER_STATE;

typedef enum _WNF_DATA_SCOPE {
  WnfDataScopeSystem = 0,  // ordinal: 0x0
  WnfDataScopeSession = 1, // ordinal: 0x1
  WnfDataScopeUser = 2,    // ordinal: 0x2
  WnfDataScopeProcess = 3, // ordinal: 0x3
  WnfDataScopeMachine = 4, // ordinal: 0x4
} _WNF_DATA_SCOPE;

typedef enum ETW_COMPRESSION_RESUMPTION_MODE {
  EtwCompressionModeRestart = 0,   // ordinal: 0x0
  EtwCompressionModeNoDisable = 1, // ordinal: 0x1
  EtwCompressionModeNoRestart = 2, // ordinal: 0x2
} ETW_COMPRESSION_RESUMPTION_MODE;

typedef enum _ETW_PERIODIC_TIMER_STATE {
  EtwpPeriodicTimerUnset = 0, // ordinal: 0x0
  EtwpPeriodicTimerSet = 1,   // ordinal: 0x1
} _ETW_PERIODIC_TIMER_STATE;

typedef enum _ETW_RT_EVENT_LOSS {
  EtwRtEventNoLoss = 0,  // ordinal: 0x0
  EtwRtEventLost = 1,    // ordinal: 0x1
  EtwRtBufferLost = 2,   // ordinal: 0x2
  EtwRtBackupLost = 3,   // ordinal: 0x3
  EtwRtEventLossMax = 4, // ordinal: 0x4
} _ETW_RT_EVENT_LOSS;

typedef enum _FS_FILTER_SECTION_SYNC_TYPE {
  SyncTypeOther = 0,         // ordinal: 0x0
  SyncTypeCreateSection = 1, // ordinal: 0x1
} _FS_FILTER_SECTION_SYNC_TYPE;

typedef enum _SECURITY_IMPERSONATION_LEVEL {
  SecurityAnonymous = 0,      // ordinal: 0x0
  SecurityIdentification = 1, // ordinal: 0x1
  SecurityImpersonation = 2,  // ordinal: 0x2
  SecurityDelegation = 3,     // ordinal: 0x3
} _SECURITY_IMPERSONATION_LEVEL;

// 0x10 bytes (sizeof)
typedef struct _SECURITY_SUBJECT_CONTEXT {
  VOID *ClientToken; // offset: 0x0 ordinal: 0x0
  enum _SECURITY_IMPERSONATION_LEVEL
      ImpersonationLevel; // offset: 0x4 ordinal: 0x1
  VOID *PrimaryToken;     // offset: 0x8 ordinal: 0x2
  VOID *ProcessAuditId;   // offset: 0xc ordinal: 0x3
} _SECURITY_SUBJECT_CONTEXT;

typedef enum _DEVICE_RELATION_LEVEL {
  RELATION_LEVEL_REMOVE_EJECT = 0,      // ordinal: 0x0
  RELATION_LEVEL_DEPENDENT = 1,         // ordinal: 0x1
  RELATION_LEVEL_DIRECT_DESCENDANT = 2, // ordinal: 0x2
} _DEVICE_RELATION_LEVEL;

typedef enum _SERVERSILO_STATE {
  SERVERSILO_INITING = 0,       // ordinal: 0x0
  SERVERSILO_STARTED = 1,       // ordinal: 0x1
  SERVERSILO_SHUTTING_DOWN = 2, // ordinal: 0x2
  SERVERSILO_TERMINATING = 3,   // ordinal: 0x3
  SERVERSILO_TERMINATED = 4,    // ordinal: 0x4
} _SERVERSILO_STATE;

typedef enum _PO_FX_PERF_STATE_TYPE {
  PoFxPerfStateTypeDiscrete = 0, // ordinal: 0x0
  PoFxPerfStateTypeRange = 1,    // ordinal: 0x1
  PoFxPerfStateTypeMaximum = 2,  // ordinal: 0x2
} _PO_FX_PERF_STATE_TYPE;

typedef enum _PO_FX_PERF_STATE_UNIT {
  PoFxPerfStateUnitOther = 0,     // ordinal: 0x0
  PoFxPerfStateUnitFrequency = 1, // ordinal: 0x1
  PoFxPerfStateUnitBandwidth = 2, // ordinal: 0x2
  PoFxPerfStateUnitMaximum = 3,   // ordinal: 0x3
} _PO_FX_PERF_STATE_UNIT;

typedef enum _IRQ_PRIORITY {
  IrqPriorityUndefined = 0, // ordinal: 0x0
  IrqPriorityLow = 1,       // ordinal: 0x1
  IrqPriorityNormal = 2,    // ordinal: 0x2
  IrqPriorityHigh = 3,      // ordinal: 0x3
} _IRQ_PRIORITY;

typedef enum _MI_SYSTEM_VA_TYPE {
  MiVaUnused = 0,              // ordinal: 0x0
  MiVaSessionSpace = 1,        // ordinal: 0x1
  MiVaProcessSpace = 2,        // ordinal: 0x2
  MiVaBootLoaded = 3,          // ordinal: 0x3
  MiVaPfnDatabase = 4,         // ordinal: 0x4
  MiVaNonPagedPool = 5,        // ordinal: 0x5
  MiVaPagedPool = 6,           // ordinal: 0x6
  MiVaSpecialPoolPaged = 7,    // ordinal: 0x7
  MiVaSystemCache = 8,         // ordinal: 0x8
  MiVaSystemPtes = 9,          // ordinal: 0x9
  MiVaHal = 10,                // ordinal: 0xa
  MiVaSessionGlobalSpace = 11, // ordinal: 0xb
  MiVaDriverImages = 12,       // ordinal: 0xc
  MiVaSystemPtesLarge = 13,    // ordinal: 0xd
  MiVaKernelStacks = 14,       // ordinal: 0xe
  MiVaMaximumType = 15,        // ordinal: 0xf
} _MI_SYSTEM_VA_TYPE;

typedef enum PROFILE_DEPARTURE_STYLE {
  PDS_UPDATE_DEFAULT = 1,      // ordinal: 0x0
  PDS_UPDATE_ON_REMOVE = 2,    // ordinal: 0x1
  PDS_UPDATE_ON_INTERFACE = 3, // ordinal: 0x2
  PDS_UPDATE_ON_EJECT = 4,     // ordinal: 0x3
} PROFILE_DEPARTURE_STYLE;

typedef enum _PNP_WATCHDOG_TYPE {
  PNP_EVENT_WORKER_WATCHDOG = 1,            // ordinal: 0x0
  PNP_DEVICE_COMPLETION_QUEUE_WATCHDOG = 2, // ordinal: 0x1
  PNP_DELAYED_REMOVE_WORKER_WATCHDOG = 3,   // ordinal: 0x2
} _PNP_WATCHDOG_TYPE;

typedef enum POWER_ACTION {
  PowerActionNone = 0,          // ordinal: 0x0
  PowerActionReserved = 1,      // ordinal: 0x1
  PowerActionSleep = 2,         // ordinal: 0x2
  PowerActionHibernate = 3,     // ordinal: 0x3
  PowerActionShutdown = 4,      // ordinal: 0x4
  PowerActionShutdownReset = 5, // ordinal: 0x5
  PowerActionShutdownOff = 6,   // ordinal: 0x6
  PowerActionWarmEject = 7,     // ordinal: 0x7
  PowerActionDisplayOff = 8,    // ordinal: 0x8
} POWER_ACTION;

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE {
  DeviceUsageTypeUndefined = 0,     // ordinal: 0x0
  DeviceUsageTypePaging = 1,        // ordinal: 0x1
  DeviceUsageTypeHibernation = 2,   // ordinal: 0x2
  DeviceUsageTypeDumpFile = 3,      // ordinal: 0x3
  DeviceUsageTypeBoot = 4,          // ordinal: 0x4
  DeviceUsageTypePostDisplay = 5,   // ordinal: 0x5
  DeviceUsageTypeGuestAssigned = 6, // ordinal: 0x6
} _DEVICE_USAGE_NOTIFICATION_TYPE;

typedef enum DEVICE_TEXT_TYPE {
  DeviceTextDescription = 0,         // ordinal: 0x0
  DeviceTextLocationInformation = 1, // ordinal: 0x1
} DEVICE_TEXT_TYPE;

typedef enum BUS_QUERY_ID_TYPE {
  BusQueryDeviceID = 0,           // ordinal: 0x0
  BusQueryHardwareIDs = 1,        // ordinal: 0x1
  BusQueryCompatibleIDs = 2,      // ordinal: 0x2
  BusQueryInstanceID = 3,         // ordinal: 0x3
  BusQueryDeviceSerialNumber = 4, // ordinal: 0x4
  BusQueryContainerID = 5,        // ordinal: 0x5
} BUS_QUERY_ID_TYPE;

// 0x4 bytes (sizeof)
typedef struct __anon_826 {
  enum BUS_QUERY_ID_TYPE IdType; // offset: 0x0 ordinal: 0x0
} __anon_826;

typedef enum _DEVICE_RELATION_TYPE {
  BusRelations = 0,         // ordinal: 0x0
  EjectionRelations = 1,    // ordinal: 0x1
  PowerRelations = 2,       // ordinal: 0x2
  RemovalRelations = 3,     // ordinal: 0x3
  TargetDeviceRelation = 4, // ordinal: 0x4
  SingleBusRelations = 5,   // ordinal: 0x5
  TransportRelations = 6,   // ordinal: 0x6
} _DEVICE_RELATION_TYPE;

// 0x4 bytes (sizeof)
typedef struct __anon_820 {
  enum _DEVICE_RELATION_TYPE Type; // offset: 0x0 ordinal: 0x0
} __anon_820;

typedef enum _FSINFOCLASS {
  FileFsVolumeInformation = 1,        // ordinal: 0x0
  FileFsLabelInformation = 2,         // ordinal: 0x1
  FileFsSizeInformation = 3,          // ordinal: 0x2
  FileFsDeviceInformation = 4,        // ordinal: 0x3
  FileFsAttributeInformation = 5,     // ordinal: 0x4
  FileFsControlInformation = 6,       // ordinal: 0x5
  FileFsFullSizeInformation = 7,      // ordinal: 0x6
  FileFsObjectIdInformation = 8,      // ordinal: 0x7
  FileFsDriverPathInformation = 9,    // ordinal: 0x8
  FileFsVolumeFlagsInformation = 10,  // ordinal: 0x9
  FileFsSectorSizeInformation = 11,   // ordinal: 0xa
  FileFsDataCopyInformation = 12,     // ordinal: 0xb
  FileFsMetadataSizeInformation = 13, // ordinal: 0xc
  FileFsFullSizeInformationEx = 14,   // ordinal: 0xd
  FileFsMaximumInformation = 15,      // ordinal: 0xe
} _FSINFOCLASS;

typedef enum _DIRECTORY_NOTIFY_INFORMATION_CLASS {
  DirectoryNotifyInformation = 1,         // ordinal: 0x0
  DirectoryNotifyExtendedInformation = 2, // ordinal: 0x1
} _DIRECTORY_NOTIFY_INFORMATION_CLASS;

typedef enum _FILE_INFORMATION_CLASS {
  FileDirectoryInformation = 1,                      // ordinal: 0x0
  FileFullDirectoryInformation = 2,                  // ordinal: 0x1
  FileBothDirectoryInformation = 3,                  // ordinal: 0x2
  FileBasicInformation = 4,                          // ordinal: 0x3
  FileStandardInformation = 5,                       // ordinal: 0x4
  FileInternalInformation = 6,                       // ordinal: 0x5
  FileEaInformation = 7,                             // ordinal: 0x6
  FileAccessInformation = 8,                         // ordinal: 0x7
  FileNameInformation = 9,                           // ordinal: 0x8
  FileRenameInformation = 10,                        // ordinal: 0x9
  FileLinkInformation = 11,                          // ordinal: 0xa
  FileNamesInformation = 12,                         // ordinal: 0xb
  FileDispositionInformation = 13,                   // ordinal: 0xc
  FilePositionInformation = 14,                      // ordinal: 0xd
  FileFullEaInformation = 15,                        // ordinal: 0xe
  FileModeInformation = 16,                          // ordinal: 0xf
  FileAlignmentInformation = 17,                     // ordinal: 0x10
  FileAllInformation = 18,                           // ordinal: 0x11
  FileAllocationInformation = 19,                    // ordinal: 0x12
  FileEndOfFileInformation = 20,                     // ordinal: 0x13
  FileAlternateNameInformation = 21,                 // ordinal: 0x14
  FileStreamInformation = 22,                        // ordinal: 0x15
  FilePipeInformation = 23,                          // ordinal: 0x16
  FilePipeLocalInformation = 24,                     // ordinal: 0x17
  FilePipeRemoteInformation = 25,                    // ordinal: 0x18
  FileMailslotQueryInformation = 26,                 // ordinal: 0x19
  FileMailslotSetInformation = 27,                   // ordinal: 0x1a
  FileCompressionInformation = 28,                   // ordinal: 0x1b
  FileObjectIdInformation = 29,                      // ordinal: 0x1c
  FileCompletionInformation = 30,                    // ordinal: 0x1d
  FileMoveClusterInformation = 31,                   // ordinal: 0x1e
  FileQuotaInformation = 32,                         // ordinal: 0x1f
  FileReparsePointInformation = 33,                  // ordinal: 0x20
  FileNetworkOpenInformation = 34,                   // ordinal: 0x21
  FileAttributeTagInformation = 35,                  // ordinal: 0x22
  FileTrackingInformation = 36,                      // ordinal: 0x23
  FileIdBothDirectoryInformation = 37,               // ordinal: 0x24
  FileIdFullDirectoryInformation = 38,               // ordinal: 0x25
  FileValidDataLengthInformation = 39,               // ordinal: 0x26
  FileShortNameInformation = 40,                     // ordinal: 0x27
  FileIoCompletionNotificationInformation = 41,      // ordinal: 0x28
  FileIoStatusBlockRangeInformation = 42,            // ordinal: 0x29
  FileIoPriorityHintInformation = 43,                // ordinal: 0x2a
  FileSfioReserveInformation = 44,                   // ordinal: 0x2b
  FileSfioVolumeInformation = 45,                    // ordinal: 0x2c
  FileHardLinkInformation = 46,                      // ordinal: 0x2d
  FileProcessIdsUsingFileInformation = 47,           // ordinal: 0x2e
  FileNormalizedNameInformation = 48,                // ordinal: 0x2f
  FileNetworkPhysicalNameInformation = 49,           // ordinal: 0x30
  FileIdGlobalTxDirectoryInformation = 50,           // ordinal: 0x31
  FileIsRemoteDeviceInformation = 51,                // ordinal: 0x32
  FileUnusedInformation = 52,                        // ordinal: 0x33
  FileNumaNodeInformation = 53,                      // ordinal: 0x34
  FileStandardLinkInformation = 54,                  // ordinal: 0x35
  FileRemoteProtocolInformation = 55,                // ordinal: 0x36
  FileRenameInformationBypassAccessCheck = 56,       // ordinal: 0x37
  FileLinkInformationBypassAccessCheck = 57,         // ordinal: 0x38
  FileVolumeNameInformation = 58,                    // ordinal: 0x39
  FileIdInformation = 59,                            // ordinal: 0x3a
  FileIdExtdDirectoryInformation = 60,               // ordinal: 0x3b
  FileReplaceCompletionInformation = 61,             // ordinal: 0x3c
  FileHardLinkFullIdInformation = 62,                // ordinal: 0x3d
  FileIdExtdBothDirectoryInformation = 63,           // ordinal: 0x3e
  FileDispositionInformationEx = 64,                 // ordinal: 0x3f
  FileRenameInformationEx = 65,                      // ordinal: 0x40
  FileRenameInformationExBypassAccessCheck = 66,     // ordinal: 0x41
  FileDesiredStorageClassInformation = 67,           // ordinal: 0x42
  FileStatInformation = 68,                          // ordinal: 0x43
  FileMemoryPartitionInformation = 69,               // ordinal: 0x44
  FileStatLxInformation = 70,                        // ordinal: 0x45
  FileCaseSensitiveInformation = 71,                 // ordinal: 0x46
  FileLinkInformationEx = 72,                        // ordinal: 0x47
  FileLinkInformationExBypassAccessCheck = 73,       // ordinal: 0x48
  FileStorageReserveIdInformation = 74,              // ordinal: 0x49
  FileCaseSensitiveInformationForceAccessCheck = 75, // ordinal: 0x4a
  FileMaximumInformation = 76,                       // ordinal: 0x4b
} _FILE_INFORMATION_CLASS;

typedef enum _IO_SESSION_STATE {
  IoSessionStateCreated = 1,              // ordinal: 0x0
  IoSessionStateInitialized = 2,          // ordinal: 0x1
  IoSessionStateConnected = 3,            // ordinal: 0x2
  IoSessionStateDisconnected = 4,         // ordinal: 0x3
  IoSessionStateDisconnectedLoggedOn = 5, // ordinal: 0x4
  IoSessionStateLoggedOn = 6,             // ordinal: 0x5
  IoSessionStateLoggedOff = 7,            // ordinal: 0x6
  IoSessionStateTerminated = 8,           // ordinal: 0x7
  IoSessionStateMax = 9,                  // ordinal: 0x8
} _IO_SESSION_STATE;

typedef enum _PLUGPLAY_EVENT_CATEGORY {
  HardwareProfileChangeEvent = 0,  // ordinal: 0x0
  TargetDeviceChangeEvent = 1,     // ordinal: 0x1
  DeviceClassChangeEvent = 2,      // ordinal: 0x2
  CustomDeviceEvent = 3,           // ordinal: 0x3
  DeviceInstallEvent = 4,          // ordinal: 0x4
  DeviceArrivalEvent = 5,          // ordinal: 0x5
  VetoEvent = 6,                   // ordinal: 0x6
  BlockedDriverEvent = 7,          // ordinal: 0x7
  InvalidIDEvent = 8,              // ordinal: 0x8
  DevicePropertyChangeEvent = 9,   // ordinal: 0x9
  DeviceInstanceRemovalEvent = 10, // ordinal: 0xa
  DeviceInstanceStartedEvent = 11, // ordinal: 0xb
  MaxPlugEventCategory = 12,       // ordinal: 0xc
} _PLUGPLAY_EVENT_CATEGORY;

typedef enum _PNP_VETO_TYPE {
  PNP_VetoTypeUnknown = 0,          // ordinal: 0x0
  PNP_VetoLegacyDevice = 1,         // ordinal: 0x1
  PNP_VetoPendingClose = 2,         // ordinal: 0x2
  PNP_VetoWindowsApp = 3,           // ordinal: 0x3
  PNP_VetoWindowsService = 4,       // ordinal: 0x4
  PNP_VetoOutstandingOpen = 5,      // ordinal: 0x5
  PNP_VetoDevice = 6,               // ordinal: 0x6
  PNP_VetoDriver = 7,               // ordinal: 0x7
  PNP_VetoIllegalDeviceRequest = 8, // ordinal: 0x8
  PNP_VetoInsufficientPower = 9,    // ordinal: 0x9
  PNP_VetoNonDisableable = 10,      // ordinal: 0xa
  PNP_VetoLegacyDriver = 11,        // ordinal: 0xb
  PNP_VetoInsufficientRights = 12,  // ordinal: 0xc
  PNP_VetoAlreadyRemoved = 13,      // ordinal: 0xd
} _PNP_VETO_TYPE;

typedef enum _POP_DEVICE_IDLE_TYPE {
  DeviceIdleNormal = 0, // ordinal: 0x0
  DeviceIdleDisk = 1,   // ordinal: 0x1
} _POP_DEVICE_IDLE_TYPE;

typedef enum _IO_ALLOCATION_ACTION {
  KeepObject = 1,                    // ordinal: 0x0
  DeallocateObject = 2,              // ordinal: 0x1
  DeallocateObjectKeepRegisters = 3, // ordinal: 0x2
} _IO_ALLOCATION_ACTION;

typedef enum HAL_APIC_DESTINATION_MODE {
  ApicDestinationModePhysical = 1,         // ordinal: 0x0
  ApicDestinationModeLogicalFlat = 2,      // ordinal: 0x1
  ApicDestinationModeLogicalClustered = 3, // ordinal: 0x2
  ApicDestinationModeUnknown = 4,          // ordinal: 0x3
} HAL_APIC_DESTINATION_MODE;

// 0x4 bytes (sizeof)
typedef struct __anon_674 {
  enum HAL_APIC_DESTINATION_MODE DestinationMode; // offset: 0x0 ordinal: 0x0
} __anon_674;

// 0x4 bytes (sizeof)
typedef struct POHANDLE__ {
  LONG unused; // offset: 0x0 ordinal: 0x0
} POHANDLE__;

typedef enum _PNP_DEVNODE_QUERY_REBALANCE_VETO_REASON {
  DeviceQueryRebalanceSucceeded = 0,         // ordinal: 0x0
  DeviceQueryStopFailed = 1,                 // ordinal: 0x1
  DeviceFailedGetNewResourceRequirement = 2, // ordinal: 0x2
  DeviceInUnexpectedState = 3,               // ordinal: 0x3
  DeviceNotSupportQueryRebalance = 4,        // ordinal: 0x4
} _PNP_DEVNODE_QUERY_REBALANCE_VETO_REASON;

typedef enum _PNP_REBALANCE_FAILURE {
  RebalanceFailureNone = 0,                    // ordinal: 0x0
  RebalanceFailureDisabled = 1,                // ordinal: 0x1
  RebalanceFailureNoMemory = 2,                // ordinal: 0x2
  RebalanceFailureQueryStopUnexpectedVeto = 3, // ordinal: 0x3
  RebalanceFailureNoRequirements = 4,          // ordinal: 0x4
  RebalanceFailureNoCandidates = 5,            // ordinal: 0x5
  RebalanceFailureNoConfiguration = 6,         // ordinal: 0x6
} _PNP_REBALANCE_FAILURE;

typedef enum _PNP_REBALANCE_REASON {
  RebalanceReasonUnknown = 0,             // ordinal: 0x0
  RebalanceReasonRequirementsChanged = 1, // ordinal: 0x1
  RebalanceReasonNewDevice = 2,           // ordinal: 0x2
} _PNP_REBALANCE_REASON;

typedef enum INTERRUPT_CONNECTION_TYPE {
  InterruptTypeControllerInput = 0, // ordinal: 0x0
  InterruptTypeXapicMessage = 1,    // ordinal: 0x1
  InterruptTypeHypertransport = 2,  // ordinal: 0x2
  InterruptTypeMessageRequest = 3,  // ordinal: 0x3
} INTERRUPT_CONNECTION_TYPE;

typedef enum _PNP_DEVICE_DELETE_TYPE {
  QueryRemoveDevice = 0,           // ordinal: 0x0
  CancelRemoveDevice = 1,          // ordinal: 0x1
  RemoveDevice = 2,                // ordinal: 0x2
  SurpriseRemoveDevice = 3,        // ordinal: 0x3
  EjectDevice = 4,                 // ordinal: 0x4
  RemoveFailedDevice = 5,          // ordinal: 0x5
  RemoveUnstartedFailedDevice = 6, // ordinal: 0x6
  MaxDeviceDeleteType = 7,         // ordinal: 0x7
} _PNP_DEVICE_DELETE_TYPE;

typedef enum IRPLOCK {
  IRPLOCK_CANCELABLE = 0,      // ordinal: 0x0
  IRPLOCK_CANCEL_STARTED = 1,  // ordinal: 0x1
  IRPLOCK_CANCEL_COMPLETE = 2, // ordinal: 0x2
  IRPLOCK_COMPLETED = 3,       // ordinal: 0x3
} IRPLOCK;

typedef enum _PEP_WORK_TYPE {
  PepWorkActiveComplete = 0,                    // ordinal: 0x0
  PepWorkRequestIdleState = 1,                  // ordinal: 0x1
  PepWorkDevicePower = 2,                       // ordinal: 0x2
  PepWorkRequestPowerControl = 3,               // ordinal: 0x3
  PepWorkDeviceIdle = 4,                        // ordinal: 0x4
  PepWorkCompleteIdleState = 5,                 // ordinal: 0x5
  PepWorkCompletePerfState = 6,                 // ordinal: 0x6
  PepWorkAcpiNotify = 7,                        // ordinal: 0x7
  PepWorkAcpiEvaluateControlMethodComplete = 8, // ordinal: 0x8
  PepWorkMax = 9,                               // ordinal: 0x9
} _PEP_WORK_TYPE;

typedef enum PROFILE_STATUS {
  DOCK_NOTDOCKDEVICE = 0,      // ordinal: 0x0
  DOCK_QUIESCENT = 1,          // ordinal: 0x1
  DOCK_ARRIVING = 2,           // ordinal: 0x2
  DOCK_DEPARTING = 3,          // ordinal: 0x3
  DOCK_EJECTIRP_COMPLETED = 4, // ordinal: 0x4
} PROFILE_STATUS;

typedef enum _HARDWARE_COUNTER_TYPE {
  PMCCounter = 0,             // ordinal: 0x0
  MaxHardwareCounterType = 1, // ordinal: 0x1
} _HARDWARE_COUNTER_TYPE;

typedef enum _SYSTEM_POWER_STATE {
  PowerSystemUnspecified = 0, // ordinal: 0x0
  PowerSystemWorking = 1,     // ordinal: 0x1
  PowerSystemSleeping1 = 2,   // ordinal: 0x2
  PowerSystemSleeping2 = 3,   // ordinal: 0x3
  PowerSystemSleeping3 = 4,   // ordinal: 0x4
  PowerSystemHibernate = 5,   // ordinal: 0x5
  PowerSystemShutdown = 6,    // ordinal: 0x6
  PowerSystemMaximum = 7,     // ordinal: 0x7
} _SYSTEM_POWER_STATE;

typedef VOID (*__anon_2470)(enum _SYSTEM_POWER_STATE);

// 0x4 bytes (sizeof)
typedef struct __anon_829 {
  enum _SYSTEM_POWER_STATE PowerState; // offset: 0x0 ordinal: 0x0
} __anon_829;

// 0x4 bytes (sizeof)
typedef union _POWER_STATE {
  enum _SYSTEM_POWER_STATE SystemState; // offset: 0x0 ordinal: 0x0
  enum _DEVICE_POWER_STATE DeviceState; // offset: 0x0 ordinal: 0x1
} _POWER_STATE;

typedef enum _INTERFACE_TYPE {
  InterfaceTypeUndefined = -1, // ordinal: 0x0
  Internal = 0,                // ordinal: 0x1
  Isa = 1,                     // ordinal: 0x2
  Eisa = 2,                    // ordinal: 0x3
  MicroChannel = 3,            // ordinal: 0x4
  TurboChannel = 4,            // ordinal: 0x5
  PCIBus = 5,                  // ordinal: 0x6
  VMEBus = 6,                  // ordinal: 0x7
  NuBus = 7,                   // ordinal: 0x8
  PCMCIABus = 8,               // ordinal: 0x9
  CBus = 9,                    // ordinal: 0xa
  MPIBus = 10,                 // ordinal: 0xb
  MPSABus = 11,                // ordinal: 0xc
  ProcessorInternal = 12,      // ordinal: 0xd
  InternalPowerBus = 13,       // ordinal: 0xe
  PNPISABus = 14,              // ordinal: 0xf
  PNPBus = 15,                 // ordinal: 0x10
  Vmcs = 16,                   // ordinal: 0x11
  ACPIBus = 17,                // ordinal: 0x12
  MaximumInterfaceType = 18,   // ordinal: 0x13
} _INTERFACE_TYPE;

typedef enum _PNP_DEVNODE_STATE {
  DeviceNodeUnspecified = 768,            // ordinal: 0x0
  DeviceNodeUninitialized = 769,          // ordinal: 0x1
  DeviceNodeInitialized = 770,            // ordinal: 0x2
  DeviceNodeDriversAdded = 771,           // ordinal: 0x3
  DeviceNodeResourcesAssigned = 772,      // ordinal: 0x4
  DeviceNodeStartPending = 773,           // ordinal: 0x5
  DeviceNodeStartCompletion = 774,        // ordinal: 0x6
  DeviceNodeStartPostWork = 775,          // ordinal: 0x7
  DeviceNodeStarted = 776,                // ordinal: 0x8
  DeviceNodeQueryStopped = 777,           // ordinal: 0x9
  DeviceNodeStopped = 778,                // ordinal: 0xa
  DeviceNodeRestartCompletion = 779,      // ordinal: 0xb
  DeviceNodeEnumeratePending = 780,       // ordinal: 0xc
  DeviceNodeEnumerateCompletion = 781,    // ordinal: 0xd
  DeviceNodeAwaitingQueuedDeletion = 782, // ordinal: 0xe
  DeviceNodeAwaitingQueuedRemoval = 783,  // ordinal: 0xf
  DeviceNodeQueryRemoved = 784,           // ordinal: 0x10
  DeviceNodeRemovePendingCloses = 785,    // ordinal: 0x11
  DeviceNodeRemoved = 786,                // ordinal: 0x12
  DeviceNodeDeletePendingCloses = 787,    // ordinal: 0x13
  DeviceNodeDeleted = 788,                // ordinal: 0x14
  MaxDeviceNodeState = 789,               // ordinal: 0x15
} _PNP_DEVNODE_STATE;

typedef enum _POP_PEP_NOTIFY_DEVICE_DSTATE_REASON {
  PepNotifyDeviceDStateReasonNone = 0,             // ordinal: 0x0
  PepNotifyDeviceDStateReasonSystemTransition = 1, // ordinal: 0x1
  PepNotifyDeviceDStateReasonDfx = 2,              // ordinal: 0x2
  PepNotifyDeviceDStateReasonMax = 3,              // ordinal: 0x3
} _POP_PEP_NOTIFY_DEVICE_DSTATE_REASON;

typedef enum _POWER_STATE_TYPE {
  SystemPowerState = 0, // ordinal: 0x0
  DevicePowerState = 1, // ordinal: 0x1
} _POWER_STATE_TYPE;

// 0x4 bytes (sizeof)
typedef struct PEPHANDLE__ {
  LONG unused; // offset: 0x0 ordinal: 0x0
} PEPHANDLE__;

// 0x8 bytes (sizeof)
typedef struct _PEP_CRASHDUMP_INFORMATION {
  struct PEPHANDLE__ *DeviceHandle; // offset: 0x0 ordinal: 0x0
  VOID *DeviceContext;              // offset: 0x4 ordinal: 0x1
} _PEP_CRASHDUMP_INFORMATION;

typedef enum _KINTERRUPT_POLARITY {
  InterruptPolarityUnknown = 0,       // ordinal: 0x0
  InterruptActiveHigh = 1,            // ordinal: 0x1
  InterruptRisingEdge = 1,            // ordinal: 0x2
  InterruptActiveLow = 2,             // ordinal: 0x3
  InterruptFallingEdge = 2,           // ordinal: 0x4
  InterruptActiveBoth = 3,            // ordinal: 0x5
  InterruptActiveBothTriggerLow = 3,  // ordinal: 0x6
  InterruptActiveBothTriggerHigh = 4, // ordinal: 0x7
} _KINTERRUPT_POLARITY;

typedef enum _KINTERRUPT_MODE {
  LevelSensitive = 0, // ordinal: 0x0
  Latched = 1,        // ordinal: 0x1
} _KINTERRUPT_MODE;

typedef enum PPM_IDLE_BUCKET_TIME_TYPE {
  PpmIdleBucketTimeInQpc = 0,   // ordinal: 0x0
  PpmIdleBucketTimeIn100ns = 1, // ordinal: 0x1
  PpmIdleBucketTimeMaximum = 2, // ordinal: 0x2
} PPM_IDLE_BUCKET_TIME_TYPE;

typedef enum _PROCESSOR_CACHE_TYPE {
  CacheUnified = 0,     // ordinal: 0x0
  CacheInstruction = 1, // ordinal: 0x1
  CacheData = 2,        // ordinal: 0x2
  CacheTrace = 3,       // ordinal: 0x3
} _PROCESSOR_CACHE_TYPE;

typedef enum _POOL_TYPE {
  NonPagedPool = 0,                          // ordinal: 0x0
  NonPagedPoolExecute = 0,                   // ordinal: 0x1
  PagedPool = 1,                             // ordinal: 0x2
  NonPagedPoolMustSucceed = 2,               // ordinal: 0x3
  DontUseThisType = 3,                       // ordinal: 0x4
  NonPagedPoolCacheAligned = 4,              // ordinal: 0x5
  PagedPoolCacheAligned = 5,                 // ordinal: 0x6
  NonPagedPoolCacheAlignedMustS = 6,         // ordinal: 0x7
  MaxPoolType = 7,                           // ordinal: 0x8
  NonPagedPoolBase = 0,                      // ordinal: 0x9
  NonPagedPoolBaseMustSucceed = 2,           // ordinal: 0xa
  NonPagedPoolBaseCacheAligned = 4,          // ordinal: 0xb
  NonPagedPoolBaseCacheAlignedMustS = 6,     // ordinal: 0xc
  NonPagedPoolSession = 32,                  // ordinal: 0xd
  PagedPoolSession = 33,                     // ordinal: 0xe
  NonPagedPoolMustSucceedSession = 34,       // ordinal: 0xf
  DontUseThisTypeSession = 35,               // ordinal: 0x10
  NonPagedPoolCacheAlignedSession = 36,      // ordinal: 0x11
  PagedPoolCacheAlignedSession = 37,         // ordinal: 0x12
  NonPagedPoolCacheAlignedMustSSession = 38, // ordinal: 0x13
  NonPagedPoolNx = 512,                      // ordinal: 0x14
  NonPagedPoolNxCacheAligned = 516,          // ordinal: 0x15
  NonPagedPoolSessionNx = 544,               // ordinal: 0x16
} _POOL_TYPE;

typedef enum _KHETERO_CPU_QOS {
  KHeteroCpuQosDefault = 0,    // ordinal: 0x0
  KHeteroCpuQosHigh = 0,       // ordinal: 0x1
  KHeteroCpuQosMedium = 1,     // ordinal: 0x2
  KHeteroCpuQosLow = 2,        // ordinal: 0x3
  KHeteroCpuQosMultimedia = 3, // ordinal: 0x4
  KHeteroCpuQosDynamic = 4,    // ordinal: 0x5
  KHeteroCpuQosMax = 4,        // ordinal: 0x6
} _KHETERO_CPU_QOS;

typedef enum _PROC_HYPERVISOR_STATE {
  ProcHypervisorNone = 0,       // ordinal: 0x0
  ProcHypervisorPresent = 1,    // ordinal: 0x1
  ProcHypervisorPower = 2,      // ordinal: 0x2
  ProcHypervisorHvCounters = 3, // ordinal: 0x3
} _PROC_HYPERVISOR_STATE;

typedef enum _EXCEPTION_DISPOSITION {
  ExceptionContinueExecution = 0, // ordinal: 0x0
  ExceptionContinueSearch = 1,    // ordinal: 0x1
  ExceptionNestedException = 2,   // ordinal: 0x2
  ExceptionCollidedUnwind = 3,    // ordinal: 0x3
} _EXCEPTION_DISPOSITION;

typedef enum _TP_CALLBACK_PRIORITY {
  TP_CALLBACK_PRIORITY_HIGH = 0,    // ordinal: 0x0
  TP_CALLBACK_PRIORITY_NORMAL = 1,  // ordinal: 0x1
  TP_CALLBACK_PRIORITY_LOW = 2,     // ordinal: 0x2
  TP_CALLBACK_PRIORITY_INVALID = 3, // ordinal: 0x3
  TP_CALLBACK_PRIORITY_COUNT = 3,   // ordinal: 0x4
} _TP_CALLBACK_PRIORITY;

// 0x2 bytes (sizeof)
typedef struct __anon_920 {
  WCHAR ParentId[1]; // offset: 0x0 ordinal: 0x0
} __anon_920;

// 0x8 bytes (sizeof)
typedef struct __anon_918 {
  enum _PNP_VETO_TYPE VetoType;    // offset: 0x0 ordinal: 0x0
  WCHAR DeviceIdVetoNameBuffer[1]; // offset: 0x4 ordinal: 0x1
} __anon_918;

// 0x8 bytes (sizeof)
typedef struct __anon_915 {
  VOID *NotificationStructure; // offset: 0x0 ordinal: 0x0
  WCHAR DeviceId[1];           // offset: 0x4 ordinal: 0x1
} __anon_915;

// 0x2 bytes (sizeof)
typedef struct __anon_914 {
  WCHAR DeviceId[1]; // offset: 0x0 ordinal: 0x0
} __anon_914;

typedef VOID (*__anon_1910)(VOID *, WCHAR *);

// 0x10 bytes (sizeof)
typedef struct __anon_524 {
  enum PROFILE_STATUS DockStatus; // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY ListEntry;   // offset: 0x4 ordinal: 0x1
  WCHAR *SerialNumber;            // offset: 0xc ordinal: 0x2
} __anon_524;

// 0x8 bytes (sizeof)
typedef struct _QUAD {
  union {
    LONGLONG UseThisFieldToCopy; // offset: 0x0 ordinal: 0x0
    double DoNotUseThisField;    // offset: 0x0 ordinal: 0x1
  };
} _QUAD;

typedef LONGLONG (*__anon_1159)();

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE {
  StandardDesign = 0,  // ordinal: 0x0
  NEC98x86 = 1,        // ordinal: 0x1
  EndAlternatives = 2, // ordinal: 0x2
} _ALTERNATIVE_ARCHITECTURE_TYPE;

// 0x8 bytes (sizeof)
typedef struct _HEAP_OPPORTUNISTIC_LARGE_PAGE_STATS {
  ULONG SmallPagesInUseWithinLarge;  // offset: 0x0 ordinal: 0x0
  ULONG OpportunisticLargePageCount; // offset: 0x4 ordinal: 0x1
} _HEAP_OPPORTUNISTIC_LARGE_PAGE_STATS;

// 0x24 bytes (sizeof)
typedef struct _FAST_OWNER_ENTRY_INTERNAL {
  struct _LIST_ENTRY ListEntry;     // offset: 0x0 ordinal: 0x0
  UCHAR AbLockHandle;               // offset: 0x8 ordinal: 0x1
  UCHAR Disowned : 1;               // offset: 0x9 ordinal: 0x2
  UCHAR DynamicallyAllocated : 1;   // offset: 0x9 ordinal: 0x3
  UCHAR CallerExclusive : 1;        // offset: 0x9 ordinal: 0x4
  UCHAR IsSublistHead;              // offset: 0xa ordinal: 0x5
  UCHAR IsWaiting;                  // offset: 0xb ordinal: 0x6
  VOID *LockAddress;                // offset: 0xc ordinal: 0x7
  VOID *ThreadAddress;              // offset: 0x10 ordinal: 0x8
  struct _LIST_ENTRY SublistHead;   // offset: 0x14 ordinal: 0x9
  struct _LIST_ENTRY LockListEntry; // offset: 0x1c ordinal: 0xa
} _FAST_OWNER_ENTRY_INTERNAL;

// 0x1 bytes (sizeof)
typedef union __anon_3200 {
  UCHAR AsUCHAR;                // offset: 0x0 ordinal: 0x0
  UCHAR NoDomainAccounting : 1; // offset: 0x0 ordinal: 0x1
  UCHAR IncreasePolicy : 2;     // offset: 0x0 ordinal: 0x2
  UCHAR DecreasePolicy : 2;     // offset: 0x0 ordinal: 0x3
  UCHAR Reserved : 3;           // offset: 0x0 ordinal: 0x4
} __anon_3200;

// 0x8 bytes (sizeof)
typedef struct _VF_TRACKER_STAMP {
  VOID *Thread;        // offset: 0x0 ordinal: 0x0
  UCHAR Flags : 8;     // offset: 0x4 ordinal: 0x1
  UCHAR OldIrql : 8;   // offset: 0x5 ordinal: 0x2
  UCHAR NewIrql : 8;   // offset: 0x6 ordinal: 0x3
  UCHAR Processor : 8; // offset: 0x7 ordinal: 0x4
} _VF_TRACKER_STAMP;

// 0x1 bytes (sizeof)
typedef struct __anon_2900 {
  UCHAR EntireWsle; // offset: 0x0 ordinal: 0x0
} __anon_2900;

// 0x1 bytes (sizeof)
typedef struct __anon_2899 {
  UCHAR Age : 4;        // offset: 0x0 ordinal: 0x0
  UCHAR Protection : 3; // offset: 0x0 ordinal: 0x1
  UCHAR Reserved : 1;   // offset: 0x0 ordinal: 0x2
} __anon_2899;

// 0x1 bytes (sizeof)
typedef union __anon_2898 {
  struct __anon_2899 e1; // offset: 0x0 ordinal: 0x0
  struct __anon_2900 e2; // offset: 0x0 ordinal: 0x1
} __anon_2898;

// 0x1 bytes (sizeof)
typedef struct _MI_WSLE {
  union __anon_2898 u1; // offset: 0x0 ordinal: 0x0
} _MI_WSLE;

// 0x1 bytes (sizeof)
typedef union _PS_TRUSTLET_ATTRIBUTE_ACCESSRIGHTS {
  UCHAR Trustlet : 1;    // offset: 0x0 ordinal: 0x0
  UCHAR Ntos : 1;        // offset: 0x0 ordinal: 0x1
  UCHAR WriteHandle : 1; // offset: 0x0 ordinal: 0x2
  UCHAR ReadHandle : 1;  // offset: 0x0 ordinal: 0x3
  UCHAR Reserved : 4;    // offset: 0x0 ordinal: 0x4
  UCHAR AccessRights;    // offset: 0x0 ordinal: 0x5
} _PS_TRUSTLET_ATTRIBUTE_ACCESSRIGHTS;

// 0x2 bytes (sizeof)
typedef struct __anon_2633 {
  UCHAR SecondaryBus;   // offset: 0x0 ordinal: 0x0
  UCHAR SubordinateBus; // offset: 0x1 ordinal: 0x1
} __anon_2633;

// 0x4 bytes (sizeof)
typedef struct __anon_2632 {
  UCHAR Bus;      // offset: 0x0 ordinal: 0x0
  UCHAR Device;   // offset: 0x1 ordinal: 0x1
  UCHAR Function; // offset: 0x2 ordinal: 0x2
  UCHAR Reserved; // offset: 0x3 ordinal: 0x3
} __anon_2632;

// 0x8 bytes (sizeof)
typedef struct _MAP_REGISTER_ENTRY {
  VOID *MapRegister;   // offset: 0x0 ordinal: 0x0
  UCHAR WriteToDevice; // offset: 0x4 ordinal: 0x1
} _MAP_REGISTER_ENTRY;

typedef UCHAR (*__anon_2513)(UCHAR);

typedef VOID (*__anon_2486)(struct _MDL *, UCHAR);

typedef VOID (*__anon_2476)(UCHAR, UCHAR);

typedef UCHAR (*__anon_2450)();

typedef VOID (*__anon_2445)(UCHAR);

// 0x1 bytes (sizeof)
typedef union _XPF_MC_BANK_FLAGS {
  UCHAR ClearOnInitializationRW : 1; // offset: 0x0 ordinal: 0x0
  UCHAR ControlDataRW : 1;           // offset: 0x0 ordinal: 0x1
  UCHAR Reserved : 6;                // offset: 0x0 ordinal: 0x2
  UCHAR AsUCHAR;                     // offset: 0x0 ordinal: 0x3
} _XPF_MC_BANK_FLAGS;

// 0x1e bytes (sizeof)
typedef struct _TOKEN_AUDIT_POLICY {
  UCHAR PerUserPolicy[30]; // offset: 0x0 ordinal: 0x0
} _TOKEN_AUDIT_POLICY;

// 0x1f bytes (sizeof)
typedef struct _SEP_AUDIT_POLICY {
  struct _TOKEN_AUDIT_POLICY AdtTokenPolicy; // offset: 0x0 ordinal: 0x0
  UCHAR PolicySetStatus;                     // offset: 0x1e ordinal: 0x1
} _SEP_AUDIT_POLICY;

// 0x1 bytes (sizeof)
typedef struct _ETW_LOGGER_HANDLE {
  UCHAR DereferenceAndLeave; // offset: 0x0 ordinal: 0x0
} _ETW_LOGGER_HANDLE;

// 0x4 bytes (sizeof)
typedef struct __anon_2190 {
  UCHAR MajorVersion;    // offset: 0x0 ordinal: 0x0
  UCHAR MinorVersion;    // offset: 0x1 ordinal: 0x1
  UCHAR SubVersion;      // offset: 0x2 ordinal: 0x2
  UCHAR SubMinorVersion; // offset: 0x3 ordinal: 0x3
} __anon_2190;

// 0x1 bytes (sizeof)
typedef struct __anon_2078 {
  UCHAR ReferenceCache : 1; // offset: 0x0 ordinal: 0x0
  UCHAR Lookaside : 1;      // offset: 0x0 ordinal: 0x1
  UCHAR Initializing : 1;   // offset: 0x0 ordinal: 0x2
  UCHAR Deleted : 1;        // offset: 0x0 ordinal: 0x3
} __anon_2078;

// 0x1 bytes (sizeof)
typedef union __anon_2079 {
  struct __anon_2078 s1; // offset: 0x0 ordinal: 0x0
  UCHAR Flags;           // offset: 0x0 ordinal: 0x1
} __anon_2079;

// 0x2 bytes (sizeof)
typedef struct _HEAP_LFH_SUBSEGMENT_STAT {
  UCHAR Index; // offset: 0x0 ordinal: 0x0
  UCHAR Count; // offset: 0x1 ordinal: 0x1
} _HEAP_LFH_SUBSEGMENT_STAT;

// 0x4 bytes (sizeof)
typedef union _HEAP_LFH_SUBSEGMENT_STATS {
  struct _HEAP_LFH_SUBSEGMENT_STAT Buckets[2]; // offset: 0x0 ordinal: 0x0
  VOID *AllStats;                              // offset: 0x0 ordinal: 0x1
} _HEAP_LFH_SUBSEGMENT_STATS;

// 0x1 bytes (sizeof)
typedef union __anon_2003 {
  UCHAR LargePagePolicy : 3;      // offset: 0x0 ordinal: 0x0
  UCHAR FullDecommit : 1;         // offset: 0x0 ordinal: 0x1
  UCHAR ReleaseEmptySegments : 1; // offset: 0x0 ordinal: 0x2
  UCHAR AllFlags;                 // offset: 0x0 ordinal: 0x3
} __anon_2003;

typedef UCHAR (*__anon_1953)(VOID *);

typedef UCHAR (*__anon_1939)(VOID *, UCHAR);

// 0x10 bytes (sizeof)
typedef struct _CACHE_MANAGER_CALLBACKS {
  UCHAR (*AcquireForLazyWrite)(VOID *, UCHAR); // offset: 0x0 ordinal: 0x0
  VOID (*ReleaseFromLazyWrite)(VOID *);        // offset: 0x4 ordinal: 0x1
  UCHAR (*AcquireForReadAhead)(VOID *, UCHAR); // offset: 0x8 ordinal: 0x2
  VOID (*ReleaseFromReadAhead)(VOID *);        // offset: 0xc ordinal: 0x3
} _CACHE_MANAGER_CALLBACKS;

// 0x1 bytes (sizeof)
typedef struct _MMPFNENTRY3 {
  UCHAR Priority : 3;           // offset: 0x0 ordinal: 0x0
  UCHAR OnProtectedStandby : 1; // offset: 0x0 ordinal: 0x1
  UCHAR InPageError : 1;        // offset: 0x0 ordinal: 0x2
  UCHAR SystemChargedPage : 1;  // offset: 0x0 ordinal: 0x3
  UCHAR RemovalRequested : 1;   // offset: 0x0 ordinal: 0x4
  UCHAR ParityError : 1;        // offset: 0x0 ordinal: 0x5
} _MMPFNENTRY3;

// 0x1 bytes (sizeof)
typedef struct _MMPFNENTRY1 {
  UCHAR PageLocation : 3;    // offset: 0x0 ordinal: 0x0
  UCHAR WriteInProgress : 1; // offset: 0x0 ordinal: 0x1
  UCHAR Modified : 1;        // offset: 0x0 ordinal: 0x2
  UCHAR ReadInProgress : 1;  // offset: 0x0 ordinal: 0x3
  UCHAR CacheAttribute : 2;  // offset: 0x0 ordinal: 0x4
} _MMPFNENTRY1;

// 0x4 bytes (sizeof)
typedef struct _MMPAGE_FILE_EXPANSION_FLAGS {
  UCHAR PageFileNumber : 8;        // offset: 0x0 ordinal: 0x0
  UCHAR Spare1 : 8;                // offset: 0x1 ordinal: 0x1
  UCHAR Spare2 : 8;                // offset: 0x2 ordinal: 0x2
  UCHAR IgnoreCurrentCommit : 1;   // offset: 0x3 ordinal: 0x3
  UCHAR IncreaseMinimumSize : 1;   // offset: 0x3 ordinal: 0x4
  UCHAR AttemptForCantExtend : 1;  // offset: 0x3 ordinal: 0x5
  UCHAR UnusedSegmentDeletion : 1; // offset: 0x3 ordinal: 0x6
  UCHAR PageFileContract : 1;      // offset: 0x3 ordinal: 0x7
  UCHAR NoWait : 1;                // offset: 0x3 ordinal: 0x8
  UCHAR Spare3 : 2;                // offset: 0x3 ordinal: 0x9
} _MMPAGE_FILE_EXPANSION_FLAGS;

// 0x14 bytes (sizeof)
typedef struct _MI_REBUILD_LARGE_PAGE_TIMER {
  struct _WORK_QUEUE_ITEM WorkItem; // offset: 0x0 ordinal: 0x0
  UCHAR SecondsLeft;                // offset: 0x10 ordinal: 0x1
  UCHAR RebuildActive;              // offset: 0x11 ordinal: 0x2
  UCHAR NextPassDelta;              // offset: 0x12 ordinal: 0x3
  UCHAR LargeSubPagesActive;        // offset: 0x13 ordinal: 0x4
} _MI_REBUILD_LARGE_PAGE_TIMER;

// 0x3 bytes (sizeof)
typedef struct _MI_RESTRICTED_MODWRITES {
  UCHAR MaximumClusterPages;  // offset: 0x0 ordinal: 0x0
  UCHAR ReducedClusterWrites; // offset: 0x1 ordinal: 0x1
  UCHAR ImposeDelay;          // offset: 0x2 ordinal: 0x2
} _MI_RESTRICTED_MODWRITES;

// 0x18 bytes (sizeof)
typedef struct wil_details_FeatureTestState {
  enum wil_details_FeatureTestStateKind kind; // offset: 0x0 ordinal: 0x0
  ULONG featureId;                            // offset: 0x4 ordinal: 0x1
  enum wil_FeatureEnabledState state;         // offset: 0x8 ordinal: 0x2
  UCHAR variant;                              // offset: 0xc ordinal: 0x3
  ULONG payload;                              // offset: 0x10 ordinal: 0x4
  struct wil_details_FeatureTestState *next;  // offset: 0x14 ordinal: 0x5
} wil_details_FeatureTestState;

// 0x18 bytes (sizeof)
typedef struct wil_FeatureState {
  enum wil_FeatureEnabledState enabledState;      // offset: 0x0 ordinal: 0x0
  UCHAR variant;                                  // offset: 0x4 ordinal: 0x1
  enum wil_FeatureVariantPayloadKind payloadKind; // offset: 0x8 ordinal: 0x2
  ULONG payload;                                  // offset: 0xc ordinal: 0x3
  LONG hasNotification;                           // offset: 0x10 ordinal: 0x4
  LONG isVariantConfiguration;                    // offset: 0x14 ordinal: 0x5
} wil_FeatureState;

// 0x1 bytes (sizeof)
typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS {
  UCHAR FRUId : 1;    // offset: 0x0 ordinal: 0x0
  UCHAR FRUText : 1;  // offset: 0x0 ordinal: 0x1
  UCHAR Reserved : 6; // offset: 0x0 ordinal: 0x2
  UCHAR AsUCHAR;      // offset: 0x0 ordinal: 0x3
} _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS;

// 0x2 bytes (sizeof)
typedef struct _ETW_SYSTEM_LOGGER {
  UCHAR LoggerId;  // offset: 0x0 ordinal: 0x0
  UCHAR ClockType; // offset: 0x1 ordinal: 0x1
} _ETW_SYSTEM_LOGGER;

typedef VOID (*__anon_1008)(VOID *, UCHAR);

// 0x8 bytes (sizeof)
typedef struct _VF_ADDRESS_RANGE {
  UCHAR *Start; // offset: 0x0 ordinal: 0x0
  UCHAR *End;   // offset: 0x4 ordinal: 0x1
} _VF_ADDRESS_RANGE;

// 0x1 bytes (sizeof)
typedef struct __anon_825 {
  UCHAR Lock; // offset: 0x0 ordinal: 0x0
} __anon_825;

// 0x1 bytes (sizeof)
typedef struct _PS_PROTECTION {
  union {
    UCHAR Level;    // offset: 0x0 ordinal: 0x0
    UCHAR Type : 3; // offset: 0x0 ordinal: 0x1
  };
  UCHAR Audit : 1;  // offset: 0x0 ordinal: 0x2
  UCHAR Signer : 4; // offset: 0x0 ordinal: 0x3
} _PS_PROTECTION;

typedef UCHAR (*__anon_715)(struct _FILE_OBJECT *, struct _MDL *,
                            struct _DEVICE_OBJECT *);

// 0x8 bytes (sizeof)
typedef struct _PEP_WORK_DEVICE_IDLE {
  struct POHANDLE__ *DeviceHandle; // offset: 0x0 ordinal: 0x0
  UCHAR IgnoreIdleTimeout;         // offset: 0x4 ordinal: 0x1
} _PEP_WORK_DEVICE_IDLE;

// 0x8 bytes (sizeof)
typedef struct _PEP_WORK_DEVICE_POWER {
  struct POHANDLE__ *DeviceHandle; // offset: 0x0 ordinal: 0x0
  UCHAR PowerRequired;             // offset: 0x4 ordinal: 0x1
} _PEP_WORK_DEVICE_POWER;

typedef UCHAR (*__anon_472)(struct _PEP_CRASHDUMP_INFORMATION *);

typedef UCHAR (*__anon_441)(VOID *);

// 0x1 bytes (sizeof)
typedef union _KEXECUTE_OPTIONS {
  UCHAR ExecuteDisable : 1;                  // offset: 0x0 ordinal: 0x0
  UCHAR ExecuteEnable : 1;                   // offset: 0x0 ordinal: 0x1
  UCHAR DisableThunkEmulation : 1;           // offset: 0x0 ordinal: 0x2
  UCHAR Permanent : 1;                       // offset: 0x0 ordinal: 0x3
  UCHAR ExecuteDispatchEnable : 1;           // offset: 0x0 ordinal: 0x4
  UCHAR ImageDispatchEnable : 1;             // offset: 0x0 ordinal: 0x5
  UCHAR DisableExceptionChainValidation : 1; // offset: 0x0 ordinal: 0x6
  UCHAR Spare : 1;                           // offset: 0x0 ordinal: 0x7
  UCHAR ExecuteOptions;                      // offset: 0x0 ordinal: 0x8
  UCHAR ExecuteOptionsNV;                    // offset: 0x0 ordinal: 0x9
} _KEXECUTE_OPTIONS;

// 0x2 bytes (sizeof)
typedef struct _PROC_PERF_LOAD {
  UCHAR BusyPercentage;      // offset: 0x0 ordinal: 0x0
  UCHAR FrequencyPercentage; // offset: 0x1 ordinal: 0x1
} _PROC_PERF_LOAD;

// 0x1 bytes (sizeof)
typedef struct _flags {
  UCHAR Removable : 1;            // offset: 0x0 ordinal: 0x0
  UCHAR GroupAssigned : 1;        // offset: 0x0 ordinal: 0x1
  UCHAR GroupCommitted : 1;       // offset: 0x0 ordinal: 0x2
  UCHAR GroupAssignmentFixed : 1; // offset: 0x0 ordinal: 0x3
  UCHAR ProcessorOnly : 1;        // offset: 0x0 ordinal: 0x4
  UCHAR Fill : 3;                 // offset: 0x0 ordinal: 0x5
} _flags;

// 0x8 bytes (sizeof)
typedef struct __anon_2791 {
  UCHAR Pch;                // offset: 0x0 ordinal: 0x0
  UCHAR EmbeddedController; // offset: 0x1 ordinal: 0x1
  UCHAR Reserved[6];        // offset: 0x2 ordinal: 0x2
} __anon_2791;

// 0x6 bytes (sizeof)
typedef struct _SID_IDENTIFIER_AUTHORITY {
  UCHAR Value[6]; // offset: 0x0 ordinal: 0x0
} _SID_IDENTIFIER_AUTHORITY;

// 0x1 bytes (sizeof)
typedef union _KWAIT_STATUS_REGISTER {
  UCHAR Flags;        // offset: 0x0 ordinal: 0x0
  UCHAR State : 3;    // offset: 0x0 ordinal: 0x1
  UCHAR Affinity : 1; // offset: 0x0 ordinal: 0x2
  UCHAR Priority : 1; // offset: 0x0 ordinal: 0x3
  UCHAR Apc : 1;      // offset: 0x0 ordinal: 0x4
  UCHAR UserApc : 1;  // offset: 0x0 ordinal: 0x5
  UCHAR Alert : 1;    // offset: 0x0 ordinal: 0x6
} _KWAIT_STATUS_REGISTER;

// 0x4 bytes (sizeof)
typedef struct __anon_266 {
  UCHAR BaseMid; // offset: 0x0 ordinal: 0x0
  UCHAR Flags1;  // offset: 0x1 ordinal: 0x1
  UCHAR Flags2;  // offset: 0x2 ordinal: 0x2
  UCHAR BaseHi;  // offset: 0x3 ordinal: 0x3
} __anon_266;

// 0x10 bytes (sizeof)
typedef struct _RTL_BALANCED_LINKS {
  struct _RTL_BALANCED_LINKS *Parent;     // offset: 0x0 ordinal: 0x0
  struct _RTL_BALANCED_LINKS *LeftChild;  // offset: 0x4 ordinal: 0x1
  struct _RTL_BALANCED_LINKS *RightChild; // offset: 0x8 ordinal: 0x2
  CHAR Balance;                           // offset: 0xc ordinal: 0x3
  UCHAR Reserved[3];                      // offset: 0xd ordinal: 0x4
} _RTL_BALANCED_LINKS;

// 0x14 bytes (sizeof)
typedef struct _KTMOBJECT_NAMESPACE_LINK {
  struct _RTL_BALANCED_LINKS Links; // offset: 0x0 ordinal: 0x0
  UCHAR Expired;                    // offset: 0x10 ordinal: 0x1
} _KTMOBJECT_NAMESPACE_LINK;

// 0x8 bytes (sizeof)
typedef struct __anon_828 {
  UCHAR InPath;                              // offset: 0x0 ordinal: 0x0
  UCHAR Reserved[3];                         // offset: 0x1 ordinal: 0x1
  enum _DEVICE_USAGE_NOTIFICATION_TYPE Type; // offset: 0x4 ordinal: 0x2
} __anon_828;

// 0x6 bytes (sizeof)
typedef struct _PROC_IDLE_POLICY {
  UCHAR PromotePercent;     // offset: 0x0 ordinal: 0x0
  UCHAR DemotePercent;      // offset: 0x1 ordinal: 0x1
  UCHAR PromotePercentBase; // offset: 0x2 ordinal: 0x2
  UCHAR DemotePercentBase;  // offset: 0x3 ordinal: 0x3
  UCHAR AllowScaling;       // offset: 0x4 ordinal: 0x4
  UCHAR ForceLightIdle;     // offset: 0x5 ordinal: 0x5
} _PROC_IDLE_POLICY;

// 0x2024 bytes (sizeof)
typedef struct _KiIoAccessMap {
  UCHAR DirectionMap[32]; // offset: 0x0 ordinal: 0x0
  UCHAR IoMap[8196];      // offset: 0x20 ordinal: 0x1
} _KiIoAccessMap;

// 0x8 bytes (sizeof)
typedef struct _RTL_RB_TREE {
  struct _RTL_BALANCED_NODE *Root; // offset: 0x0 ordinal: 0x0
  UCHAR Encoded : 1;               // offset: 0x4 ordinal: 0x1
  struct _RTL_BALANCED_NODE *Min;  // offset: 0x4 ordinal: 0x2
} _RTL_RB_TREE;

typedef enum _NT_PRODUCT_TYPE {
  NtProductWinNt = 1,    // ordinal: 0x0
  NtProductLanManNt = 2, // ordinal: 0x1
  NtProductServer = 3,   // ordinal: 0x2
} _NT_PRODUCT_TYPE;

// 0x8 bytes (sizeof)
typedef struct _MI_COMBINE_PAGE_LISTHEAD {
  struct _RTL_AVL_TREE Table; // offset: 0x0 ordinal: 0x0
  LONG Lock;                  // offset: 0x4 ordinal: 0x1
} _MI_COMBINE_PAGE_LISTHEAD;

// 0x4 bytes (sizeof)
typedef union wil_details_FeaturePropertyCache {
  struct wil_details_FeatureProperties cache;   // offset: 0x0 ordinal: 0x0
  struct wil_details_VariantProperties variant; // offset: 0x0 ordinal: 0x1
  LONG var;                                     // offset: 0x0 ordinal: 0x2
} wil_details_FeaturePropertyCache;

// 0x8 bytes (sizeof)
typedef struct wil_details_FeatureVariantPropertyCache {
  union wil_details_FeaturePropertyCache
      propertyCache; // offset: 0x0 ordinal: 0x0
  ULONG payloadId;   // offset: 0x4 ordinal: 0x1
} wil_details_FeatureVariantPropertyCache;

// 0x4 bytes (sizeof)
typedef struct _HEAP_FREE_ENTRY_EXTRA {
  USHORT TagIndex;           // offset: 0x0 ordinal: 0x0
  USHORT FreeBackTraceIndex; // offset: 0x2 ordinal: 0x1
} _HEAP_FREE_ENTRY_EXTRA;

// 0x2 bytes (sizeof)
typedef union __anon_2901 {
  USHORT AsUSHORT;         // offset: 0x0 ordinal: 0x0
  USHORT AllowScaling : 1; // offset: 0x0 ordinal: 0x1
  USHORT Disabled : 1;     // offset: 0x0 ordinal: 0x2
  USHORT Reserved : 14;    // offset: 0x0 ordinal: 0x3
} __anon_2901;

// 0x2 bytes (sizeof)
typedef union __anon_2889 {
  USHORT SignatureLevel : 4; // offset: 0x0 ordinal: 0x0
  USHORT SignatureType : 3;  // offset: 0x0 ordinal: 0x1
  USHORT Unused : 9;         // offset: 0x0 ordinal: 0x2
  USHORT EntireField;        // offset: 0x0 ordinal: 0x3
} __anon_2889;

// 0x2 bytes (sizeof)
typedef union _HAL_UNMASKED_INTERRUPT_FLAGS {
  USHORT SecondaryInterrupt : 1; // offset: 0x0 ordinal: 0x0
  USHORT Reserved : 15;          // offset: 0x0 ordinal: 0x1
  USHORT AsUSHORT;               // offset: 0x0 ordinal: 0x2
} _HAL_UNMASKED_INTERRUPT_FLAGS;

// 0x8040 bytes (sizeof)
typedef struct _STACK_TABLE {
  USHORT NumStackTraces;                    // offset: 0x0 ordinal: 0x0
  USHORT TraceCapacity;                     // offset: 0x2 ordinal: 0x1
  struct _OBJECT_REF_TRACE *StackTrace[16]; // offset: 0x4 ordinal: 0x2
  USHORT StackTableHash[16381];             // offset: 0x44 ordinal: 0x3
} _STACK_TABLE;

// 0x2 bytes (sizeof)
typedef union _WHEA_NOTIFICATION_FLAGS {
  USHORT PollIntervalRW : 1;             // offset: 0x0 ordinal: 0x0
  USHORT SwitchToPollingThresholdRW : 1; // offset: 0x0 ordinal: 0x1
  USHORT SwitchToPollingWindowRW : 1;    // offset: 0x0 ordinal: 0x2
  USHORT ErrorThresholdRW : 1;           // offset: 0x0 ordinal: 0x3
  USHORT ErrorThresholdWindowRW : 1;     // offset: 0x0 ordinal: 0x4
  USHORT Reserved : 11;                  // offset: 0x0 ordinal: 0x5
  USHORT AsUSHORT;                       // offset: 0x0 ordinal: 0x6
} _WHEA_NOTIFICATION_FLAGS;

// 0x2 bytes (sizeof)
typedef union _AER_BRIDGE_DESCRIPTOR_FLAGS {
  USHORT UncorrectableErrorMaskRW : 1;          // offset: 0x0 ordinal: 0x0
  USHORT UncorrectableErrorSeverityRW : 1;      // offset: 0x0 ordinal: 0x1
  USHORT CorrectableErrorMaskRW : 1;            // offset: 0x0 ordinal: 0x2
  USHORT AdvancedCapsAndControlRW : 1;          // offset: 0x0 ordinal: 0x3
  USHORT SecondaryUncorrectableErrorMaskRW : 1; // offset: 0x0 ordinal: 0x4
  USHORT SecondaryUncorrectableErrorSevRW : 1;  // offset: 0x0 ordinal: 0x5
  USHORT SecondaryCapsAndControlRW : 1;         // offset: 0x0 ordinal: 0x6
  USHORT Reserved : 9;                          // offset: 0x0 ordinal: 0x7
  USHORT AsUSHORT;                              // offset: 0x0 ordinal: 0x8
} _AER_BRIDGE_DESCRIPTOR_FLAGS;

// 0x2 bytes (sizeof)
typedef union _AER_ENDPOINT_DESCRIPTOR_FLAGS {
  USHORT UncorrectableErrorMaskRW : 1;     // offset: 0x0 ordinal: 0x0
  USHORT UncorrectableErrorSeverityRW : 1; // offset: 0x0 ordinal: 0x1
  USHORT CorrectableErrorMaskRW : 1;       // offset: 0x0 ordinal: 0x2
  USHORT AdvancedCapsAndControlRW : 1;     // offset: 0x0 ordinal: 0x3
  USHORT Reserved : 12;                    // offset: 0x0 ordinal: 0x4
  USHORT AsUSHORT;                         // offset: 0x0 ordinal: 0x5
} _AER_ENDPOINT_DESCRIPTOR_FLAGS;

// 0x2 bytes (sizeof)
typedef union _AER_ROOTPORT_DESCRIPTOR_FLAGS {
  USHORT UncorrectableErrorMaskRW : 1;     // offset: 0x0 ordinal: 0x0
  USHORT UncorrectableErrorSeverityRW : 1; // offset: 0x0 ordinal: 0x1
  USHORT CorrectableErrorMaskRW : 1;       // offset: 0x0 ordinal: 0x2
  USHORT AdvancedCapsAndControlRW : 1;     // offset: 0x0 ordinal: 0x3
  USHORT RootErrorCommandRW : 1;           // offset: 0x0 ordinal: 0x4
  USHORT Reserved : 11;                    // offset: 0x0 ordinal: 0x5
  USHORT AsUSHORT;                         // offset: 0x0 ordinal: 0x6
} _AER_ROOTPORT_DESCRIPTOR_FLAGS;

// 0x4 bytes (sizeof)
typedef struct _WHEA_IPF_CPE_DESCRIPTOR {
  USHORT Type;    // offset: 0x0 ordinal: 0x0
  UCHAR Enabled;  // offset: 0x2 ordinal: 0x1
  UCHAR Reserved; // offset: 0x3 ordinal: 0x2
} _WHEA_IPF_CPE_DESCRIPTOR;

// 0x4 bytes (sizeof)
typedef struct _WHEA_IPF_CMC_DESCRIPTOR {
  USHORT Type;    // offset: 0x0 ordinal: 0x0
  UCHAR Enabled;  // offset: 0x2 ordinal: 0x1
  UCHAR Reserved; // offset: 0x3 ordinal: 0x2
} _WHEA_IPF_CMC_DESCRIPTOR;

// 0x4 bytes (sizeof)
typedef struct _WHEA_IPF_MCA_DESCRIPTOR {
  USHORT Type;    // offset: 0x0 ordinal: 0x0
  UCHAR Enabled;  // offset: 0x2 ordinal: 0x1
  UCHAR Reserved; // offset: 0x3 ordinal: 0x2
} _WHEA_IPF_MCA_DESCRIPTOR;

// 0x3 bytes (sizeof)
typedef struct _WHEA_XPF_NMI_DESCRIPTOR {
  USHORT Type;   // offset: 0x0 ordinal: 0x0
  UCHAR Enabled; // offset: 0x2 ordinal: 0x1
} _WHEA_XPF_NMI_DESCRIPTOR;

// 0x10 bytes (sizeof)
typedef struct _OBJECT_HEADER_CREATOR_INFO {
  struct _LIST_ENTRY TypeList;  // offset: 0x0 ordinal: 0x0
  VOID *CreatorUniqueProcess;   // offset: 0x8 ordinal: 0x1
  USHORT CreatorBackTraceIndex; // offset: 0xc ordinal: 0x2
  USHORT Reserved1;             // offset: 0xe ordinal: 0x3
} _OBJECT_HEADER_CREATOR_INFO;

// 0x8 bytes (sizeof)
typedef struct _ACL {
  UCHAR AclRevision; // offset: 0x0 ordinal: 0x0
  UCHAR Sbz1;        // offset: 0x1 ordinal: 0x1
  USHORT AclSize;    // offset: 0x2 ordinal: 0x2
  USHORT AceCount;   // offset: 0x4 ordinal: 0x3
  USHORT Sbz2;       // offset: 0x6 ordinal: 0x4
} _ACL;

// 0x14 bytes (sizeof)
typedef struct _SECURITY_DESCRIPTOR {
  UCHAR Revision;    // offset: 0x0 ordinal: 0x0
  UCHAR Sbz1;        // offset: 0x1 ordinal: 0x1
  USHORT Control;    // offset: 0x2 ordinal: 0x2
  VOID *Owner;       // offset: 0x4 ordinal: 0x3
  VOID *Group;       // offset: 0x8 ordinal: 0x4
  struct _ACL *Sacl; // offset: 0xc ordinal: 0x5
  struct _ACL *Dacl; // offset: 0x10 ordinal: 0x6
} _SECURITY_DESCRIPTOR;

// 0x10 bytes (sizeof)
typedef struct _ETW_SYSTEMTIME {
  USHORT Year;         // offset: 0x0 ordinal: 0x0
  USHORT Month;        // offset: 0x2 ordinal: 0x1
  USHORT DayOfWeek;    // offset: 0x4 ordinal: 0x2
  USHORT Day;          // offset: 0x6 ordinal: 0x3
  USHORT Hour;         // offset: 0x8 ordinal: 0x4
  USHORT Minute;       // offset: 0xa ordinal: 0x5
  USHORT Second;       // offset: 0xc ordinal: 0x6
  USHORT Milliseconds; // offset: 0xe ordinal: 0x7
} _ETW_SYSTEMTIME;

// 0x8 bytes (sizeof)
typedef struct _IO_IRP_EXT_TRACK_OFFSET_HEADER {
  USHORT Validation; // offset: 0x0 ordinal: 0x0
  USHORT Flags;      // offset: 0x2 ordinal: 0x1
  VOID(*TrackedOffsetCallback)
  (struct _IO_IRP_EXT_TRACK_OFFSET_HEADER *,
   struct _IO_IRP_EXT_TRACK_OFFSET_HEADER *,
   LONGLONG); // offset: 0x4 ordinal: 0x2
} _IO_IRP_EXT_TRACK_OFFSET_HEADER;

typedef VOID (*__anon_2172)(struct _IO_IRP_EXT_TRACK_OFFSET_HEADER *,
                            struct _IO_IRP_EXT_TRACK_OFFSET_HEADER *, LONGLONG);

// 0x2 bytes (sizeof)
typedef union _HEAP_SEGMENT_MGR_COMMIT_STATE {
  USHORT CommittedPageCount : 11;          // offset: 0x0 ordinal: 0x0
  USHORT Spare : 3;                        // offset: 0x0 ordinal: 0x1
  USHORT LargePageOperationInProgress : 1; // offset: 0x0 ordinal: 0x2
  USHORT LargePageCommit : 1;              // offset: 0x0 ordinal: 0x3
  USHORT EntireUShortV;                    // offset: 0x0 ordinal: 0x4
  USHORT EntireUShort;                     // offset: 0x0 ordinal: 0x5
} _HEAP_SEGMENT_MGR_COMMIT_STATE;

// 0x2 bytes (sizeof)
typedef struct _HEAP_VS_UNUSED_BYTES_INFO {
  USHORT UnusedBytes : 13;  // offset: 0x0 ordinal: 0x0
  USHORT LfhSubsegment : 1; // offset: 0x0 ordinal: 0x1
  USHORT ExtraPresent : 1;  // offset: 0x0 ordinal: 0x2
  USHORT OneByteUnused : 1; // offset: 0x0 ordinal: 0x3
  UCHAR Bytes[2];           // offset: 0x0 ordinal: 0x4
} _HEAP_VS_UNUSED_BYTES_INFO;

// 0x2 bytes (sizeof)
typedef struct _HEAP_LFH_UNUSED_BYTES_INFO {
  USHORT UnusedBytes : 14;  // offset: 0x0 ordinal: 0x0
  USHORT ExtraPresent : 1;  // offset: 0x0 ordinal: 0x1
  USHORT OneByteUnused : 1; // offset: 0x0 ordinal: 0x2
  UCHAR Bytes[2];           // offset: 0x0 ordinal: 0x3
} _HEAP_LFH_UNUSED_BYTES_INFO;

// 0x4 bytes (sizeof)
typedef union _HEAP_LFH_ONDEMAND_POINTER {
  USHORT Invalid : 1;              // offset: 0x0 ordinal: 0x0
  USHORT AllocationInProgress : 1; // offset: 0x0 ordinal: 0x1
  USHORT Spare0 : 14;              // offset: 0x0 ordinal: 0x2
  USHORT UsageData;                // offset: 0x2 ordinal: 0x3
  VOID *AllBits;                   // offset: 0x0 ordinal: 0x4
} _HEAP_LFH_ONDEMAND_POINTER;

// 0x4 bytes (sizeof)
typedef struct _RTL_HP_LFH_CONFIG {
  USHORT MaxBlockSize;                  // offset: 0x0 ordinal: 0x0
  USHORT WitholdPageCrossingBlocks : 1; // offset: 0x2 ordinal: 0x1
  USHORT DisableRandomization : 1;      // offset: 0x2 ordinal: 0x2
} _RTL_HP_LFH_CONFIG;

// 0x8 bytes (sizeof)
typedef struct _SEGMENT_HEAP_EXTRA {
  USHORT AllocationTag;       // offset: 0x0 ordinal: 0x0
  UCHAR InterceptorIndex : 4; // offset: 0x2 ordinal: 0x1
  UCHAR UserFlags : 4;        // offset: 0x2 ordinal: 0x2
  UCHAR ExtraSizeInUnits;     // offset: 0x3 ordinal: 0x3
  VOID *Settable;             // offset: 0x4 ordinal: 0x4
} _SEGMENT_HEAP_EXTRA;

// 0x8 bytes (sizeof)
typedef struct _PCW_COUNTER_DESCRIPTOR {
  USHORT Id;          // offset: 0x0 ordinal: 0x0
  USHORT StructIndex; // offset: 0x2 ordinal: 0x1
  USHORT Offset;      // offset: 0x4 ordinal: 0x2
  USHORT Size;        // offset: 0x6 ordinal: 0x3
} _PCW_COUNTER_DESCRIPTOR;

// 0x2 bytes (sizeof)
typedef struct _HV_GET_BIN_CONTEXT {
  USHORT OutstandingReference : 1; // offset: 0x0 ordinal: 0x0
} _HV_GET_BIN_CONTEXT;

// 0x2 bytes (sizeof)
typedef struct _IMAGE_SWITCHTABLE_BRANCH_DYNAMIC_RELOCATION {
  USHORT PageRelativeOffset : 12; // offset: 0x0 ordinal: 0x0
  USHORT RegisterNumber : 4;      // offset: 0x0 ordinal: 0x1
} _IMAGE_SWITCHTABLE_BRANCH_DYNAMIC_RELOCATION;

// 0x2 bytes (sizeof)
typedef struct _IMAGE_INDIR_CONTROL_TRANSFER_DYNAMIC_RELOCATION {
  USHORT PageRelativeOffset : 12; // offset: 0x0 ordinal: 0x0
  USHORT IndirectCall : 1;        // offset: 0x0 ordinal: 0x1
  USHORT RexWPrefix : 1;          // offset: 0x0 ordinal: 0x2
  USHORT CfgCheck : 1;            // offset: 0x0 ordinal: 0x3
  USHORT Reserved : 1;            // offset: 0x0 ordinal: 0x4
} _IMAGE_INDIR_CONTROL_TRANSFER_DYNAMIC_RELOCATION;

// 0x4 bytes (sizeof)
typedef struct _MMSUBSECTION_FLAGS {
  USHORT SubsectionAccessed : 1;  // offset: 0x0 ordinal: 0x0
  USHORT Protection : 5;          // offset: 0x0 ordinal: 0x1
  USHORT StartingSector4132 : 10; // offset: 0x0 ordinal: 0x2
  USHORT SubsectionStatic : 1;    // offset: 0x2 ordinal: 0x3
  USHORT GlobalMemory : 1;        // offset: 0x2 ordinal: 0x4
  USHORT Spare : 1;               // offset: 0x2 ordinal: 0x5
  USHORT OnDereferenceList : 1;   // offset: 0x2 ordinal: 0x6
  USHORT SectorEndOffset : 12;    // offset: 0x2 ordinal: 0x7
} _MMSUBSECTION_FLAGS;

// 0x2 bytes (sizeof)
typedef struct __anon_1500 {
  USHORT ReferenceCount; // offset: 0x0 ordinal: 0x0
} __anon_1500;

// 0x4 bytes (sizeof)
typedef struct _SEGMENT_FLAGS {
  USHORT TotalNumberOfPtes4132 : 10; // offset: 0x0 ordinal: 0x0
  USHORT Spare0 : 2;                 // offset: 0x0 ordinal: 0x1
  USHORT LargePages : 1;             // offset: 0x0 ordinal: 0x2
  USHORT DebugSymbolsLoaded : 1;     // offset: 0x0 ordinal: 0x3
  USHORT WriteCombined : 1;          // offset: 0x0 ordinal: 0x4
  USHORT NoCache : 1;                // offset: 0x0 ordinal: 0x5
  USHORT Short0;                     // offset: 0x0 ordinal: 0x6
  UCHAR Unused : 1;                  // offset: 0x2 ordinal: 0x7
  UCHAR DefaultProtectionMask : 5;   // offset: 0x2 ordinal: 0x8
  UCHAR Binary32 : 1;                // offset: 0x2 ordinal: 0x9
  UCHAR ContainsDebug : 1;           // offset: 0x2 ordinal: 0xa
  UCHAR UChar1;                      // offset: 0x2 ordinal: 0xb
  UCHAR ForceCollision : 1;          // offset: 0x3 ordinal: 0xc
  UCHAR ImageSigningType : 3;        // offset: 0x3 ordinal: 0xd
  UCHAR ImageSigningLevel : 4;       // offset: 0x3 ordinal: 0xe
  UCHAR UChar2;                      // offset: 0x3 ordinal: 0xf
} _SEGMENT_FLAGS;

// 0x8 bytes (sizeof)
typedef struct _wil_details_UsageSubscriptionData {
  ULONG featureId;             // offset: 0x0 ordinal: 0x0
  USHORT serviceReportingKind; // offset: 0x4 ordinal: 0x1
} _wil_details_UsageSubscriptionData;

// 0x10 bytes (sizeof)
typedef struct wil_details_StagingConfigHeader {
  UCHAR version;                   // offset: 0x0 ordinal: 0x0
  UCHAR versionMinor;              // offset: 0x1 ordinal: 0x1
  USHORT headerSizeBytes;          // offset: 0x2 ordinal: 0x2
  USHORT featureCount;             // offset: 0x4 ordinal: 0x3
  USHORT featureUsageTriggerCount; // offset: 0x6 ordinal: 0x4
  struct wil_details_StagingConfigHeaderProperties
      sessionProperties; // offset: 0x8 ordinal: 0x5
  struct wil_details_StagingConfigHeaderProperties
      properties; // offset: 0xc ordinal: 0x6
} wil_details_StagingConfigHeader;

// 0x6 bytes (sizeof)
typedef struct FEATURE_LOGGED_TRAITS {
  USHORT version;     // offset: 0x0 ordinal: 0x0
  USHORT baseVersion; // offset: 0x2 ordinal: 0x1
  UCHAR stage;        // offset: 0x4 ordinal: 0x2
} FEATURE_LOGGED_TRAITS;

typedef unsigned int HRESULT;

// 0x38 bytes (sizeof)
typedef struct FEATURE_ERROR {
  HRESULT hr;                            // offset: 0x0 ordinal: 0x0
  USHORT lineNumber;                     // offset: 0x4 ordinal: 0x1
  CHAR *file;                            // offset: 0x8 ordinal: 0x2
  CHAR *process;                         // offset: 0xc ordinal: 0x3
  CHAR *modulePath;                      // offset: 0x10 ordinal: 0x4
  ULONG callerReturnAddressOffset;       // offset: 0x14 ordinal: 0x5
  CHAR *callerModule;                    // offset: 0x18 ordinal: 0x6
  CHAR *message;                         // offset: 0x1c ordinal: 0x7
  USHORT originLineNumber;               // offset: 0x20 ordinal: 0x8
  CHAR *originFile;                      // offset: 0x24 ordinal: 0x9
  CHAR *originModule;                    // offset: 0x28 ordinal: 0xa
  ULONG originCallerReturnAddressOffset; // offset: 0x2c ordinal: 0xb
  CHAR *originCallerModule;              // offset: 0x30 ordinal: 0xc
  CHAR *originName;                      // offset: 0x34 ordinal: 0xd
} FEATURE_ERROR;

// 0x8 bytes (sizeof)
typedef struct _UNICODE_STRING {
  USHORT Length;        // offset: 0x0 ordinal: 0x0
  USHORT MaximumLength; // offset: 0x2 ordinal: 0x1
  WCHAR *Buffer;        // offset: 0x4 ordinal: 0x2
} _UNICODE_STRING;

// 0x2 bytes (sizeof)
typedef union _WHEA_REVISION {
  UCHAR MinorRevision; // offset: 0x0 ordinal: 0x0
  UCHAR MajorRevision; // offset: 0x1 ordinal: 0x1
  USHORT AsUSHORT;     // offset: 0x0 ordinal: 0x2
} _WHEA_REVISION;

// 0x8 bytes (sizeof)
typedef struct _TXN_PARAMETER_BLOCK {
  USHORT Length;           // offset: 0x0 ordinal: 0x0
  USHORT TxFsContext;      // offset: 0x2 ordinal: 0x1
  VOID *TransactionObject; // offset: 0x4 ordinal: 0x2
} _TXN_PARAMETER_BLOCK;

// 0x8 bytes (sizeof)
typedef struct _ETW_FILTER_STRING_TOKEN_ELEMENT {
  USHORT Length; // offset: 0x0 ordinal: 0x0
  WCHAR *String; // offset: 0x4 ordinal: 0x1
} _ETW_FILTER_STRING_TOKEN_ELEMENT;

// 0x4 bytes (sizeof)
typedef struct _ETW_BUFFER_CONTEXT {
  UCHAR ProcessorNumber; // offset: 0x0 ordinal: 0x0
  UCHAR Alignment;       // offset: 0x1 ordinal: 0x1
  USHORT ProcessorIndex; // offset: 0x0 ordinal: 0x2
  USHORT LoggerId;       // offset: 0x2 ordinal: 0x3
} _ETW_BUFFER_CONTEXT;

// 0xc bytes (sizeof)
typedef struct _ETW_FILTER_STRING_TOKEN {
  USHORT Count;                                      // offset: 0x0 ordinal: 0x0
  struct _ETW_FILTER_STRING_TOKEN_ELEMENT Tokens[1]; // offset: 0x4 ordinal: 0x1
} _ETW_FILTER_STRING_TOKEN;

// 0x4 bytes (sizeof)
typedef struct _WNF_NODE_HEADER {
  USHORT NodeTypeCode; // offset: 0x0 ordinal: 0x0
  USHORT NodeByteSize; // offset: 0x2 ordinal: 0x1
} _WNF_NODE_HEADER;

// 0x10 bytes (sizeof)
typedef struct _INTERFACE {
  USHORT Size;                          // offset: 0x0 ordinal: 0x0
  USHORT Version;                       // offset: 0x2 ordinal: 0x1
  VOID *Context;                        // offset: 0x4 ordinal: 0x2
  VOID (*InterfaceReference)(VOID *);   // offset: 0x8 ordinal: 0x3
  VOID (*InterfaceDereference)(VOID *); // offset: 0xc ordinal: 0x4
} _INTERFACE;

// 0x4 bytes (sizeof)
typedef struct _MMSUPPORT_FLAGS {
  UCHAR WorkingSetType : 3;        // offset: 0x0 ordinal: 0x0
  UCHAR Reserved0 : 3;             // offset: 0x0 ordinal: 0x1
  UCHAR MaximumWorkingSetHard : 1; // offset: 0x0 ordinal: 0x2
  UCHAR MinimumWorkingSetHard : 1; // offset: 0x0 ordinal: 0x3
  UCHAR SessionMaster : 1;         // offset: 0x1 ordinal: 0x4
  UCHAR TrimmerState : 2;          // offset: 0x1 ordinal: 0x5
  UCHAR Reserved : 1;              // offset: 0x1 ordinal: 0x6
  UCHAR PageStealers : 4;          // offset: 0x1 ordinal: 0x7
  USHORT u1;                       // offset: 0x0 ordinal: 0x8
  UCHAR MemoryPriority;            // offset: 0x2 ordinal: 0x9
  UCHAR WsleDeleted : 1;           // offset: 0x3 ordinal: 0xa
  UCHAR SvmEnabled : 1;            // offset: 0x3 ordinal: 0xb
  UCHAR ForceAge : 1;              // offset: 0x3 ordinal: 0xc
  UCHAR ForceTrim : 1;             // offset: 0x3 ordinal: 0xd
  UCHAR NewMaximum : 1;            // offset: 0x3 ordinal: 0xe
  UCHAR CommitReleaseState : 2;    // offset: 0x3 ordinal: 0xf
  UCHAR u2;                        // offset: 0x3 ordinal: 0x10
} _MMSUPPORT_FLAGS;

// 0x8 bytes (sizeof)
typedef struct _PROC_PERF_HISTORY_ENTRY {
  USHORT Utility;            // offset: 0x0 ordinal: 0x0
  USHORT AffinitizedUtility; // offset: 0x2 ordinal: 0x1
  UCHAR Frequency;           // offset: 0x4 ordinal: 0x2
  UCHAR TaggedPercent[2];    // offset: 0x5 ordinal: 0x3
} _PROC_PERF_HISTORY_ENTRY;

// 0x8 bytes (sizeof)
typedef struct _KIDTENTRY {
  USHORT Offset;         // offset: 0x0 ordinal: 0x0
  USHORT Selector;       // offset: 0x2 ordinal: 0x1
  USHORT Access;         // offset: 0x4 ordinal: 0x2
  USHORT ExtendedOffset; // offset: 0x6 ordinal: 0x3
} _KIDTENTRY;

// 0x18 bytes (sizeof)
typedef struct _ETW_PMC_SUPPORT {
  enum _KPROFILE_SOURCE *Source;              // offset: 0x0 ordinal: 0x0
  ULONG HookIdCount;                          // offset: 0x4 ordinal: 0x1
  USHORT HookId[4];                           // offset: 0x8 ordinal: 0x2
  ULONG CountersCount;                        // offset: 0x10 ordinal: 0x3
  struct _HAL_PMC_COUNTERS *ProcessorCtrs[1]; // offset: 0x14 ordinal: 0x4
} _ETW_PMC_SUPPORT;

// 0x8 bytes (sizeof)
typedef struct _STRING {
  USHORT Length;        // offset: 0x0 ordinal: 0x0
  USHORT MaximumLength; // offset: 0x2 ordinal: 0x1
  CHAR *Buffer;         // offset: 0x4 ordinal: 0x2
} _STRING;

// 0x4 bytes (sizeof)
typedef struct _PROCESSOR_NUMBER {
  USHORT Group;   // offset: 0x0 ordinal: 0x0
  UCHAR Number;   // offset: 0x2 ordinal: 0x1
  UCHAR Reserved; // offset: 0x3 ordinal: 0x2
} _PROCESSOR_NUMBER;

// 0xc bytes (sizeof)
typedef struct _SEP_CACHED_HANDLES_ENTRY_DESCRIPTOR {
  enum _SEP_CACHED_HANDLES_ENTRY_TYPE
      DescriptorType; // offset: 0x0 ordinal: 0x0
  union {
    VOID *PackageSid;                       // offset: 0x4 ordinal: 0x1
    struct _UNICODE_STRING IsolationPrefix; // offset: 0x4 ordinal: 0x2
  };
} _SEP_CACHED_HANDLES_ENTRY_DESCRIPTOR;

// 0x14 bytes (sizeof)
typedef struct _RELATIVE_SYMLINK_INFO {
  USHORT ExposedNamespaceLength;                     // offset: 0x0 ordinal: 0x0
  USHORT Flags;                                      // offset: 0x2 ordinal: 0x1
  USHORT DeviceNameLength;                           // offset: 0x4 ordinal: 0x2
  USHORT Reserved;                                   // offset: 0x6 ordinal: 0x3
  struct _RELATIVE_SYMLINK_INFO *InteriorMountPoint; // offset: 0x8 ordinal: 0x4
  struct _UNICODE_STRING OpenedName;                 // offset: 0xc ordinal: 0x5
} _RELATIVE_SYMLINK_INFO;

// 0x8 bytes (sizeof)
typedef struct _OBJECT_NAME_INFORMATION {
  struct _UNICODE_STRING Name; // offset: 0x0 ordinal: 0x0
} _OBJECT_NAME_INFORMATION;

// 0x4 bytes (sizeof)
typedef struct _SE_AUDIT_PROCESS_CREATION_INFO {
  struct _OBJECT_NAME_INFORMATION *ImageFileName; // offset: 0x0 ordinal: 0x0
} _SE_AUDIT_PROCESS_CREATION_INFO;

// 0x18 bytes (sizeof)
typedef struct _SEP_SILOSTATE {
  struct _SEP_LOGON_SESSION_REFERENCES
      *SystemLogonSession; // offset: 0x0 ordinal: 0x0
  struct _SEP_LOGON_SESSION_REFERENCES
      *AnonymousLogonSession;             // offset: 0x4 ordinal: 0x1
  VOID *AnonymousLogonToken;              // offset: 0x8 ordinal: 0x2
  VOID *AnonymousLogonTokenNoEveryone;    // offset: 0xc ordinal: 0x3
  struct _UNICODE_STRING *UncSystemPaths; // offset: 0x10 ordinal: 0x4
  struct _CI_NGEN_PATHS *NgenPaths;       // offset: 0x14 ordinal: 0x5
} _SEP_SILOSTATE;

// 0xc bytes (sizeof)
typedef struct _CURDIR {
  struct _UNICODE_STRING DosPath; // offset: 0x0 ordinal: 0x0
  VOID *Handle;                   // offset: 0x8 ordinal: 0x1
} _CURDIR;

typedef LONG (*__anon_2729)(struct _IOMMU_DMA_DOMAIN *, struct _MDL *);

typedef LONG (*__anon_2721)(struct _IOMMU_DMA_DOMAIN *);

typedef LONG (*__anon_2720)(UCHAR, struct _IOMMU_DMA_DOMAIN **);

typedef LONG (*__anon_2719)(VOID *, VOID *, UCHAR);

typedef LONG (*__anon_2710)(VOID *, ULONG);

typedef LONG (*__anon_2709)(UCHAR *);

typedef LONG (*__anon_2681)(ULONG);

typedef LONG (*__anon_2680)(ULONG, UCHAR, UCHAR);

typedef LONG (*__anon_2560)(struct _BUS_HANDLER *);

typedef LONG (*__anon_2512)(UCHAR (*)(struct _KINTERRUPT *, VOID *));

typedef LONG (*__anon_2507)(UCHAR);

typedef LONG (*__anon_2487)(enum _SYSTEM_POWER_STATE);

typedef LONG (*__anon_2472)(VOID *, VOID **);

typedef LONG (*__anon_2460)();

// 0x18 bytes (sizeof)
typedef struct _WNF_DISPATCHER {
  struct _WNF_NODE_HEADER Header;   // offset: 0x0 ordinal: 0x0
  struct _WORK_QUEUE_ITEM WorkItem; // offset: 0x4 ordinal: 0x1
  LONG State;                       // offset: 0x14 ordinal: 0x2
} _WNF_DISPATCHER;

// 0x10 bytes (sizeof)
typedef struct _OBJECT_HEADER_NAME_INFO {
  struct _OBJECT_DIRECTORY *Directory; // offset: 0x0 ordinal: 0x0
  struct _UNICODE_STRING Name;         // offset: 0x4 ordinal: 0x1
  LONG ReferenceCount;                 // offset: 0xc ordinal: 0x2
} _OBJECT_HEADER_NAME_INFO;

// 0xac bytes (sizeof)
typedef struct _RTL_TIME_ZONE_INFORMATION {
  LONG Bias;                         // offset: 0x0 ordinal: 0x0
  WCHAR StandardName[32];            // offset: 0x4 ordinal: 0x1
  struct _TIME_FIELDS StandardStart; // offset: 0x44 ordinal: 0x2
  LONG StandardBias;                 // offset: 0x54 ordinal: 0x3
  WCHAR DaylightName[32];            // offset: 0x58 ordinal: 0x4
  struct _TIME_FIELDS DaylightStart; // offset: 0x98 ordinal: 0x5
  LONG DaylightBias;                 // offset: 0xa8 ordinal: 0x6
} _RTL_TIME_ZONE_INFORMATION;

// 0x8 bytes (sizeof)
typedef struct _VACB_LEVEL_REFERENCE {
  LONG Reference;        // offset: 0x0 ordinal: 0x0
  LONG SpecialReference; // offset: 0x4 ordinal: 0x1
} _VACB_LEVEL_REFERENCE;

// 0x4 bytes (sizeof)
typedef struct _DBGKD_CONTINUE {
  LONG ContinueStatus; // offset: 0x0 ordinal: 0x0
} _DBGKD_CONTINUE;

// 0x18 bytes (sizeof)
typedef struct _ETW_PERF_COUNTERS {
  LONG TotalActiveSessions;           // offset: 0x0 ordinal: 0x0
  LONG TotalBufferMemoryNonPagedPool; // offset: 0x4 ordinal: 0x1
  LONG TotalBufferMemoryPagedPool;    // offset: 0x8 ordinal: 0x2
  LONG TotalGuidsEnabled;             // offset: 0xc ordinal: 0x3
  LONG TotalGuidsNotEnabled;          // offset: 0x10 ordinal: 0x4
  LONG TotalGuidsPreEnabled;          // offset: 0x14 ordinal: 0x5
} _ETW_PERF_COUNTERS;

// 0x10 bytes (sizeof)
typedef struct _CMP_DISCARD_AND_REPLACE_KCB_CONTEXT {
  struct _CM_KEY_CONTROL_BLOCK *BaseKcb; // offset: 0x0 ordinal: 0x0
  LONG PrepareStatus;                    // offset: 0x4 ordinal: 0x1
  struct _LIST_ENTRY ClonedKcbListHead;  // offset: 0x8 ordinal: 0x2
} _CMP_DISCARD_AND_REPLACE_KCB_CONTEXT;

// 0x20 bytes (sizeof)
typedef struct _MI_LDW_WORK_CONTEXT {
  struct _WORK_QUEUE_ITEM WorkItem; // offset: 0x0 ordinal: 0x0
  struct _FILE_OBJECT *FileObject;  // offset: 0x10 ordinal: 0x1
  LONG ErrorStatus;                 // offset: 0x14 ordinal: 0x2
  LONG Active;                      // offset: 0x18 ordinal: 0x3
  UCHAR FreeWhenDone;               // offset: 0x1c ordinal: 0x4
} _MI_LDW_WORK_CONTEXT;

// 0x4 bytes (sizeof)
typedef union __anon_1385 {
  LONG FlushCompleting : 1;  // offset: 0x0 ordinal: 0x0
  LONG FlushInProgress : 31; // offset: 0x0 ordinal: 0x1
  LONG Long;                 // offset: 0x0 ordinal: 0x2
} __anon_1385;

typedef LONG (*__anon_1204)(VOID *, VOID *);

typedef LONG (*__anon_1203)(VOID *);

// 0x10 bytes (sizeof)
typedef struct _ETW_COUNTERS {
  LONG GuidCount;    // offset: 0x0 ordinal: 0x0
  LONG PoolUsage[2]; // offset: 0x4 ordinal: 0x1
  LONG SessionCount; // offset: 0xc ordinal: 0x2
} _ETW_COUNTERS;

typedef LONG (*__anon_720)(struct _FILE_OBJECT *, struct _DEVICE_OBJECT *);

// 0x4 bytes (sizeof)
typedef union __anon_505 {
  struct _IRP *MasterIrp; // offset: 0x0 ordinal: 0x0
  LONG IrpCount;          // offset: 0x0 ordinal: 0x1
  VOID *SystemBuffer;     // offset: 0x0 ordinal: 0x2
} __anon_505;

// 0x10 bytes (sizeof)
typedef struct _DISPATCHER_HEADER {
  union {
    LONG Lock;   // offset: 0x0 ordinal: 0x0
    LONG LockNV; // offset: 0x0 ordinal: 0x1
    UCHAR Type;  // offset: 0x0 ordinal: 0x2
  };
  UCHAR Signalling; // offset: 0x1 ordinal: 0x3
  UCHAR Size;       // offset: 0x2 ordinal: 0x4
  UCHAR Reserved1;  // offset: 0x3 ordinal: 0x5
  UCHAR TimerType;  // offset: 0x0 ordinal: 0x6
  union {
    UCHAR TimerControlFlags; // offset: 0x1 ordinal: 0x7
    UCHAR Absolute : 1;      // offset: 0x1 ordinal: 0x8
  };
  UCHAR Wake : 1;                  // offset: 0x1 ordinal: 0x9
  UCHAR EncodedTolerableDelay : 6; // offset: 0x1 ordinal: 0xa
  UCHAR Hand;                      // offset: 0x2 ordinal: 0xb
  union {
    UCHAR TimerMiscFlags; // offset: 0x3 ordinal: 0xc
    UCHAR Index : 1;      // offset: 0x3 ordinal: 0xd
  };
  UCHAR Processor : 5; // offset: 0x3 ordinal: 0xe
  UCHAR Inserted : 1;  // offset: 0x3 ordinal: 0xf
  UCHAR Expired : 1;   // offset: 0x3 ordinal: 0x10
  UCHAR Timer2Type;    // offset: 0x0 ordinal: 0x11
  union {
    UCHAR Timer2Flags;        // offset: 0x1 ordinal: 0x12
    UCHAR Timer2Inserted : 1; // offset: 0x1 ordinal: 0x13
  };
  UCHAR Timer2Expiring : 1;      // offset: 0x1 ordinal: 0x14
  UCHAR Timer2CancelPending : 1; // offset: 0x1 ordinal: 0x15
  UCHAR Timer2SetPending : 1;    // offset: 0x1 ordinal: 0x16
  UCHAR Timer2Running : 1;       // offset: 0x1 ordinal: 0x17
  UCHAR Timer2Disabled : 1;      // offset: 0x1 ordinal: 0x18
  UCHAR Timer2ReservedFlags : 2; // offset: 0x1 ordinal: 0x19
  UCHAR Timer2ComponentId;       // offset: 0x2 ordinal: 0x1a
  UCHAR Timer2RelativeId;        // offset: 0x3 ordinal: 0x1b
  UCHAR QueueType;               // offset: 0x0 ordinal: 0x1c
  union {
    UCHAR QueueControlFlags; // offset: 0x1 ordinal: 0x1d
    UCHAR Abandoned : 1;     // offset: 0x1 ordinal: 0x1e
  };
  UCHAR DisableIncrement : 1;          // offset: 0x1 ordinal: 0x1f
  UCHAR QueueReservedControlFlags : 6; // offset: 0x1 ordinal: 0x20
  UCHAR QueueSize;                     // offset: 0x2 ordinal: 0x21
  UCHAR QueueReserved;                 // offset: 0x3 ordinal: 0x22
  UCHAR ThreadType;                    // offset: 0x0 ordinal: 0x23
  UCHAR ThreadReserved;                // offset: 0x1 ordinal: 0x24
  union {
    UCHAR ThreadControlFlags; // offset: 0x2 ordinal: 0x25
    UCHAR CycleProfiling : 1; // offset: 0x2 ordinal: 0x26
  };
  UCHAR CounterProfiling : 1;      // offset: 0x2 ordinal: 0x27
  UCHAR GroupScheduling : 1;       // offset: 0x2 ordinal: 0x28
  UCHAR AffinitySet : 1;           // offset: 0x2 ordinal: 0x29
  UCHAR Tagged : 1;                // offset: 0x2 ordinal: 0x2a
  UCHAR EnergyProfiling : 1;       // offset: 0x2 ordinal: 0x2b
  UCHAR SchedulerAssist : 1;       // offset: 0x2 ordinal: 0x2c
  UCHAR Instrumented : 1;          // offset: 0x2 ordinal: 0x2d
  UCHAR DebugActive;               // offset: 0x3 ordinal: 0x2e
  UCHAR MutantType;                // offset: 0x0 ordinal: 0x2f
  UCHAR MutantSize;                // offset: 0x1 ordinal: 0x30
  UCHAR DpcActive;                 // offset: 0x2 ordinal: 0x31
  UCHAR MutantReserved;            // offset: 0x3 ordinal: 0x32
  LONG SignalState;                // offset: 0x4 ordinal: 0x33
  struct _LIST_ENTRY WaitListHead; // offset: 0x8 ordinal: 0x34
} _DISPATCHER_HEADER;

// 0x20 bytes (sizeof)
typedef struct _KMUTANT {
  struct _DISPATCHER_HEADER Header;   // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY MutantListEntry; // offset: 0x10 ordinal: 0x1
  struct _KTHREAD *OwnerThread;       // offset: 0x18 ordinal: 0x2
  union {
    UCHAR MutantFlags;   // offset: 0x1c ordinal: 0x3
    UCHAR Abandoned : 1; // offset: 0x1c ordinal: 0x4
  };
  UCHAR Spare1 : 7;     // offset: 0x1c ordinal: 0x5
  UCHAR Abandoned2 : 1; // offset: 0x1c ordinal: 0x6
  UCHAR AbEnabled : 1;  // offset: 0x1c ordinal: 0x7
  UCHAR Spare2 : 6;     // offset: 0x1c ordinal: 0x8
  UCHAR ApcDisable;     // offset: 0x1d ordinal: 0x9
} _KMUTANT;

// 0x14 bytes (sizeof)
typedef struct _KSEMAPHORE {
  struct _DISPATCHER_HEADER Header; // offset: 0x0 ordinal: 0x0
  LONG Limit;                       // offset: 0x10 ordinal: 0x1
} _KSEMAPHORE;

// 0x18 bytes (sizeof)
typedef struct _LPCP_NONPAGED_PORT_QUEUE {
  struct _KSEMAPHORE Semaphore;          // offset: 0x0 ordinal: 0x0
  struct _LPCP_PORT_OBJECT *BackPointer; // offset: 0x14 ordinal: 0x1
} _LPCP_NONPAGED_PORT_QUEUE;

// 0x10 bytes (sizeof)
typedef struct _LPCP_PORT_QUEUE {
  struct _LPCP_NONPAGED_PORT_QUEUE
      *NonPagedPortQueue;         // offset: 0x0 ordinal: 0x0
  struct _KSEMAPHORE *Semaphore;  // offset: 0x4 ordinal: 0x1
  struct _LIST_ENTRY ReceiveHead; // offset: 0x8 ordinal: 0x2
} _LPCP_PORT_QUEUE;

// 0x2c bytes (sizeof)
typedef struct _MMDEREFERENCE_SEGMENT_HEADER {
  struct _KSEMAPHORE Semaphore;                   // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY ControlAreaDeleteListHead;   // offset: 0x14 ordinal: 0x1
  struct _LIST_ENTRY UnusedSegmentDeleteListHead; // offset: 0x1c ordinal: 0x2
  struct _LIST_ENTRY PagefileExtensionListHead;   // offset: 0x24 ordinal: 0x3
} _MMDEREFERENCE_SEGMENT_HEADER;

// 0x10 bytes (sizeof)
typedef struct _KEVENT {
  struct _DISPATCHER_HEADER Header; // offset: 0x0 ordinal: 0x0
} _KEVENT;

// 0x1c bytes (sizeof)
typedef struct _KWAIT_CHAIN_ENTRY {
  struct _LIST_ENTRY ListEntry; // offset: 0x0 ordinal: 0x0
  struct _KTHREAD *Thread;      // offset: 0x8 ordinal: 0x1
  struct _KEVENT Event;         // offset: 0xc ordinal: 0x2
} _KWAIT_CHAIN_ENTRY;

// 0x20 bytes (sizeof)
typedef struct _MI_RESUME_WORKITEM {
  struct _KEVENT ResumeCompleteEvent; // offset: 0x0 ordinal: 0x0
  struct _WORK_QUEUE_ITEM WorkItem;   // offset: 0x10 ordinal: 0x1
} _MI_RESUME_WORKITEM;

// 0x14 bytes (sizeof)
typedef struct _PALPC_PORT_REFERENCE_WAIT_BLOCK {
  struct _KEVENT DesiredReferenceNoEvent; // offset: 0x0 ordinal: 0x0
  LONG DesiredReferenceNo;                // offset: 0x10 ordinal: 0x1
} _PALPC_PORT_REFERENCE_WAIT_BLOCK;

// 0x14 bytes (sizeof)
typedef struct _CACHE_UNINITIALIZE_EVENT {
  struct _CACHE_UNINITIALIZE_EVENT *Next; // offset: 0x0 ordinal: 0x0
  struct _KEVENT Event;                   // offset: 0x4 ordinal: 0x1
} _CACHE_UNINITIALIZE_EVENT;

// 0x18 bytes (sizeof)
typedef struct _HIVE_WAIT_PACKET {
  struct _KEVENT WakeEvent;       // offset: 0x0 ordinal: 0x0
  LONG Status;                    // offset: 0x10 ordinal: 0x1
  struct _HIVE_WAIT_PACKET *Next; // offset: 0x14 ordinal: 0x2
} _HIVE_WAIT_PACKET;

// 0x18 bytes (sizeof)
typedef struct _IO_REMOVE_LOCK_COMMON_BLOCK {
  UCHAR Removed;              // offset: 0x0 ordinal: 0x0
  UCHAR Reserved[3];          // offset: 0x1 ordinal: 0x1
  LONG IoCount;               // offset: 0x4 ordinal: 0x2
  struct _KEVENT RemoveEvent; // offset: 0x8 ordinal: 0x3
} _IO_REMOVE_LOCK_COMMON_BLOCK;

// 0x18 bytes (sizeof)
typedef struct _IO_REMOVE_LOCK {
  struct _IO_REMOVE_LOCK_COMMON_BLOCK Common; // offset: 0x0 ordinal: 0x0
} _IO_REMOVE_LOCK;

// 0x4 bytes (sizeof)
typedef struct __anon_1946 {
  struct _KEVENT *Event; // offset: 0x0 ordinal: 0x0
} __anon_1946;

// 0x10 bytes (sizeof)
typedef struct _KGATE {
  struct _DISPATCHER_HEADER Header; // offset: 0x0 ordinal: 0x0
} _KGATE;

// 0x14 bytes (sizeof)
typedef struct _MI_EXTENT_DELETION_WAIT_BLOCK {
  struct _MI_EXTENT_DELETION_WAIT_BLOCK *Next; // offset: 0x0 ordinal: 0x0
  struct _KGATE Gate;                          // offset: 0x4 ordinal: 0x1
} _MI_EXTENT_DELETION_WAIT_BLOCK;

// 0x18 bytes (sizeof)
typedef struct _MMMOD_WRITER_LISTHEAD {
  struct _LIST_ENTRY ListHead; // offset: 0x0 ordinal: 0x0
  union {
    struct _KGATE Gate;   // offset: 0x8 ordinal: 0x1
    struct _KEVENT Event; // offset: 0x8 ordinal: 0x2
  };
} _MMMOD_WRITER_LISTHEAD;

// 0x40 bytes (sizeof)
typedef struct _MI_PARTITION_ZEROING {
  struct _KEVENT PageEvent;      // offset: 0x0 ordinal: 0x0
  UCHAR ThreadActive;            // offset: 0x10 ordinal: 0x1
  UCHAR ThreadPriorityStatic;    // offset: 0x11 ordinal: 0x2
  LONG ZeroFreePageSlistMinimum; // offset: 0x14 ordinal: 0x3
  struct _WORK_QUEUE_ITEM
      RebalanceZeroFreeWorkItem;                 // offset: 0x18 ordinal: 0x4
  LONG ThreadCount;                              // offset: 0x28 ordinal: 0x5
  struct _KGATE Gate;                            // offset: 0x2c ordinal: 0x6
  struct _MI_ZERO_THREAD_CONTEXT *ThreadContext; // offset: 0x3c ordinal: 0x7
} _MI_PARTITION_ZEROING;

// 0x40 bytes (sizeof)
typedef struct _IMAGE_DOS_HEADER {
  USHORT e_magic;    // offset: 0x0 ordinal: 0x0
  USHORT e_cblp;     // offset: 0x2 ordinal: 0x1
  USHORT e_cp;       // offset: 0x4 ordinal: 0x2
  USHORT e_crlc;     // offset: 0x6 ordinal: 0x3
  USHORT e_cparhdr;  // offset: 0x8 ordinal: 0x4
  USHORT e_minalloc; // offset: 0xa ordinal: 0x5
  USHORT e_maxalloc; // offset: 0xc ordinal: 0x6
  USHORT e_ss;       // offset: 0xe ordinal: 0x7
  USHORT e_sp;       // offset: 0x10 ordinal: 0x8
  USHORT e_csum;     // offset: 0x12 ordinal: 0x9
  USHORT e_ip;       // offset: 0x14 ordinal: 0xa
  USHORT e_cs;       // offset: 0x16 ordinal: 0xb
  USHORT e_lfarlc;   // offset: 0x18 ordinal: 0xc
  USHORT e_ovno;     // offset: 0x1a ordinal: 0xd
  USHORT e_res[4];   // offset: 0x1c ordinal: 0xe
  USHORT e_oemid;    // offset: 0x24 ordinal: 0xf
  USHORT e_oeminfo;  // offset: 0x26 ordinal: 0x10
  USHORT e_res2[10]; // offset: 0x28 ordinal: 0x11
  LONG e_lfanew;     // offset: 0x3c ordinal: 0x12
} _IMAGE_DOS_HEADER;

// 0x4 bytes (sizeof)
typedef union _MI_RESERVATION_CLUSTER_INFO {
  ULONG ClusterSize : 10;    // offset: 0x0 ordinal: 0x0
  ULONG SequenceNumber : 22; // offset: 0x0 ordinal: 0x1
  LONG EntireInfo;           // offset: 0x0 ordinal: 0x2
} _MI_RESERVATION_CLUSTER_INFO;

// 0x4 bytes (sizeof)
typedef union _MI_FLAGS {
  LONG EntireFlags;                         // offset: 0x0 ordinal: 0x0
  ULONG VerifierEnabled : 1;                // offset: 0x0 ordinal: 0x1
  ULONG KernelVerifierEnabled : 1;          // offset: 0x0 ordinal: 0x2
  ULONG LargePageKernel : 1;                // offset: 0x0 ordinal: 0x3
  ULONG StopOn4d : 1;                       // offset: 0x0 ordinal: 0x4
  ULONG InitializationPhase : 2;            // offset: 0x0 ordinal: 0x5
  ULONG PageKernelStacks : 1;               // offset: 0x0 ordinal: 0x6
  ULONG CheckZeroPages : 1;                 // offset: 0x0 ordinal: 0x7
  ULONG ProcessorPrewalks : 1;              // offset: 0x0 ordinal: 0x8
  ULONG ProcessorPostwalks : 1;             // offset: 0x0 ordinal: 0x9
  ULONG CoverageBuild : 1;                  // offset: 0x0 ordinal: 0xa
  ULONG AccessBitReplacementDisabled : 1;   // offset: 0x0 ordinal: 0xb
  ULONG CheckExecute : 1;                   // offset: 0x0 ordinal: 0xc
  ULONG ProtectedPagesEnabled : 1;          // offset: 0x0 ordinal: 0xd
  ULONG SecureRelocations : 1;              // offset: 0x0 ordinal: 0xe
  ULONG StrongPageIdentity : 1;             // offset: 0x0 ordinal: 0xf
  ULONG StrongCodeGuarantees : 1;           // offset: 0x0 ordinal: 0x10
  ULONG HardCodeGuarantees : 1;             // offset: 0x0 ordinal: 0x11
  ULONG ExecutePagePrivilegeRequired : 1;   // offset: 0x0 ordinal: 0x12
  ULONG SecureKernelCfgEnabled : 1;         // offset: 0x0 ordinal: 0x13
  ULONG FullHvci : 1;                       // offset: 0x0 ordinal: 0x14
  ULONG BootDebuggerActive : 1;             // offset: 0x0 ordinal: 0x15
  ULONG ExceptionHandlingReady : 1;         // offset: 0x0 ordinal: 0x16
  ULONG ShadowStacksSupported : 1;          // offset: 0x0 ordinal: 0x17
  ULONG AccessBitFenceRequired : 1;         // offset: 0x0 ordinal: 0x18
  ULONG PfnDatabaseExists : 1;              // offset: 0x0 ordinal: 0x19
  ULONG DeferredHotAddsCompleted : 1;       // offset: 0x0 ordinal: 0x1a
  ULONG KernelHalLargeSectionAlignment : 1; // offset: 0x0 ordinal: 0x1b
} _MI_FLAGS;

// 0x14 bytes (sizeof)
typedef struct _CALL_HASH_ENTRY {
  struct _LIST_ENTRY ListEntry; // offset: 0x0 ordinal: 0x0
  VOID *CallersAddress;         // offset: 0x8 ordinal: 0x1
  VOID *CallersCaller;          // offset: 0xc ordinal: 0x2
  ULONG CallCount;              // offset: 0x10 ordinal: 0x3
} _CALL_HASH_ENTRY;

// 0x4 bytes (sizeof)
typedef struct _OBJECT_HEADER_PADDING_INFO {
  ULONG PaddingAmount; // offset: 0x0 ordinal: 0x0
} _OBJECT_HEADER_PADDING_INFO;

// 0x1c bytes (sizeof)
typedef struct _IMAGE_DEBUG_DIRECTORY {
  ULONG Characteristics;  // offset: 0x0 ordinal: 0x0
  ULONG TimeDateStamp;    // offset: 0x4 ordinal: 0x1
  USHORT MajorVersion;    // offset: 0x8 ordinal: 0x2
  USHORT MinorVersion;    // offset: 0xa ordinal: 0x3
  ULONG Type;             // offset: 0xc ordinal: 0x4
  ULONG SizeOfData;       // offset: 0x10 ordinal: 0x5
  ULONG AddressOfRawData; // offset: 0x14 ordinal: 0x6
  ULONG PointerToRawData; // offset: 0x18 ordinal: 0x7
} _IMAGE_DEBUG_DIRECTORY;

// 0x14 bytes (sizeof)
typedef struct _NB10 {
  ULONG Signature; // offset: 0x0 ordinal: 0x0
  ULONG Offset;    // offset: 0x4 ordinal: 0x1
  ULONG TimeStamp; // offset: 0x8 ordinal: 0x2
  ULONG Age;       // offset: 0xc ordinal: 0x3
  CHAR PdbName[1]; // offset: 0x10 ordinal: 0x4
} _NB10;

// 0x18 bytes (sizeof)
typedef struct _HEAP_UCR_DESCRIPTOR {
  struct _LIST_ENTRY ListEntry;    // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY SegmentEntry; // offset: 0x8 ordinal: 0x1
  VOID *Address;                   // offset: 0x10 ordinal: 0x2
  ULONG Size;                      // offset: 0x14 ordinal: 0x3
} _HEAP_UCR_DESCRIPTOR;

// 0x8 bytes (sizeof)
typedef struct _POOL_HEADER {
  USHORT PreviousSize : 9; // offset: 0x0 ordinal: 0x0
  USHORT PoolIndex : 7;    // offset: 0x0 ordinal: 0x1
  USHORT BlockSize : 9;    // offset: 0x2 ordinal: 0x2
  USHORT PoolType : 7;     // offset: 0x2 ordinal: 0x3
  ULONG Ulong1;            // offset: 0x0 ordinal: 0x4
  union {
    ULONG PoolTag;                  // offset: 0x4 ordinal: 0x5
    USHORT AllocatorBackTraceIndex; // offset: 0x4 ordinal: 0x6
  };
  USHORT PoolTagHash; // offset: 0x6 ordinal: 0x7
} _POOL_HEADER;

// 0x4 bytes (sizeof)
typedef union __anon_3217 {
  ULONG PhysicalAddress; // offset: 0x0 ordinal: 0x0
  ULONG VirtualSize;     // offset: 0x0 ordinal: 0x1
} __anon_3217;

// 0x28 bytes (sizeof)
typedef struct _IMAGE_SECTION_HEADER {
  UCHAR Name[8];              // offset: 0x0 ordinal: 0x0
  union __anon_3217 Misc;     // offset: 0x8 ordinal: 0x1
  ULONG VirtualAddress;       // offset: 0xc ordinal: 0x2
  ULONG SizeOfRawData;        // offset: 0x10 ordinal: 0x3
  ULONG PointerToRawData;     // offset: 0x14 ordinal: 0x4
  ULONG PointerToRelocations; // offset: 0x18 ordinal: 0x5
  ULONG PointerToLinenumbers; // offset: 0x1c ordinal: 0x6
  USHORT NumberOfRelocations; // offset: 0x20 ordinal: 0x7
  USHORT NumberOfLinenumbers; // offset: 0x22 ordinal: 0x8
  ULONG Characteristics;      // offset: 0x24 ordinal: 0x9
} _IMAGE_SECTION_HEADER;

// 0x8 bytes (sizeof)
typedef struct _LDR_SERVICE_TAG_RECORD {
  struct _LDR_SERVICE_TAG_RECORD *Next; // offset: 0x0 ordinal: 0x0
  ULONG ServiceTag;                     // offset: 0x4 ordinal: 0x1
} _LDR_SERVICE_TAG_RECORD;

// 0x2c bytes (sizeof)
typedef struct _LDR_DDAG_NODE {
  struct _LIST_ENTRY Modules;                     // offset: 0x0 ordinal: 0x0
  struct _LDR_SERVICE_TAG_RECORD *ServiceTagList; // offset: 0x8 ordinal: 0x1
  ULONG LoadCount;                                // offset: 0xc ordinal: 0x2
  ULONG LoadWhileUnloadingCount;                  // offset: 0x10 ordinal: 0x3
  ULONG LowestLink;                               // offset: 0x14 ordinal: 0x4
  struct _LDRP_CSLIST Dependencies;               // offset: 0x18 ordinal: 0x5
  struct _LDRP_CSLIST IncomingDependencies;       // offset: 0x1c ordinal: 0x6
  enum _LDR_DDAG_STATE State;                     // offset: 0x20 ordinal: 0x7
  struct _SINGLE_LIST_ENTRY CondenseLink;         // offset: 0x24 ordinal: 0x8
  ULONG PreorderNumber;                           // offset: 0x28 ordinal: 0x9
} _LDR_DDAG_NODE;

// 0x1c bytes (sizeof)
typedef struct PROCESSOR_PERFSTATE_POLICY {
  ULONG Revision;         // offset: 0x0 ordinal: 0x0
  UCHAR MaxThrottle;      // offset: 0x4 ordinal: 0x1
  UCHAR MinThrottle;      // offset: 0x5 ordinal: 0x2
  UCHAR BusyAdjThreshold; // offset: 0x6 ordinal: 0x3
  union {
    UCHAR Spare;             // offset: 0x7 ordinal: 0x4
    union __anon_3200 Flags; // offset: 0x7 ordinal: 0x5
  };
  ULONG TimeCheck;       // offset: 0x8 ordinal: 0x6
  ULONG IncreaseTime;    // offset: 0xc ordinal: 0x7
  ULONG DecreaseTime;    // offset: 0x10 ordinal: 0x8
  ULONG IncreasePercent; // offset: 0x14 ordinal: 0x9
  ULONG DecreasePercent; // offset: 0x18 ordinal: 0xa
} PROCESSOR_PERFSTATE_POLICY;

// 0x10 bytes (sizeof)
typedef struct _POOL_TRACKER_BIG_PAGES {
  ULONG Va;             // offset: 0x0 ordinal: 0x0
  ULONG Key;            // offset: 0x4 ordinal: 0x1
  ULONG Pattern : 8;    // offset: 0x8 ordinal: 0x2
  ULONG PoolType : 12;  // offset: 0x8 ordinal: 0x3
  ULONG SlushSize : 12; // offset: 0x8 ordinal: 0x4
  ULONG NumberOfBytes;  // offset: 0xc ordinal: 0x5
} _POOL_TRACKER_BIG_PAGES;

// 0x204 bytes (sizeof)
typedef struct _CALL_PERFORMANCE_DATA {
  ULONG SpinLock;                   // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY HashTable[64]; // offset: 0x4 ordinal: 0x1
} _CALL_PERFORMANCE_DATA;

// 0x4 bytes (sizeof)
typedef union _PPM_IDLE_SYNCHRONIZATION_STATE {
  LONG AsLong;        // offset: 0x0 ordinal: 0x0
  LONG RefCount : 24; // offset: 0x0 ordinal: 0x1
  ULONG State : 8;    // offset: 0x0 ordinal: 0x2
} _PPM_IDLE_SYNCHRONIZATION_STATE;

// 0x4 bytes (sizeof)
typedef struct _CM_FAST_LEAF_HINT {
  union {
    UCHAR Characters[4]; // offset: 0x0 ordinal: 0x0
    ULONG FullHint;      // offset: 0x0 ordinal: 0x1
  };
} _CM_FAST_LEAF_HINT;

// 0x44 bytes (sizeof)
typedef struct _PTE_TRACKER {
  struct _LIST_ENTRY ListEntry; // offset: 0x0 ordinal: 0x0
  struct _MDL *Mdl;             // offset: 0x8 ordinal: 0x1
  ULONG Count;                  // offset: 0xc ordinal: 0x2
  VOID *SystemVa;               // offset: 0x10 ordinal: 0x3
  VOID *StartVa;                // offset: 0x14 ordinal: 0x4
  ULONG Offset;                 // offset: 0x18 ordinal: 0x5
  ULONG Length;                 // offset: 0x1c ordinal: 0x6
  ULONG Page;                   // offset: 0x20 ordinal: 0x7
  ULONG IoMapping : 1;          // offset: 0x24 ordinal: 0x8
  ULONG Matched : 1;            // offset: 0x24 ordinal: 0x9
  ULONG CacheAttribute : 2;     // offset: 0x24 ordinal: 0xa
  ULONG GuardPte : 1;           // offset: 0x24 ordinal: 0xb
  ULONG Spare : 27;             // offset: 0x24 ordinal: 0xc
  VOID *StackTrace[7];          // offset: 0x28 ordinal: 0xd
} _PTE_TRACKER;

// 0x40f0 bytes (sizeof)
typedef struct _VI_DEADLOCK_GLOBALS {
  LONGLONG TimeAcquire;                 // offset: 0x0 ordinal: 0x0
  LONGLONG TimeRelease;                 // offset: 0x8 ordinal: 0x1
  struct _LIST_ENTRY *ResourceDatabase; // offset: 0x10 ordinal: 0x2
  ULONG ResourceDatabaseCount;          // offset: 0x14 ordinal: 0x3
  struct _VF_ADDRESS_RANGE
      ResourceAddressRange[1023];     // offset: 0x18 ordinal: 0x4
  struct _LIST_ENTRY *ThreadDatabase; // offset: 0x2010 ordinal: 0x5
  ULONG ThreadDatabaseCount;          // offset: 0x2014 ordinal: 0x6
  struct _VF_ADDRESS_RANGE
      ThreadAddressRange[1023];              // offset: 0x2018 ordinal: 0x7
  ULONG AllocationFailures;                  // offset: 0x4010 ordinal: 0x8
  ULONG NodesTrimmedBasedOnAge;              // offset: 0x4014 ordinal: 0x9
  ULONG NodesTrimmedBasedOnCount;            // offset: 0x4018 ordinal: 0xa
  ULONG NodesSearched;                       // offset: 0x401c ordinal: 0xb
  ULONG MaxNodesSearched;                    // offset: 0x4020 ordinal: 0xc
  ULONG SequenceNumber;                      // offset: 0x4024 ordinal: 0xd
  ULONG RecursionDepthLimit;                 // offset: 0x4028 ordinal: 0xe
  ULONG SearchedNodesLimit;                  // offset: 0x402c ordinal: 0xf
  ULONG DepthLimitHits;                      // offset: 0x4030 ordinal: 0x10
  ULONG SearchLimitHits;                     // offset: 0x4034 ordinal: 0x11
  ULONG StackLimitHits;                      // offset: 0x4038 ordinal: 0x12
  ULONG ABC_ACB_Skipped;                     // offset: 0x403c ordinal: 0x13
  ULONG OutOfOrderReleases;                  // offset: 0x4040 ordinal: 0x14
  ULONG NodesReleasedOutOfOrder;             // offset: 0x4044 ordinal: 0x15
  ULONG TotalReleases;                       // offset: 0x4048 ordinal: 0x16
  ULONG RootNodesDeleted;                    // offset: 0x404c ordinal: 0x17
  ULONG ForgetHistoryCounter;                // offset: 0x4050 ordinal: 0x18
  VOID *Instigator;                          // offset: 0x4054 ordinal: 0x19
  ULONG NumberOfParticipants;                // offset: 0x4058 ordinal: 0x1a
  struct _VI_DEADLOCK_NODE *Participant[32]; // offset: 0x405c ordinal: 0x1b
  LONG ChildrenCountWatermark;               // offset: 0x40dc ordinal: 0x1c
  enum _KERNEL_STACK_LIMITS StackType;       // offset: 0x40e0 ordinal: 0x1d
  ULONG StackLowLimit;                       // offset: 0x40e4 ordinal: 0x1e
  ULONG StackHighLimit;                      // offset: 0x40e8 ordinal: 0x1f
} _VI_DEADLOCK_GLOBALS;

// 0x8 bytes (sizeof)
typedef struct _LEARNING_MODE_DATA {
  ULONG Settings;              // offset: 0x0 ordinal: 0x0
  UCHAR Enabled;               // offset: 0x4 ordinal: 0x1
  UCHAR PermissiveModeEnabled; // offset: 0x5 ordinal: 0x2
} _LEARNING_MODE_DATA;

// 0x38 bytes (sizeof)
typedef struct _FAST_ERESOURCE_INTERNAL {
  struct _LIST_ENTRY SystemResourcesList; // offset: 0x0 ordinal: 0x0
  VOID *ReservedPointer;                  // offset: 0x8 ordinal: 0x1
  SHORT ActiveCount;                      // offset: 0xc ordinal: 0x2
  USHORT Flag;                            // offset: 0xe ordinal: 0x3
  struct _KWAIT_CHAIN SharedWaiters;      // offset: 0x10 ordinal: 0x4
  struct _KWAIT_CHAIN ExclusiveWaiters;   // offset: 0x14 ordinal: 0x5
  struct _LIST_ENTRY OwnerEntryListHead;  // offset: 0x18 ordinal: 0x6
  ULONG ActiveEntries;                    // offset: 0x20 ordinal: 0x7
  ULONG ContentionCount;                  // offset: 0x24 ordinal: 0x8
  ULONG NumberOfSharedWaiters;            // offset: 0x28 ordinal: 0x9
  ULONG NumberOfExclusiveWaiters;         // offset: 0x2c ordinal: 0xa
  union {
    VOID *Address;               // offset: 0x30 ordinal: 0xb
    ULONG CreatorBackTraceIndex; // offset: 0x30 ordinal: 0xc
  };
  ULONG SpinLock; // offset: 0x34 ordinal: 0xd
} _FAST_ERESOURCE_INTERNAL;

typedef VOID (*__anon_3176)(enum _DUMP_EVENTS, VOID *, ULONG);

typedef LONG (*__anon_3174)(ULONG, ULONG, VOID *, ULONG);

// 0x8 bytes (sizeof)
typedef struct __anon_3171 {
  ULONG Signature; // offset: 0x0 ordinal: 0x0
  ULONG CheckSum;  // offset: 0x4 ordinal: 0x1
} __anon_3171;

// 0x18 bytes (sizeof)
typedef struct _DIAGNOSTIC_BUFFER {
  ULONG Size;                      // offset: 0x0 ordinal: 0x0
  enum _REQUESTER_TYPE CallerType; // offset: 0x4 ordinal: 0x1
  ULONG ProcessImageNameOffset;    // offset: 0x8 ordinal: 0x2
  ULONG ProcessId;                 // offset: 0xc ordinal: 0x3
  ULONG ServiceTag;                // offset: 0x10 ordinal: 0x4
  ULONG DeviceDescriptionOffset;   // offset: 0x8 ordinal: 0x5
  ULONG DevicePathOffset;          // offset: 0xc ordinal: 0x6
  ULONG ReasonOffset;              // offset: 0x14 ordinal: 0x7
} _DIAGNOSTIC_BUFFER;

// 0x4 bytes (sizeof)
typedef union RTLP_HP_LFH_PERF_FLAGS {
  ULONG HotspotDetection : 1;            // offset: 0x0 ordinal: 0x0
  ULONG HotspotFullCommit : 1;           // offset: 0x0 ordinal: 0x1
  ULONG ActiveSubsegment : 1;            // offset: 0x0 ordinal: 0x2
  ULONG SmallerSubsegment : 1;           // offset: 0x0 ordinal: 0x3
  ULONG SingleAffinitySlot : 1;          // offset: 0x0 ordinal: 0x4
  ULONG ApplyLfhDecommitPolicy : 1;      // offset: 0x0 ordinal: 0x5
  ULONG EnableGarbageCollection : 1;     // offset: 0x0 ordinal: 0x6
  ULONG LargePagePreCommit : 1;          // offset: 0x0 ordinal: 0x7
  ULONG OpportunisticLargePreCommit : 1; // offset: 0x0 ordinal: 0x8
  ULONG LfhForcedAffinity : 1;           // offset: 0x0 ordinal: 0x9
  ULONG LfhCachelinePadding : 1;         // offset: 0x0 ordinal: 0xa
  ULONG AllFlags;                        // offset: 0x0 ordinal: 0xb
} RTLP_HP_LFH_PERF_FLAGS;

// 0x4 bytes (sizeof)
typedef union _PPM_COORDINATED_SYNCHRONIZATION {
  LONG AsLong;               // offset: 0x0 ordinal: 0x0
  ULONG EnterProcessor : 12; // offset: 0x0 ordinal: 0x1
  ULONG ExitProcessor : 12;  // offset: 0x0 ordinal: 0x2
  ULONG Transition : 2;      // offset: 0x0 ordinal: 0x3
  ULONG Entered : 1;         // offset: 0x0 ordinal: 0x4
  ULONG EntryPriority : 5;   // offset: 0x0 ordinal: 0x5
} _PPM_COORDINATED_SYNCHRONIZATION;

// 0x20 bytes (sizeof)
typedef struct _VI_TRACK_IRQL {
  VOID *Thread;        // offset: 0x0 ordinal: 0x0
  UCHAR OldIrql;       // offset: 0x4 ordinal: 0x1
  UCHAR NewIrql;       // offset: 0x5 ordinal: 0x2
  USHORT Processor;    // offset: 0x6 ordinal: 0x3
  ULONG TickCount;     // offset: 0x8 ordinal: 0x4
  VOID *StackTrace[5]; // offset: 0xc ordinal: 0x5
} _VI_TRACK_IRQL;

// 0x4 bytes (sizeof)
typedef struct _HEAP_GLOBAL_APPCOMPAT_FLAGS {
  ULONG SafeInputValidation : 1;  // offset: 0x0 ordinal: 0x0
  ULONG Padding : 1;              // offset: 0x0 ordinal: 0x1
  ULONG CommitLFHSubsegments : 1; // offset: 0x0 ordinal: 0x2
  ULONG AllocateHeapFromEnv : 1;  // offset: 0x0 ordinal: 0x3
} _HEAP_GLOBAL_APPCOMPAT_FLAGS;

// 0x8 bytes (sizeof)
typedef struct _TEB_ACTIVE_FRAME_CONTEXT {
  ULONG Flags;     // offset: 0x0 ordinal: 0x0
  CHAR *FrameName; // offset: 0x4 ordinal: 0x1
} _TEB_ACTIVE_FRAME_CONTEXT;

// 0x4 bytes (sizeof)
typedef struct _MMVAD_FLAGS2 {
  ULONG FileOffset : 24;        // offset: 0x0 ordinal: 0x0
  ULONG Large : 1;              // offset: 0x0 ordinal: 0x1
  ULONG TrimBehind : 1;         // offset: 0x0 ordinal: 0x2
  ULONG Inherit : 1;            // offset: 0x0 ordinal: 0x3
  ULONG NoValidationNeeded : 1; // offset: 0x0 ordinal: 0x4
  ULONG PrivateDemandZero : 1;  // offset: 0x0 ordinal: 0x5
  ULONG Spare : 3;              // offset: 0x0 ordinal: 0x6
} _MMVAD_FLAGS2;

// 0x10 bytes (sizeof)
typedef struct _VI_POOL_ENTRY_INUSE {
  VOID *VirtualAddress; // offset: 0x0 ordinal: 0x0
  VOID *CallingAddress; // offset: 0x4 ordinal: 0x1
  ULONG NumberOfBytes;  // offset: 0x8 ordinal: 0x2
  ULONG Tag;            // offset: 0xc ordinal: 0x3
} _VI_POOL_ENTRY_INUSE;

// 0xc bytes (sizeof)
typedef struct _VI_POOL_PAGE_HEADER {
  struct _SINGLE_LIST_ENTRY *NextPage; // offset: 0x0 ordinal: 0x0
  VOID *VerifierEntry;                 // offset: 0x4 ordinal: 0x1
  ULONG Signature;                     // offset: 0x8 ordinal: 0x2
} _VI_POOL_PAGE_HEADER;

// 0x10 bytes (sizeof)
typedef struct _VI_POOL_ENTRY {
  union {
    struct _VI_POOL_PAGE_HEADER PageHeader; // offset: 0x0 ordinal: 0x0
    struct _VI_POOL_ENTRY_INUSE InUse;      // offset: 0x0 ordinal: 0x1
    struct _SINGLE_LIST_ENTRY *NextFree;    // offset: 0x0 ordinal: 0x2
  };
} _VI_POOL_ENTRY;

// 0x4 bytes (sizeof)
typedef struct _VI_VERIFIER_POOL_HEADER {
  struct _VI_POOL_ENTRY *VerifierPoolEntry; // offset: 0x0 ordinal: 0x0
} _VI_VERIFIER_POOL_HEADER;

// 0x4 bytes (sizeof)
typedef struct __anon_3078 {
  ULONG SnapSharedExportsFailed : 1; // offset: 0x0 ordinal: 0x0
  ULONG Spare : 31;                  // offset: 0x0 ordinal: 0x1
} __anon_3078;

// 0x10 bytes (sizeof)
typedef union __anon_3079 {
  struct _VF_TARGET_ALL_SHARED_EXPORT_THUNKS
      AllSharedExportThunks; // offset: 0x0 ordinal: 0x0
  struct __anon_3078 Flags;  // offset: 0x0 ordinal: 0x1
} __anon_3079;

// 0x10 bytes (sizeof)
typedef struct _VF_TRACKER {
  ULONG TrackerFlags; // offset: 0x0 ordinal: 0x0
  ULONG TrackerSize;  // offset: 0x4 ordinal: 0x1
  ULONG TrackerIndex; // offset: 0x8 ordinal: 0x2
  ULONG TraceDepth;   // offset: 0xc ordinal: 0x3
} _VF_TRACKER;

// 0xc bytes (sizeof)
typedef struct _IOP_IRP_EXTENSION_STATUS {
  ULONG Flags;      // offset: 0x0 ordinal: 0x0
  ULONG ActivityId; // offset: 0x4 ordinal: 0x1
  ULONG IoTracking; // offset: 0x8 ordinal: 0x2
} _IOP_IRP_EXTENSION_STATUS;

// 0x4 bytes (sizeof)
typedef union _KSTACK_COUNT {
  LONG Value;            // offset: 0x0 ordinal: 0x0
  ULONG State : 3;       // offset: 0x0 ordinal: 0x1
  ULONG StackCount : 29; // offset: 0x0 ordinal: 0x2
} _KSTACK_COUNT;

// 0x90 bytes (sizeof)
typedef struct _MM_DRIVER_VERIFIER_DATA {
  ULONG Level;                               // offset: 0x0 ordinal: 0x0
  ULONG RaiseIrqls;                          // offset: 0x4 ordinal: 0x1
  ULONG AcquireSpinLocks;                    // offset: 0x8 ordinal: 0x2
  ULONG SynchronizeExecutions;               // offset: 0xc ordinal: 0x3
  ULONG AllocationsAttempted;                // offset: 0x10 ordinal: 0x4
  ULONG AllocationsSucceeded;                // offset: 0x14 ordinal: 0x5
  ULONG AllocationsSucceededSpecialPool;     // offset: 0x18 ordinal: 0x6
  ULONG AllocationsWithNoTag;                // offset: 0x1c ordinal: 0x7
  ULONG TrimRequests;                        // offset: 0x20 ordinal: 0x8
  ULONG Trims;                               // offset: 0x24 ordinal: 0x9
  ULONG AllocationsFailed;                   // offset: 0x28 ordinal: 0xa
  ULONG AllocationsFailedDeliberately;       // offset: 0x2c ordinal: 0xb
  ULONG Loads;                               // offset: 0x30 ordinal: 0xc
  ULONG Unloads;                             // offset: 0x34 ordinal: 0xd
  ULONG UnTrackedPool;                       // offset: 0x38 ordinal: 0xe
  ULONG UserTrims;                           // offset: 0x3c ordinal: 0xf
  ULONG CurrentPagedPoolAllocations;         // offset: 0x40 ordinal: 0x10
  ULONG CurrentNonPagedPoolAllocations;      // offset: 0x44 ordinal: 0x11
  ULONG PeakPagedPoolAllocations;            // offset: 0x48 ordinal: 0x12
  ULONG PeakNonPagedPoolAllocations;         // offset: 0x4c ordinal: 0x13
  ULONG PagedBytes;                          // offset: 0x50 ordinal: 0x14
  ULONG NonPagedBytes;                       // offset: 0x54 ordinal: 0x15
  ULONG PeakPagedBytes;                      // offset: 0x58 ordinal: 0x16
  ULONG PeakNonPagedBytes;                   // offset: 0x5c ordinal: 0x17
  ULONG BurstAllocationsFailedDeliberately;  // offset: 0x60 ordinal: 0x18
  ULONG SessionTrims;                        // offset: 0x64 ordinal: 0x19
  ULONG OptionChanges;                       // offset: 0x68 ordinal: 0x1a
  ULONG VerifyMode;                          // offset: 0x6c ordinal: 0x1b
  struct _UNICODE_STRING PreviousBucketName; // offset: 0x70 ordinal: 0x1c
  ULONG ExecutePoolTypes;                    // offset: 0x78 ordinal: 0x1d
  ULONG ExecutePageProtections;              // offset: 0x7c ordinal: 0x1e
  ULONG ExecutePageMappings;                 // offset: 0x80 ordinal: 0x1f
  ULONG ExecuteWriteSections;                // offset: 0x84 ordinal: 0x20
  ULONG SectionAlignmentFailures;            // offset: 0x88 ordinal: 0x21
  ULONG IATInExecutableSection;              // offset: 0x8c ordinal: 0x22
} _MM_DRIVER_VERIFIER_DATA;

// 0x10 bytes (sizeof)
typedef struct _RTL_ATOM_TABLE_REFERENCE {
  struct _LIST_ENTRY LowBoxList; // offset: 0x0 ordinal: 0x0
  ULONG LowBoxID;                // offset: 0x8 ordinal: 0x1
  USHORT ReferenceCount;         // offset: 0xc ordinal: 0x2
  USHORT Flags;                  // offset: 0xe ordinal: 0x3
} _RTL_ATOM_TABLE_REFERENCE;

// 0x1c bytes (sizeof)
typedef struct _RTL_ATOM_TABLE_ENTRY {
  struct _RTL_ATOM_TABLE_ENTRY *HashLink;     // offset: 0x0 ordinal: 0x0
  USHORT HandleIndex;                         // offset: 0x4 ordinal: 0x1
  USHORT Atom;                                // offset: 0x6 ordinal: 0x2
  struct _RTL_ATOM_TABLE_REFERENCE Reference; // offset: 0x8 ordinal: 0x3
  UCHAR NameLength;                           // offset: 0x18 ordinal: 0x4
  WCHAR Name[1];                              // offset: 0x1a ordinal: 0x5
} _RTL_ATOM_TABLE_ENTRY;

// 0x4 bytes (sizeof)
typedef struct __anon_3026 {
  ULONG Type; // offset: 0x0 ordinal: 0x0
} __anon_3026;

// 0x4 bytes (sizeof)
typedef struct __anon_3025 {
  ULONG PercentLevel; // offset: 0x0 ordinal: 0x0
} __anon_3025;

// 0x10 bytes (sizeof)
typedef struct _POP_ACTION_TRIGGER {
  enum POWER_POLICY_DEVICE_TYPE Type; // offset: 0x0 ordinal: 0x0
  ULONG Flags;                        // offset: 0x4 ordinal: 0x1
  struct _POP_TRIGGER_WAIT *Wait;     // offset: 0x8 ordinal: 0x2
  union {
    struct __anon_3025 Battery; // offset: 0xc ordinal: 0x3
    struct __anon_3026 Button;  // offset: 0xc ordinal: 0x4
  };
} _POP_ACTION_TRIGGER;

// 0x20 bytes (sizeof)
typedef struct _POP_TRIGGER_WAIT {
  struct _KEVENT Event;                // offset: 0x0 ordinal: 0x0
  LONG Status;                         // offset: 0x10 ordinal: 0x1
  struct _LIST_ENTRY Link;             // offset: 0x14 ordinal: 0x2
  struct _POP_ACTION_TRIGGER *Trigger; // offset: 0x1c ordinal: 0x3
} _POP_TRIGGER_WAIT;

// 0x4 bytes (sizeof)
typedef struct _PS_TRUSTLET_ATTRIBUTE_TYPE {
  UCHAR Version;      // offset: 0x0 ordinal: 0x0
  UCHAR DataCount;    // offset: 0x1 ordinal: 0x1
  UCHAR SemanticType; // offset: 0x2 ordinal: 0x2
  union _PS_TRUSTLET_ATTRIBUTE_ACCESSRIGHTS
      AccessRights;    // offset: 0x3 ordinal: 0x3
  ULONG AttributeType; // offset: 0x0 ordinal: 0x4
} _PS_TRUSTLET_ATTRIBUTE_TYPE;

// 0x44 bytes (sizeof)
typedef struct _PI_BUS_EXTENSION {
  ULONG Flags;                                // offset: 0x0 ordinal: 0x0
  UCHAR NumberCSNs;                           // offset: 0x4 ordinal: 0x1
  UCHAR *ReadDataPort;                        // offset: 0x8 ordinal: 0x2
  UCHAR DataPortMapped;                       // offset: 0xc ordinal: 0x3
  UCHAR *AddressPort;                         // offset: 0x10 ordinal: 0x4
  UCHAR AddrPortMapped;                       // offset: 0x14 ordinal: 0x5
  UCHAR *CommandPort;                         // offset: 0x18 ordinal: 0x6
  UCHAR CmdPortMapped;                        // offset: 0x1c ordinal: 0x7
  ULONG NextSlotNumber;                       // offset: 0x20 ordinal: 0x8
  struct _SINGLE_LIST_ENTRY DeviceList;       // offset: 0x24 ordinal: 0x9
  struct _SINGLE_LIST_ENTRY CardList;         // offset: 0x28 ordinal: 0xa
  struct _DEVICE_OBJECT *PhysicalBusDevice;   // offset: 0x2c ordinal: 0xb
  struct _DEVICE_OBJECT *FunctionalBusDevice; // offset: 0x30 ordinal: 0xc
  struct _DEVICE_OBJECT *AttachedDevice;      // offset: 0x34 ordinal: 0xd
  ULONG BusNumber;                            // offset: 0x38 ordinal: 0xe
  enum _SYSTEM_POWER_STATE SystemPowerState;  // offset: 0x3c ordinal: 0xf
  enum _DEVICE_POWER_STATE DevicePowerState;  // offset: 0x40 ordinal: 0x10
} _PI_BUS_EXTENSION;

// 0x8 bytes (sizeof)
typedef struct _BUS_EXTENSION_LIST {
  VOID *Next;                             // offset: 0x0 ordinal: 0x0
  struct _PI_BUS_EXTENSION *BusExtension; // offset: 0x4 ordinal: 0x1
} _BUS_EXTENSION_LIST;

// 0x4c bytes (sizeof)
typedef struct _THERMAL_INFORMATION {
  ULONG ThermalStamp;         // offset: 0x0 ordinal: 0x0
  ULONG ThermalConstant1;     // offset: 0x4 ordinal: 0x1
  ULONG ThermalConstant2;     // offset: 0x8 ordinal: 0x2
  ULONG Processors;           // offset: 0xc ordinal: 0x3
  ULONG SamplingPeriod;       // offset: 0x10 ordinal: 0x4
  ULONG CurrentTemperature;   // offset: 0x14 ordinal: 0x5
  ULONG PassiveTripPoint;     // offset: 0x18 ordinal: 0x6
  ULONG CriticalTripPoint;    // offset: 0x1c ordinal: 0x7
  UCHAR ActiveTripPointCount; // offset: 0x20 ordinal: 0x8
  ULONG ActiveTripPoint[10];  // offset: 0x24 ordinal: 0x9
} _THERMAL_INFORMATION;

// 0x18 bytes (sizeof)
typedef struct _THERMAL_POLICY {
  ULONG Version;           // offset: 0x0 ordinal: 0x0
  UCHAR WaitForUpdate;     // offset: 0x4 ordinal: 0x1
  UCHAR Hibernate;         // offset: 0x5 ordinal: 0x2
  UCHAR Critical;          // offset: 0x6 ordinal: 0x3
  UCHAR ThermalStandby;    // offset: 0x7 ordinal: 0x4
  ULONG ActivationReasons; // offset: 0x8 ordinal: 0x5
  ULONG PassiveLimit;      // offset: 0xc ordinal: 0x6
  ULONG ActiveLevel;       // offset: 0x10 ordinal: 0x7
  UCHAR OverThrottled;     // offset: 0x14 ordinal: 0x8
} _THERMAL_POLICY;

// 0x5c bytes (sizeof)
typedef struct _THERMAL_INFORMATION_EX {
  ULONG ThermalStamp;                 // offset: 0x0 ordinal: 0x0
  ULONG ThermalConstant1;             // offset: 0x4 ordinal: 0x1
  ULONG ThermalConstant2;             // offset: 0x8 ordinal: 0x2
  ULONG SamplingPeriod;               // offset: 0xc ordinal: 0x3
  ULONG CurrentTemperature;           // offset: 0x10 ordinal: 0x4
  ULONG PassiveTripPoint;             // offset: 0x14 ordinal: 0x5
  ULONG ThermalStandbyTripPoint;      // offset: 0x18 ordinal: 0x6
  ULONG CriticalTripPoint;            // offset: 0x1c ordinal: 0x7
  UCHAR ActiveTripPointCount;         // offset: 0x20 ordinal: 0x8
  UCHAR PassiveCoolingDevicesPresent; // offset: 0x21 ordinal: 0x9
  ULONG ActiveTripPoint[10];          // offset: 0x24 ordinal: 0xa
  ULONG S4TransitionTripPoint;        // offset: 0x4c ordinal: 0xb
  ULONG MinimumThrottle;              // offset: 0x50 ordinal: 0xc
  ULONG OverThrottleThreshold;        // offset: 0x54 ordinal: 0xd
  ULONG PollingPeriod;                // offset: 0x58 ordinal: 0xe
} _THERMAL_INFORMATION_EX;

// 0x8 bytes (sizeof)
typedef struct BATTERY_REPORTING_SCALE {
  ULONG Granularity; // offset: 0x0 ordinal: 0x0
  ULONG Capacity;    // offset: 0x4 ordinal: 0x1
} BATTERY_REPORTING_SCALE;

// 0x4c bytes (sizeof)
typedef struct SYSTEM_POWER_CAPABILITIES {
  UCHAR PowerButtonPresent;                       // offset: 0x0 ordinal: 0x0
  UCHAR SleepButtonPresent;                       // offset: 0x1 ordinal: 0x1
  UCHAR LidPresent;                               // offset: 0x2 ordinal: 0x2
  UCHAR SystemS1;                                 // offset: 0x3 ordinal: 0x3
  UCHAR SystemS2;                                 // offset: 0x4 ordinal: 0x4
  UCHAR SystemS3;                                 // offset: 0x5 ordinal: 0x5
  UCHAR SystemS4;                                 // offset: 0x6 ordinal: 0x6
  UCHAR SystemS5;                                 // offset: 0x7 ordinal: 0x7
  UCHAR HiberFilePresent;                         // offset: 0x8 ordinal: 0x8
  UCHAR FullWake;                                 // offset: 0x9 ordinal: 0x9
  UCHAR VideoDimPresent;                          // offset: 0xa ordinal: 0xa
  UCHAR ApmPresent;                               // offset: 0xb ordinal: 0xb
  UCHAR UpsPresent;                               // offset: 0xc ordinal: 0xc
  UCHAR ThermalControl;                           // offset: 0xd ordinal: 0xd
  UCHAR ProcessorThrottle;                        // offset: 0xe ordinal: 0xe
  UCHAR ProcessorMinThrottle;                     // offset: 0xf ordinal: 0xf
  UCHAR ProcessorMaxThrottle;                     // offset: 0x10 ordinal: 0x10
  UCHAR FastSystemS4;                             // offset: 0x11 ordinal: 0x11
  UCHAR Hiberboot;                                // offset: 0x12 ordinal: 0x12
  UCHAR WakeAlarmPresent;                         // offset: 0x13 ordinal: 0x13
  UCHAR AoAc;                                     // offset: 0x14 ordinal: 0x14
  UCHAR DiskSpinDown;                             // offset: 0x15 ordinal: 0x15
  UCHAR HiberFileType;                            // offset: 0x16 ordinal: 0x16
  UCHAR AoAcConnectivitySupported;                // offset: 0x17 ordinal: 0x17
  UCHAR spare3[6];                                // offset: 0x18 ordinal: 0x18
  UCHAR SystemBatteriesPresent;                   // offset: 0x1e ordinal: 0x19
  UCHAR BatteriesAreShortTerm;                    // offset: 0x1f ordinal: 0x1a
  struct BATTERY_REPORTING_SCALE BatteryScale[3]; // offset: 0x20 ordinal: 0x1b
  enum _SYSTEM_POWER_STATE AcOnLineWake;          // offset: 0x38 ordinal: 0x1c
  enum _SYSTEM_POWER_STATE SoftLidWake;           // offset: 0x3c ordinal: 0x1d
  enum _SYSTEM_POWER_STATE RtcWake;               // offset: 0x40 ordinal: 0x1e
  enum _SYSTEM_POWER_STATE MinDeviceWakeState;    // offset: 0x44 ordinal: 0x1f
  enum _SYSTEM_POWER_STATE DefaultLowLatencyWake; // offset: 0x48 ordinal: 0x20
} SYSTEM_POWER_CAPABILITIES;

// 0x40 bytes (sizeof)
typedef struct _VF_POOL_TRACE {
  VOID *Address;           // offset: 0x0 ordinal: 0x0
  ULONG Size;              // offset: 0x4 ordinal: 0x1
  struct _ETHREAD *Thread; // offset: 0x8 ordinal: 0x2
  VOID *StackTrace[13];    // offset: 0xc ordinal: 0x3
} _VF_POOL_TRACE;

// 0x14 bytes (sizeof)
typedef struct _RTL_RANGE_LIST {
  struct _LIST_ENTRY ListHead; // offset: 0x0 ordinal: 0x0
  ULONG Flags;                 // offset: 0x8 ordinal: 0x1
  ULONG Count;                 // offset: 0xc ordinal: 0x2
  ULONG Stamp;                 // offset: 0x10 ordinal: 0x3
} _RTL_RANGE_LIST;

// 0x8 bytes (sizeof)
typedef struct _VF_AVL_TREE_NODE {
  VOID *p;         // offset: 0x0 ordinal: 0x0
  ULONG RangeSize; // offset: 0x4 ordinal: 0x1
} _VF_AVL_TREE_NODE;

// 0xc bytes (sizeof)
typedef struct _VF_AVL_TREE_NODE_EX {
  struct _VF_AVL_TREE_NODE Base; // offset: 0x0 ordinal: 0x0
  ULONG SessionId;               // offset: 0x8 ordinal: 0x1
} _VF_AVL_TREE_NODE_EX;

// 0x4 bytes (sizeof)
typedef union __anon_2905 {
  ULONG NodeSize;     // offset: 0x0 ordinal: 0x0
  ULONG UseLookaside; // offset: 0x0 ordinal: 0x1
} __anon_2905;

// 0x8 bytes (sizeof)
typedef struct PROCESSOR_IDLESTATE_INFO {
  ULONG TimeCheck;      // offset: 0x0 ordinal: 0x0
  UCHAR DemotePercent;  // offset: 0x4 ordinal: 0x1
  UCHAR PromotePercent; // offset: 0x5 ordinal: 0x2
  UCHAR Spare[2];       // offset: 0x6 ordinal: 0x3
} PROCESSOR_IDLESTATE_INFO;

// 0x20 bytes (sizeof)
typedef struct PROCESSOR_IDLESTATE_POLICY {
  USHORT Revision;                           // offset: 0x0 ordinal: 0x0
  union __anon_2901 Flags;                   // offset: 0x2 ordinal: 0x1
  ULONG PolicyCount;                         // offset: 0x4 ordinal: 0x2
  struct PROCESSOR_IDLESTATE_INFO Policy[3]; // offset: 0x8 ordinal: 0x3
} PROCESSOR_IDLESTATE_POLICY;

// 0x4 bytes (sizeof)
typedef struct _MI_SYSTEM_REGION_ANCHOR {
  ULONG ReferenceCount : 31; // offset: 0x0 ordinal: 0x0
  ULONG BeingDeleted : 1;    // offset: 0x0 ordinal: 0x1
} _MI_SYSTEM_REGION_ANCHOR;

// 0x4 bytes (sizeof)
typedef struct __anon_2893 {
  union {
    struct _MI_SYSTEM_REGION_ANCHOR Anchor; // offset: 0x0 ordinal: 0x0
    ULONG EntireReference;                  // offset: 0x0 ordinal: 0x1
  };
} __anon_2893;

// 0x4 bytes (sizeof)
typedef struct _MI_SYSTEM_REGION_REFERENCE {
  struct __anon_2893 u1; // offset: 0x0 ordinal: 0x0
} _MI_SYSTEM_REGION_REFERENCE;

// 0x4 bytes (sizeof)
typedef union __anon_2887 {
  struct _CONTROL_AREA *ControlArea; // offset: 0x0 ordinal: 0x0
  struct _FILE_OBJECT *FileObject;   // offset: 0x0 ordinal: 0x1
  ULONG RemoteImageFileObject : 1;   // offset: 0x0 ordinal: 0x2
  ULONG RemoteDataFileObject : 1;    // offset: 0x0 ordinal: 0x3
} __anon_2887;

// 0xc bytes (sizeof)
typedef struct _HAL_CHANNEL_MEMORY_RANGES {
  ULONG PageFrameIndex;    // offset: 0x0 ordinal: 0x0
  USHORT MpnId;            // offset: 0x4 ordinal: 0x1
  USHORT Node;             // offset: 0x6 ordinal: 0x2
  USHORT Channel;          // offset: 0x8 ordinal: 0x3
  UCHAR IsPowerManageable; // offset: 0xa ordinal: 0x4
  UCHAR DeepPowerState;    // offset: 0xb ordinal: 0x5
} _HAL_CHANNEL_MEMORY_RANGES;

// 0x8 bytes (sizeof)
typedef struct _HAL_NODE_RANGE {
  ULONG PageFrameIndex; // offset: 0x0 ordinal: 0x0
  ULONG Node;           // offset: 0x4 ordinal: 0x1
} _HAL_NODE_RANGE;

// 0x4 bytes (sizeof)
typedef struct _MI_NODE_NUMBER_ZERO_BASED {
  ULONG ZeroBased; // offset: 0x0 ordinal: 0x0
} _MI_NODE_NUMBER_ZERO_BASED;

// 0x10 bytes (sizeof)
typedef struct _PAE_PAGEINFO {
  struct _LIST_ENTRY ListHead; // offset: 0x0 ordinal: 0x0
  ULONG PageFrameNumber;       // offset: 0x8 ordinal: 0x1
  ULONG EntriesInUse;          // offset: 0xc ordinal: 0x2
} _PAE_PAGEINFO;

// 0x8c bytes (sizeof)
typedef struct _SYSPTES_HEADER {
  struct _LIST_ENTRY ListHead[16]; // offset: 0x0 ordinal: 0x0
  ULONG Count;                     // offset: 0x80 ordinal: 0x1
  ULONG NumberOfEntries;           // offset: 0x84 ordinal: 0x2
  ULONG NumberOfEntriesPeak;       // offset: 0x88 ordinal: 0x3
} _SYSPTES_HEADER;

// 0x20 bytes (sizeof)
typedef struct _MI_IO_CACHE_STATS {
  ULONG UnusedBlocks;                 // offset: 0x0 ordinal: 0x0
  ULONG ActiveCacheMatch;             // offset: 0x4 ordinal: 0x1
  ULONG ActiveCacheOverride;          // offset: 0x8 ordinal: 0x2
  ULONG UnmappedCacheFlush;           // offset: 0xc ordinal: 0x3
  ULONG UnmappedCacheMatch;           // offset: 0x10 ordinal: 0x4
  ULONG UnmappedCacheConflict;        // offset: 0x14 ordinal: 0x5
  ULONG PermanentIoAttributeConflict; // offset: 0x18 ordinal: 0x6
  ULONG PermanentIoNodeConflict;      // offset: 0x1c ordinal: 0x7
} _MI_IO_CACHE_STATS;

// 0x8 bytes (sizeof)
typedef struct _MI_RESAVAIL_FAILURES {
  ULONG Wrap;     // offset: 0x0 ordinal: 0x0
  ULONG NoCharge; // offset: 0x4 ordinal: 0x1
} _MI_RESAVAIL_FAILURES;

// 0x8 bytes (sizeof)
typedef struct _MI_FORCED_COMMITS {
  ULONG Regular; // offset: 0x0 ordinal: 0x0
  ULONG Wrap;    // offset: 0x4 ordinal: 0x1
} _MI_FORCED_COMMITS;

// 0x44 bytes (sizeof)
typedef struct _MI_PROBE_RAISE_TRACKER {
  ULONG UserRangeInKernel;              // offset: 0x0 ordinal: 0x0
  ULONG FaultFailed;                    // offset: 0x4 ordinal: 0x1
  ULONG WriteFaultFailed;               // offset: 0x8 ordinal: 0x2
  ULONG LargePageFailed;                // offset: 0xc ordinal: 0x3
  ULONG UserAccessToKernelPte;          // offset: 0x10 ordinal: 0x4
  ULONG BadPageLocation;                // offset: 0x14 ordinal: 0x5
  ULONG InsufficientCharge;             // offset: 0x18 ordinal: 0x6
  ULONG PageTableCharge;                // offset: 0x1c ordinal: 0x7
  ULONG NoPhysicalMapping;              // offset: 0x20 ordinal: 0x8
  ULONG NoIoReference;                  // offset: 0x24 ordinal: 0x9
  ULONG ProbeFailed;                    // offset: 0x28 ordinal: 0xa
  ULONG PteIsZero;                      // offset: 0x2c ordinal: 0xb
  ULONG StrongCodeWrite;                // offset: 0x30 ordinal: 0xc
  ULONG ReducedCloneCommitChargeFailed; // offset: 0x34 ordinal: 0xd
  ULONG CopyOnWriteAtDispatchNoPages;   // offset: 0x38 ordinal: 0xe
  ULONG NoPageTablesAllowed;            // offset: 0x3c ordinal: 0xf
  ULONG EnclavePageFailed;              // offset: 0x40 ordinal: 0x10
} _MI_PROBE_RAISE_TRACKER;

// 0x10 bytes (sizeof)
typedef struct _MM_SYSTEM_PAGE_COUNTS {
  ULONG SystemCodePage;        // offset: 0x0 ordinal: 0x0
  ULONG SystemDriverPage;      // offset: 0x4 ordinal: 0x1
  LONG TotalSystemCodePages;   // offset: 0x8 ordinal: 0x2
  LONG TotalSystemDriverPages; // offset: 0xc ordinal: 0x3
} _MM_SYSTEM_PAGE_COUNTS;

// 0x40 bytes (sizeof)
typedef struct _MI_IO_PAGE_STATE {
  LONG IoPfnLock;                         // offset: 0x0 ordinal: 0x0
  struct _RTL_AVL_TREE IoPfnRoot[3];      // offset: 0x4 ordinal: 0x1
  struct _LIST_ENTRY UnusedCachedMaps;    // offset: 0x10 ordinal: 0x2
  ULONG OldestCacheFlushTimeStamp;        // offset: 0x18 ordinal: 0x3
  struct _MI_IO_CACHE_STATS IoCacheStats; // offset: 0x1c ordinal: 0x4
  struct _RTL_AVL_TREE InvariantIoSpace;  // offset: 0x3c ordinal: 0x5
} _MI_IO_PAGE_STATE;

// 0x14 bytes (sizeof)
typedef struct _MI_PAGELIST_STATE {
  LONG ActiveSpinLock;                       // offset: 0x0 ordinal: 0x0
  struct _RTL_AVL_TREE ActiveThreadTree;     // offset: 0x4 ordinal: 0x1
  LONG ActiveZeroSpinLock;                   // offset: 0x8 ordinal: 0x2
  struct _RTL_AVL_TREE ActiveZeroThreadTree; // offset: 0xc ordinal: 0x3
  ULONG NumberOfLargePageListHeads;          // offset: 0x10 ordinal: 0x4
} _MI_PAGELIST_STATE;

// 0x4 bytes (sizeof)
typedef struct _FAULT_INFORMATION_ARM64_FLAGS {
  ULONG WriteNotRead : 1;       // offset: 0x0 ordinal: 0x0
  ULONG InstructionNotData : 1; // offset: 0x0 ordinal: 0x1
  ULONG Privileged : 1;         // offset: 0x0 ordinal: 0x2
  ULONG FaultAddressValid : 1;  // offset: 0x0 ordinal: 0x3
  ULONG Reserved : 28;          // offset: 0x0 ordinal: 0x4
} _FAULT_INFORMATION_ARM64_FLAGS;

// 0x18 bytes (sizeof)
typedef struct _FAULT_INFORMATION_ARM64 {
  VOID *DomainHandle;                          // offset: 0x0 ordinal: 0x0
  VOID *FaultAddress;                          // offset: 0x4 ordinal: 0x1
  struct _DEVICE_OBJECT *PhysicalDeviceObject; // offset: 0x8 ordinal: 0x2
  ULONG InputMappingId;                        // offset: 0xc ordinal: 0x3
  struct _FAULT_INFORMATION_ARM64_FLAGS Flags; // offset: 0x10 ordinal: 0x4
  enum _FAULT_INFORMATION_ARM64_TYPE Type;     // offset: 0x14 ordinal: 0x5
} _FAULT_INFORMATION_ARM64;

// 0x1c bytes (sizeof)
typedef struct _FAULT_INFORMATION {
  enum _FAULT_INFORMATION_ARCH Type;     // offset: 0x0 ordinal: 0x0
  struct _FAULT_INFORMATION_ARM64 Arm64; // offset: 0x4 ordinal: 0x1
} _FAULT_INFORMATION;

typedef VOID (*__anon_2803)(VOID *, struct _FAULT_INFORMATION *);

// 0x8 bytes (sizeof)
typedef struct _DEVICE_FAULT_CONFIGURATION {
  VOID(*FaultHandler)
  (VOID *, struct _FAULT_INFORMATION *); // offset: 0x0 ordinal: 0x0
  VOID *FaultContext;                    // offset: 0x4 ordinal: 0x1
} _DEVICE_FAULT_CONFIGURATION;

// 0x4 bytes (sizeof)
typedef struct __anon_2797 {
  ULONG PasidMaxWidth : 5;           // offset: 0x0 ordinal: 0x0
  ULONG PasidExePerm : 1;            // offset: 0x0 ordinal: 0x1
  ULONG PasidPrivMode : 1;           // offset: 0x0 ordinal: 0x2
  ULONG AtsPageAlignedRequest : 1;   // offset: 0x0 ordinal: 0x3
  ULONG AtsGlobalInvalidate : 1;     // offset: 0x0 ordinal: 0x4
  ULONG AtsInvalidateQueueDepth : 5; // offset: 0x0 ordinal: 0x5
} __anon_2797;

// 0x4 bytes (sizeof)
typedef union __anon_2796 {
  ULONG NumberOfEntries : 10; // offset: 0x0 ordinal: 0x0
  ULONG PageSize : 2;         // offset: 0x0 ordinal: 0x1
  VOID *Va;                   // offset: 0x0 ordinal: 0x2
  ULONG VaLong;               // offset: 0x0 ordinal: 0x3
} __anon_2796;

// 0x4 bytes (sizeof)
typedef struct _KTB_FLUSH_VA {
  union __anon_2796 u1; // offset: 0x0 ordinal: 0x0
} _KTB_FLUSH_VA;

// 0x4 bytes (sizeof)
typedef struct __anon_2794 {
  ULONG PmemErrInfo; // offset: 0x0 ordinal: 0x0
} __anon_2794;

// 0xc bytes (sizeof)
typedef struct __anon_2793 {
  ULONG Address;        // offset: 0x0 ordinal: 0x0
  UCHAR Consumed;       // offset: 0x4 ordinal: 0x1
  USHORT ErrorCode;     // offset: 0x6 ordinal: 0x2
  UCHAR ErrorIpValid;   // offset: 0x8 ordinal: 0x3
  UCHAR RestartIpValid; // offset: 0x9 ordinal: 0x4
  UCHAR ClearPoison;    // offset: 0xa ordinal: 0x5
} __anon_2793;

// 0x38 bytes (sizeof)
typedef struct _VIRTUAL_EFI_RUNTIME_SERVICES {
  ULONG GetTime;                   // offset: 0x0 ordinal: 0x0
  ULONG SetTime;                   // offset: 0x4 ordinal: 0x1
  ULONG GetWakeupTime;             // offset: 0x8 ordinal: 0x2
  ULONG SetWakeupTime;             // offset: 0xc ordinal: 0x3
  ULONG SetVirtualAddressMap;      // offset: 0x10 ordinal: 0x4
  ULONG ConvertPointer;            // offset: 0x14 ordinal: 0x5
  ULONG GetVariable;               // offset: 0x18 ordinal: 0x6
  ULONG GetNextVariableName;       // offset: 0x1c ordinal: 0x7
  ULONG SetVariable;               // offset: 0x20 ordinal: 0x8
  ULONG GetNextHighMonotonicCount; // offset: 0x24 ordinal: 0x9
  ULONG ResetSystem;               // offset: 0x28 ordinal: 0xa
  ULONG UpdateCapsule;             // offset: 0x2c ordinal: 0xb
  ULONG QueryCapsuleCapabilities;  // offset: 0x30 ordinal: 0xc
  ULONG QueryVariableInfo;         // offset: 0x34 ordinal: 0xd
} _VIRTUAL_EFI_RUNTIME_SERVICES;

// 0x4 bytes (sizeof)
typedef struct _INPUT_MAPPING_ELEMENT {
  ULONG InputMappingId; // offset: 0x0 ordinal: 0x0
} _INPUT_MAPPING_ELEMENT;

// 0xc bytes (sizeof)
typedef union _IOMMU_SVM_CAPABILITIES {
  ULONG AtsCapability : 1;   // offset: 0x0 ordinal: 0x0
  ULONG PriCapability : 1;   // offset: 0x0 ordinal: 0x1
  ULONG PasidCapability : 1; // offset: 0x0 ordinal: 0x2
  struct __anon_2797 CapReg; // offset: 0x4 ordinal: 0x3
  ULONG Rsvd : 15;           // offset: 0x8 ordinal: 0x4
  ULONG AsULONG;             // offset: 0x0 ordinal: 0x5
} _IOMMU_SVM_CAPABILITIES;

// 0x8 bytes (sizeof)
typedef struct _HAL_HV_DMA_DOMAIN_INFO {
  ULONG DomainId; // offset: 0x0 ordinal: 0x0
  UCHAR IsStage1; // offset: 0x4 ordinal: 0x1
} _HAL_HV_DMA_DOMAIN_INFO;

typedef LONG (*__anon_2703)(struct _HAL_HV_DMA_DOMAIN_INFO *);

// 0xc bytes (sizeof)
typedef struct _HAL_HV_SVM_DEVICE_CAPABILITIES {
  ULONG SvmSupported : 1;     // offset: 0x0 ordinal: 0x0
  ULONG PciExecute : 1;       // offset: 0x0 ordinal: 0x1
  ULONG NoExecute : 1;        // offset: 0x0 ordinal: 0x2
  ULONG Reserved : 28;        // offset: 0x0 ordinal: 0x3
  ULONG OverflowPossible : 1; // offset: 0x0 ordinal: 0x4
  ULONG PasidCount;           // offset: 0x4 ordinal: 0x5
  ULONG IommuIndex;           // offset: 0x8 ordinal: 0x6
} _HAL_HV_SVM_DEVICE_CAPABILITIES;

// 0x18 bytes (sizeof)
typedef struct _HAL_HV_SVM_SYSTEM_CAPABILITIES {
  ULONG SvmSupported : 1;        // offset: 0x0 ordinal: 0x0
  ULONG GpaAlwaysValid : 1;      // offset: 0x0 ordinal: 0x1
  ULONG MaxPasidSpaceCount;      // offset: 0x4 ordinal: 0x2
  ULONG MaxPasidSpacePasidCount; // offset: 0x8 ordinal: 0x3
  ULONG MaxPrqSize;              // offset: 0xc ordinal: 0x4
  ULONG IommuCount;              // offset: 0x10 ordinal: 0x5
  ULONG MinIommuPasidCount;      // offset: 0x14 ordinal: 0x6
} _HAL_HV_SVM_SYSTEM_CAPABILITIES;

typedef VOID (*__anon_2694)(struct _HAL_HV_SVM_SYSTEM_CAPABILITIES *);

// 0x10 bytes (sizeof)
typedef struct _NETWORK_LOADER_BLOCK {
  UCHAR *DHCPServerACK;              // offset: 0x0 ordinal: 0x0
  ULONG DHCPServerACKLength;         // offset: 0x4 ordinal: 0x1
  UCHAR *BootServerReplyPacket;      // offset: 0x8 ordinal: 0x2
  ULONG BootServerReplyPacketLength; // offset: 0xc ordinal: 0x3
} _NETWORK_LOADER_BLOCK;

// 0x4 bytes (sizeof)
typedef struct _DEVICE_FLAGS {
  ULONG Failed : 1;     // offset: 0x0 ordinal: 0x0
  ULONG ReadOnly : 1;   // offset: 0x0 ordinal: 0x1
  ULONG Removable : 1;  // offset: 0x0 ordinal: 0x2
  ULONG ConsoleIn : 1;  // offset: 0x0 ordinal: 0x3
  ULONG ConsoleOut : 1; // offset: 0x0 ordinal: 0x4
  ULONG Input : 1;      // offset: 0x0 ordinal: 0x5
  ULONG Output : 1;     // offset: 0x0 ordinal: 0x6
} _DEVICE_FLAGS;

// 0x4 bytes (sizeof)
typedef struct _PCAT_FIRMWARE_INFORMATION {
  ULONG PlaceHolder; // offset: 0x0 ordinal: 0x0
} _PCAT_FIRMWARE_INFORMATION;

// 0x24 bytes (sizeof)
typedef struct _EFI_FIRMWARE_INFORMATION {
  ULONG FirmwareVersion; // offset: 0x0 ordinal: 0x0
  struct _VIRTUAL_EFI_RUNTIME_SERVICES
      *VirtualEfiRuntimeServices;          // offset: 0x4 ordinal: 0x1
  LONG SetVirtualAddressMapStatus;         // offset: 0x8 ordinal: 0x2
  ULONG MissedMappingsCount;               // offset: 0xc ordinal: 0x3
  struct _LIST_ENTRY FirmwareResourceList; // offset: 0x10 ordinal: 0x4
  VOID *EfiMemoryMap;                      // offset: 0x18 ordinal: 0x5
  ULONG EfiMemoryMapSize;                  // offset: 0x1c ordinal: 0x6
  ULONG EfiMemoryMapDescriptorSize;        // offset: 0x20 ordinal: 0x7
} _EFI_FIRMWARE_INFORMATION;

// 0x24 bytes (sizeof)
typedef union __anon_2677 {
  struct _EFI_FIRMWARE_INFORMATION EfiInformation;   // offset: 0x0 ordinal: 0x0
  struct _PCAT_FIRMWARE_INFORMATION PcatInformation; // offset: 0x0 ordinal: 0x1
} __anon_2677;

// 0x14 bytes (sizeof)
typedef struct _LOADER_HIVE_RECOVERY_INFO {
  ULONG Recovered : 1;          // offset: 0x0 ordinal: 0x0
  ULONG LegacyRecovery : 1;     // offset: 0x0 ordinal: 0x1
  ULONG SoftRebootConflict : 1; // offset: 0x0 ordinal: 0x2
  ULONG MostRecentLog : 3;      // offset: 0x0 ordinal: 0x3
  ULONG Spare : 27;             // offset: 0x4 ordinal: 0x4
  ULONG LogNextSequence;        // offset: 0x8 ordinal: 0x5
  ULONG LogMinimumSequence;     // offset: 0xc ordinal: 0x6
  ULONG LogCurrentOffset;       // offset: 0x10 ordinal: 0x7
} _LOADER_HIVE_RECOVERY_INFO;

// 0x14 bytes (sizeof)
typedef struct _LOADER_BUGCHECK_PARAMETERS {
  ULONG BugcheckCode;       // offset: 0x0 ordinal: 0x0
  ULONG BugcheckParameter1; // offset: 0x4 ordinal: 0x1
  ULONG BugcheckParameter2; // offset: 0x8 ordinal: 0x2
  ULONG BugcheckParameter3; // offset: 0xc ordinal: 0x3
  ULONG BugcheckParameter4; // offset: 0x10 ordinal: 0x4
} _LOADER_BUGCHECK_PARAMETERS;

// 0x10 bytes (sizeof)
typedef struct _PROFILE_PARAMETER_BLOCK {
  USHORT Status;       // offset: 0x0 ordinal: 0x0
  USHORT Reserved;     // offset: 0x2 ordinal: 0x1
  USHORT DockingState; // offset: 0x4 ordinal: 0x2
  USHORT Capabilities; // offset: 0x6 ordinal: 0x3
  ULONG DockID;        // offset: 0x8 ordinal: 0x4
  ULONG SerialNumber;  // offset: 0xc ordinal: 0x5
} _PROFILE_PARAMETER_BLOCK;

// 0x24 bytes (sizeof)
typedef struct _CONFIGURATION_COMPONENT {
  enum _CONFIGURATION_CLASS Class; // offset: 0x0 ordinal: 0x0
  enum _CONFIGURATION_TYPE Type;   // offset: 0x4 ordinal: 0x1
  struct _DEVICE_FLAGS Flags;      // offset: 0x8 ordinal: 0x2
  USHORT Version;                  // offset: 0xc ordinal: 0x3
  USHORT Revision;                 // offset: 0xe ordinal: 0x4
  ULONG Key;                       // offset: 0x10 ordinal: 0x5
  union {
    ULONG AffinityMask; // offset: 0x14 ordinal: 0x6
    USHORT Group;       // offset: 0x14 ordinal: 0x7
  };
  USHORT GroupIndex;             // offset: 0x16 ordinal: 0x8
  ULONG ConfigurationDataLength; // offset: 0x18 ordinal: 0x9
  ULONG IdentifierLength;        // offset: 0x1c ordinal: 0xa
  CHAR *Identifier;              // offset: 0x20 ordinal: 0xb
} _CONFIGURATION_COMPONENT;

// 0x34 bytes (sizeof)
typedef struct _CONFIGURATION_COMPONENT_DATA {
  struct _CONFIGURATION_COMPONENT_DATA *Parent;   // offset: 0x0 ordinal: 0x0
  struct _CONFIGURATION_COMPONENT_DATA *Child;    // offset: 0x4 ordinal: 0x1
  struct _CONFIGURATION_COMPONENT_DATA *Sibling;  // offset: 0x8 ordinal: 0x2
  struct _CONFIGURATION_COMPONENT ComponentEntry; // offset: 0xc ordinal: 0x3
  VOID *ConfigurationData;                        // offset: 0x30 ordinal: 0x4
} _CONFIGURATION_COMPONENT_DATA;

// 0x20 bytes (sizeof)
typedef struct _SUPPORTED_RANGE {
  struct _SUPPORTED_RANGE *Next; // offset: 0x0 ordinal: 0x0
  ULONG SystemAddressSpace;      // offset: 0x4 ordinal: 0x1
  LONGLONG SystemBase;           // offset: 0x8 ordinal: 0x2
  LONGLONG Base;                 // offset: 0x10 ordinal: 0x3
  LONGLONG Limit;                // offset: 0x18 ordinal: 0x4
} _SUPPORTED_RANGE;

typedef LONG (*__anon_2735)(ULONG, USHORT, USHORT, ULONG, ULONG);

typedef LONG (*__anon_2730)(struct _DEVICE_OBJECT *, ULONG, UCHAR,
                            struct _DEVICE_FAULT_CONFIGURATION *);

typedef LONG (*__anon_2728)(struct _IOMMU_DMA_DOMAIN *, ULONG, struct _MDL *);

typedef LONG (*__anon_2724)(struct _IOMMU_DMA_DOMAIN *, UCHAR, ULONG, VOID *);

typedef LONG (*__anon_2723)(struct _IOMMU_DMA_DOMAIN *, struct _DEVICE_OBJECT *,
                            ULONG);

typedef LONG (*__anon_2722)(struct _IOMMU_DMA_DOMAIN *, struct _DEVICE_OBJECT *,
                            ULONG, ULONG);

typedef LONG (*__anon_2718)(ULONG, VOID *, ULONG);

typedef VOID *(*__anon_2717)(ULONG);

typedef VOID (*__anon_2716)(VOID *, ULONG, struct _KTB_FLUSH_VA *);

typedef LONG (*__anon_2715)(VOID *, ULONG);

typedef LONG (*__anon_2713)(ULONG, ULONG, VOID **);

typedef VOID (*__anon_2711)(ULONG, VOID *, ULONG);

typedef LONG (*__anon_2701)(ULONG, UCHAR);

typedef LONG (*__anon_2698)(ULONG, ULONG, ULONG, ULONG);

typedef VOID (*__anon_2697)(ULONG, ULONG, ULONG, struct _KTB_FLUSH_VA *);

typedef LONG (*__anon_2695)(ULONG, struct _HAL_HV_SVM_DEVICE_CAPABILITIES *);

typedef LONG (*__anon_2692)(UCHAR, ULONG, ULONG, ULONG, ULONG, ULONG, ULONG,
                            VOID *);

typedef VOID (*__anon_2679)(ULONG, ULONG);

// 0x4 bytes (sizeof)
typedef struct _ARM_LOADER_BLOCK {
  ULONG PlaceHolder; // offset: 0x0 ordinal: 0x0
} _ARM_LOADER_BLOCK;

// 0xc bytes (sizeof)
typedef struct _I386_LOADER_BLOCK {
  VOID *CommonDataArea; // offset: 0x0 ordinal: 0x0
  ULONG MachineType;    // offset: 0x4 ordinal: 0x1
  ULONG VirtualBias;    // offset: 0x8 ordinal: 0x2
} _I386_LOADER_BLOCK;

// 0xc bytes (sizeof)
typedef union __anon_2593 {
  struct _I386_LOADER_BLOCK I386; // offset: 0x0 ordinal: 0x0
  struct _ARM_LOADER_BLOCK Arm;   // offset: 0x0 ordinal: 0x1
} __anon_2593;

// 0xc bytes (sizeof)
typedef struct DEBUG_DEVICE_ADDRESS {
  UCHAR Type;  // offset: 0x0 ordinal: 0x0
  UCHAR Valid; // offset: 0x1 ordinal: 0x1
  union {
    UCHAR Reserved[2]; // offset: 0x2 ordinal: 0x2
    UCHAR BitWidth;    // offset: 0x2 ordinal: 0x3
  };
  UCHAR AccessSize;         // offset: 0x3 ordinal: 0x4
  UCHAR *TranslatedAddress; // offset: 0x4 ordinal: 0x5
  ULONG Length;             // offset: 0x8 ordinal: 0x6
} DEBUG_DEVICE_ADDRESS;

typedef ULONG (*__anon_2666)(struct _BUS_HANDLER *, struct _BUS_HANDLER *,
                             ULONG, VOID *, ULONG, ULONG);

// 0xa0 bytes (sizeof)
typedef struct _SUPPORTED_RANGES {
  USHORT Version;                         // offset: 0x0 ordinal: 0x0
  UCHAR Sorted;                           // offset: 0x2 ordinal: 0x1
  UCHAR Reserved;                         // offset: 0x3 ordinal: 0x2
  ULONG NoIO;                             // offset: 0x4 ordinal: 0x3
  struct _SUPPORTED_RANGE IO;             // offset: 0x8 ordinal: 0x4
  ULONG NoMemory;                         // offset: 0x28 ordinal: 0x5
  struct _SUPPORTED_RANGE Memory;         // offset: 0x30 ordinal: 0x6
  ULONG NoPrefetchMemory;                 // offset: 0x50 ordinal: 0x7
  struct _SUPPORTED_RANGE PrefetchMemory; // offset: 0x58 ordinal: 0x8
  ULONG NoDma;                            // offset: 0x78 ordinal: 0x9
  struct _SUPPORTED_RANGE Dma;            // offset: 0x80 ordinal: 0xa
} _SUPPORTED_RANGES;

// 0x28 bytes (sizeof)
typedef struct _FIRMWARE_INFORMATION_LOADER_BLOCK {
  ULONG FirmwareTypeUefi : 1;                  // offset: 0x0 ordinal: 0x0
  ULONG EfiRuntimeUseIum : 1;                  // offset: 0x0 ordinal: 0x1
  ULONG EfiRuntimePageProtectionSupported : 1; // offset: 0x0 ordinal: 0x2
  ULONG Reserved : 29;                         // offset: 0x0 ordinal: 0x3
  union __anon_2677 u;                         // offset: 0x4 ordinal: 0x4
} _FIRMWARE_INFORMATION_LOADER_BLOCK;

// 0x8 bytes (sizeof)
typedef struct _DEBUG_TRANSPORT_DATA {
  ULONG HwContextSize;    // offset: 0x0 ordinal: 0x0
  UCHAR UseSerialFraming; // offset: 0x4 ordinal: 0x1
  UCHAR ValidUSBCoreId;   // offset: 0x5 ordinal: 0x2
  UCHAR USBCoreId;        // offset: 0x6 ordinal: 0x3
} _DEBUG_TRANSPORT_DATA;

typedef VOID (*__anon_2573)(ULONG, LONG *);

// 0x1c bytes (sizeof)
typedef struct _HAL_UNMASKED_INTERRUPT_INFORMATION {
  USHORT Version;                            // offset: 0x0 ordinal: 0x0
  USHORT Size;                               // offset: 0x2 ordinal: 0x1
  union _HAL_UNMASKED_INTERRUPT_FLAGS Flags; // offset: 0x4 ordinal: 0x2
  enum _KINTERRUPT_MODE Mode;                // offset: 0x8 ordinal: 0x3
  enum _KINTERRUPT_POLARITY Polarity;        // offset: 0xc ordinal: 0x4
  ULONG Gsiv;                                // offset: 0x10 ordinal: 0x5
  USHORT PinNumber;                          // offset: 0x14 ordinal: 0x6
  VOID *DeviceHandle;                        // offset: 0x18 ordinal: 0x7
} _HAL_UNMASKED_INTERRUPT_INFORMATION;

typedef UCHAR (*__anon_2569)(VOID *,
                             struct _HAL_UNMASKED_INTERRUPT_INFORMATION *);

typedef LONG (*__anon_2495)(
    UCHAR (*)(VOID *, struct _HAL_UNMASKED_INTERRUPT_INFORMATION *), VOID *,
    struct _HAL_UNMASKED_INTERRUPT_INFORMATION *);

// 0xc bytes (sizeof)
typedef struct _PCI_BUSMASTER_DESCRIPTOR {
  enum _PCI_BUSMASTER_RID_TYPE Type; // offset: 0x0 ordinal: 0x0
  ULONG Segment;                     // offset: 0x4 ordinal: 0x1
  union {
    struct __anon_2632 DeviceRid;       // offset: 0x8 ordinal: 0x2
    struct __anon_2632 BridgeRid;       // offset: 0x8 ordinal: 0x3
    struct __anon_2633 MultipleBridges; // offset: 0x8 ordinal: 0x4
  };
} _PCI_BUSMASTER_DESCRIPTOR;

// 0x8 bytes (sizeof)
typedef struct _HAL_LOG_REGISTER_CONTEXT {
  VOID (*LogRoutine)(ULONG, VOID *, ULONG); // offset: 0x0 ordinal: 0x0
  ULONG Flag;                               // offset: 0x4 ordinal: 0x1
} _HAL_LOG_REGISTER_CONTEXT;

typedef VOID (*__anon_2478)(struct _HAL_LOG_REGISTER_CONTEXT *);

typedef LONG (*__anon_2509)(ULONG, struct _DEVICE_OBJECT *);

typedef VOID (*__anon_2498)(struct _MDL *, ULONG, ULONG, ULONG, ULONG, UCHAR);

typedef LONG (*__anon_2492)(ULONG, VOID *, LONG (*)(VOID *));

typedef LONG (*__anon_2489)(ULONG, enum _KPROFILE_SOURCE *, ULONG,
                            struct _HAL_PMC_COUNTERS **);

typedef UCHAR (*__anon_2482)(ULONG, ULONG);

typedef LONG (*__anon_2481)(ULONG, ULONG);

typedef ULONG (*__anon_2479)(ULONG);

typedef LONG (*__anon_2477)(ULONG);

typedef VOID (*__anon_2465)(ULONG);

typedef LONG (*__anon_2464)(ULONG, VOID *);

typedef ULONG (*__anon_2457)(ULONG, ULONG, VOID *, ULONG, ULONG);

typedef UCHAR (*__anon_2455)(ULONG);

typedef LONG (*__anon_2451)(struct _ADAPTER_OBJECT *, ULONG, ULONG,
                            struct _MAP_REGISTER_ENTRY *);

typedef LONG (*__anon_2444)(enum _INTERFACE_TYPE, enum _BUS_DATA_TYPE, ULONG,
                            enum _INTERFACE_TYPE, ULONG, ULONG,
                            LONG (*)(struct _BUS_HANDLER *),
                            struct _BUS_HANDLER **);

typedef struct _BUS_HANDLER *(*__anon_2443)(enum _BUS_DATA_TYPE, ULONG);

typedef struct _BUS_HANDLER *(*__anon_2442)(enum _INTERFACE_TYPE, ULONG);

// 0xc bytes (sizeof)
typedef struct POWER_ACTION_POLICY {
  enum POWER_ACTION Action; // offset: 0x0 ordinal: 0x0
  ULONG Flags;              // offset: 0x4 ordinal: 0x1
  ULONG EventCode;          // offset: 0x8 ordinal: 0x2
} POWER_ACTION_POLICY;

// 0x18 bytes (sizeof)
typedef struct SYSTEM_POWER_LEVEL {
  UCHAR Enable;                            // offset: 0x0 ordinal: 0x0
  UCHAR Spare[3];                          // offset: 0x1 ordinal: 0x1
  ULONG BatteryLevel;                      // offset: 0x4 ordinal: 0x2
  struct POWER_ACTION_POLICY PowerPolicy;  // offset: 0x8 ordinal: 0x3
  enum _SYSTEM_POWER_STATE MinSystemState; // offset: 0x14 ordinal: 0x4
} SYSTEM_POWER_LEVEL;

// 0x14 bytes (sizeof)
typedef struct _MEMORY_ALLOCATION_DESCRIPTOR {
  struct _LIST_ENTRY ListEntry;    // offset: 0x0 ordinal: 0x0
  enum _TYPE_OF_MEMORY MemoryType; // offset: 0x8 ordinal: 0x1
  ULONG BasePage;                  // offset: 0xc ordinal: 0x2
  ULONG PageCount;                 // offset: 0x10 ordinal: 0x3
} _MEMORY_ALLOCATION_DESCRIPTOR;

// 0x18 bytes (sizeof)
typedef struct _VF_SUSPECT_DRIVER_ENTRY {
  struct _LIST_ENTRY Links;        // offset: 0x0 ordinal: 0x0
  ULONG Loads;                     // offset: 0x8 ordinal: 0x1
  ULONG Unloads;                   // offset: 0xc ordinal: 0x2
  struct _UNICODE_STRING BaseName; // offset: 0x10 ordinal: 0x3
} _VF_SUSPECT_DRIVER_ENTRY;

// 0x4 bytes (sizeof)
typedef struct __anon_2343 {
  ULONG MissedEtwRegistration : 1; // offset: 0x0 ordinal: 0x0
  ULONG IsBootDriver : 1;          // offset: 0x0 ordinal: 0x1
  ULONG Spare : 30;                // offset: 0x0 ordinal: 0x2
} __anon_2343;

// 0x4 bytes (sizeof)
typedef union __anon_2344 {
  struct __anon_2343 Flags; // offset: 0x0 ordinal: 0x0
  ULONG Whole;              // offset: 0x0 ordinal: 0x1
} __anon_2344;

// 0x4 bytes (sizeof)
typedef struct _HEAP_STOP_ON_TAG {
  union {
    ULONG HeapAndTagIndex; // offset: 0x0 ordinal: 0x0
    USHORT TagIndex;       // offset: 0x0 ordinal: 0x1
  };
  USHORT HeapIndex; // offset: 0x2 ordinal: 0x2
} _HEAP_STOP_ON_TAG;

// 0x18 bytes (sizeof)
typedef struct _HEAP_STOP_ON_VALUES {
  ULONG AllocAddress;                  // offset: 0x0 ordinal: 0x0
  struct _HEAP_STOP_ON_TAG AllocTag;   // offset: 0x4 ordinal: 0x1
  ULONG ReAllocAddress;                // offset: 0x8 ordinal: 0x2
  struct _HEAP_STOP_ON_TAG ReAllocTag; // offset: 0xc ordinal: 0x3
  ULONG FreeAddress;                   // offset: 0x10 ordinal: 0x4
  struct _HEAP_STOP_ON_TAG FreeTag;    // offset: 0x14 ordinal: 0x5
} _HEAP_STOP_ON_VALUES;

// 0xc bytes (sizeof)
typedef struct _VF_BTS_RECORD {
  VOID *JumpedFrom;    // offset: 0x0 ordinal: 0x0
  VOID *JumpedTo;      // offset: 0x4 ordinal: 0x1
  ULONG Unused1 : 3;   // offset: 0x8 ordinal: 0x2
  ULONG Predicted : 4; // offset: 0x8 ordinal: 0x3
  ULONG Unused2 : 25;  // offset: 0x8 ordinal: 0x4
} _VF_BTS_RECORD;

// 0xc bytes (sizeof)
typedef struct _OBJECT_REF_STACK_INFO {
  ULONG Sequence;   // offset: 0x0 ordinal: 0x0
  USHORT Index;     // offset: 0x4 ordinal: 0x1
  USHORT NumTraces; // offset: 0x6 ordinal: 0x2
  ULONG Tag;        // offset: 0x8 ordinal: 0x3
} _OBJECT_REF_STACK_INFO;

// 0x28 bytes (sizeof)
typedef struct _PO_NOTIFY_ORDER_LEVEL {
  ULONG DeviceCount;             // offset: 0x0 ordinal: 0x0
  ULONG ActiveCount;             // offset: 0x4 ordinal: 0x1
  struct _LIST_ENTRY WaitSleep;  // offset: 0x8 ordinal: 0x2
  struct _LIST_ENTRY ReadySleep; // offset: 0x10 ordinal: 0x3
  struct _LIST_ENTRY ReadyS0;    // offset: 0x18 ordinal: 0x4
  struct _LIST_ENTRY WaitS0;     // offset: 0x20 ordinal: 0x5
} _PO_NOTIFY_ORDER_LEVEL;

// 0xd4 bytes (sizeof)
typedef struct _PO_DEVICE_NOTIFY_ORDER {
  UCHAR Locked;                                // offset: 0x0 ordinal: 0x0
  struct _DEVICE_OBJECT **WarmEjectPdoPointer; // offset: 0x4 ordinal: 0x1
  struct _PO_NOTIFY_ORDER_LEVEL OrderLevel[5]; // offset: 0x8 ordinal: 0x2
  ULONG Flags;                                 // offset: 0xd0 ordinal: 0x3
} _PO_DEVICE_NOTIFY_ORDER;

// 0x108 bytes (sizeof)
typedef struct _POP_DEVICE_SYS_STATE {
  UCHAR IrpMinor;                        // offset: 0x0 ordinal: 0x0
  enum _SYSTEM_POWER_STATE SystemState;  // offset: 0x4 ordinal: 0x1
  ULONG SpinLock;                        // offset: 0x8 ordinal: 0x2
  struct _KTHREAD *Thread;               // offset: 0xc ordinal: 0x3
  struct _KEVENT *AbortEvent;            // offset: 0x10 ordinal: 0x4
  struct _KSEMAPHORE *ReadySemaphore;    // offset: 0x14 ordinal: 0x5
  struct _KSEMAPHORE *FinishedSemaphore; // offset: 0x18 ordinal: 0x6
  struct _PO_DEVICE_NOTIFY_ORDER Order;  // offset: 0x1c ordinal: 0x7
  struct _LIST_ENTRY Pending;            // offset: 0xf0 ordinal: 0x8
  LONG Status;                           // offset: 0xf8 ordinal: 0x9
  struct _DEVICE_OBJECT *FailedDevice;   // offset: 0xfc ordinal: 0xa
  UCHAR Waking;                          // offset: 0x100 ordinal: 0xb
  UCHAR Cancelled;                       // offset: 0x101 ordinal: 0xc
  UCHAR IgnoreErrors;                    // offset: 0x102 ordinal: 0xd
  UCHAR IgnoreNotImplemented;            // offset: 0x103 ordinal: 0xe
  UCHAR TimeRefreshLockAcquired;         // offset: 0x104 ordinal: 0xf
} _POP_DEVICE_SYS_STATE;

// 0x19c bytes (sizeof)
typedef struct _KPRIQUEUE {
  struct _DISPATCHER_HEADER Header;     // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY EntryListHead[32]; // offset: 0x10 ordinal: 0x1
  LONG CurrentCount[32];                // offset: 0x110 ordinal: 0x2
  ULONG MaximumCount;                   // offset: 0x190 ordinal: 0x3
  struct _LIST_ENTRY ThreadListHead;    // offset: 0x194 ordinal: 0x4
} _KPRIQUEUE;

// 0x19c bytes (sizeof)
typedef struct _TRIAGE_EX_WORK_QUEUE {
  struct _KPRIQUEUE WorkPriQueue; // offset: 0x0 ordinal: 0x0
} _TRIAGE_EX_WORK_QUEUE;

// 0x14 bytes (sizeof)
typedef struct _TRIAGE_9F_POWER {
  USHORT Signature;                                 // offset: 0x0 ordinal: 0x0
  USHORT Revision;                                  // offset: 0x2 ordinal: 0x1
  struct _LIST_ENTRY *IrpList;                      // offset: 0x4 ordinal: 0x2
  struct _LIST_ENTRY *ThreadList;                   // offset: 0x8 ordinal: 0x3
  struct _TRIAGE_EX_WORK_QUEUE *DelayedWorkQueue;   // offset: 0xc ordinal: 0x4
  struct _TRIAGE_EX_WORK_QUEUE *DelayedIoWorkQueue; // offset: 0x10 ordinal: 0x5
} _TRIAGE_9F_POWER;

// 0x10 bytes (sizeof)
typedef struct _TRIAGE_9F_PNP {
  USHORT Signature; // offset: 0x0 ordinal: 0x0
  USHORT Revision;  // offset: 0x2 ordinal: 0x1
  struct _TRIAGE_PNP_DEVICE_COMPLETION_QUEUE
      *CompletionQueue;                             // offset: 0x4 ordinal: 0x2
  struct _TRIAGE_EX_WORK_QUEUE *DelayedWorkQueue;   // offset: 0x8 ordinal: 0x3
  struct _TRIAGE_EX_WORK_QUEUE *DelayedIoWorkQueue; // offset: 0xc ordinal: 0x4
} _TRIAGE_9F_PNP;

// 0x14 bytes (sizeof)
typedef struct _LOCK_HEADER {
  struct _RTL_AVL_TREE LockTree;            // offset: 0x0 ordinal: 0x0
  struct _RTL_AVL_TREE LockMdlSwitchedTree; // offset: 0x4 ordinal: 0x1
  ULONG Count;                              // offset: 0x8 ordinal: 0x2
  ULONG Lock;                               // offset: 0xc ordinal: 0x3
  ULONG Valid;                              // offset: 0x10 ordinal: 0x4
} _LOCK_HEADER;

// 0x4 bytes (sizeof)
typedef union __anon_2313 {
  ULONG Active : 1;             // offset: 0x0 ordinal: 0x0
  ULONG OnlyTryAcquireUsed : 1; // offset: 0x0 ordinal: 0x1
  ULONG ReleasedOutOfOrder : 1; // offset: 0x0 ordinal: 0x2
  ULONG SequenceNumber : 29;    // offset: 0x0 ordinal: 0x3
  ULONG Whole;                  // offset: 0x0 ordinal: 0x4
} __anon_2313;

// 0x20 bytes (sizeof)
typedef struct _VI_DEADLOCK_THREAD {
  struct _KTHREAD *Thread;                    // offset: 0x0 ordinal: 0x0
  struct _VI_DEADLOCK_NODE *CurrentSpinNode;  // offset: 0x4 ordinal: 0x1
  struct _VI_DEADLOCK_NODE *CurrentOtherNode; // offset: 0x8 ordinal: 0x2
  union {
    struct _LIST_ENTRY ListEntry;     // offset: 0xc ordinal: 0x3
    struct _LIST_ENTRY FreeListEntry; // offset: 0xc ordinal: 0x4
  };
  ULONG NodeCount;            // offset: 0x14 ordinal: 0x5
  ULONG PagingCount;          // offset: 0x18 ordinal: 0x6
  UCHAR ThreadUsesEresources; // offset: 0x1c ordinal: 0x7
} _VI_DEADLOCK_THREAD;

// 0x80 bytes (sizeof)
typedef struct _VI_DEADLOCK_RESOURCE {
  enum _VI_DEADLOCK_RESOURCE_TYPE Type;    // offset: 0x0 ordinal: 0x0
  ULONG NodeCount : 16;                    // offset: 0x4 ordinal: 0x1
  ULONG RecursionCount : 16;               // offset: 0x4 ordinal: 0x2
  VOID *ResourceAddress;                   // offset: 0x8 ordinal: 0x3
  struct _VI_DEADLOCK_THREAD *ThreadOwner; // offset: 0xc ordinal: 0x4
  struct _LIST_ENTRY ResourceList;         // offset: 0x10 ordinal: 0x5
  union {
    struct _LIST_ENTRY HashChainList; // offset: 0x18 ordinal: 0x6
    struct _LIST_ENTRY FreeListEntry; // offset: 0x18 ordinal: 0x7
  };
  VOID *StackTrace[8];       // offset: 0x20 ordinal: 0x8
  VOID *LastAcquireTrace[8]; // offset: 0x40 ordinal: 0x9
  VOID *LastReleaseTrace[8]; // offset: 0x60 ordinal: 0xa
} _VI_DEADLOCK_RESOURCE;

// 0x6c bytes (sizeof)
typedef struct _VI_DEADLOCK_NODE {
  struct _VI_DEADLOCK_NODE *Parent; // offset: 0x0 ordinal: 0x0
  struct _LIST_ENTRY ChildrenList;  // offset: 0x4 ordinal: 0x1
  struct _LIST_ENTRY SiblingsList;  // offset: 0xc ordinal: 0x2
  union {
    struct _LIST_ENTRY ResourceList;  // offset: 0x14 ordinal: 0x3
    struct _LIST_ENTRY FreeListEntry; // offset: 0x14 ordinal: 0x4
  };
  struct _VI_DEADLOCK_RESOURCE *Root;      // offset: 0x1c ordinal: 0x5
  struct _VI_DEADLOCK_THREAD *ThreadEntry; // offset: 0x20 ordinal: 0x6
  union __anon_2313 u1;                    // offset: 0x24 ordinal: 0x7
  LONG ChildrenCount;                      // offset: 0x28 ordinal: 0x8
  VOID *StackTrace[8];                     // offset: 0x2c ordinal: 0x9
  VOID *ParentStackTrace[8];               // offset: 0x4c ordinal: 0xa
} _VI_DEADLOCK_NODE;

// 0xc bytes (sizeof)
typedef struct _KSYSTEM_TIME {
