// 0x0 bytes (sizeof)
typedef struct _LDRP_LOAD_CONTEXT {
} _LDRP_LOAD_CONTEXT;

// 0x0 bytes (sizeof)
typedef struct _VERIFIER_SHARED_EXPORT_THUNK {
} _VERIFIER_SHARED_EXPORT_THUNK;

// 0x18 bytes (sizeof)
typedef struct _VF_TARGET_ALL_SHARED_EXPORT_THUNKS {
  struct _VERIFIER_SHARED_EXPORT_THUNK
      *SharedExportThunks; // offset: 0x0 ordinal: 0x0
  struct _VERIFIER_SHARED_EXPORT_THUNK
      *PoolSharedExportThunks; // offset: 0x8 ordinal: 0x1
  struct _VERIFIER_SHARED_EXPORT_THUNK
      *XdvSharedExportThunks; // offset: 0x10 ordinal: 0x2
} _VF_TARGET_ALL_SHARED_EXPORT_THUNKS;

// 0x0 bytes (sizeof)
typedef struct _ACTIVATION_CONTEXT_DATA {
} _ACTIVATION_CONTEXT_DATA;

// 0x0 bytes (sizeof)
typedef struct _CALLBACK_OBJECT {
} _CALLBACK_OBJECT;

// 0x8 bytes (sizeof)
typedef struct __anon_2713 {
  struct _SHARED_CACHE_MAP *SharedCacheMap; // offset: 0x0 ordinal: 0x0
} __anon_2713;

typedef unsigned char UCHAR;

typedef unsigned long long ULONGLONG;

typedef void VOID;

// 0x0 bytes (sizeof)
typedef struct _PCW_INSTANCE {
} _PCW_INSTANCE;

// 0x0 bytes (sizeof)
typedef struct _PCW_REGISTRATION {
} _PCW_REGISTRATION;

// 0x0 bytes (sizeof)
typedef struct _PCW_BUFFER {
} _PCW_BUFFER;

// 0x0 bytes (sizeof)
typedef struct _KTMNOTIFICATION_PACKET {
} _KTMNOTIFICATION_PACKET;

// 0x0 bytes (sizeof)
typedef struct _MI_SLAB_ALLOCATOR_ENTRY {
} _MI_SLAB_ALLOCATOR_ENTRY;

typedef char CHAR;

typedef unsigned int HRESULT;

typedef unsigned short USHORT;

// 0x10 bytes (sizeof)
typedef struct _SLIST_ENTRY {
  struct _SLIST_ENTRY *Next; // offset: 0x0 ordinal: 0x0
} _SLIST_ENTRY;

// 0x0 bytes (sizeof)
typedef struct _CHPEV2_CPUAREA_INFO {
} _CHPEV2_CPUAREA_INFO;

// 0x0 bytes (sizeof)
typedef struct _TP_CALLBACK_INSTANCE {
} _TP_CALLBACK_INSTANCE;

// 0x0 bytes (sizeof)
typedef struct _ACTIVATION_CONTEXT {
} _ACTIVATION_CONTEXT;

// 0x0 bytes (sizeof)
typedef struct _TP_CLEANUP_GROUP {
} _TP_CLEANUP_GROUP;

// 0x0 bytes (sizeof)
typedef struct _TP_POOL {
} _TP_POOL;

// 0x0 bytes (sizeof)
typedef struct _DMAR_PAGE_TABLE_STATE {
} _DMAR_PAGE_TABLE_STATE;

// 0x8 bytes (sizeof)
typedef struct _EXT_IOMMU_DEVICE_ID_ACPI {
  CHAR *ObjectName; // offset: 0x0 ordinal: 0x0
} _EXT_IOMMU_DEVICE_ID_ACPI;

typedef unsigned short WCHAR;

// 0x18 bytes (sizeof)
typedef struct _RTL_SPLAY_LINKS {
  struct _RTL_SPLAY_LINKS *Parent;     // offset: 0x0 ordinal: 0x0
  struct _RTL_SPLAY_LINKS *LeftChild;  // offset: 0x8 ordinal: 0x1
  struct _RTL_SPLAY_LINKS *RightChild; // offset: 0x10 ordinal: 0x2
} _RTL_SPLAY_LINKS;

// 0x0 bytes (sizeof)
typedef struct _HAL_PMC_COUNTERS {
} _HAL_PMC_COUNTERS;

// 0x0 bytes (sizeof)
typedef struct _SCSI_REQUEST_BLOCK {
} _SCSI_REQUEST_BLOCK;

// 0x0 bytes (sizeof)
typedef struct _EX_TIMER {
} _EX_TIMER;

// 0x8 bytes (sizeof)
typedef struct __anon_1007 {
  struct _SCSI_REQUEST_BLOCK *Srb; // offset: 0x0 ordinal: 0x0
} __anon_1007;

// 0x0 bytes (sizeof)
typedef struct _DEVICE_NODE_IOMMU_EXTENSION {
} _DEVICE_NODE_IOMMU_EXTENSION;

// 0x0 bytes (sizeof)
typedef struct _ETW_EVENT_CALLBACK_CONTEXT {
} _ETW_EVENT_CALLBACK_CONTEXT;

// 0x0 bytes (sizeof)
typedef struct _ETW_SOFT_RESTART_CONTEXT {
} _ETW_SOFT_RESTART_CONTEXT;

// 0x0 bytes (sizeof)
typedef struct _ETW_STACK_CACHE {
} _ETW_STACK_CACHE;

// 0x0 bytes (sizeof)
typedef struct _ETW_PERFECT_HASH_FUNCTION {
} _ETW_PERFECT_HASH_FUNCTION;

typedef unsigned long ULONG;

// 0x8 bytes (sizeof)
typedef struct _IOMMU_DEVICE_CREATION_CONFIGURATION_ACPI {
  ULONG InputMappingBase; // offset: 0x0 ordinal: 0x0
  ULONG MappingsCount;    // offset: 0x4 ordinal: 0x1
} _IOMMU_DEVICE_CREATION_CONFIGURATION_ACPI;

// 0xc bytes (sizeof)
typedef struct _RTL_FEATURE_CONFIGURATION {
  ULONG FeatureId;               // offset: 0x0 ordinal: 0x0
  ULONG Priority : 4;            // offset: 0x4 ordinal: 0x1
  ULONG EnabledState : 2;        // offset: 0x4 ordinal: 0x2
  ULONG IsWexpConfiguration : 1; // offset: 0x4 ordinal: 0x3
  ULONG HasSubscriptions : 1;    // offset: 0x4 ordinal: 0x4
  ULONG Variant : 6;             // offset: 0x4 ordinal: 0x5
  ULONG VariantPayloadKind : 2;  // offset: 0x4 ordinal: 0x6
  ULONG VariantPayload;          // offset: 0x8 ordinal: 0x7
} _RTL_FEATURE_CONFIGURATION;

// 0x4 bytes (sizeof)
typedef union wil_details_RecordedState {
  ULONG exchange;                               // offset: 0x0 ordinal: 0x0
  ULONG recordedDeviceUsage : 1;                // offset: 0x0 ordinal: 0x1
  ULONG recordedDevicePotential : 1;            // offset: 0x0 ordinal: 0x2
  ULONG recordedDeviceOpportunity : 1;          // offset: 0x0 ordinal: 0x3
  ULONG recordedDevicePotentialOpportunity : 1; // offset: 0x0 ordinal: 0x4
  ULONG recordedVariantDeviceUsage : 1;         // offset: 0x0 ordinal: 0x5
  ULONG recordedVariant : 6;                    // offset: 0x0 ordinal: 0x6
  ULONG unused : 21;                            // offset: 0x0 ordinal: 0x7
} wil_details_RecordedState;

// 0x4 bytes (sizeof)
typedef union wil_details_ReportedState {
  ULONG exchange;                                // offset: 0x0 ordinal: 0x0
  ULONG queuedForReporting : 1;                  // offset: 0x0 ordinal: 0x1
  ULONG reportedDeviceUsage : 1;                 // offset: 0x0 ordinal: 0x2
  ULONG reportedDevicePotential : 1;             // offset: 0x0 ordinal: 0x3
  ULONG reportedDeviceOpportunity : 1;           // offset: 0x0 ordinal: 0x4
  ULONG reportedDevicePotentialOpportunity : 1;  // offset: 0x0 ordinal: 0x5
  ULONG usageCount : 9;                          // offset: 0x0 ordinal: 0x6
  ULONG usageCountRepresentsPotential : 1;       // offset: 0x0 ordinal: 0x7
  ULONG opportunityCount : 7;                    // offset: 0x0 ordinal: 0x8
  ULONG opportunityCountRepresentsPotential : 1; // offset: 0x0 ordinal: 0x9
  ULONG unused : 9;                              // offset: 0x0 ordinal: 0xa
} wil_details_ReportedState;

// 0x8 bytes (sizeof)
typedef struct wil_details_FeatureReportingCache {
  union wil_details_ReportedState reported; // offset: 0x0 ordinal: 0x0
  union wil_details_RecordedState recorded; // offset: 0x4 ordinal: 0x1
} wil_details_FeatureReportingCache;

// 0x4 bytes (sizeof)
typedef union _EXT_IOMMU_CREATE_DEVICE_FLAGS {
  ULONG AsUINT32;        // offset: 0x0 ordinal: 0x0
  ULONG WildCard : 1;    // offset: 0x0 ordinal: 0x1
  ULONG ForceCreate : 1; // offset: 0x0 ordinal: 0x2
  ULONG LiveTraffic : 1; // offset: 0x0 ordinal: 0x3
  ULONG Reserved : 29;   // offset: 0x0 ordinal: 0x4
} _EXT_IOMMU_CREATE_DEVICE_FLAGS;

// 0x4 bytes (sizeof)
typedef struct _EXT_IOMMU_DEVICE_ID_GIC {
  ULONG LineNumber; // offset: 0x0 ordinal: 0x0
} _EXT_IOMMU_DEVICE_ID_GIC;

// 0x4 bytes (sizeof)
typedef struct __anon_1442 {
  ULONG RecoveryAttempted : 1; // offset: 0x0 ordinal: 0x0
  ULONG HvHandled : 1;         // offset: 0x0 ordinal: 0x1
  ULONG Reserved : 30;         // offset: 0x0 ordinal: 0x2
} __anon_1442;

// 0x4 bytes (sizeof)
typedef struct __anon_1441 {
  ULONG NotSupported : 1;             // offset: 0x0 ordinal: 0x0
  ULONG Overflow : 1;                 // offset: 0x0 ordinal: 0x1
  ULONG ContextCorrupt : 1;           // offset: 0x0 ordinal: 0x2
  ULONG RestartIpErrorIpNotValid : 1; // offset: 0x0 ordinal: 0x3
  ULONG NoRecoveryContext : 1;        // offset: 0x0 ordinal: 0x4
  ULONG MiscOrAddrNotValid : 1;       // offset: 0x0 ordinal: 0x5
  ULONG InvalidAddressMode : 1;       // offset: 0x0 ordinal: 0x6
  ULONG HighIrql : 1;                 // offset: 0x0 ordinal: 0x7
  ULONG InterruptsDisabled : 1;       // offset: 0x0 ordinal: 0x8
  ULONG SwapBusy : 1;                 // offset: 0x0 ordinal: 0x9
  ULONG StackOverflow : 1;            // offset: 0x0 ordinal: 0xa
  ULONG Reserved : 21;                // offset: 0x0 ordinal: 0xb
} __anon_1441;

// 0x8 bytes (sizeof)
typedef struct IORING_REGISTERED_BUFFER {
  ULONG BufferIndex; // offset: 0x0 ordinal: 0x0
  ULONG Offset;      // offset: 0x4 ordinal: 0x1
} IORING_REGISTERED_BUFFER;

// 0x8 bytes (sizeof)
typedef struct _ETW_PARTITION_CONTEXT {
  struct _EPARTITION *Partition; // offset: 0x0 ordinal: 0x0
} _ETW_PARTITION_CONTEXT;

// 0x8 bytes (sizeof)
typedef union __anon_871 {
  struct _DEVICE_NODE *NextResourceDeviceNode; // offset: 0x0 ordinal: 0x0
} __anon_871;

// 0x0 bytes (sizeof)
typedef struct _EX_WNF_SUBSCRIPTION {
} _EX_WNF_SUBSCRIPTION;

// 0x0 bytes (sizeof)
typedef struct _DBGKP_ERROR_PORT {
} _DBGKP_ERROR_PORT;

// 0x0 bytes (sizeof)
typedef struct _CI_NGEN_PATHS {
} _CI_NGEN_PATHS;

// 0x0 bytes (sizeof)
typedef struct _NLS_STATE {
} _NLS_STATE;

// 0x0 bytes (sizeof)
typedef struct _EXP_LICENSE_STATE {
} _EXP_LICENSE_STATE;

// 0x10 bytes (sizeof)
typedef struct _PO_IRP_QUEUE {
  struct _IRP *CurrentIrp;     // offset: 0x0 ordinal: 0x0
  struct _IRP *PendingIrpList; // offset: 0x8 ordinal: 0x1
} _PO_IRP_QUEUE;

// 0x20 bytes (sizeof)
typedef struct _PO_IRP_MANAGER {
  struct _PO_IRP_QUEUE DeviceIrpQueue; // offset: 0x0 ordinal: 0x0
  struct _PO_IRP_QUEUE SystemIrpQueue; // offset: 0x10 ordinal: 0x1
} _PO_IRP_MANAGER;

typedef long LONG;

typedef enum _MEM_DEDICATED_ATTRIBUTE_TYPE {
  MemDedicatedAttributeReadBandwidth = 0,  // ordinal: 0x0
  MemDedicatedAttributeReadLatency = 1,    // ordinal: 0x1
  MemDedicatedAttributeWriteBandwidth = 2, // ordinal: 0x2
  MemDedicatedAttributeWriteLatency = 3,   // ordinal: 0x3
  MemDedicatedAttributeMax = 4,            // ordinal: 0x4
} _MEM_DEDICATED_ATTRIBUTE_TYPE;

typedef enum _MACHINE_CHECK_NESTING_LEVEL {
  McheckNormal = 0,        // ordinal: 0x0
  McheckNmi = 1,           // ordinal: 0x1
  McheckNestingLevels = 2, // ordinal: 0x2
} _MACHINE_CHECK_NESTING_LEVEL;

typedef enum _JOBOBJECT_IO_PRIORITY_LIMIT_FLAGS {
  JOBOBJECT_IO_PRIORITY_LIMIT_ENABLE = 1,      // ordinal: 0x0
  JOBOBJECT_IO_PRIORITY_LIMIT_VALID_FLAGS = 1, // ordinal: 0x1
} _JOBOBJECT_IO_PRIORITY_LIMIT_FLAGS;

typedef enum LSA_FOREST_TRUST_RECORD_TYPE {
  ForestTrustTopLevelName = 0,   // ordinal: 0x0
  ForestTrustTopLevelNameEx = 1, // ordinal: 0x1
  ForestTrustDomainInfo = 2,     // ordinal: 0x2
  ForestTrustBinaryInfo = 3,     // ordinal: 0x3
  ForestTrustScannerInfo = 4,    // ordinal: 0x4
  ForestTrustRecordTypeLast = 4, // ordinal: 0x5
} LSA_FOREST_TRUST_RECORD_TYPE;

typedef enum _CM_SHARE_DISPOSITION {
  CmResourceShareUndetermined = 0,    // ordinal: 0x0
  CmResourceShareDeviceExclusive = 1, // ordinal: 0x1
  CmResourceShareDriverExclusive = 2, // ordinal: 0x2
  CmResourceShareShared = 3,          // ordinal: 0x3
} _CM_SHARE_DISPOSITION;

typedef enum _CM_HIVE_CACHE_OPLOCK_FILE_TYPE {
  OplockOnPrimary = 0,   // ordinal: 0x0
  OplockOnLog1 = 1,      // ordinal: 0x1
  OplockOnLog2 = 2,      // ordinal: 0x2
  OplocksOnFilesMax = 3, // ordinal: 0x3
} _CM_HIVE_CACHE_OPLOCK_FILE_TYPE;

typedef enum _MI_AVAILABLE_PAGE_WAIT_TYPES {
  AvailablePagesWaitLow = 0,      // ordinal: 0x0
  AvailablePagesWaitHigh = 1,     // ordinal: 0x1
  AvailablePagesWaitVeryHigh = 2, // ordinal: 0x2
  AvailablePagesWaitMaximum = 3,  // ordinal: 0x3
} _MI_AVAILABLE_PAGE_WAIT_TYPES;

typedef enum _PO_MODERN_SLEEP_ACTION {
  PoModernSleepActionGlobalActivatorsVeto = 0,               // ordinal: 0x0
  PoModernSleepActionNonBlockingPhases = 1,                  // ordinal: 0x1
  PoModernSleepActionForceIdle = 2,                          // ordinal: 0x2
  PoModernSleepActionMinimalBlockingNotificationClients = 3, // ordinal: 0x3
  PoModernSleepActionMax = 4,                                // ordinal: 0x4
} _PO_MODERN_SLEEP_ACTION;

typedef enum _MI_MIRROR_BITMAP_TYPES {
  MirrorBitmapTypeNormal = 0,      // ordinal: 0x0
  MirrorBitmapTypeInterlocked = 1, // ordinal: 0x1
  MirrorBitmapTypeMaximum = 2,     // ordinal: 0x2
} _MI_MIRROR_BITMAP_TYPES;

typedef enum _KCONTINUE_TYPE {
  KCONTINUE_UNWIND = 0,   // ordinal: 0x0
  KCONTINUE_RESUME = 1,   // ordinal: 0x1
  KCONTINUE_LONGJUMP = 2, // ordinal: 0x2
  KCONTINUE_SET = 3,      // ordinal: 0x3
  KCONTINUE_LAST = 4,     // ordinal: 0x4
  KCONTINUE_INVALID = 4,  // ordinal: 0x5
} _KCONTINUE_TYPE;

typedef enum _MI_INPAGE_SUPPORT_TYPES {
  MiInPageSupportExpanded = 0, // ordinal: 0x0
  MiInPageSupportRegular = 1,  // ordinal: 0x1
  MiInPageSupportMaximum = 2,  // ordinal: 0x2
} _MI_INPAGE_SUPPORT_TYPES;

typedef enum SLEEPSTUDY_SPM_SCENARIO_CS_EXIT {
  SpmScenarioStopReasonUnspecified = 16,               // ordinal: 0x0
  SpmScenarioStopReasonCsExit = 17,                    // ordinal: 0x1
  SpmScenarioStopReasonInternalSegmentTransition = 18, // ordinal: 0x2
  SpmScenarioStopReasonMax = 19,                       // ordinal: 0x3
} SLEEPSTUDY_SPM_SCENARIO_CS_EXIT;

typedef enum JOB_OBJECT_NET_RATE_CONTROL_FLAGS {
  JOB_OBJECT_NET_RATE_CONTROL_ENABLE = 1,        // ordinal: 0x0
  JOB_OBJECT_NET_RATE_CONTROL_MAX_BANDWIDTH = 2, // ordinal: 0x1
  JOB_OBJECT_NET_RATE_CONTROL_DSCP_TAG = 4,      // ordinal: 0x2
  JOB_OBJECT_NET_RATE_CONTROL_VALID_FLAGS = 7,   // ordinal: 0x3
} JOB_OBJECT_NET_RATE_CONTROL_FLAGS;

typedef enum PDC_ACTIVITY_TYPE {
  PdcNetwork = 0,         // ordinal: 0x0
  PdcSystem = 1,          // ordinal: 0x1
  PdcTimer = 2,           // ordinal: 0x2
  PdcAllNetworks = 3,     // ordinal: 0x3
  PdcAnyNetwork = 4,      // ordinal: 0x4
  PdcInvalidActivity = 5, // ordinal: 0x5
  PdcMaxActivity = 5,     // ordinal: 0x6
} PDC_ACTIVITY_TYPE;

typedef enum ReplacesCorHdrNumericDefines {
  COMIMAGE_FLAGS_ILONLY = 1,                      // ordinal: 0x0
  COMIMAGE_FLAGS_32BITREQUIRED = 2,               // ordinal: 0x1
  COMIMAGE_FLAGS_IL_LIBRARY = 4,                  // ordinal: 0x2
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,            // ordinal: 0x3
  COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 16,          // ordinal: 0x4
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 65536,          // ordinal: 0x5
  COMIMAGE_FLAGS_32BITPREFERRED = 131072,         // ordinal: 0x6
  COR_VERSION_MAJOR_V2 = 2,                       // ordinal: 0x7
  COR_VERSION_MAJOR = 2,                          // ordinal: 0x8
  COR_VERSION_MINOR = 5,                          // ordinal: 0x9
  COR_DELETED_NAME_LENGTH = 8,                    // ordinal: 0xa
  COR_VTABLEGAP_NAME_LENGTH = 8,                  // ordinal: 0xb
  NATIVE_TYPE_MAX_CB = 1,                         // ordinal: 0xc
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,     // ordinal: 0xd
  IMAGE_COR_MIH_METHODRVA = 1,                    // ordinal: 0xe
  IMAGE_COR_MIH_EHRVA = 2,                        // ordinal: 0xf
  IMAGE_COR_MIH_BASICBLOCK = 8,                   // ordinal: 0x10
  COR_VTABLE_32BIT = 1,                           // ordinal: 0x11
  COR_VTABLE_64BIT = 2,                           // ordinal: 0x12
  COR_VTABLE_FROM_UNMANAGED = 4,                  // ordinal: 0x13
  COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8, // ordinal: 0x14
  COR_VTABLE_CALL_MOST_DERIVED = 16,              // ordinal: 0x15
  IMAGE_COR_EATJ_THUNK_SIZE = 32,                 // ordinal: 0x16
  MAX_CLASS_NAME = 1024,                          // ordinal: 0x17
  MAX_PACKAGE_NAME = 1024,                        // ordinal: 0x18
} ReplacesCorHdrNumericDefines;

typedef enum _VRF_TRIAGE_CONTEXT {
  VRF_TRIAGE_CONTEXT_NONE = 0,                 // ordinal: 0x0
  VRF_TRIAGE_CONTEXT_DEFAULT = 1,              // ordinal: 0x1
  VRF_TRIAGE_CONTEXT_DEVELOPMENT = 1,          // ordinal: 0x2
  VRF_TRIAGE_CONTEXT_CERTIFICATION = 2,        // ordinal: 0x3
  VRF_TRIAGE_CONTEXT_CERTIFICATION_STRICT = 3, // ordinal: 0x4
  VRF_TRIAGE_CONTEXT_FLIGHT_TARGETED = 4,      // ordinal: 0x5
  VRF_TRIAGE_CONTEXT_FLIGHT_DIAGNOSTICS = 5,   // ordinal: 0x6
  VRF_TRIAGE_CONTEXT_FLIGHT_MONITORING = 6,    // ordinal: 0x7
  NUM_VRF_TRIAGE_CONTEXTS = 7,                 // ordinal: 0x8
} _VRF_TRIAGE_CONTEXT;

typedef enum _PROCESS_TERMINATE_REQUEST_REASON {
  ProcessTerminateRequestReasonNone = 0,            // ordinal: 0x0
  ProcessTerminateCommitFail = 1,                   // ordinal: 0x1
  ProcessTerminateWriteToExecuteMemory = 2,         // ordinal: 0x2
  ProcessTerminateAttachedWriteToExecuteMemory = 3, // ordinal: 0x3
  ProcessTerminateRequestReasonMax = 4,             // ordinal: 0x4
} _PROCESS_TERMINATE_REQUEST_REASON;

typedef enum _SYSTEM_INFORMATION_CLASS {
  SystemBasicInformation = 0,                                  // ordinal: 0x0
  SystemProcessorInformation = 1,                              // ordinal: 0x1
  SystemPerformanceInformation = 2,                            // ordinal: 0x2
  SystemTimeOfDayInformation = 3,                              // ordinal: 0x3
  SystemPathInformation = 4,                                   // ordinal: 0x4
  SystemProcessInformation = 5,                                // ordinal: 0x5
  SystemCallCountInformation = 6,                              // ordinal: 0x6
  SystemDeviceInformation = 7,                                 // ordinal: 0x7
  SystemProcessorPerformanceInformation = 8,                   // ordinal: 0x8
  SystemFlagsInformation = 9,                                  // ordinal: 0x9
  SystemCallTimeInformation = 10,                              // ordinal: 0xa
  SystemModuleInformation = 11,                                // ordinal: 0xb
  SystemLocksInformation = 12,                                 // ordinal: 0xc
  SystemStackTraceInformation = 13,                            // ordinal: 0xd
  SystemPagedPoolInformation = 14,                             // ordinal: 0xe
  SystemNonPagedPoolInformation = 15,                          // ordinal: 0xf
  SystemHandleInformation = 16,                                // ordinal: 0x10
  SystemObjectInformation = 17,                                // ordinal: 0x11
  SystemPageFileInformation = 18,                              // ordinal: 0x12
  SystemVdmInstemulInformation = 19,                           // ordinal: 0x13
  SystemVdmBopInformation = 20,                                // ordinal: 0x14
  SystemFileCacheInformation = 21,                             // ordinal: 0x15
  SystemPoolTagInformation = 22,                               // ordinal: 0x16
  SystemInterruptInformation = 23,                             // ordinal: 0x17
  SystemDpcBehaviorInformation = 24,                           // ordinal: 0x18
  SystemFullMemoryInformation = 25,                            // ordinal: 0x19
  SystemLoadGdiDriverInformation = 26,                         // ordinal: 0x1a
  SystemUnloadGdiDriverInformation = 27,                       // ordinal: 0x1b
  SystemTimeAdjustmentInformation = 28,                        // ordinal: 0x1c
  SystemSummaryMemoryInformation = 29,                         // ordinal: 0x1d
  SystemMirrorMemoryInformation = 30,                          // ordinal: 0x1e
  SystemPerformanceTraceInformation = 31,                      // ordinal: 0x1f
  SystemObsolete0 = 32,                                        // ordinal: 0x20
  SystemExceptionInformation = 33,                             // ordinal: 0x21
  SystemCrashDumpStateInformation = 34,                        // ordinal: 0x22
  SystemKernelDebuggerInformation = 35,                        // ordinal: 0x23
  SystemContextSwitchInformation = 36,                         // ordinal: 0x24
  SystemRegistryQuotaInformation = 37,                         // ordinal: 0x25
  SystemExtendServiceTableInformation = 38,                    // ordinal: 0x26
  SystemPrioritySeperation = 39,                               // ordinal: 0x27
  SystemVerifierAddDriverInformation = 40,                     // ordinal: 0x28
  SystemVerifierRemoveDriverInformation = 41,                  // ordinal: 0x29
  SystemProcessorIdleInformation = 42,                         // ordinal: 0x2a
  SystemLegacyDriverInformation = 43,                          // ordinal: 0x2b
  SystemCurrentTimeZoneInformation = 44,                       // ordinal: 0x2c
  SystemLookasideInformation = 45,                             // ordinal: 0x2d
  SystemTimeSlipNotification = 46,                             // ordinal: 0x2e
  SystemSessionCreate = 47,                                    // ordinal: 0x2f
  SystemSessionDetach = 48,                                    // ordinal: 0x30
  SystemSessionInformation = 49,                               // ordinal: 0x31
  SystemRangeStartInformation = 50,                            // ordinal: 0x32
  SystemVerifierInformation = 51,                              // ordinal: 0x33
  SystemVerifierThunkExtend = 52,                              // ordinal: 0x34
  SystemSessionProcessInformation = 53,                        // ordinal: 0x35
  SystemLoadGdiDriverInSystemSpace = 54,                       // ordinal: 0x36
  SystemNumaProcessorMap = 55,                                 // ordinal: 0x37
  SystemPrefetcherInformation = 56,                            // ordinal: 0x38
  SystemExtendedProcessInformation = 57,                       // ordinal: 0x39
  SystemRecommendedSharedDataAlignment = 58,                   // ordinal: 0x3a
  SystemComPlusPackage = 59,                                   // ordinal: 0x3b
  SystemNumaAvailableMemory = 60,                              // ordinal: 0x3c
  SystemProcessorPowerInformation = 61,                        // ordinal: 0x3d
  SystemEmulationBasicInformation = 62,                        // ordinal: 0x3e
  SystemEmulationProcessorInformation = 63,                    // ordinal: 0x3f
  SystemExtendedHandleInformation = 64,                        // ordinal: 0x40
  SystemLostDelayedWriteInformation = 65,                      // ordinal: 0x41
  SystemBigPoolInformation = 66,                               // ordinal: 0x42
  SystemSessionPoolTagInformation = 67,                        // ordinal: 0x43
  SystemSessionMappedViewInformation = 68,                     // ordinal: 0x44
  SystemHotpatchInformation = 69,                              // ordinal: 0x45
  SystemObjectSecurityMode = 70,                               // ordinal: 0x46
  SystemWatchdogTimerHandler = 71,                             // ordinal: 0x47
  SystemWatchdogTimerInformation = 72,                         // ordinal: 0x48
  SystemLogicalProcessorInformation = 73,                      // ordinal: 0x49
  SystemWow64SharedInformationObsolete = 74,                   // ordinal: 0x4a
  SystemRegisterFirmwareTableInformationHandler = 75,          // ordinal: 0x4b
  SystemFirmwareTableInformation = 76,                         // ordinal: 0x4c
  SystemModuleInformationEx = 77,                              // ordinal: 0x4d
  SystemVerifierTriageInformation = 78,                        // ordinal: 0x4e
  SystemSuperfetchInformation = 79,                            // ordinal: 0x4f
  SystemMemoryListInformation = 80,                            // ordinal: 0x50
  SystemFileCacheInformationEx = 81,                           // ordinal: 0x51
  SystemThreadPriorityClientIdInformation = 82,                // ordinal: 0x52
  SystemProcessorIdleCycleTimeInformation = 83,                // ordinal: 0x53
  SystemVerifierCancellationInformation = 84,                  // ordinal: 0x54
  SystemProcessorPowerInformationEx = 85,                      // ordinal: 0x55
  SystemRefTraceInformation = 86,                              // ordinal: 0x56
  SystemSpecialPoolInformation = 87,                           // ordinal: 0x57
  SystemProcessIdInformation = 88,                             // ordinal: 0x58
  SystemErrorPortInformation = 89,                             // ordinal: 0x59
  SystemBootEnvironmentInformation = 90,                       // ordinal: 0x5a
  SystemHypervisorInformation = 91,                            // ordinal: 0x5b
  SystemVerifierInformationEx = 92,                            // ordinal: 0x5c
  SystemTimeZoneInformation = 93,                              // ordinal: 0x5d
  SystemImageFileExecutionOptionsInformation = 94,             // ordinal: 0x5e
  SystemCoverageInformation = 95,                              // ordinal: 0x5f
  SystemPrefetchPatchInformation = 96,                         // ordinal: 0x60
  SystemVerifierFaultsInformation = 97,                        // ordinal: 0x61
  SystemSystemPartitionInformation = 98,                       // ordinal: 0x62
  SystemSystemDiskInformation = 99,                            // ordinal: 0x63
  SystemProcessorPerformanceDistribution = 100,                // ordinal: 0x64
  SystemNumaProximityNodeInformation = 101,                    // ordinal: 0x65
  SystemDynamicTimeZoneInformation = 102,                      // ordinal: 0x66
  SystemCodeIntegrityInformation = 103,                        // ordinal: 0x67
  SystemProcessorMicrocodeUpdateInformation = 104,             // ordinal: 0x68
  SystemProcessorBrandString = 105,                            // ordinal: 0x69
  SystemVirtualAddressInformation = 106,                       // ordinal: 0x6a
  SystemLogicalProcessorAndGroupInformation = 107,             // ordinal: 0x6b
  SystemProcessorCycleTimeInformation = 108,                   // ordinal: 0x6c
  SystemStoreInformation = 109,                                // ordinal: 0x6d
  SystemRegistryAppendString = 110,                            // ordinal: 0x6e
  SystemAitSamplingValue = 111,                                // ordinal: 0x6f
  SystemVhdBootInformation = 112,                              // ordinal: 0x70
  SystemCpuQuotaInformation = 113,                             // ordinal: 0x71
  SystemNativeBasicInformation = 114,                          // ordinal: 0x72
  SystemErrorPortTimeouts = 115,                               // ordinal: 0x73
  SystemLowPriorityIoInformation = 116,                        // ordinal: 0x74
  SystemBootEntropyInformation = 117,                          // ordinal: 0x75
  SystemVerifierCountersInformation = 118,                     // ordinal: 0x76
  SystemPagedPoolInformationEx = 119,                          // ordinal: 0x77
  SystemSystemPtesInformationEx = 120,                         // ordinal: 0x78
  SystemNodeDistanceInformation = 121,                         // ordinal: 0x79
  SystemAcpiAuditInformation = 122,                            // ordinal: 0x7a
  SystemBasicPerformanceInformation = 123,                     // ordinal: 0x7b
  SystemQueryPerformanceCounterInformation = 124,              // ordinal: 0x7c
  SystemSessionBigPoolInformation = 125,                       // ordinal: 0x7d
  SystemBootGraphicsInformation = 126,                         // ordinal: 0x7e
  SystemScrubPhysicalMemoryInformation = 127,                  // ordinal: 0x7f
  SystemBadPageInformation = 128,                              // ordinal: 0x80
  SystemProcessorProfileControlArea = 129,                     // ordinal: 0x81
  SystemCombinePhysicalMemoryInformation = 130,                // ordinal: 0x82
  SystemEntropyInterruptTimingInformation = 131,               // ordinal: 0x83
  SystemConsoleInformation = 132,                              // ordinal: 0x84
  SystemPlatformBinaryInformation = 133,                       // ordinal: 0x85
  SystemPolicyInformation = 134,                               // ordinal: 0x86
  SystemHypervisorProcessorCountInformation = 135,             // ordinal: 0x87
  SystemDeviceDataInformation = 136,                           // ordinal: 0x88
  SystemDeviceDataEnumerationInformation = 137,                // ordinal: 0x89
  SystemMemoryTopologyInformation = 138,                       // ordinal: 0x8a
  SystemMemoryChannelInformation = 139,                        // ordinal: 0x8b
  SystemBootLogoInformation = 140,                             // ordinal: 0x8c
  SystemProcessorPerformanceInformationEx = 141,               // ordinal: 0x8d
  SystemCriticalProcessErrorLogInformation = 142,              // ordinal: 0x8e
  SystemSecureBootPolicyInformation = 143,                     // ordinal: 0x8f
  SystemPageFileInformationEx = 144,                           // ordinal: 0x90
  SystemSecureBootInformation = 145,                           // ordinal: 0x91
  SystemEntropyInterruptTimingRawInformation = 146,            // ordinal: 0x92
  SystemPortableWorkspaceEfiLauncherInformation = 147,         // ordinal: 0x93
  SystemFullProcessInformation = 148,                          // ordinal: 0x94
  SystemKernelDebuggerInformationEx = 149,                     // ordinal: 0x95
  SystemBootMetadataInformation = 150,                         // ordinal: 0x96
  SystemSoftRebootInformation = 151,                           // ordinal: 0x97
  SystemElamCertificateInformation = 152,                      // ordinal: 0x98
  SystemOfflineDumpConfigInformation = 153,                    // ordinal: 0x99
  SystemProcessorFeaturesInformation = 154,                    // ordinal: 0x9a
  SystemRegistryReconciliationInformation = 155,               // ordinal: 0x9b
  SystemEdidInformation = 156,                                 // ordinal: 0x9c
  SystemManufacturingInformation = 157,                        // ordinal: 0x9d
  SystemEnergyEstimationConfigInformation = 158,               // ordinal: 0x9e
  SystemHypervisorDetailInformation = 159,                     // ordinal: 0x9f
  SystemProcessorCycleStatsInformation = 160,                  // ordinal: 0xa0
  SystemVmGenerationCountInformation = 161,                    // ordinal: 0xa1
  SystemTrustedPlatformModuleInformation = 162,                // ordinal: 0xa2
  SystemKernelDebuggerFlags = 163,                             // ordinal: 0xa3
  SystemCodeIntegrityPolicyInformation = 164,                  // ordinal: 0xa4
  SystemIsolatedUserModeInformation = 165,                     // ordinal: 0xa5
  SystemHardwareSecurityTestInterfaceResultsInformation = 166, // ordinal: 0xa6
  SystemSingleModuleInformation = 167,                         // ordinal: 0xa7
  SystemAllowedCpuSetsInformation = 168,                       // ordinal: 0xa8
  SystemVsmProtectionInformation = 169,                        // ordinal: 0xa9
  SystemInterruptCpuSetsInformation = 170,                     // ordinal: 0xaa
  SystemSecureBootPolicyFullInformation = 171,                 // ordinal: 0xab
  SystemCodeIntegrityPolicyFullInformation = 172,              // ordinal: 0xac
  SystemAffinitizedInterruptProcessorInformation = 173,        // ordinal: 0xad
  SystemRootSiloInformation = 174,                             // ordinal: 0xae
  SystemCpuSetInformation = 175,                               // ordinal: 0xaf
  SystemCpuSetTagInformation = 176,                            // ordinal: 0xb0
  SystemWin32WerStartCallout = 177,                            // ordinal: 0xb1
  SystemSecureKernelProfileInformation = 178,                  // ordinal: 0xb2
  SystemCodeIntegrityPlatformManifestInformation = 179,        // ordinal: 0xb3
  SystemInterruptSteeringInformation = 180,                    // ordinal: 0xb4
  SystemSupportedProcessorArchitectures = 181,                 // ordinal: 0xb5
  SystemMemoryUsageInformation = 182,                          // ordinal: 0xb6
  SystemCodeIntegrityCertificateInformation = 183,             // ordinal: 0xb7
  SystemPhysicalMemoryInformation = 184,                       // ordinal: 0xb8
  SystemControlFlowTransition = 185,                           // ordinal: 0xb9
  SystemKernelDebuggingAllowed = 186,                          // ordinal: 0xba
  SystemActivityModerationExeState = 187,                      // ordinal: 0xbb
  SystemActivityModerationUserSettings = 188,                  // ordinal: 0xbc
  SystemCodeIntegrityPoliciesFullInformation = 189,            // ordinal: 0xbd
  SystemCodeIntegrityUnlockInformation = 190,                  // ordinal: 0xbe
  SystemIntegrityQuotaInformation = 191,                       // ordinal: 0xbf
  SystemFlushInformation = 192,                                // ordinal: 0xc0
  SystemProcessorIdleMaskInformation = 193,                    // ordinal: 0xc1
  SystemSecureDumpEncryptionInformation = 194,                 // ordinal: 0xc2
  SystemWriteConstraintInformation = 195,                      // ordinal: 0xc3
  SystemKernelVaShadowInformation = 196,                       // ordinal: 0xc4
  SystemHypervisorSharedPageInformation = 197,                 // ordinal: 0xc5
  SystemFirmwareBootPerformanceInformation = 198,              // ordinal: 0xc6
  SystemCodeIntegrityVerificationInformation = 199,            // ordinal: 0xc7
  SystemFirmwarePartitionInformation = 200,                    // ordinal: 0xc8
  SystemSpeculationControlInformation = 201,                   // ordinal: 0xc9
  SystemDmaGuardPolicyInformation = 202,                       // ordinal: 0xca
  SystemEnclaveLaunchControlInformation = 203,                 // ordinal: 0xcb
  SystemWorkloadAllowedCpuSetsInformation = 204,               // ordinal: 0xcc
  SystemCodeIntegrityUnlockModeInformation = 205,              // ordinal: 0xcd
  SystemLeapSecondInformation = 206,                           // ordinal: 0xce
  SystemFlags2Information = 207,                               // ordinal: 0xcf
  SystemSecurityModelInformation = 208,                        // ordinal: 0xd0
  SystemCodeIntegritySyntheticCacheInformation = 209,          // ordinal: 0xd1
  SystemFeatureConfigurationInformation = 210,                 // ordinal: 0xd2
  SystemFeatureConfigurationSectionInformation = 211,          // ordinal: 0xd3
  SystemFeatureUsageSubscriptionInformation = 212,             // ordinal: 0xd4
  SystemSecureSpeculationControlInformation = 213,             // ordinal: 0xd5
  SystemSpacesBootInformation = 214,                           // ordinal: 0xd6
  SystemFwRamdiskInformation = 215,                            // ordinal: 0xd7
  SystemWheaIpmiHardwareInformation = 216,                     // ordinal: 0xd8
  SystemDifSetRuleClassInformation = 217,                      // ordinal: 0xd9
  SystemDifClearRuleClassInformation = 218,                    // ordinal: 0xda
  SystemDifApplyPluginVerificationOnDriver = 219,              // ordinal: 0xdb
  SystemDifRemovePluginVerificationOnDriver = 220,             // ordinal: 0xdc
  SystemShadowStackInformation = 221,                          // ordinal: 0xdd
  SystemBuildVersionInformation = 222,                         // ordinal: 0xde
  SystemPoolLimitInformation = 223,                            // ordinal: 0xdf
  SystemCodeIntegrityAddDynamicStore = 224,                    // ordinal: 0xe0
  SystemCodeIntegrityClearDynamicStores = 225,                 // ordinal: 0xe1
  SystemDifPoolTrackingInformation = 226,                      // ordinal: 0xe2
  SystemPoolZeroingInformation = 227,                          // ordinal: 0xe3
  SystemDpcWatchdogInformation = 228,                          // ordinal: 0xe4
  SystemDpcWatchdogInformation2 = 229,                         // ordinal: 0xe5
  SystemSupportedProcessorArchitectures2 = 230,                // ordinal: 0xe6
  SystemSingleProcessorRelationshipInformation = 231,          // ordinal: 0xe7
  SystemXfgCheckFailureInformation = 232,                      // ordinal: 0xe8
  SystemIommuStateInformation = 233,                           // ordinal: 0xe9
  SystemHypervisorMinrootInformation = 234,                    // ordinal: 0xea
  SystemHypervisorBootPagesInformation = 235,                  // ordinal: 0xeb
  SystemPointerAuthInformation = 236,                          // ordinal: 0xec
  SystemSecureKernelDebuggerInformation = 237,                 // ordinal: 0xed
  SystemOriginalImageFeatureInformation = 238,                 // ordinal: 0xee
  MaxSystemInfoClass = 239,                                    // ordinal: 0xef
} _SYSTEM_INFORMATION_CLASS;

typedef enum _ConnectionResourceConsumerDesc {
  ConnectionResourceConsumerDescIsUndefined = 0, // ordinal: 0x0
  ConnectionResourceConsumerDescIsDevice = 1,    // ordinal: 0x1
  ConnectionResourceConsumerDescIsOpregion = 2,  // ordinal: 0x2
  ConnectionResourceConsumerDescMax = 3,         // ordinal: 0x3
} _ConnectionResourceConsumerDesc;

typedef enum _MI_VAD_ALLOCATION_CELL_TYPE {
  MiVadBottomUp = 0,              // ordinal: 0x0
  MiVadStackPebTeb = 1,           // ordinal: 0x1
  MiVadReserved64 = 2,            // ordinal: 0x2
  MiVadAllocationCellMaximum = 3, // ordinal: 0x3
} _MI_VAD_ALLOCATION_CELL_TYPE;

typedef enum _PPM_PERF_QOS_DISABLE_REASON {
  PpmPerfQosDisableInternal = 0,           // ordinal: 0x0
  PpmPerfQosDisableNoProfile = 1,          // ordinal: 0x1
  PpmPerfQosDisableNoPolicy = 2,           // ordinal: 0x2
  PpmPerfQosDisableInsufficientPolicy = 3, // ordinal: 0x3
  PpmPerfQosDisableMaxOverride = 4,        // ordinal: 0x4
  PpmPerfQosDisableLowLatency = 5,         // ordinal: 0x5
  PpmPerfQosDisableSmtScheduler = 6,       // ordinal: 0x6
  PpmPerfQosDisableNoHardwareSupport = 7,  // ordinal: 0x7
  PpmPerfQosDisableGroupPolicy = 8,        // ordinal: 0x8
  PpmPerfQosDisableMax = 9,                // ordinal: 0x9
} _PPM_PERF_QOS_DISABLE_REASON;

typedef enum _PS_ATTRIBUTE_NUM {
  PsAttributeParentProcess = 0,                 // ordinal: 0x0
  PsAttributeDebugObject = 1,                   // ordinal: 0x1
  PsAttributeToken = 2,                         // ordinal: 0x2
  PsAttributeClientId = 3,                      // ordinal: 0x3
  PsAttributeTebAddress = 4,                    // ordinal: 0x4
  PsAttributeImageName = 5,                     // ordinal: 0x5
  PsAttributeImageInfo = 6,                     // ordinal: 0x6
  PsAttributeMemoryReserve = 7,                 // ordinal: 0x7
  PsAttributePriorityClass = 8,                 // ordinal: 0x8
  PsAttributeErrorMode = 9,                     // ordinal: 0x9
  PsAttributeStdHandleInfo = 10,                // ordinal: 0xa
  PsAttributeHandleList = 11,                   // ordinal: 0xb
  PsAttributeGroupAffinity = 12,                // ordinal: 0xc
  PsAttributePreferredNode = 13,                // ordinal: 0xd
  PsAttributeIdealProcessor = 14,               // ordinal: 0xe
  PsAttributeUmsThread = 15,                    // ordinal: 0xf
  PsAttributeMitigationOptions = 16,            // ordinal: 0x10
  PsAttributeProtectionLevel = 17,              // ordinal: 0x11
  PsAttributeSecureProcess = 18,                // ordinal: 0x12
  PsAttributeJobList = 19,                      // ordinal: 0x13
  PsAttributeChildProcessPolicy = 20,           // ordinal: 0x14
  PsAttributeAllApplicationPackagesPolicy = 21, // ordinal: 0x15
  PsAttributeWin32kFilter = 22,                 // ordinal: 0x16
  PsAttributeSafeOpenPromptOriginClaim = 23,    // ordinal: 0x17
  PsAttributeBnoIsolation = 24,                 // ordinal: 0x18
  PsAttributeDesktopAppPolicy = 25,             // ordinal: 0x19
  PsAttributeChpe = 26,                         // ordinal: 0x1a
  PsAttributeMitigationAuditOptions = 27,       // ordinal: 0x1b
  PsAttributeMachineType = 28,                  // ordinal: 0x1c
  PsAttributeComponentFilter = 29,              // ordinal: 0x1d
  PsAttributeEnableOptionalXStateFeatures = 30, // ordinal: 0x1e
  PsAttributeMax = 31,                          // ordinal: 0x1f
} _PS_ATTRIBUTE_NUM;

typedef enum _SYSTEM_FEATURE_CONFIGURATION_SECTION_TYPE {
  SystemFeatureConfigurationSectionTypeBoot = 0,          // ordinal: 0x0
  SystemFeatureConfigurationSectionTypeRuntime = 1,       // ordinal: 0x1
  SystemFeatureConfigurationSectionTypeUsageTriggers = 2, // ordinal: 0x2
  SystemFeatureConfigurationSectionTypeCount = 3,         // ordinal: 0x3
} _SYSTEM_FEATURE_CONFIGURATION_SECTION_TYPE;

typedef enum _PO_S0_DISCONNECTED_REASON {
  PoS0DisconnectedReasonNone = 0,            // ordinal: 0x0
  PoS0DisconnectedReasonNonCompliantNic = 1, // ordinal: 0x1
  PoS0DisconnectedReasonSettingPolicy = 2,   // ordinal: 0x2
  PoS0DisconnectedReasonEnforceDsPolicy = 3, // ordinal: 0x3
  PoS0DisconnectedReasonCsChecksFailed = 4,  // ordinal: 0x4
  PoS0DisconnectedReasonOpportunisticDs = 5, // ordinal: 0x5
  PoS0DisconnectedReasonAdaptiveCs = 5,      // ordinal: 0x6
  PoS0DisconnectedReasonMaximum = 6,         // ordinal: 0x7
} _PO_S0_DISCONNECTED_REASON;

typedef enum _MI_RVA_LIST_FILTER_TYPE {
  MiRvaListFilterCfgValid = 0, // ordinal: 0x0
  MiRvaListFilterCfgFirst = 0, // ordinal: 0x1
  MiRvaListFilterCfgLast = 1,  // ordinal: 0x2
  MiRvaListFilterInvalid = 2,  // ordinal: 0x3
} _MI_RVA_LIST_FILTER_TYPE;

typedef enum _HV_EXT_EPF_MODE {
  HvExtEpfModeMin = 0, // ordinal: 0x0
  HvExtEpfModeNt = 0,  // ordinal: 0x1
  HvExtEpfModeMax = 1, // ordinal: 0x2
} _HV_EXT_EPF_MODE;

typedef enum _KTOPOLOGY_LEVEL {
  KTopologyLevelProcessor = 0, // ordinal: 0x0
  KTopologyLevelCore = 1,      // ordinal: 0x1
  KTopologyLevelModule = 2,    // ordinal: 0x2
  KTopologyLevelDie = 3,       // ordinal: 0x3
  KTopologyLevelPackage = 4,   // ordinal: 0x4
  KTopologyLevelCount = 5,     // ordinal: 0x5
} _KTOPOLOGY_LEVEL;

typedef enum _MI_CROSS_PARTITION_CHARGE_TYPE {
  MiCrossPartitionSectionResAvailCharge = 0,   // ordinal: 0x0
  MiCrossPartitionSectionCommitCharge = 1,     // ordinal: 0x1
  MiCrossPartitionLargePageResAvailCharge = 2, // ordinal: 0x2
  MiCrossPartitionLargePageCommitCharge = 3,   // ordinal: 0x3
  MiCrossPartitionSmallAweResAvailCharge = 4,  // ordinal: 0x4
  MiCrossPartitionSmallAweCommitCharge = 5,    // ordinal: 0x5
  MiCrossPartitionPageCloneResAvailCharge = 6, // ordinal: 0x6
  MiCrossPartitionAggregateResAvailCharge = 7, // ordinal: 0x7
  MiCrossPartitionAggregateCommitCharge = 8,   // ordinal: 0x8
  MiCrossPartitionMaximumCharge = 9,           // ordinal: 0x9
} _MI_CROSS_PARTITION_CHARGE_TYPE;

typedef enum _CM_HIVE_CACHE_OPLOCK_EVENT_TYPE {
  OplockEventOnPrimary = 0,           // ordinal: 0x0
  OplockEventOnLog1 = 1,              // ordinal: 0x1
  OplockEventOnLog2 = 2,              // ordinal: 0x2
  OplockBreakThreadKillEvent = 3,     // ordinal: 0x3
  OplockBreakThreadEndEvent = 4,      // ordinal: 0x4
  OplockBreakThreadSyncEvent = 5,     // ordinal: 0x5
  OplockBreakThreadWaitEventsMax = 4, // ordinal: 0x6
  OplockRelatedEventsMax = 6,         // ordinal: 0x7
} _CM_HIVE_CACHE_OPLOCK_EVENT_TYPE;

typedef enum _THREAD_WORKLOAD_CLASS {
  ThreadWorkloadClassDefault = 0,  // ordinal: 0x0
  ThreadWorkloadClassGraphics = 1, // ordinal: 0x1
  MaxThreadWorkloadClass = 2,      // ordinal: 0x2
} _THREAD_WORKLOAD_CLASS;

typedef enum _SYSTEM_POOL_LIMIT_MEM_TYPE {
  SysPlMemPaged = 0,    // ordinal: 0x0
  SysPlMemNonPaged = 1, // ordinal: 0x1
  SysPlMemTypeMax = 2,  // ordinal: 0x2
} _SYSTEM_POOL_LIMIT_MEM_TYPE;

typedef enum PDCCLIENTID {
  PDC_INVALID_CLIENT = 0,                             // ordinal: 0x0
  PDC_PLM_CLIENT = 1,                                 // ordinal: 0x1
  PDC_NQM_CLIENT = 2,                                 // ordinal: 0x2
  PDC_WNS_CLIENT = 3,                                 // ordinal: 0x3
  PDC_DAM_CLIENT = 4,                                 // ordinal: 0x4
  PDC_WCM_CLIENT = 5,                                 // ordinal: 0x5
  PDC_NCSI_CLIENT = 7,                                // ordinal: 0x6
  PDC_DHCP_CLIENT = 8,                                // ordinal: 0x7
  PDC_TCPIP_CLIENT = 9,                               // ordinal: 0x8
  PDC_WU_CLIENT = 11,                                 // ordinal: 0x9
  PDC_GP_CLIENT = 12,                                 // ordinal: 0xa
  PDC_NCA_CLIENT = 14,                                // ordinal: 0xb
  PDC_BI_CLIENT = 15,                                 // ordinal: 0xc
  PDC_MSCHED_CLIENT = 16,                             // ordinal: 0xd
  PDC_SUSPENDRESUME_CLIENT = 17,                      // ordinal: 0xe
  PDC_INTERNAL_CLIENT = 18,                           // ordinal: 0xf
  PDC_DEFAULT_KM_TEST_CLIENT_EXEMPTED = 19,           // ordinal: 0x10
  PDC_DEFAULT_UM_TEST_CLIENT_EXEMPTED = 20,           // ordinal: 0x11
  PDC_DAM_PHASE_TEST_CLIENT = 21,                     // ordinal: 0x12
  PDC_LOW_POWER_PHASE_TEST_CLIENT = 22,               // ordinal: 0x13
  PDC_RESILIENCY_NOTIFICATION_PHASE_TEST_CLIENT = 23, // ordinal: 0x14
  PDC_NQM_RESILIENCY_TEST_CLIENT = 24,                // ordinal: 0x15
  PDC_DAM_RESILIENCY_TEST_CLIENT = 25,                // ordinal: 0x16
  PDC_DAM_KM_TEST_CLIENT = 26,                        // ordinal: 0x17
  PDC_DAM_UM_TEST_CLIENT = 27,                        // ordinal: 0x18
  PDC_SINGLETON_TEST_CLIENT = 28,                     // ordinal: 0x19
  PDC_NETWORK_SERVICE_TEST_CLIENT = 29,               // ordinal: 0x1a
  PDC_NETWORK_SERVICE2_TEST_CLIENT = 30,              // ordinal: 0x1b
  PDC_SYSTEM_SERVICE_TEST_CLIENT = 31,                // ordinal: 0x1c
  PDC_ACTIV_NOTIF_DAM_RESIL_TEST_CLIENT = 32,         // ordinal: 0x1d
  PDC_ACTIV_NOTIF_NET_RESIL_TEST_CLIENT = 33,         // ordinal: 0x1e
  PDC_SHELL_CLIENT = 34,                              // ordinal: 0x1f
  PDC_MAINTENANCE_CLIENT = 35,                        // ordinal: 0x20
  PDC_SYNC_CLIENT = 36,                               // ordinal: 0x21
  PDC_IDM_CLIENT = 37,                                // ordinal: 0x22
  PDC_CORTANA_VOICE_ACTIVATION_CLIENT = 38,           // ordinal: 0x23
  PDC_TETHERING_CLIENT = 39,                          // ordinal: 0x24
  PDC_AUDIO_CLIENT = 40,                              // ordinal: 0x25
  PDC_LOCK_SCREEN = 41,                               // ordinal: 0x26
  PDC_LREC_CLIENT = 42,                               // ordinal: 0x27
  PDC_WP_BW_CLIENT = 43,                              // ordinal: 0x28
  PDC_WP_MEDIA_STREAMING_CLIENT = 44,                 // ordinal: 0x29
  PDC_WP_MAPS_CLIENT = 46,                            // ordinal: 0x2a
  PDC_WP_SYNC_CLIENT = 47,                            // ordinal: 0x2b
  PDC_SETTING_SYNC_CLIENT = 48,                       // ordinal: 0x2c
  PDC_WP_EDM_CLIENT = 49,                             // ordinal: 0x2d
  PDC_WP_WALLET_CLIENT = 50,                          // ordinal: 0x2e
  PDC_WP_LOCATION_CLIENT = 51,                        // ordinal: 0x2f
  PDC_WP_CM_CLIENT = 53,                              // ordinal: 0x30
  PDC_WP_DCP_CLIENT = 54,                             // ordinal: 0x31
  PDC_WP_WIFIAUTO_CLIENT = 55,                        // ordinal: 0x32
  PDC_BITLOCKER_CLIENT = 56,                          // ordinal: 0x33
  PDC_MDM_CERTINSTALLER_CLIENT = 57,                  // ordinal: 0x34
  PDC_WP_IM_CLIENT = 58,                              // ordinal: 0x35
  PDC_WP_MMS_CLIENT = 59,                             // ordinal: 0x36
  PDC_DEVICEENROLLER_CLIENT = 60,                     // ordinal: 0x37
  PDC_WP_WIFI_SCANNING_CLIENT = 61,                   // ordinal: 0x38
  PDC_WP_OMADM_CLIENT = 62,                           // ordinal: 0x39
  PDC_WP_TELEMETRY_CHECK_CLIENT = 63,                 // ordinal: 0x3a
  PDC_WP_DIS_CLIENT = 64,                             // ordinal: 0x3b
  PDC_BITS_CLIENT = 65,                               // ordinal: 0x3c
  PDC_WP_VOIP_EXECUTION_CLIENT = 66,                  // ordinal: 0x3d
  PDC_WP_RESERVED_CLIENT3 = 67,                       // ordinal: 0x3e
  PDC_SLEEP_STUDY_CLIENT = 68,                        // ordinal: 0x3f
  PDC_WP_AUTOTIMEUPDATE_CLIENT = 69,                  // ordinal: 0x40
  PDC_HYPERV_CLIENT = 70,                             // ordinal: 0x41
  PDC_KM_SIGNAL_CLIENT = 71,                          // ordinal: 0x42
  PDC_UM_SIGNAL_CLIENT = 72,                          // ordinal: 0x43
  PDC_DEVICE_HEALTH_ATTESTATION_CLIENT = 73,          // ordinal: 0x44
  PDC_XB_SYSTEM_CLIENT = 74,                          // ordinal: 0x45
  PDC_XB_HOST_CLIENT = 75,                            // ordinal: 0x46
  PDC_PRINT_JOB_MANAGER_CLIENT = 76,                  // ordinal: 0x47
  PDC_TELEMETRY_CLIENT = 77,                          // ordinal: 0x48
  PDC_ERROR_REPORTING_CLIENT = 78,                    // ordinal: 0x49
  PDC_XBOX_NTM = 79,                                  // ordinal: 0x4a
  PDC_CBE_CLIENT = 80,                                // ordinal: 0x4b
  PDC_FIND_MY_PHONE_CLIENT = 81,                      // ordinal: 0x4c
  PDC_COMMAND_CHANNEL_CLIENT = 82,                    // ordinal: 0x4d
  PDC_PPM_PROFILES_CLIENT = 83,                       // ordinal: 0x4e
  PDC_WIFI_CALLING_CLIENT = 84,                       // ordinal: 0x4f
  PDC_WU_REBOOT_CLIENT = 85,                          // ordinal: 0x50
  PDC_SYSMAIN_CLIENT = 86,                            // ordinal: 0x51
  PDC_XBOX_UPDATE_CLIENT = 87,                        // ordinal: 0x52
  PDC_CHAT_SERVICE_CLIENT = 88,                       // ordinal: 0x53
  PDC_FIND_MY_DEVICE_CLIENT = 89,                     // ordinal: 0x54
  PDC_NOTIFICATION_FORWARDING_AND_ACTION_CLIENT = 90, // ordinal: 0x55
  PDC_INSTALL_AGENT_CLIENT = 91,                      // ordinal: 0x56
  PDC_XBOX_WAKE_ON_VOICE = 92,                        // ordinal: 0x57
  PDC_PLM_AUDIO_CLIENT = 93,                          // ordinal: 0x58
  PDC_WP_BCKAUDIO_CLIENT = 94,                        // ordinal: 0x59
  PDC_WAKE_ON_LAN_CLIENT = 95,                        // ordinal: 0x5a
  PDC_WP_CLOUD_MESSAGING_CLIENT = 96,                 // ordinal: 0x5b
  PDC_DATA_MIGRATION_MANAGER = 97,                    // ordinal: 0x5c
  PDC_EVENT_SOUND_MANAGER_CLIENT = 98,                // ordinal: 0x5d
  PDC_WWAN_DORMANCY_HINT_CLIENT = 99,                 // ordinal: 0x5e
  PDC_HAM_CLIENT = 100,                               // ordinal: 0x5f
  PDC_FILESHARINGSERVER_CLIENT = 101,                 // ordinal: 0x60
  PDC_DIRECTED_DRIPS_TASK_CLIENT = 102,               // ordinal: 0x61
  PDC_DIRECTED_DRIPS_LPE_CLIENT = 103,                // ordinal: 0x62
  PDC_DIRECTED_DRIPS_PLM_CLIENT = 104,                // ordinal: 0x63
  PDC_HTTPSDATASOURCE_CLIENT = 105,                   // ordinal: 0x64
  PDC_TERMINALSERVER_CONNECTION_CLIENT = 106,         // ordinal: 0x65
  PDC_TERMINALSERVER_SESSION_CLIENT = 107,            // ordinal: 0x66
  PDC_ANYNETWORK_RESILIENCY_CLIENT = 108,             // ordinal: 0x67
  PDC_XBOX_NUI_CLIENT = 110,                          // ordinal: 0x68
  PDC_WIFI_CALLING_IMS_CLIENT = 111,                  // ordinal: 0x69
  PDC_SLEEPSTUDY_HELPER_USER_CLIENT = 112,            // ordinal: 0x6a
  PDC_SLEEPSTUDY_HELPER_KERNEL_CLIENT = 113,          // ordinal: 0x6b
  PDC_CONTAINER_MANAGER_CLIENT = 114,                 // ordinal: 0x6c
  PDC_UPDATE_ORCHESTRATOR_CLIENT = 115,               // ordinal: 0x6d
  PDC_UPDATE_UX_CLIENT = 116,                         // ordinal: 0x6e
  PDC_HOT_KEY_MANAGER_CLIENT = 117,                   // ordinal: 0x6f
  PDC_SERVICING_PLATFORM = 118,                       // ordinal: 0x70
  PDC_TNC_CLIENT = 119,                               // ordinal: 0x71
  PDC_USER_SHUTDOWN_CLIENT = 120,                     // ordinal: 0x72
  PDC_KERNEL_PLUG_AND_PLAY = 121,                     // ordinal: 0x73
  PDC_NUMBER_OF_CLIENTS = 122,                        // ordinal: 0x74
} PDCCLIENTID;

typedef enum _MI_WRITE_TYPES {
  WriteTypeCached = 0,      // ordinal: 0x0
  WriteTypeNonTemporal = 1, // ordinal: 0x1
  WriteTypeMaximum = 2,     // ordinal: 0x2
} _MI_WRITE_TYPES;

typedef enum _PERFINFO_MM_STAT {
  PerfInfoMMStatNotUsed = 0,              // ordinal: 0x0
  PerfInfoMMStatAggregatePageCombine = 1, // ordinal: 0x1
  PerfInfoMMStatIterationPageCombine = 2, // ordinal: 0x2
  PerfInfoMMStatMax = 3,                  // ordinal: 0x3
} _PERFINFO_MM_STAT;

typedef enum _KERNEL_SHADOW_STACK_TYPE {
  KernelShadowStackTypeUserThread = 0,               // ordinal: 0x0
  KernelShadowStackTypeKernelThread = 1,             // ordinal: 0x1
  KernelShadowStackTypeRstorssp = 2,                 // ordinal: 0x2
  KernelShadowStackTypeSetssbsy = 3,                 // ordinal: 0x3
  KernelShadowStackTypeSetssbsyForSystemStartup = 4, // ordinal: 0x4
  KernelShadowStackTypeMax = 5,                      // ordinal: 0x5
} _KERNEL_SHADOW_STACK_TYPE;

typedef enum _KISOLATION_WIDTH {
  KiIsolationWidthLogicalProcessor = 0, // ordinal: 0x0
  KiIsolationWidthCore = 1,             // ordinal: 0x1
  KiIsolationWidthMax = 2,              // ordinal: 0x2
} _KISOLATION_WIDTH;

typedef enum _MI_PARTITION_THREAD {
  MiZeroPageThreadSlot = 0,             // ordinal: 0x0
  MiRebuildLargePagesThreadSlot = 1,    // ordinal: 0x1
  MiPartitionWorkingSetManagerSlot = 2, // ordinal: 0x2
  MiDereferenceSegmentThreadSlot = 3,   // ordinal: 0x3
  MiModifiedPageWriterSlot = 4,         // ordinal: 0x4
  MiMappedPageWriterSlot = 5,           // ordinal: 0x5
  MiNumberOfPartitionThreads = 6,       // ordinal: 0x6
} _MI_PARTITION_THREAD;

typedef enum _TRACE_INFORMATION_CLASS {
  TraceIdClass = 0,                    // ordinal: 0x0
  TraceHandleClass = 1,                // ordinal: 0x1
  TraceEnableFlagsClass = 2,           // ordinal: 0x2
  TraceEnableLevelClass = 3,           // ordinal: 0x3
  GlobalLoggerHandleClass = 4,         // ordinal: 0x4
  EventLoggerHandleClass = 5,          // ordinal: 0x5
  AllLoggerHandlesClass = 6,           // ordinal: 0x6
  TraceHandleByNameClass = 7,          // ordinal: 0x7
  LoggerEventsLostClass = 8,           // ordinal: 0x8
  TraceSessionSettingsClass = 9,       // ordinal: 0x9
  LoggerEventsLoggedClass = 10,        // ordinal: 0xa
  DiskIoNotifyRoutinesClass = 11,      // ordinal: 0xb
  TraceInformationClassReserved1 = 12, // ordinal: 0xc
  AllPossibleNotifyRoutinesClass = 12, // ordinal: 0xd
  FltIoNotifyRoutinesClass = 13,       // ordinal: 0xe
  TraceInformationClassReserved2 = 14, // ordinal: 0xf
  WdfNotifyRoutinesClass = 15,         // ordinal: 0x10
  MaxTraceInformationClass = 16,       // ordinal: 0x11
} _TRACE_INFORMATION_CLASS;

typedef enum _MI_IO_PFN_TYPE {
  MiIoPfnProbes = 0,      // ordinal: 0x0
  MiIoPfnMaps = 1,        // ordinal: 0x1
  MiMaximumIoPfnType = 2, // ordinal: 0x2
} _MI_IO_PFN_TYPE;

typedef enum TlgOut_t {
  TlgOutNULL = 0,                  // ordinal: 0x0
  TlgOutNOPRINT = 1,               // ordinal: 0x1
  TlgOutSTRING = 2,                // ordinal: 0x2
  TlgOutBOOLEAN = 3,               // ordinal: 0x3
  TlgOutHEX = 4,                   // ordinal: 0x4
  TlgOutPID = 5,                   // ordinal: 0x5
  TlgOutTID = 6,                   // ordinal: 0x6
  TlgOutPORT = 7,                  // ordinal: 0x7
  TlgOutIPV4 = 8,                  // ordinal: 0x8
  TlgOutIPV6 = 9,                  // ordinal: 0x9
  TlgOutSOCKETADDRESS = 10,        // ordinal: 0xa
  TlgOutXML = 11,                  // ordinal: 0xb
  TlgOutJSON = 12,                 // ordinal: 0xc
  TlgOutWIN32ERROR = 13,           // ordinal: 0xd
  TlgOutNTSTATUS = 14,             // ordinal: 0xe
  TlgOutHRESULT = 15,              // ordinal: 0xf
  TlgOutFILETIME = 16,             // ordinal: 0x10
  TlgOutSIGNED = 17,               // ordinal: 0x11
  TlgOutUNSIGNED = 18,             // ordinal: 0x12
  TlgOutUTF8 = 35,                 // ordinal: 0x13
  TlgOutPKCS7_WITH_TYPE_INFO = 36, // ordinal: 0x14
  TlgOutCODE_POINTER = 37,         // ordinal: 0x15
  TlgOutDATETIME_UTC = 38,         // ordinal: 0x16
  _TlgOutMax = 39,                 // ordinal: 0x17
  _TlgOutChain = 128,              // ordinal: 0x18
  _TlgOutTypeMask = 127,           // ordinal: 0x19
} TlgOut_t;

typedef enum _INVPCID_TYPE {
  InvpcidIndividualAddress = 0,    // ordinal: 0x0
  InvpcidSingleContext = 1,        // ordinal: 0x1
  InvpcidAllContextAndGlobals = 2, // ordinal: 0x2
  InvpcidAllContext = 3,           // ordinal: 0x3
} _INVPCID_TYPE;

typedef enum _ADD_DRIVER_STAGE {
  ClassConfigFilters = 0, // ordinal: 0x0
  LowerDeviceFilters = 1, // ordinal: 0x1
  LowerClassFilters = 2,  // ordinal: 0x2
  DeviceService = 3,      // ordinal: 0x3
  UpperDeviceFilters = 4, // ordinal: 0x4
  UpperClassFilters = 5,  // ordinal: 0x5
  MaximumAddStage = 6,    // ordinal: 0x6
} _ADD_DRIVER_STAGE;

typedef enum _KPROCESS_STATE {
  ProcessInMemory = 0,      // ordinal: 0x0
  ProcessOutOfMemory = 1,   // ordinal: 0x1
  ProcessInTransition = 2,  // ordinal: 0x2
  ProcessOutTransition = 3, // ordinal: 0x3
  ProcessInSwap = 4,        // ordinal: 0x4
  ProcessOutSwap = 5,       // ordinal: 0x5
  ProcessRetryOutSwap = 6,  // ordinal: 0x6
  ProcessAllSwapStates = 7, // ordinal: 0x7
} _KPROCESS_STATE;

typedef enum _MI_VAD_64K_TYPES {
  MiVad64KPrivate = 0, // ordinal: 0x0
  MiVad64KShared = 1,  // ordinal: 0x1
  MiVad64KTypes = 2,   // ordinal: 0x2
} _MI_VAD_64K_TYPES;

typedef enum _PO_CS_DEVICE_NOTIFICATION_TYPE {
  PoCsDeviceNotificationStorage = 0,  // ordinal: 0x0
  PoCsDeviceNotificationWiFi = 1,     // ordinal: 0x1
  PoCsDeviceNotificationMbn = 2,      // ordinal: 0x2
  PoCsDeviceNotificationAudio = 3,    // ordinal: 0x3
  PoCsDeviceNotificationEthernet = 4, // ordinal: 0x4
  PoCsDeviceNotificationMaximum = 5,  // ordinal: 0x5
} _PO_CS_DEVICE_NOTIFICATION_TYPE;

typedef enum _POLICY_AUDIT_EVENT_TYPE {
  AuditCategorySystem = 0,                 // ordinal: 0x0
  AuditCategoryLogon = 1,                  // ordinal: 0x1
  AuditCategoryObjectAccess = 2,           // ordinal: 0x2
  AuditCategoryPrivilegeUse = 3,           // ordinal: 0x3
  AuditCategoryDetailedTracking = 4,       // ordinal: 0x4
  AuditCategoryPolicyChange = 5,           // ordinal: 0x5
  AuditCategoryAccountManagement = 6,      // ordinal: 0x6
  AuditCategoryDirectoryServiceAccess = 7, // ordinal: 0x7
  AuditCategoryAccountLogon = 8,           // ordinal: 0x8
} _POLICY_AUDIT_EVENT_TYPE;

typedef enum _MI_ASSIGNED_REGION_TYPES {
  AssignedRegionPfnDatabase = 0,         // ordinal: 0x0
  AssignedRegionNonPagedPool = 1,        // ordinal: 0x1
  AssignedRegionPagedPool = 2,           // ordinal: 0x2
  AssignedRegionSystemCache = 3,         // ordinal: 0x3
  AssignedRegionSystemPtes = 4,          // ordinal: 0x4
  AssignedRegionKasan = 5,               // ordinal: 0x5
  AssignedRegionUltraZero = 6,           // ordinal: 0x6
  AssignedRegionCfg = 7,                 // ordinal: 0x7
  AssignedRegionHyperSpace = 8,          // ordinal: 0x8
  AssignedRegionKernelStacks = 9,        // ordinal: 0x9
  AssignedRegionPageTables = 10,         // ordinal: 0xa
  AssignedRegionSession = 11,            // ordinal: 0xb
  AssignedRegionSecureNonPagedPool = 12, // ordinal: 0xc
  AssignedRegionKernelShadowStacks = 13, // ordinal: 0xd
  AssignedRegionSystemImages = 14,       // ordinal: 0xe
  AssignedRegionMaximum = 15,            // ordinal: 0xf
} _MI_ASSIGNED_REGION_TYPES;

typedef enum _MI_SUBVAD_LISTS {
  MiSubVadPebTebAny = 0, // ordinal: 0x0
  MiSubVadMaximum = 1,   // ordinal: 0x1
} _MI_SUBVAD_LISTS;

typedef enum _KWAIT_STATE {
  WaitInProgress = 0,        // ordinal: 0x0
  WaitCommitted = 1,         // ordinal: 0x1
  WaitAborted = 2,           // ordinal: 0x2
  WaitSuspendInProgress = 3, // ordinal: 0x3
  WaitSuspended = 4,         // ordinal: 0x4
  WaitResumeInProgress = 5,  // ordinal: 0x5
  WaitResumeAborted = 6,     // ordinal: 0x6
  WaitFirstSuspendState = 3, // ordinal: 0x7
  WaitLastSuspendState = 6,  // ordinal: 0x8
  MaximumWaitState = 7,      // ordinal: 0x9
} _KWAIT_STATE;

typedef enum _KI_CALLBACK {
  KiCallbackNmi = 0,   // ordinal: 0x0
  KiCallbackBound = 1, // ordinal: 0x1
  KiCallbackSx = 2,    // ordinal: 0x2
  KiCallbackCount = 3, // ordinal: 0x3
  KiFirstCallback = 0, // ordinal: 0x4
} _KI_CALLBACK;

typedef enum _POP_DEEP_SLEEP_DISENGAGE_REASON {
  PopDeepSleepDisengageReasonInactive = 0,                // ordinal: 0x0
  PopDeepSleepDisengageReasonNonAoAc = 1,                 // ordinal: 0x1
  PopDeepSleepDisengageReasonPendingIrps = 2,             // ordinal: 0x2
  PopDeepSleepDisengageReasonPowerSettings = 3,           // ordinal: 0x3
  PopDeepSleepDisengageReasonDozeS4WorkerQueued = 4,      // ordinal: 0x4
  PopDeepSleepDisengageReasonSystemPowerTransition = 5,   // ordinal: 0x5
  PopDeepSleepDisengageReasonDeviceBlockingDrips = 6,     // ordinal: 0x6
  PopDeepSleepDisengageReasonAcpi = 7,                    // ordinal: 0x7
  PopDeepSleepDisengageReasonDirectedDripsTransition = 8, // ordinal: 0x8
  PopDeepSleepDisengageReasonPepPreVeto = 9,              // ordinal: 0x9
  PopDeepSleepDisengageReasonThermal = 10,                // ordinal: 0xa
  PopDeepSleepDisengageReasonMax = 11,                    // ordinal: 0xb
} _POP_DEEP_SLEEP_DISENGAGE_REASON;

typedef enum _ETW_GUID_TYPE {
  EtwTraceGuidType = 0,        // ordinal: 0x0
  EtwNotificationGuidType = 1, // ordinal: 0x1
  EtwGroupGuidType = 2,        // ordinal: 0x2
  EtwGuidTypeMax = 3,          // ordinal: 0x3
} _ETW_GUID_TYPE;

typedef enum _MI_KSTACK_TYPE {
  MiRegularKstack = 0,     // ordinal: 0x0
  MiShortLivedKstack = 1,  // ordinal: 0x1
  MiXStateStateKstack = 2, // ordinal: 0x2
  MiMaximumKstack = 3,     // ordinal: 0x3
} _MI_KSTACK_TYPE;

typedef enum _WOW64_SHARED_INFORMATION {
  SharedNtdll32LdrInitializeThunk = 0,                  // ordinal: 0x0
  SharedNtdll32KiUserExceptionDispatcher = 1,           // ordinal: 0x1
  SharedNtdll32KiUserApcDispatcher = 2,                 // ordinal: 0x2
  SharedNtdll32KiUserCallbackDispatcher = 3,            // ordinal: 0x3
  SharedNtdll32RtlUserThreadStart = 4,                  // ordinal: 0x4
  SharedNtdll32pQueryProcessDebugInformationRemote = 5, // ordinal: 0x5
  SharedNtdll32BaseAddress = 6,                         // ordinal: 0x6
  SharedNtdll32LdrSystemDllInitBlock = 7,               // ordinal: 0x7
  SharedNtdll32RtlpFreezeTimeBias = 8,                  // ordinal: 0x8
  Wow64SharedPageEntriesCount = 9,                      // ordinal: 0x9
} _WOW64_SHARED_INFORMATION;

typedef enum _PO_HIBER_FORCE_DISABLE_REASON {
  PoHiberForceDisableReasonPolicy = 0,      // ordinal: 0x0
  PoHiberForceDisableReasonGuardedHost = 1, // ordinal: 0x1
  PoHiberForceDisableReasonMax = 2,         // ordinal: 0x2
} _PO_HIBER_FORCE_DISABLE_REASON;

typedef enum _SYSTEM_PROCESS_CLASSIFICATION {
  SystemProcessClassificationNormal = 0,         // ordinal: 0x0
  SystemProcessClassificationSystem = 1,         // ordinal: 0x1
  SystemProcessClassificationSecureSystem = 2,   // ordinal: 0x2
  SystemProcessClassificationMemCompression = 3, // ordinal: 0x3
  SystemProcessClassificationRegistry = 4,       // ordinal: 0x4
  SystemProcessClassificationMaximum = 5,        // ordinal: 0x5
} _SYSTEM_PROCESS_CLASSIFICATION;

typedef enum _KTHREAD_CORE_ISOLATION_REASON {
  KThreadCoreIsolationReasonSimulation = 0,       // ordinal: 0x0
  KThreadCoreIsolationReasonMitigationPolicy = 1, // ordinal: 0x1
  KThreadCoreIsolationReasonMax = 2,              // ordinal: 0x2
} _KTHREAD_CORE_ISOLATION_REASON;

typedef enum _KTHREAD_STATE {
  Initialized = 0,             // ordinal: 0x0
  Ready = 1,                   // ordinal: 0x1
  Running = 2,                 // ordinal: 0x2
  Standby = 3,                 // ordinal: 0x3
  Terminated = 4,              // ordinal: 0x4
  Waiting = 5,                 // ordinal: 0x5
  Transition = 6,              // ordinal: 0x6
  DeferredReady = 7,           // ordinal: 0x7
  GateWaitObsolete = 8,        // ordinal: 0x8
  WaitingForProcessInSwap = 9, // ordinal: 0x9
} _KTHREAD_STATE;

typedef enum _TlgBlob_t {
  _TlgBlobNone = 0,      // ordinal: 0x0
  _TlgBlobEnd = 1,       // ordinal: 0x1
  _TlgBlobProvider = 2,  // ordinal: 0x2
  _TlgBlobEvent3 = 3,    // ordinal: 0x3
  _TlgBlobProvider3 = 4, // ordinal: 0x4
  _TlgBlobEvent2 = 5,    // ordinal: 0x5
  _TlgBlobEvent4 = 6,    // ordinal: 0x6
  _TlgBlobMax = 7,       // ordinal: 0x7
} _TlgBlob_t;

typedef enum _MI_SHARED_USER_PAGE_TYPES {
  MiSharedUserPageKernel = 0,     // ordinal: 0x0
  MiSharedUserPageHypervisor = 1, // ordinal: 0x1
  MiSharedUserPageMaximum = 2,    // ordinal: 0x2
} _MI_SHARED_USER_PAGE_TYPES;

typedef enum _KPROCESS_PPM_POLICY {
  ProcessPpmDefault = 0,         // ordinal: 0x0
  ProcessPpmThrottle = 1,        // ordinal: 0x1
  ProcessPpmSemiThrottle = 2,    // ordinal: 0x2
  ProcessPpmNoThrottle = 3,      // ordinal: 0x3
  ProcessPpmWindowMinimized = 4, // ordinal: 0x4
  ProcessPpmWindowOccluded = 5,  // ordinal: 0x5
  ProcessPpmWindowVisible = 6,   // ordinal: 0x6
  ProcessPpmWindowInFocus = 7,   // ordinal: 0x7
  ProcessPpmMaximumThrottle = 8, // ordinal: 0x8
  MaxProcessPpmPolicy = 9,       // ordinal: 0x9
} _KPROCESS_PPM_POLICY;

typedef enum _KTHREAD_PPM_POLICY {
  ThreadPpmDefault = 0,         // ordinal: 0x0
  ThreadPpmThrottle = 1,        // ordinal: 0x1
  ThreadPpmSemiThrottle = 2,    // ordinal: 0x2
  ThreadPpmNoThrottle = 3,      // ordinal: 0x3
  ThreadPpmMaximumThrottle = 4, // ordinal: 0x4
  MaxThreadPpmPolicy = 5,       // ordinal: 0x5
} _KTHREAD_PPM_POLICY;

typedef enum PS_CREATE_STATE {
  PsCreateInitialState = 0,        // ordinal: 0x0
  PsCreateFailOnFileOpen = 1,      // ordinal: 0x1
  PsCreateFailOnSectionCreate = 2, // ordinal: 0x2
  PsCreateFailExeFormat = 3,       // ordinal: 0x3
  PsCreateFailMachineMismatch = 4, // ordinal: 0x4
  PsCreateFailExeName = 5,         // ordinal: 0x5
  PsCreateSuccess = 6,             // ordinal: 0x6
  PsCreateMaximumStates = 7,       // ordinal: 0x7
} PS_CREATE_STATE;

typedef enum _MI_DYNAMICBASE_BITMAP {
  DynamicBaseBitMapNative = 0,     // ordinal: 0x0
  DynamicBaseBitMap64Low = 1,      // ordinal: 0x1
  DynamicBaseBitMap64LowWow = 2,   // ordinal: 0x2
  DynamicBaseBitMap32WowFirst = 3, // ordinal: 0x3
  DynamicBaseBitMap32WowLast = 3,  // ordinal: 0x4
  DynamicBaseBitMapInvalid = 4,    // ordinal: 0x5
  DynamicBaseBitMapMax = 4,        // ordinal: 0x6
} _MI_DYNAMICBASE_BITMAP;

typedef enum _POP_SYSTEM_IDLE_EVENT_TYPE {
  PopSystemIdleEventTypeMonitorOffUserInput = 0,          // ordinal: 0x0
  PopSystemIdleEventTypeMonitorOnUserInput = 1,           // ordinal: 0x1
  PopSystemIdleEventTypeUserPresence = 2,                 // ordinal: 0x2
  PopSystemIdleEventTypeResumeFromSxSystemPowerState = 3, // ordinal: 0x3
  PopSystemIdleEventTypeMax = 4,                          // ordinal: 0x4
  PopSystemIdleEventTypeInvalid = 4,                      // ordinal: 0x5
} _POP_SYSTEM_IDLE_EVENT_TYPE;

typedef enum _POP_FX_WORK_POOL_QUEUE {
  PopFxWorkPoolQueueEmergency = 0, // ordinal: 0x0
  PopFxWorkPoolQueuePlugin = 1,    // ordinal: 0x1
  PopFxWorkPoolQueueMax = 2,       // ordinal: 0x2
} _POP_FX_WORK_POOL_QUEUE;

typedef enum _JOBOBJECT_PAGE_PRIORITY_LIMIT_FLAGS {
  JOBOBJECT_PAGE_PRIORITY_LIMIT_ENABLE = 1,      // ordinal: 0x0
  JOBOBJECT_PAGE_PRIORITY_LIMIT_VALID_FLAGS = 1, // ordinal: 0x1
} _JOBOBJECT_PAGE_PRIORITY_LIMIT_FLAGS;

typedef enum _WORKING_SET_TYPE {
  WorkingSetTypeUser = 0,           // ordinal: 0x0
  WorkingSetTypeSession = 1,        // ordinal: 0x1
  WorkingSetTypeSystemTypes = 2,    // ordinal: 0x2
  WorkingSetTypeSystemCache = 2,    // ordinal: 0x3
  WorkingSetTypePagedPool = 3,      // ordinal: 0x4
  WorkingSetTypeSystemViews = 4,    // ordinal: 0x5
  WorkingSetTypePagableMaximum = 4, // ordinal: 0x6
  WorkingSetTypeSystemPtes = 5,     // ordinal: 0x7
  WorkingSetTypeKernelStacks = 6,   // ordinal: 0x8
  WorkingSetTypeNonPagedPool = 7,   // ordinal: 0x9
  WorkingSetTypeMaximum = 8,        // ordinal: 0xa
} _WORKING_SET_TYPE;

typedef enum _PS_PROTECTED_SIGNER {
  PsProtectedSignerNone = 0,         // ordinal: 0x0
  PsProtectedSignerAuthenticode = 1, // ordinal: 0x1
  PsProtectedSignerCodeGen = 2,      // ordinal: 0x2
  PsProtectedSignerAntimalware = 3,  // ordinal: 0x3
  PsProtectedSignerLsa = 4,          // ordinal: 0x4
  PsProtectedSignerWindows = 5,      // ordinal: 0x5
  PsProtectedSignerWinTcb = 6,       // ordinal: 0x6
  PsProtectedSignerWinSystem = 7,    // ordinal: 0x7
  PsProtectedSignerApp = 8,          // ordinal: 0x8
  PsProtectedSignerMax = 9,          // ordinal: 0x9
} _PS_PROTECTED_SIGNER;

typedef enum _MI_MEMORY_HIGHLOW {
  MiMemoryHigh = 0,    // ordinal: 0x0
  MiMemoryLow = 1,     // ordinal: 0x1
  MiMemoryHighLow = 2, // ordinal: 0x2
} _MI_MEMORY_HIGHLOW;

typedef enum FEATURE_ENABLED_STATE {
  FEATURE_ENABLED_STATE_DEFAULT = 0,                // ordinal: 0x0
  FEATURE_ENABLED_STATE_DISABLED = 1,               // ordinal: 0x1
  FEATURE_ENABLED_STATE_ENABLED = 2,                // ordinal: 0x2
  FEATURE_ENABLED_STATE_HAS_NOTIFICATION = 128,     // ordinal: 0x3
  FEATURE_ENABLED_STATE_IS_WEXP_CONFIGURATION = 64, // ordinal: 0x4
} FEATURE_ENABLED_STATE;

typedef enum _MI_STORE_VIRTUAL_PAGEFILE_VALUE {
  MiStoreVirtualPagefileValueInvalid = 0, // ordinal: 0x0
  MiStoreVirtualPagefileValueStart = 2,   // ordinal: 0x1
  MiStoreVirtualPagefileSwap = 2,         // ordinal: 0x2
  MiStoreVirtualPagefileCompress = 3,     // ordinal: 0x3
  MiStoreVirtualPagefileNoCompress = 4,   // ordinal: 0x4
  MiStoreVirtualPagefileMax = 5,          // ordinal: 0x5
} _MI_STORE_VIRTUAL_PAGEFILE_VALUE;

typedef enum _REFS_STREAM_SNAPSHOT_OPERATION {
  REFS_STREAM_SNAPSHOT_OPERATION_INVALID = 0,            // ordinal: 0x0
  REFS_STREAM_SNAPSHOT_OPERATION_CREATE = 1,             // ordinal: 0x1
  REFS_STREAM_SNAPSHOT_OPERATION_LIST = 2,               // ordinal: 0x2
  REFS_STREAM_SNAPSHOT_OPERATION_QUERY_DELTAS = 3,       // ordinal: 0x3
  REFS_STREAM_SNAPSHOT_OPERATION_REVERT = 4,             // ordinal: 0x4
  REFS_STREAM_SNAPSHOT_OPERATION_SET_SHADOW_BTREE = 5,   // ordinal: 0x5
  REFS_STREAM_SNAPSHOT_OPERATION_CLEAR_SHADOW_BTREE = 6, // ordinal: 0x6
  REFS_STREAM_SNAPSHOT_OPERATION_MAX = 6,                // ordinal: 0x7
} _REFS_STREAM_SNAPSHOT_OPERATION;

typedef enum _PERFINFO_KERNELMEMORY_USAGE_TYPE {
  PerfInfoMemUsagePfnMetadata = 0, // ordinal: 0x0
  PerfInfoMemUsageMax = 1,         // ordinal: 0x1
} _PERFINFO_KERNELMEMORY_USAGE_TYPE;

typedef enum _RTL_FEATURE_CONFIGURATION_PRIORITY {
  FeatureConfigurationPriorityImageDefault = 0,   // ordinal: 0x0
  FeatureConfigurationPriorityEnrollment = 2,     // ordinal: 0x1
  FeatureConfigurationPriorityService = 4,        // ordinal: 0x2
  FeatureConfigurationPriorityUser = 8,           // ordinal: 0x3
  FeatureConfigurationPriorityUserPolicy = 10,    // ordinal: 0x4
  FeatureConfigurationPriorityTest = 12,          // ordinal: 0x5
  FeatureConfigurationPriorityImageOverride = 15, // ordinal: 0x6
  FeatureConfigurationPriorityMax = 15,           // ordinal: 0x7
} _RTL_FEATURE_CONFIGURATION_PRIORITY;

typedef enum _HEAP_SEGMGR_LARGE_PAGE_POLICY {
  HeapSegMgrNoLargePages = 0,       // ordinal: 0x0
  HeapSegMgrEnableLargePages = 1,   // ordinal: 0x1
  HeapSegMgrNormalPolicy = 1,       // ordinal: 0x2
  HeapSegMgrForceSmall = 2,         // ordinal: 0x3
  HeapSegMgrForceLarge = 3,         // ordinal: 0x4
  HeapSegMgrForceRandom = 4,        // ordinal: 0x5
  HeapSegMgrLargePagePolicyMax = 5, // ordinal: 0x6
} _HEAP_SEGMGR_LARGE_PAGE_POLICY;

typedef enum _PS_RESOURCE_TYPE {
  PsResourceNonPagedPool = 0, // ordinal: 0x0
  PsResourcePagedPool = 1,    // ordinal: 0x1
  PsResourcePageFile = 2,     // ordinal: 0x2
  PsResourceWorkingSet = 3,   // ordinal: 0x3
  PsResourceMax = 4,          // ordinal: 0x4
} _PS_RESOURCE_TYPE;

typedef enum _PROCESS_VA_TYPE {
  ProcessVAImage = 0,   // ordinal: 0x0
  ProcessVASection = 1, // ordinal: 0x1
  ProcessVAPrivate = 2, // ordinal: 0x2
  ProcessVAMax = 3,     // ordinal: 0x3
} _PROCESS_VA_TYPE;

typedef enum _MI_CFG_BITMAP_TYPE {
  CfgBitMapNative = 0, // ordinal: 0x0
  CfgBitMapWow64 = 1,  // ordinal: 0x1
  CfgBitMapMax = 2,    // ordinal: 0x2
} _MI_CFG_BITMAP_TYPE;

typedef enum _PS_PROTECTED_TYPE {
  PsProtectedTypeNone = 0,           // ordinal: 0x0
  PsProtectedTypeProtectedLight = 1, // ordinal: 0x1
  PsProtectedTypeProtected = 2,      // ordinal: 0x2
  PsProtectedTypeMax = 3,            // ordinal: 0x3
} _PS_PROTECTED_TYPE;

typedef enum _SKSERVICE {
  SECURESERVICE_NONE = 0,                                     // ordinal: 0x0
  SECURESERVICE_PHASE4_INIT = 1,                              // ordinal: 0x1
  SECURESERVICE_START_PROCESSOR = 2,                          // ordinal: 0x2
  SECURESERVICE_FINISH_START_PROCESSOR = 3,                   // ordinal: 0x3
  SECURESERVICE_REGISTER_SYSTEM_DLLS = 4,                     // ordinal: 0x4
  SECURESERVICE_REGISTER_SYSTEM_PROCESS = 5,                  // ordinal: 0x5
  SECURESERVICE_CREATE_PROCESS = 6,                           // ordinal: 0x6
  SECURESERVICE_INITIALIZE_PROCESS = 7,                       // ordinal: 0x7
  SECURESERVICE_CREATE_THREAD = 8,                            // ordinal: 0x8
  SECURESERVICE_REQUEST_THREAD_EXIT = 9,                      // ordinal: 0x9
  SECURESERVICE_TERMINATE_THREAD = 10,                        // ordinal: 0xa
  SECURESERVICE_RUNDOWN_PROCESS = 11,                         // ordinal: 0xb
  SECURESERVICE_DEBUG_PROCESS = 12,                           // ordinal: 0xc
  SECURESERVICE_GET_TEB_ADDRESS = 13,                         // ordinal: 0xd
  SECURESERVICE_GET_CONTEXT = 14,                             // ordinal: 0xe
  SECURESERVICE_SET_CONTEXT = 15,                             // ordinal: 0xf
  SECURESERVICE_SEND_ATTACH_NOTIFICATIONS = 16,               // ordinal: 0x10
  SECURESERVICE_GET_ETW_DEBUG_ID = 17,                        // ordinal: 0x11
  SECURESERVICE_GET_ON_DEMAND_DEBUG_CHALLENGE = 18,           // ordinal: 0x12
  SECURESERVICE_ENABLE_ON_DEMAND_DEBUG_WITH_RESPONSE = 19,    // ordinal: 0x13
  SECURESERVICE_RETRIEVE_MAILBOX = 20,                        // ordinal: 0x14
  SECURESERVICE_IS_TRUSTLET_RUNNING = 21,                     // ordinal: 0x15
  SECURESERVICE_CREATE_SECURE_ALLOCATION = 22,                // ordinal: 0x16
  SECURESERVICE_FILL_SECURE_ALLOCATION = 23,                  // ordinal: 0x17
  SECURESERVICE_MAKE_CODE_CATALOG = 24,                       // ordinal: 0x18
  SECURESERVICE_CREATE_SECURE_IMAGE = 25,                     // ordinal: 0x19
  SECURESERVICE_FINALIZE_SECURE_IMAGE_HASH = 26,              // ordinal: 0x1a
  SECURESERVICE_FINISH_SECURE_IMAGE_VALIDATION = 27,          // ordinal: 0x1b
  SECURESERVICE_PREPARE_IMAGE_RELOCATIONS = 28,               // ordinal: 0x1c
  SECURESERVICE_RELOCATE_IMAGE = 29,                          // ordinal: 0x1d
  SECURESERVICE_CLOSE_SECURE_HANDLE = 30,                     // ordinal: 0x1e
  SECURESERVICE_VALIDATE_DYNAMIC_CODE = 31,                   // ordinal: 0x1f
  SECURESERVICE_TRANSFER_IMAGE_VERSION_RESOURCE = 32,         // ordinal: 0x20
  SECURESERVICE_SET_CODE_INTEGRITY_POLICY = 33,               // ordinal: 0x21
  SECURESERVICE_EXCHANGE_ENTROPY = 34,                        // ordinal: 0x22
  SECURESERVICE_IS_ENCRYPTION_KEY_AVAILABLE = 35,             // ordinal: 0x23
  SECURESERVICE_ALLOCATE_HIBERNATE_RESOURCES = 36,            // ordinal: 0x24
  SECURESERVICE_FREE_HIBERNATE_RESOURCES = 37,                // ordinal: 0x25
  SECURESERVICE_CONFIGURE_DYNAMIC_MEMORY = 38,                // ordinal: 0x26
  SECURESERVICE_DEBUG_PROTECT_MEMORY = 39,                    // ordinal: 0x27
  SECURESERVICE_DEBUG_READ_WRITE_MEMORY = 40,                 // ordinal: 0x28
  SECURESERVICE_QUERY_VIRTUAL_MEMORY = 41,                    // ordinal: 0x29
  SECURESERVICE_CAPTURE_IMAGE_IAT = 42,                       // ordinal: 0x2a
  SECURESERVICE_FREE_IMAGE_IAT = 43,                          // ordinal: 0x2b
  SECURESERVICE_APPLY_FIXUPS = 44,                            // ordinal: 0x2c
  SECURESERVICE_MARK_IMAGE_PROTECTED = 45,                    // ordinal: 0x2d
  SECURESERVICE_CREATE_ENCLAVE = 46,                          // ordinal: 0x2e
  SECURESERVICE_LOAD_ENCLAVE_DATA = 47,                       // ordinal: 0x2f
  SECURESERVICE_LOAD_ENCLAVE_MODULE = 48,                     // ordinal: 0x30
  SECURESERVICE_INITIALIZE_ENCLAVE = 49,                      // ordinal: 0x31
  SECURESERVICE_TERMINATE_ENCLAVE = 50,                       // ordinal: 0x32
  SECURESERVICE_DELETE_ENCLAVE = 51,                          // ordinal: 0x33
  SECURESERVICE_CONNECT_SW_INTERRUPT = 52,                    // ordinal: 0x34
  SECURESERVICE_RELAX_HYPERGUARD_QUOTA = 53,                  // ordinal: 0x35
  SECURESERVICE_REGISTER_BOOT_DRIVERS = 54,                   // ordinal: 0x36
  SECURESERVICE_LIVEDUMP_QUERY_SECONDARYDATA_SIZE = 55,       // ordinal: 0x37
  SECURESERVICE_LIVEDUMP_START = 56,                          // ordinal: 0x38
  SECURESERVICE_LIVEDUMP_ADD_BUFFER = 57,                     // ordinal: 0x39
  SECURESERVICE_LIVEDUMP_SETUP_BUFFER = 58,                   // ordinal: 0x3a
  SECURESERVICE_LIVEDUMP_FINALIZE = 59,                       // ordinal: 0x3b
  SECURESERVICE_LIVEDUMP_ABORT = 60,                          // ordinal: 0x3c
  SECURESERVICE_LIVEDUMP_CAPTURE_PROCESS = 61,                // ordinal: 0x3d
  SECURESERVICE_NOTIFY_POWER_STATE = 62,                      // ordinal: 0x3e
  SECURESERVICE_QUERY_PROFILE_INFORMATION = 63,               // ordinal: 0x3f
  SECURESERVICE_UPDATE_FREEZE_BIAS = 64,                      // ordinal: 0x40
  SECURESERVICE_CREATE_SECURE_SECTION = 65,                   // ordinal: 0x41
  SECURESERVICE_DELETE_SECURE_SECTION = 66,                   // ordinal: 0x42
  SECURESERVICE_QUERY_SECURE_DEVICE = 67,                     // ordinal: 0x43
  SECURESERVICE_UNPROTECT_SECURE_DEVICE = 68,                 // ordinal: 0x44
  SECURESERVICE_DETERMINE_HOT_PATCH_TYPE = 69,                // ordinal: 0x45
  SECURESERVICE_OBTAIN_PATCH_UNDO_TABLE_SIZE = 70,            // ordinal: 0x46
  SECURESERVICE_OBTAIN_PATCH_UNDO_TABLE = 71,                 // ordinal: 0x47
  SECURESERVICE_APPLY_HOT_PATCH = 72,                         // ordinal: 0x48
  SECURESERVICE_REVERT_HOT_PATCH = 73,                        // ordinal: 0x49
  SECURESERVICE_PREPARE_DRIVER_FOR_PATCH = 74,                // ordinal: 0x4a
  SECURESERVICE_PROVISION_DUMP_KEYS = 75,                     // ordinal: 0x4b
  SECURESERVICE_CAPTURE_PGO_DATA = 76,                        // ordinal: 0x4c
  SECURESERVICE_START_PROFILE = 77,                           // ordinal: 0x4d
  SECURESERVICE_STOP_PROFILE = 78,                            // ordinal: 0x4e
  SECURESERVICE_SECURE_POOL_CREATE = 79,                      // ordinal: 0x4f
  SECURESERVICE_SECURE_POOL_DESTROY = 80,                     // ordinal: 0x50
  SECURESERVICE_SECURE_POOL_ALLOCATE = 81,                    // ordinal: 0x51
  SECURESERVICE_SECURE_POOL_FREE = 82,                        // ordinal: 0x52
  SECURESERVICE_SECURE_POOL_UPDATE = 83,                      // ordinal: 0x53
  SECURESERVICE_SET_TRACEPOINT = 84,                          // ordinal: 0x54
  SECURESERVICE_TRANSFORM_DUMP_KEY = 85,                      // ordinal: 0x55
  SECURESERVICE_PUBLISH_SYSCALL_PROVIDER_SERVICE_TABLES = 86, // ordinal: 0x56
  SECURESERVICE_REVOKE_SYSCALL_PROVIDER_SERVICE_TABLES = 87,  // ordinal: 0x57
  SECURESERVICE_NO_TRACING_FIRST = 191,                       // ordinal: 0x58
  SECURESERVICE_GET_PEB_ADDRESS = 192,                        // ordinal: 0x59
  SECURESERVICE_VALIDATE_SECURE_IMAGE_PAGES = 193,            // ordinal: 0x5a
  SECURESERVICE_PRE_INIT_FIRST = 207,                         // ordinal: 0x5b
  SECURESERVICE_PHASE3_INIT = 208,                            // ordinal: 0x5c
  SECURESERVICE_PERIODIC = 209,                               // ordinal: 0x5d
  SECURESERVICE_WORK_QUEUE = 210,                             // ordinal: 0x5e
  SECURESERVICE_RESERVE_PROTECTED_PAGES = 211,                // ordinal: 0x5f
  SECURESERVICE_APPLY_DYNAMIC_RELOCATIONS = 212,              // ordinal: 0x60
  SECURESERVICE_ETW_ENABLE_CALLBACK = 213,                    // ordinal: 0x61
  SECURESERVICE_INITIALIZE_SECURE_POOL = 214,                 // ordinal: 0x62
  SECURESERVICE_INITIALIZE_KERNEL_CFG = 215,                  // ordinal: 0x63
  SECURESERVICE_LOAD_DRIVER = 216,                            // ordinal: 0x64
  SECURESERVICE_UNLOAD_DRIVER = 217,                          // ordinal: 0x65
  SECURESERVICE_ENABLE_CFG_TARGET = 218,                      // ordinal: 0x66
  SECURESERVICE_COMPLETE_SLAB_CONFIGURATION = 219,            // ordinal: 0x67
  SECURESERVICE_REAPPLY_BOOT_DRIVER_PATCH = 220,              // ordinal: 0x68
  SECURESERVICE_INITIALIZE_RETPOLINE = 221,                   // ordinal: 0x69
  SECURESERVICE_PERFORM_RETPOLINE_RELOCATIONS = 222,          // ordinal: 0x6a
  SECURESERVICE_UPDATE_IMPORT_RELOCATIONS = 223,              // ordinal: 0x6b
  SECURESERVICE_REAPPLY_IMPORT_RELOCATIONS = 224,             // ordinal: 0x6c
  SECURESERVICE_INIT_FUNCTION_OVERRIDES = 225,                // ordinal: 0x6d
  SECURESERVICE_PERFORM_DRIVER_FUNCTION_OVERRIDES = 226,      // ordinal: 0x6e
  SECURESERVICE_ALLOCATE_SHADOW_STACK = 227,                  // ordinal: 0x6f
  SECURESERVICE_FREE_SHADOW_STACK = 228,                      // ordinal: 0x70
  SECURESERVICE_RESET_SHADOW_STACK = 229,                     // ordinal: 0x71
  SECURESERVICE_REGISTER_SYSCALL_PROVIDER_SERVICE_TABLE_MD =
      230,                                                // ordinal: 0x72
  SECURESERVICE_INITIALIZE_SYSCALL_PROVIDERS = 231,       // ordinal: 0x73
  SECURESERVICE_DISPATCH_LEVEL_FIRST = 239,               // ordinal: 0x74
  SECURESERVICE_FLUSH_ADDRESS_SPACE = 240,                // ordinal: 0x75
  SECURESERVICE_FAST_FLUSH_RANGE_LIST = 241,              // ordinal: 0x76
  SECURESERVICE_SLOW_FLUSH_RANGE_LIST = 242,              // ordinal: 0x77
  SECURESERVICE_REMOVE_PROTECTED_PAGE = 243,              // ordinal: 0x78
  SECURESERVICE_COPY_PROTECTED_PAGE = 244,                // ordinal: 0x79
  SECURESERVICE_REGISTER_PROTECTED_PAGE = 245,            // ordinal: 0x7a
  SECURESERVICE_DISAMBIGUATE_PROTECTED_PAGE = 246,        // ordinal: 0x7b
  SECURESERVICE_MAKE_PROTECTED_PAGE_WRITABLE = 247,       // ordinal: 0x7c
  SECURESERVICE_MAKE_PROTECTED_PAGE_EXECUTABLE = 248,     // ordinal: 0x7d
  SECURESERVICE_QUERY_STRONG_CODE_FEATURES = 249,         // ordinal: 0x7e
  SECURESERVICE_INVOKE_EFI_RUNTIME_SERVICE = 250,         // ordinal: 0x7f
  SECURESERVICE_LIVEDUMP_COLLECT_LIVE_DUMP = 251,         // ordinal: 0x80
  SECURESERVICE_REGISTER_LOG_PAGES = 252,                 // ordinal: 0x81
  SECURESERVICE_RECLAIM_PARTITION_PAGES = 253,            // ordinal: 0x82
  SECURESERVICE_BIND_NT_KERNEL_IMPORTS = 254,             // ordinal: 0x83
  SECURESERVICE_SET_PLACEHOLDER_PAGES = 255,              // ordinal: 0x84
  SECURESERVICE_QUERY_SPECULATION_CONTROL_FEATURES = 256, // ordinal: 0x85
  SECURESERVICE_PROTECT_KERNEL_DATA_PAGE = 257,           // ordinal: 0x86
  SECURESERVICE_VERIFY_PAGE = 258,                        // ordinal: 0x87
  SECURESERVICE_PREPARE_FOR_HIBERNATION = 259,            // ordinal: 0x88
  SECURESERVICE_PREPARE_FOR_CRASHDUMP = 260,              // ordinal: 0x89
  SECURESERVICE_REPORT_BUGCHECK_PROGRESS = 261,           // ordinal: 0x8a
  SECURESERVICE_SHUTDOWN = 262,                           // ordinal: 0x8b
  SECURESERVICE_QUERY_SECURE_PCI_INFO = 263,              // ordinal: 0x8c
  SECURESERVICE_ACCESS_PCI_DEVICE = 264,                  // ordinal: 0x8d
  SECURESERVICE_QUERY_SECURE_PCI_BOOT_CONFIG = 265,       // ordinal: 0x8e
  SECURESERVICE_REINITIALIZE_DEBUGGER_TRANSPORT = 266,    // ordinal: 0x8f
  SECURESERVICE_KSR_CALL = 267,                           // ordinal: 0x90
  SECURESERVICE_SVC_CALL = 268,                           // ordinal: 0x91
  SECURESERVICE_SHADOW_STACK_ASSIST = 269,                // ordinal: 0x92
  SECURESERVICE_BUGCHECK = 1792,                          // ordinal: 0x93
  SECURESERVICE_LIMITED_MODE_SERVICE_START = 2048,        // ordinal: 0x94
} _SKSERVICE;

typedef enum _KTIMER2_COLLECTION_INDEX {
  KTimer2CollectionNoWake = 0,       // ordinal: 0x0
  KTimer2CollectionHr = 1,           // ordinal: 0x1
  KTimer2CollectionPseudoHr = 2,     // ordinal: 0x2
  KTimer2CollectionFinite = 3,       // ordinal: 0x3
  KTimer2CollectionIr = 4,           // ordinal: 0x4
  KTimer2CollectionNotInserted = 16, // ordinal: 0x5
  KTimer2CollectionInvalid = 21,     // ordinal: 0x6
  KTimer2CollectionOptional = 32,    // ordinal: 0x7
  KTimer2CollectionMin = 0,          // ordinal: 0x8
  KTimer2CollectionMax = 5,          // ordinal: 0x9
  KTimer2CollectionNode1 = 2,        // ordinal: 0xa
} _KTIMER2_COLLECTION_INDEX;

typedef enum _MI_WORKING_SET_TYPE {
  MiWorkingSetTypeSystemCache = 0,      // ordinal: 0x0
  MiWorkingSetTypeSystemViews = 1,      // ordinal: 0x1
  MiWorkingSetTypePartitionMaximum = 1, // ordinal: 0x2
  MiWorkingSetTypePagedPool = 2,        // ordinal: 0x3
  MiWorkingSetTypePagableMaximum = 2,   // ordinal: 0x4
  MiWorkingSetTypeSystemPtes = 3,       // ordinal: 0x5
  MiWorkingSetTypeKernelStacks = 4,     // ordinal: 0x6
  MiWorkingSetTypeNonPagedPool = 5,     // ordinal: 0x7
  MiWorkingSetTypeMaximum = 6,          // ordinal: 0x8
} _MI_WORKING_SET_TYPE;

typedef enum _KSOFTWARE_INTERRUPT_TARGET {
  KSoftwareInterruptTargetNone = 0,               // ordinal: 0x0
  KSoftwareInterruptTargetSingleProcessor = 1,    // ordinal: 0x1
  KSoftwareInterruptTargetMultipleProcessors = 2, // ordinal: 0x2
  KSoftwareInterruptTargetMax = 3,                // ordinal: 0x3
} _KSOFTWARE_INTERRUPT_TARGET;

typedef enum _FAN_NOISE_ZONES_ {
  FanNoiseZoneLow = 0,        // ordinal: 0x0
  FanNoiseZoneMedium = 1,     // ordinal: 0x1
  FanNoiseZoneMediumHigh = 2, // ordinal: 0x2
  FanNoiseZoneHigh = 3,       // ordinal: 0x3
  FanNoiseZoneLast = 3,       // ordinal: 0x4
  FanNoiseZoneMax = 4,        // ordinal: 0x5
} _FAN_NOISE_ZONES_;

typedef enum _POWER_INFORMATION_LEVEL_INTERNAL_TTMTCAPI {
  PowerInformationInternalTtmFirst = 4096,           // ordinal: 0x0
  PowerInternalTtmOpenTerminal = 4096,               // ordinal: 0x1
  PowerInternalTtmCreateTerminal = 4097,             // ordinal: 0x2
  PowerInternalTtmEvacuateDevices = 4098,            // ordinal: 0x3
  PowerInternalTtmCreateTerminalEventQueue = 4099,   // ordinal: 0x4
  PowerInternalTtmGetTerminalEvent = 4100,           // ordinal: 0x5
  PowerInternalTtmSetDefaultDeviceAssignment = 4101, // ordinal: 0x6
  PowerInternalTtmAssignDevice = 4102,               // ordinal: 0x7
  PowerInternalTtmSetDisplayState = 4103,            // ordinal: 0x8
  PowerInternalTtmSetDisplayTimeouts = 4104,         // ordinal: 0x9
  PowerInternalTtmSetDisplayPowerRequest = 4105,     // ordinal: 0xa
  PowerInternalTtmSetInputWakeCapability = 4106,     // ordinal: 0xb
  PowerInformationInternalTtmLast = 4106,            // ordinal: 0xc
} _POWER_INFORMATION_LEVEL_INTERNAL_TTMTCAPI;

typedef enum _MI_ENCLAVE_TYPE {
  MiEnclaveNone = 0,     // ordinal: 0x0
  MiEnclaveHardware = 1, // ordinal: 0x1
  MiEnclaveVsm = 2,      // ordinal: 0x2
  MiEnclaveMax = 3,      // ordinal: 0x3
} _MI_ENCLAVE_TYPE;

typedef enum _KTHREAD_TAG {
  KThreadTagNone = 0,           // ordinal: 0x0
  KThreadTagMediaBuffering = 1, // ordinal: 0x1
  KThreadTagDeadline = 2,       // ordinal: 0x2
  KThreadTagMediaOther = 3,     // ordinal: 0x3
  KThreadTagMax = 4,            // ordinal: 0x4
} _KTHREAD_TAG;

typedef enum _REFS_SET_VOLUME_COMPRESSION_INFO_FLAGS {
  REFS_SET_VOLUME_COMPRESSION_INFO_FLAG_COMPRESS_SYNC = 1, // ordinal: 0x0
  REFS_SET_VOLUME_COMPRESSION_INFO_FLAG_MAX = 1,           // ordinal: 0x1
} _REFS_SET_VOLUME_COMPRESSION_INFO_FLAGS;

typedef enum _KHETERO_RUNNING_TYPE {
  KHeteroShortRunning = 0,   // ordinal: 0x0
  KHeteroLongRunning = 1,    // ordinal: 0x1
  KHeteroRunningTypeMax = 2, // ordinal: 0x2
} _KHETERO_RUNNING_TYPE;

typedef enum wil_FeatureStage {
  wil_FeatureStage_AlwaysDisabled = 0,    // ordinal: 0x0
  wil_FeatureStage_DisabledByDefault = 1, // ordinal: 0x1
  wil_FeatureStage_EnabledByDefault = 2,  // ordinal: 0x2
  wil_FeatureStage_AlwaysEnabled = 3,     // ordinal: 0x3
} wil_FeatureStage;

typedef enum _RTL_MEMORY_TYPE {
  MemoryTypePaged = 0,     // ordinal: 0x0
  MemoryTypeNonPaged = 1,  // ordinal: 0x1
  MemoryType64KPage = 2,   // ordinal: 0x2
  MemoryTypeLargePage = 3, // ordinal: 0x3
  MemoryTypeHugePage = 4,  // ordinal: 0x4
  MemoryTypeCustom = 5,    // ordinal: 0x5
  MemoryTypeMax = 6,       // ordinal: 0x6
} _RTL_MEMORY_TYPE;

typedef enum _PS_WAKE_REASON {
  PsWakeReasonUser = 0,              // ordinal: 0x0
  PsWakeReasonExecutionRequired = 1, // ordinal: 0x1
  PsWakeReasonKernel = 2,            // ordinal: 0x2
  PsWakeReasonInstrumentation = 3,   // ordinal: 0x3
  PsWakeReasonPreserveProcess = 4,   // ordinal: 0x4
  PsWakeReasonActivityReference = 5, // ordinal: 0x5
  PsWakeReasonWorkOnBehalf = 6,      // ordinal: 0x6
  PsMaxWakeReasons = 7,              // ordinal: 0x7
} _PS_WAKE_REASON;

typedef enum _MEMORY_PHYSICAL_CONTIGUITY_UNIT_STATE {
  MemoryNotContiguous = 0,               // ordinal: 0x0
  MemoryAlignedAndContiguous = 1,        // ordinal: 0x1
  MemoryNotResident = 2,                 // ordinal: 0x2
  MemoryNotEligibleToMakeContiguous = 3, // ordinal: 0x3
  MemoryContiguityStateMax = 4,          // ordinal: 0x4
} _MEMORY_PHYSICAL_CONTIGUITY_UNIT_STATE;

typedef enum _PS_STD_HANDLE_STATE {
  PsNeverDuplicate = 0,     // ordinal: 0x0
  PsRequestDuplicate = 1,   // ordinal: 0x1
  PsAlwaysDuplicate = 2,    // ordinal: 0x2
  PsMaxStdHandleStates = 3, // ordinal: 0x3
} _PS_STD_HANDLE_STATE;

typedef enum _POWER_INFORMATION_LEVEL_INTERNAL {
  PowerInternalAcpiInterfaceRegister = 0,                    // ordinal: 0x0
  PowerInternalS0LowPowerIdleInfo = 1,                       // ordinal: 0x1
  PowerInternalReapplyBrightnessSettings = 2,                // ordinal: 0x2
  PowerInternalUserAbsencePrediction = 3,                    // ordinal: 0x3
  PowerInternalUserAbsencePredictionCapability = 4,          // ordinal: 0x4
  PowerInternalPoProcessorLatencyHint = 5,                   // ordinal: 0x5
  PowerInternalStandbyNetworkRequest = 6,                    // ordinal: 0x6
  PowerInternalDirtyTransitionInformation = 7,               // ordinal: 0x7
  PowerInternalSetBackgroundTaskState = 8,                   // ordinal: 0x8
  PowerInternalReservedDoNotUseEnum9 = 9,                    // ordinal: 0x9
  PowerInternalReservedDoNotUseEnum10 = 10,                  // ordinal: 0xa
  PowerInternalReservedDoNotUseEnum11 = 11,                  // ordinal: 0xb
  PowerInternalReservedDoNotUseEnum12 = 12,                  // ordinal: 0xc
  PowerInternalReservedDoNotUseEnum13 = 13,                  // ordinal: 0xd
  PowerInternalReservedDoNotUseEnum14 = 14,                  // ordinal: 0xe
  PowerInternalReservedDoNotUseEnum15 = 15,                  // ordinal: 0xf
  PowerInternalReservedDoNotUseEnum16 = 16,                  // ordinal: 0x10
  PowerInternalReservedDoNotUseEnum17 = 17,                  // ordinal: 0x11
  PowerInternalBootSessionStandbyActivationInformation = 18, // ordinal: 0x12
  PowerInternalSessionPowerState = 19,                       // ordinal: 0x13
  PowerInternalSessionTerminalInput = 20,                    // ordinal: 0x14
  PowerInternalSetWatchdog = 21,                             // ordinal: 0x15
  PowerInternalPhysicalPowerButtonPressInfoAtBoot = 22,      // ordinal: 0x16
  PowerInternalExternalMonitorConnected = 23,                // ordinal: 0x17
  PowerInternalHighPrecisionBrightnessSettings = 24,         // ordinal: 0x18
  PowerInternalWinrtScreenToggle = 25,                       // ordinal: 0x19
  PowerInternalPpmQosDisable = 26,                           // ordinal: 0x1a
  PowerInternalTransitionCheckpoint = 27,                    // ordinal: 0x1b
  PowerInternalInputControllerState = 28,                    // ordinal: 0x1c
  PowerInternalFirmwareResetReason = 29,                     // ordinal: 0x1d
  PowerInternalPpmSchedulerQosSupport = 30,                  // ordinal: 0x1e
  PowerInternalBootStatGet = 31,                             // ordinal: 0x1f
  PowerInternalBootStatSet = 32,                             // ordinal: 0x20
  PowerInternalCallHasNotReturnedWatchdog = 33,              // ordinal: 0x21
  PowerInternalBootStatCheckIntegrity = 34,                  // ordinal: 0x22
  PowerInternalBootStatRestoreDefaults = 35,                 // ordinal: 0x23
  PowerInternalHostEsStateUpdate = 36,                       // ordinal: 0x24
  PowerInternalGetPowerActionState = 37,                     // ordinal: 0x25
  PowerInternalBootStatUnlock = 38,                          // ordinal: 0x26
  PowerInternalWakeOnVoiceState = 39,                        // ordinal: 0x27
  PowerInternalDeepSleepBlock = 40,                          // ordinal: 0x28
  PowerInternalIsPoFxDevice = 41,                            // ordinal: 0x29
  PowerInternalPowerTransitionExtensionAtBoot = 42,          // ordinal: 0x2a
  PowerInternalProcessorBrandedFrequency = 43,               // ordinal: 0x2b
  PowerInternalTimeBrokerExpirationReason = 44,              // ordinal: 0x2c
  PowerInternalNotifyUserShutdownStatus = 45,                // ordinal: 0x2d
  PowerInternalPowerRequestTerminalCoreWindow = 46,          // ordinal: 0x2e
  PowerInternalProcessorIdleVeto = 47,                       // ordinal: 0x2f
  PowerInternalPlatformIdleVeto = 48,                        // ordinal: 0x30
  PowerInternalIsLongPowerButtonBugcheckEnabled = 49,        // ordinal: 0x31
  PowerInternalAutoChkCausedReboot = 50,                     // ordinal: 0x32
  PowerInternalSetWakeAlarmOverride = 51,                    // ordinal: 0x33
  PowerInternalDirectedFxAddTestDevice = 53,                 // ordinal: 0x34
  PowerInternalDirectedFxRemoveTestDevice = 54,              // ordinal: 0x35
  PowerInternalDirectedFxSetMode = 56,                       // ordinal: 0x36
  PowerInternalRegisterPowerPlane = 57,                      // ordinal: 0x37
  PowerInternalSetDirectedDripsFlags = 58,                   // ordinal: 0x38
  PowerInternalClearDirectedDripsFlags = 59,                 // ordinal: 0x39
  PowerInternalRetrieveHiberFileResumeContext = 60,          // ordinal: 0x3a
  PowerInternalReadHiberFilePage = 61,                       // ordinal: 0x3b
  PowerInternalLastBootSucceeded = 62,                       // ordinal: 0x3c
  PowerInternalQuerySleepStudyHelperRoutineBlock = 63,       // ordinal: 0x3d
  PowerInternalDirectedDripsQueryCapabilities = 64,          // ordinal: 0x3e
  PowerInternalClearConstraints = 65,                        // ordinal: 0x3f
  PowerInternalSoftParkVelocityEnabled = 66,                 // ordinal: 0x40
  PowerInternalQueryIntelPepCapabilities = 67,               // ordinal: 0x41
  PowerInternalGetSystemIdleLoopEnablement = 68,             // ordinal: 0x42
  PowerInternalGetVmPerfControlSupport = 69,                 // ordinal: 0x43
  PowerInternalGetVmPerfControlConfig = 70,                  // ordinal: 0x44
  PowerInternalSleepDetailedDiagUpdate = 71,                 // ordinal: 0x45
  PowerInternalProcessorClassFrequencyBandsStats = 72,       // ordinal: 0x46
  PowerInternalHostGlobalUserPresenceStateUpdate = 73,       // ordinal: 0x47
  PowerInternalCpuNodeIdleIntervalStats = 74,                // ordinal: 0x48
  PowerInternalClassIdleIntervalStats = 75,                  // ordinal: 0x49
  PowerInternalCpuNodeConcurrencyStats = 76,                 // ordinal: 0x4a
  PowerInternalClassConcurrencyStats = 77,                   // ordinal: 0x4b
  PowerInternalQueryProcMeasurementCapabilities = 78,        // ordinal: 0x4c
  PowerInternalQueryProcMeasurementValues = 79,              // ordinal: 0x4d
  PowerInternalPrepareForSystemInitiatedReboot = 80,         // ordinal: 0x4e
  PowerInternalGetAdaptiveSessionState = 81,                 // ordinal: 0x4f
  PowerInternalSetConsoleLockedState = 82,                   // ordinal: 0x50
  PowerInternalOverrideSystemInitiatedRebootState = 83,      // ordinal: 0x51
  PowerInternalFanImpactStats = 84,                          // ordinal: 0x52
  PowerInternalFanRpmBuckets = 85,                           // ordinal: 0x53
  PowerInternalPowerBootAppDiagInfo = 86,                    // ordinal: 0x54
  PowerInternalUnregisterShutdownNotification = 87,          // ordinal: 0x55
  PowerInternalManageTransitionStateRecord = 88,             // ordinal: 0x56
  PowerInternalGetAcpiTimeAndAlarmCapabilities = 89,         // ordinal: 0x57
  PowerInternalSuspendResumeRequest = 90,                    // ordinal: 0x58
  PowerInformationInternalMaximum = 91,                      // ordinal: 0x59
} _POWER_INFORMATION_LEVEL_INTERNAL;

typedef enum _BUGCHECK_RECOVERY_LOG_EVENT {
  RecoveryEventStart = 0,                  // ordinal: 0x0
  RecoveryEventPhase1Status = 1,           // ordinal: 0x1
  RecoveryEventPhase2Status = 2,           // ordinal: 0x2
  RecoveryEventMultipleBugcheckStatus = 3, // ordinal: 0x3
  RecoveryEventMax = 4,                    // ordinal: 0x4
} _BUGCHECK_RECOVERY_LOG_EVENT;

typedef enum TlgIn_t {
  TlgInNULL = 0,                  // ordinal: 0x0
  TlgInUNICODESTRING = 1,         // ordinal: 0x1
  TlgInANSISTRING = 2,            // ordinal: 0x2
  TlgInINT8 = 3,                  // ordinal: 0x3
  TlgInUINT8 = 4,                 // ordinal: 0x4
  TlgInINT16 = 5,                 // ordinal: 0x5
  TlgInUINT16 = 6,                // ordinal: 0x6
  TlgInINT32 = 7,                 // ordinal: 0x7
  TlgInUINT32 = 8,                // ordinal: 0x8
  TlgInINT64 = 9,                 // ordinal: 0x9
  TlgInUINT64 = 10,               // ordinal: 0xa
  TlgInFLOAT = 11,                // ordinal: 0xb
  TlgInDOUBLE = 12,               // ordinal: 0xc
  TlgInBOOL32 = 13,               // ordinal: 0xd
  TlgInBINARY = 14,               // ordinal: 0xe
  TlgInGUID = 15,                 // ordinal: 0xf
  _TlgInPOINTER_unsupported = 16, // ordinal: 0x10
  TlgInFILETIME = 17,             // ordinal: 0x11
  TlgInSYSTEMTIME = 18,           // ordinal: 0x12
  TlgInSID = 19,                  // ordinal: 0x13
  TlgInHEXINT32 = 20,             // ordinal: 0x14
  TlgInHEXINT64 = 21,             // ordinal: 0x15
  TlgInCOUNTEDSTRING = 22,        // ordinal: 0x16
  TlgInCOUNTEDANSISTRING = 23,    // ordinal: 0x17
  _TlgInSTRUCT = 24,              // ordinal: 0x18
  TlgInCOUNTEDBINARY = 25,        // ordinal: 0x19
  _TlgInMax = 26,                 // ordinal: 0x1a
  TlgInINTPTR = 9,                // ordinal: 0x1b
  TlgInUINTPTR = 10,              // ordinal: 0x1c
  TlgInPOINTER = 21,              // ordinal: 0x1d
  TlgInLONG = 7,                  // ordinal: 0x1e
  TlgInULONG = 8,                 // ordinal: 0x1f
  TlgInHEXLONG = 20,              // ordinal: 0x20
  _TlgInCcount = 32,              // ordinal: 0x21
  TlgInVcount = 64,               // ordinal: 0x22
  _TlgInChain = 128,              // ordinal: 0x23
  _TlgInCustom = 96,              // ordinal: 0x24
  _TlgInTypeMask = 31,            // ordinal: 0x25
  _TlgInCountMask = 96,           // ordinal: 0x26
  _TlgInFlagMask = 224,           // ordinal: 0x27
} TlgIn_t;

typedef enum PDC_RESOURCE {
  PdcResourceSystemForeground = 0,      // ordinal: 0x0
  PdcResourceUniversalApplications = 1, // ordinal: 0x1
  PdcResourceWin32 = 2,                 // ordinal: 0x2
  PdcResourceNetwork = 3,               // ordinal: 0x3
  PdcResourceSystemBackground = 4,      // ordinal: 0x4
  PdcResourceMin = 0,                   // ordinal: 0x5
  PdcResourceMax = 4,                   // ordinal: 0x6
} PDC_RESOURCE;

typedef enum _POP_SLEEP_CHECKPOINT_STATUS {
  PopSleepCheckpointStatusDisabled = 0,                  // ordinal: 0x0
  PopSleepCheckpointStatusEnabledDueToDirtyShutdown = 1, // ordinal: 0x1
  PopSleepCheckpointStatusEnabledManually = 4,           // ordinal: 0x2
  PopSleepCheckpointStatusEnabledExperiment = 4,         // ordinal: 0x3
  PopSleepCheckpointStatusEnabledMax = 7,                // ordinal: 0x4
  PopSleepCheckpointStatusFailedNotEfiSystem = 8,        // ordinal: 0x5
  PopSleepCheckpointStatusFailedInsufficientSpace = 9,   // ordinal: 0x6
  PopSleepCheckpointStatusFailedTooSlow = 10,            // ordinal: 0x7
  PopSleepCheckpointStatusFailedOtherError = 15,         // ordinal: 0x8
  PopSleepCheckpointStatusMax = 15,                      // ordinal: 0x9
} _POP_SLEEP_CHECKPOINT_STATUS;

typedef enum _KOBJECTS {
  EventNotificationObject = 0,      // ordinal: 0x0
  EventSynchronizationObject = 1,   // ordinal: 0x1
  MutantObject = 2,                 // ordinal: 0x2
  ProcessObject = 3,                // ordinal: 0x3
  QueueObject = 4,                  // ordinal: 0x4
  SemaphoreObject = 5,              // ordinal: 0x5
  ThreadObject = 6,                 // ordinal: 0x6
  GateObject = 7,                   // ordinal: 0x7
  TimerNotificationObject = 8,      // ordinal: 0x8
  TimerSynchronizationObject = 9,   // ordinal: 0x9
  Spare2Object = 10,                // ordinal: 0xa
  Spare3Object = 11,                // ordinal: 0xb
  Spare4Object = 12,                // ordinal: 0xc
  Spare5Object = 13,                // ordinal: 0xd
  Spare6Object = 14,                // ordinal: 0xe
  Spare7Object = 15,                // ordinal: 0xf
  Spare8Object = 16,                // ordinal: 0x10
  ProfileCallbackObject = 17,       // ordinal: 0x11
  ApcObject = 18,                   // ordinal: 0x12
  DpcObject = 19,                   // ordinal: 0x13
  DeviceQueueObject = 20,           // ordinal: 0x14
  PriQueueObject = 21,              // ordinal: 0x15
  InterruptObject = 22,             // ordinal: 0x16
  ProfileObject = 23,               // ordinal: 0x17
  Timer2NotificationObject = 24,    // ordinal: 0x18
  Timer2SynchronizationObject = 25, // ordinal: 0x19
  ThreadedDpcObject = 26,           // ordinal: 0x1a
  MaximumKernelObject = 27,         // ordinal: 0x1b
} _KOBJECTS;

typedef enum JOB_OBJECT_IO_RATE_CONTROL_FLAGS {
  JOB_OBJECT_IO_RATE_CONTROL_ENABLE = 1,                        // ordinal: 0x0
  JOB_OBJECT_IO_RATE_CONTROL_STANDALONE_VOLUME = 2,             // ordinal: 0x1
  JOB_OBJECT_IO_RATE_CONTROL_FORCE_UNIT_ACCESS_ALL = 4,         // ordinal: 0x2
  JOB_OBJECT_IO_RATE_CONTROL_FORCE_UNIT_ACCESS_ON_SOFT_CAP = 8, // ordinal: 0x3
  JOB_OBJECT_IO_RATE_CONTROL_VALID_FLAGS = 15,                  // ordinal: 0x4
} JOB_OBJECT_IO_RATE_CONTROL_FLAGS;

typedef enum _MI_MEMORY_EVENT_TYPES {
  LowPagedPoolEvent = 0,          // ordinal: 0x0
  HighPagedPoolEvent = 1,         // ordinal: 0x1
  LowNonPagedPoolEvent = 2,       // ordinal: 0x2
  HighNonPagedPoolEvent = 3,      // ordinal: 0x3
  LowAvailablePagesEvent = 4,     // ordinal: 0x4
  HighAvailablePagesEvent = 5,    // ordinal: 0x5
  LowCommitEvent = 6,             // ordinal: 0x6
  HighCommitEvent = 7,            // ordinal: 0x7
  MaximumCommitEvent = 8,         // ordinal: 0x8
  BadMemoryDetectedEvent = 9,     // ordinal: 0x9
  PhysicalMemoryChangeEvent = 10, // ordinal: 0xa
  TotalNumberOfMemoryEvents = 11, // ordinal: 0xb
} _MI_MEMORY_EVENT_TYPES;

typedef enum _VRF_RULE_CLASS_ID {
  DifPluginSpecialPool = 0,              // ordinal: 0x0
  DifPluginIrqlRuleClass = 1,            // ordinal: 0x1
  VrfAllocationFailuresRuleClass = 2,    // ordinal: 0x2
  DifPluginPoolTracking = 3,             // ordinal: 0x3
  DifPluginIoRuleClass = 4,              // ordinal: 0x4
  DifPluginDeadlock = 5,                 // ordinal: 0x5
  VrfEnhancedIORuleClass = 6,            // ordinal: 0x6
  DifPluginDmaRuleClass = 7,             // ordinal: 0x7
  DifPluginSecurity = 8,                 // ordinal: 0x8
  VrfForcePendingIORequestRuleClass = 9, // ordinal: 0x9
  VrfIRPTrackingRuleClass = 10,          // ordinal: 0xa
  DifPluginMiscellaneous = 11,           // ordinal: 0xb
  VrfMoreDebuggingRuleClass = 12,        // ordinal: 0xc
  VrfMDLInvariantStackRuleClass = 13,    // ordinal: 0xd
  VrfMDLInvariantDriverRuleClass = 14,   // ordinal: 0xe
  DifPluginPowerDelayFuzzing = 15,       // ordinal: 0xf
  VrfPortMiniportRuleClass = 16,         // ordinal: 0x10
  DifPluginDdiStandard = 17,             // ordinal: 0x11
  DifPluginAutoFail = 18,                // ordinal: 0x12
  DifPluginDdiStateful = 19,             // ordinal: 0x13
  VrfRuleClassBase = 20,                 // ordinal: 0x14
  VrfNdisWifiRuleClass = 21,             // ordinal: 0x15
  DifPluginDriverLogging = 22,           // ordinal: 0x16
  DifPluginSyncDelayFuzzing = 23,        // ordinal: 0x17
  VrfVMSwitchingRuleClass = 24,          // ordinal: 0x18
  VrfCodeIntegrityRuleClass = 25,        // ordinal: 0x19
  VrfBelow4GBAllocationRuleClass = 26,   // ordinal: 0x1a
  VrfProcessorBranchTraceRuleClass = 27, // ordinal: 0x1b
  VrfAdvancedMMRuleClass = 28,           // ordinal: 0x1c
  VrfExtendingXDVTimeLimit = 29,         // ordinal: 0x1d
  VrfSystemBIOSRuleClass = 30,           // ordinal: 0x1e
  VrfHardwareRuleClass = 31,             // ordinal: 0x1f
  DifPluginDriverIsolation = 32,         // ordinal: 0x20
  DifPluginWdfRuleClass = 33,            // ordinal: 0x21
  DifPluginDdiMoreirql = 34,             // ordinal: 0x22
  DifPluginMode = 35,                    // ordinal: 0x23
  ReservedForDVRF36 = 36,                // ordinal: 0x24
  DifPluginTest = 37,                    // ordinal: 0x25
  DifPluginInfoDisclosureIRPRule = 38,   // ordinal: 0x26
  DifPluginLwSP = 39,                    // ordinal: 0x27
  DifPluginAvxCorruption = 40,           // ordinal: 0x28
  DifPluginAccessModeMismatch = 41,      // ordinal: 0x29
  ReservedForDVRF42 = 42,                // ordinal: 0x2a
  ReservedForDVRF43 = 43,                // ordinal: 0x2b
  ReservedForDVRF44 = 44,                // ordinal: 0x2c
  ReservedForDVRF45 = 45,                // ordinal: 0x2d
  ReservedForDVRF46 = 46,                // ordinal: 0x2e
  ReservedForDVRF47 = 47,                // ordinal: 0x2f
  ReservedForDVRF48 = 48,                // ordinal: 0x30
  ReservedForDVRF49 = 49,                // ordinal: 0x31
  ReservedForDVRF50 = 50,                // ordinal: 0x32
  ReservedForDVRF51 = 51,                // ordinal: 0x33
  ReservedForDVRF52 = 52,                // ordinal: 0x34
  ReservedForDVRF53 = 53,                // ordinal: 0x35
  ReservedForDVRF54 = 54,                // ordinal: 0x36
  ReservedForDVRF55 = 55,                // ordinal: 0x37
  ReservedForDVRF56 = 56,                // ordinal: 0x38
  ReservedForDVRF57 = 57,                // ordinal: 0x39
  ReservedForDVRF58 = 58,                // ordinal: 0x3a
  ReservedForDVRF59 = 59,                // ordinal: 0x3b
  ReservedForDVRF60 = 60,                // ordinal: 0x3c
  ReservedForDVRF61 = 61,                // ordinal: 0x3d
  ReservedForDVRF62 = 62,                // ordinal: 0x3e
  ReservedForDVRF63 = 63,                // ordinal: 0x3f
  VrfRuleClassSizeMax = 64,              // ordinal: 0x40
} _VRF_RULE_CLASS_ID;

typedef enum _FREQUENCY_QOS_BUCKET {
  FrequencyQosBucketHigh = 0,  // ordinal: 0x0
  FrequencyQosBucketLow = 1,   // ordinal: 0x1
  FrequencyQosBucketTotal = 2, // ordinal: 0x2
  FrequencyQosBucketMax = 3,   // ordinal: 0x3
} _FREQUENCY_QOS_BUCKET;

typedef enum _MI_FILE_EXTENT_TYPES {
  MiExtentCopyImage = 0,   // ordinal: 0x0
  MiExtentCopyData = 1,    // ordinal: 0x1
  MiExtentCopyMaximum = 2, // ordinal: 0x2
} _MI_FILE_EXTENT_TYPES;

typedef enum _MI_PAGELIST_LOCK_TYPES {
  MiPageListPreviousGlobal = 0, // ordinal: 0x0
  MiPageListNextGlobal = 1,     // ordinal: 0x1
  MiPageListPreviousNode = 2,   // ordinal: 0x2
  MiPageListNextNode = 3,       // ordinal: 0x3
  MiPageListPageMaximum = 4,    // ordinal: 0x4
} _MI_PAGELIST_LOCK_TYPES;

typedef enum PDC_CS_PHASE {
  PdcNoCsPhase = 0,                   // ordinal: 0x0
  PdcConnectionPhase = 1,             // ordinal: 0x1
  PdcShellPhase = 2,                  // ordinal: 0x2
  PdcPlmPhase = 3,                    // ordinal: 0x3
  PdcMaintenancePhase = 4,            // ordinal: 0x4
  PdcDamPhase = 5,                    // ordinal: 0x5
  PdcLowPowerPhase = 6,               // ordinal: 0x6
  PdcResiliencyNotificationPhase = 7, // ordinal: 0x7
  PdcResiliencyPhase = 8,             // ordinal: 0x8
  PdcInvalidPhase = 9,                // ordinal: 0x9
  PdcMaxPhase = 9,                    // ordinal: 0xa
} PDC_CS_PHASE;

typedef enum _POP_SLEEP_CHECKPOINT {
  PopSleepCheckpointInvalid = 0,                             // ordinal: 0x0
  PopSleepCheckpointPowerTransitionStart = 1,                // ordinal: 0x1
  PopSleepCheckpointSuspendAppsBefore = 2,                   // ordinal: 0x2
  PopSleepCheckpointSuspendAppsAfter = 3,                    // ordinal: 0x3
  PopSleepCheckpointSuspendServicesBefore = 4,               // ordinal: 0x4
  PopSleepCheckpointSuspendServicesAfter = 5,                // ordinal: 0x5
  PopSleepCheckpointNotifySuperfetchBefore = 6,              // ordinal: 0x6
  PopSleepCheckpointNotifySuperfetchAfter = 7,               // ordinal: 0x7
  PopSleepCheckpointNotifyCallbacksBefore = 8,               // ordinal: 0x8
  PopSleepCheckpointNotifyCallbacksAfter = 9,                // ordinal: 0x9
  PopSleepCheckpointSleepTransactionCommitted = 10,          // ordinal: 0xa
  PopSleepCheckpointQueryDriversBefore = 11,                 // ordinal: 0xb
  PopSleepCheckpointQueryDriversAfter = 12,                  // ordinal: 0xc
  PopSleepCheckpointAllocatingHiberContext = 13,             // ordinal: 0xd
  PopSleepCheckpointSuspendDriversBefore = 14,               // ordinal: 0xe
  PopSleepCheckpointPreSleepNotification = 16,               // ordinal: 0xf
  PopSleepCheckpointInterruptsDisabledBegin = 17,            // ordinal: 0x10
  PopSleepCheckpointInvokeHandlerBefore = 18,                // ordinal: 0x11
  PopSleepCheckpointSaveHiberContextBegin = 19,              // ordinal: 0x12
  PopSleepCheckpointInitializeDumpStackFailed = 20,          // ordinal: 0x13
  PopSleepCheckpointHiberWriteFailed = 21,                   // ordinal: 0x14
  PopSleepCheckpointHiberFileTooSmall = 22,                  // ordinal: 0x15
  PopSleepCheckpointSaveHiberContextFailed = 23,             // ordinal: 0x16
  PopSleepCheckpointSaveHiberContextEnd = 24,                // ordinal: 0x17
  PopSleepCheckpointHiberKernelHandoff = 25,                 // ordinal: 0x18
  PopSleepCheckpointInvokeHandlerAfter = 26,                 // ordinal: 0x19
  PopSleepCheckpointReadHiberfileBefore = 27,                // ordinal: 0x1a
  PopSleepCheckpointInitializeDumpStackForReadFailed = 28,   // ordinal: 0x1b
  PopSleepCheckpointHiberReadFailed = 29,                    // ordinal: 0x1c
  PopSleepCheckpointChecksumFailure = 30,                    // ordinal: 0x1d
  PopSleepCheckpointDecompressionFailed = 31,                // ordinal: 0x1e
  PopSleepCheckpointReadHiberfileAfter = 32,                 // ordinal: 0x1f
  PopSleepCheckpointInterruptsDisabledEnd = 33,              // ordinal: 0x20
  PopSleepCheckpointWakeDriversAfter = 36,                   // ordinal: 0x21
  PopSleepCheckpointResumeAppsBefore = 37,                   // ordinal: 0x22
  PopSleepCheckpointResumeAppsAfter = 38,                    // ordinal: 0x23
  PopSleepCheckpointResumeServicesBefore = 39,               // ordinal: 0x24
  PopSleepCheckpointResumeServicesAfter = 40,                // ordinal: 0x25
  PopSleepCheckpointPowerTransitionEnd = 41,                 // ordinal: 0x26
  PopSleepCheckpointAllocatingHiberContextNoFileObject = 42, // ordinal: 0x27
  PopSleepCheckpointAllocatingHiberContextGetDumpStackFailed =
      43, // ordinal: 0x28
  PopSleepCheckpointAllocatingHiberContextLoadResumeContextFailed =
      44,                                                     // ordinal: 0x29
  PopSleepCheckpointAllocatingHiberContextBcdOpenFailed = 45, // ordinal: 0x2a
  PopSleepCheckpointAllocatingHiberContextEstablishResumeObjectFailed =
      46, // ordinal: 0x2b
  PopSleepCheckpointAllocatingHiberContextSetPendingResumeFailed =
      47, // ordinal: 0x2c
  PopSleepCheckpointAllocatingHiberContextAllocateIoPagesPagesFailed =
      48, // ordinal: 0x2d
  PopSleepCheckpointAllocatingHiberContextAdapterBuffersInvalid1 =
      49, // ordinal: 0x2e
  PopSleepCheckpointAllocatingHiberContextAllocateDumpPagesFailed =
      50, // ordinal: 0x2f
  PopSleepCheckpointAllocatingHiberContextAdapterBuffersInvalid2 =
      51, // ordinal: 0x30
  PopSleepCheckpointAllocatingHiberContextUnHibernatedMdlFailed =
      52, // ordinal: 0x31
  PopSleepCheckpointAllocatingHiberContextSecureResourcesFailed =
      53,                                    // ordinal: 0x32
  PopSleepCheckpointPrepareSleepBefore = 54, // ordinal: 0x33
  PopSleepCheckpointPrepareSleepAfter = 55,  // ordinal: 0x34
  PopSleepCheckpointBootstatAvailable = 56,  // ordinal: 0x35
  PopSleepCheckpointMax = 57,                // ordinal: 0x36
} _POP_SLEEP_CHECKPOINT;

typedef enum _MI_ALTERNATE_LOCK_VA_TYPE {
  AlternateLockVaTypeSystemPtes = 0,   // ordinal: 0x0
  AlternateLockVaTypeNonPagedPool = 1, // ordinal: 0x1
  AlternateLockVaTypeUser = 2,         // ordinal: 0x2
  AlternateLockVaTypeSystem = 3,       // ordinal: 0x3
  AlternateLockVaTypeMaximum = 4,      // ordinal: 0x4
} _MI_ALTERNATE_LOCK_VA_TYPE;

typedef enum _KWAIT_BLOCK_STATE {
  WaitBlockBypassStart = 0,           // ordinal: 0x0
  WaitBlockBypassComplete = 1,        // ordinal: 0x1
  WaitBlockSuspendBypassStart = 2,    // ordinal: 0x2
  WaitBlockSuspendBypassComplete = 3, // ordinal: 0x3
  WaitBlockActive = 4,                // ordinal: 0x4
  WaitBlockInactive = 5,              // ordinal: 0x5
  WaitBlockSuspended = 6,             // ordinal: 0x6
  WaitBlockAllStates = 7,             // ordinal: 0x7
} _KWAIT_BLOCK_STATE;

typedef enum _MI_ENGINE_TYPE {
  MiEngineAccelerator = 0,   // ordinal: 0x0
  MiEngineFastProcessor = 1, // ordinal: 0x1
  MiEngineSlowProcessor = 2, // ordinal: 0x2
  MiEngineMaximumTypes = 3,  // ordinal: 0x3
} _MI_ENGINE_TYPE;

typedef enum _OBP_LOOKUP_DIR_ENTRY_FLAGS {
  OBP_LOOKUP_SEARCH_SHADOW = 1,     // ordinal: 0x0
  OBP_LOOKUP_IS_SANDBOXED = 2,      // ordinal: 0x1
  OBP_LOOKUP_IS_NOT_SANDBOXED = 4,  // ordinal: 0x2
  OBP_LOOKUP_SANDBOX_COMPUTED = 6,  // ordinal: 0x3
  OBP_LOOKUP_CASE_INSENSITIVE = 64, // ordinal: 0x4
} _OBP_LOOKUP_DIR_ENTRY_FLAGS;

typedef enum _DEVPROP_OPERATOR {
  DEVPROP_OPERATOR_MODIFIER_NOT = 65536,               // ordinal: 0x0
  DEVPROP_OPERATOR_MODIFIER_IGNORE_CASE = 131072,      // ordinal: 0x1
  DEVPROP_OPERATOR_NONE = 0,                           // ordinal: 0x2
  DEVPROP_OPERATOR_EXISTS = 1,                         // ordinal: 0x3
  DEVPROP_OPERATOR_NOT_EXISTS = 65537,                 // ordinal: 0x4
  DEVPROP_OPERATOR_EQUALS = 2,                         // ordinal: 0x5
  DEVPROP_OPERATOR_NOT_EQUALS = 65538,                 // ordinal: 0x6
  DEVPROP_OPERATOR_GREATER_THAN = 3,                   // ordinal: 0x7
  DEVPROP_OPERATOR_LESS_THAN = 4,                      // ordinal: 0x8
  DEVPROP_OPERATOR_GREATER_THAN_EQUALS = 5,            // ordinal: 0x9
  DEVPROP_OPERATOR_LESS_THAN_EQUALS = 6,               // ordinal: 0xa
  DEVPROP_OPERATOR_EQUALS_IGNORE_CASE = 131074,        // ordinal: 0xb
  DEVPROP_OPERATOR_NOT_EQUALS_IGNORE_CASE = 196610,    // ordinal: 0xc
  DEVPROP_OPERATOR_BITWISE_AND = 7,                    // ordinal: 0xd
  DEVPROP_OPERATOR_BITWISE_OR = 8,                     // ordinal: 0xe
  DEVPROP_OPERATOR_BEGINS_WITH = 9,                    // ordinal: 0xf
  DEVPROP_OPERATOR_ENDS_WITH = 10,                     // ordinal: 0x10
  DEVPROP_OPERATOR_CONTAINS = 11,                      // ordinal: 0x11
  DEVPROP_OPERATOR_BEGINS_WITH_IGNORE_CASE = 131081,   // ordinal: 0x12
  DEVPROP_OPERATOR_ENDS_WITH_IGNORE_CASE = 131082,     // ordinal: 0x13
  DEVPROP_OPERATOR_CONTAINS_IGNORE_CASE = 131083,      // ordinal: 0x14
  DEVPROP_OPERATOR_LIST_CONTAINS = 4096,               // ordinal: 0x15
  DEVPROP_OPERATOR_LIST_ELEMENT_BEGINS_WITH = 8192,    // ordinal: 0x16
  DEVPROP_OPERATOR_LIST_ELEMENT_ENDS_WITH = 12288,     // ordinal: 0x17
  DEVPROP_OPERATOR_LIST_ELEMENT_CONTAINS = 16384,      // ordinal: 0x18
  DEVPROP_OPERATOR_LIST_CONTAINS_IGNORE_CASE = 135168, // ordinal: 0x19
  DEVPROP_OPERATOR_LIST_ELEMENT_BEGINS_WITH_IGNORE_CASE =
      139264,                                                   // ordinal: 0x1a
  DEVPROP_OPERATOR_LIST_ELEMENT_ENDS_WITH_IGNORE_CASE = 143360, // ordinal: 0x1b
  DEVPROP_OPERATOR_LIST_ELEMENT_CONTAINS_IGNORE_CASE = 147456,  // ordinal: 0x1c
  DEVPROP_OPERATOR_AND_OPEN = 1048576,                          // ordinal: 0x1d
  DEVPROP_OPERATOR_AND_CLOSE = 2097152,                         // ordinal: 0x1e
  DEVPROP_OPERATOR_OR_OPEN = 3145728,                           // ordinal: 0x1f
  DEVPROP_OPERATOR_OR_CLOSE = 4194304,                          // ordinal: 0x20
  DEVPROP_OPERATOR_NOT_OPEN = 5242880,                          // ordinal: 0x21
  DEVPROP_OPERATOR_NOT_CLOSE = 6291456,                         // ordinal: 0x22
  DEVPROP_OPERATOR_ARRAY_CONTAINS = 268435456,                  // ordinal: 0x23
  DEVPROP_OPERATOR_MASK_EVAL = 4095,                            // ordinal: 0x24
  DEVPROP_OPERATOR_MASK_LIST = 61440,                           // ordinal: 0x25
  DEVPROP_OPERATOR_MASK_MODIFIER = 983040,                      // ordinal: 0x26
  DEVPROP_OPERATOR_MASK_NOT_LOGICAL = -267386881,               // ordinal: 0x27
  DEVPROP_OPERATOR_MASK_LOGICAL = 267386880,                    // ordinal: 0x28
  DEVPROP_OPERATOR_MASK_ARRAY = -268435456,                     // ordinal: 0x29
} _DEVPROP_OPERATOR;

typedef enum _RTL_FEATURE_ENABLED_STATE_OPTIONS {
  FeatureEnabledStateOptionsNone = 0,       // ordinal: 0x0
  FeatureEnabledStateOptionsWexpConfig = 1, // ordinal: 0x1
} _RTL_FEATURE_ENABLED_STATE_OPTIONS;

typedef enum _EX_HEAP_TYPE {
  ExHeapTypeNonPagedMin = 0, // ordinal: 0x0
  ExHeapTypeNonPaged = 0,    // ordinal: 0x1
  ExHeapTypeNonPagedMax = 1, // ordinal: 0x2
  ExHeapTypeNonPagedNx = 1,  // ordinal: 0x3
  ExHeapTypePagedMin = 2,    // ordinal: 0x4
  ExHeapTypePaged = 2,       // ordinal: 0x5
  ExHeapTypePagedMax = 3,    // ordinal: 0x6
  ExHeapTypeMmSt = 3,        // ordinal: 0x7
  ExHeapTypeMax = 4,         // ordinal: 0x8
  ExHeapTypeSpecialMax = 4,  // ordinal: 0x9
} _EX_HEAP_TYPE;

typedef enum FEATURE_CHANGE_TIME {
  FEATURE_CHANGE_TIME_READ = 0,          // ordinal: 0x0
  FEATURE_CHANGE_TIME_MODULE_RELOAD = 1, // ordinal: 0x1
  FEATURE_CHANGE_TIME_SESSION = 2,       // ordinal: 0x2
  FEATURE_CHANGE_TIME_REBOOT = 3,        // ordinal: 0x3
  FEATURE_CHANGE_TIME_USER_FLAG = 128,   // ordinal: 0x4
} FEATURE_CHANGE_TIME;

typedef enum _POP_DIRECTED_DRIPS_PROBLEM_DEVICE_REASON {
  DirectedDripsProblemDeviceReasonSpecialDevice = 0,      // ordinal: 0x0
  DirectedDripsProblemDeviceReasonNoDfx = 1,              // ordinal: 0x1
  DirectedDripsProblemDeviceReasonNoPs4 = 2,              // ordinal: 0x2
  DirectedDripsProblemDeviceReasonNoPs4Root = 3,          // ordinal: 0x3
  DirectedDripsProblemDeviceReasonComponentContraint = 4, // ordinal: 0x4
  DirectedDripsProblemDeviceReasonDfxFailure = 5,         // ordinal: 0x5
  DirectedDripsProblemDeviceReasonPagingDevice = 6,       // ordinal: 0x6
  DirectedDripsProblemDeviceReasonDebuggingDevice = 7,    // ordinal: 0x7
  DirectedDripsProblemDeviceReasonDfxNotAllowed = 8,      // ordinal: 0x8
  DirectedDripsProblemDeviceReasonDfxOptOut = 9,          // ordinal: 0x9
  DirectedDripsProblemDeviceReasonMax = 10,               // ordinal: 0xa
} _POP_DIRECTED_DRIPS_PROBLEM_DEVICE_REASON;

typedef enum _PROCESS_SECTION_TYPE {
  ProcessSectionData = 0,           // ordinal: 0x0
  ProcessSectionImage = 1,          // ordinal: 0x1
  ProcessSectionImageNx = 2,        // ordinal: 0x2
  ProcessSectionPagefileBacked = 3, // ordinal: 0x3
  ProcessSectionMax = 4,            // ordinal: 0x4
} _PROCESS_SECTION_TYPE;

typedef enum _FILE_OBJECT_EXTENSION_TYPE {
  FoExtTypeTransactionParams = 0,   // ordinal: 0x0
  FoExtTypeInternal = 1,            // ordinal: 0x1
  FoExtTypeIosbRange = 2,           // ordinal: 0x2
  FoExtTypeGeneric = 3,             // ordinal: 0x3
  FoExtTypeSfio = 4,                // ordinal: 0x4
  FoExtTypeSymlink = 5,             // ordinal: 0x5
  FoExtTypeOplockKey = 6,           // ordinal: 0x6
  FoExtTypeSilo = 7,                // ordinal: 0x7
  FoExtTypeMemoryPartitionInfo = 8, // ordinal: 0x8
  FoExtTypeShadowFile = 9,          // ordinal: 0x9
  MaxFoExtTypes = 10,               // ordinal: 0xa
} _FILE_OBJECT_EXTENSION_TYPE;

typedef enum _KE_WAKE_SOURCE_TYPE {
  KeWakeSourceTypeSpuriousWake = 0,      // ordinal: 0x0
  KeWakeSourceTypeSpuriousClock = 1,     // ordinal: 0x1
  KeWakeSourceTypeSpuriousInterrupt = 2, // ordinal: 0x2
  KeWakeSourceTypeQueryFailure = 3,      // ordinal: 0x3
  KeWakeSourceTypeAccountingFailure = 4, // ordinal: 0x4
  KeWakeSourceTypeNonIrTimer = 5,        // ordinal: 0x5
  KeWakeSourceTypeDebugPoll = 6,         // ordinal: 0x6
  KeWakeSourceTypeClockWatchdog = 7,     // ordinal: 0x7
  KeWakeSourceTypeClockInternal = 8,     // ordinal: 0x8
  KeWakeSourceTypeClockNotOwner = 9,     // ordinal: 0x9
  KeWakeSourceTypeClockNotArmed = 10,    // ordinal: 0xa
  KeWakeSourceTypeExTimer = 11,          // ordinal: 0xb
  KeWakeSourceTypeStaticSourceMax = 11,  // ordinal: 0xc
  KeWakeSourceTypeInterrupt = 128,       // ordinal: 0xd
  KeWakeSourceTypeIRTimer = 129,         // ordinal: 0xe
  KeWakeSourceTypeMax = 130,             // ordinal: 0xf
} _KE_WAKE_SOURCE_TYPE;

typedef enum _OBJECT_INFORMATION_CLASS {
  ObjectBasicInformation = 0,         // ordinal: 0x0
  ObjectNameInformation = 1,          // ordinal: 0x1
  ObjectTypeInformation = 2,          // ordinal: 0x2
  ObjectTypesInformation = 3,         // ordinal: 0x3
  ObjectHandleFlagInformation = 4,    // ordinal: 0x4
  ObjectSessionInformation = 5,       // ordinal: 0x5
  ObjectSessionObjectInformation = 6, // ordinal: 0x6
  MaxObjectInfoClass = 7,             // ordinal: 0x7
} _OBJECT_INFORMATION_CLASS;

typedef enum _JOBOBJECTINFOCLASS {
  JobObjectBasicAccountingInformation = 1,         // ordinal: 0x0
  JobObjectBasicLimitInformation = 2,              // ordinal: 0x1
  JobObjectBasicProcessIdList = 3,                 // ordinal: 0x2
  JobObjectBasicUIRestrictions = 4,                // ordinal: 0x3
  JobObjectSecurityLimitInformation = 5,           // ordinal: 0x4
  JobObjectEndOfJobTimeInformation = 6,            // ordinal: 0x5
  JobObjectAssociateCompletionPortInformation = 7, // ordinal: 0x6
  JobObjectBasicAndIoAccountingInformation = 8,    // ordinal: 0x7
  JobObjectExtendedLimitInformation = 9,           // ordinal: 0x8
  JobObjectJobSetInformation = 10,                 // ordinal: 0x9
  JobObjectGroupInformation = 11,                  // ordinal: 0xa
  JobObjectNotificationLimitInformation = 12,      // ordinal: 0xb
  JobObjectLimitViolationInformation = 13,         // ordinal: 0xc
  JobObjectGroupInformationEx = 14,                // ordinal: 0xd
  JobObjectCpuRateControlInformation = 15,         // ordinal: 0xe
  JobObjectCompletionFilter = 16,                  // ordinal: 0xf
  JobObjectCompletionCounter = 17,                 // ordinal: 0x10
  JobObjectFreezeInformation = 18,                 // ordinal: 0x11
  JobObjectExtendedAccountingInformation = 19,     // ordinal: 0x12
  JobObjectWakeInformation = 20,                   // ordinal: 0x13
  JobObjectBackgroundInformation = 21,             // ordinal: 0x14
  JobObjectSchedulingRankBiasInformation = 22,     // ordinal: 0x15
  JobObjectTimerVirtualizationInformation = 23,    // ordinal: 0x16
  JobObjectCycleTimeNotification = 24,             // ordinal: 0x17
  JobObjectClearEvent = 25,                        // ordinal: 0x18
  JobObjectInterferenceInformation = 26,           // ordinal: 0x19
  JobObjectClearPeakJobMemoryUsed = 27,            // ordinal: 0x1a
  JobObjectMemoryUsageInformation = 28,            // ordinal: 0x1b
  JobObjectSharedCommit = 29,                      // ordinal: 0x1c
  JobObjectContainerId = 30,                       // ordinal: 0x1d
  JobObjectIoRateControlInformation = 31,          // ordinal: 0x1e
  JobObjectSiloRootDirectory = 37,                 // ordinal: 0x1f
  JobObjectServerSiloBasicInformation = 38,        // ordinal: 0x20
  JobObjectServerSiloUserSharedData = 39,          // ordinal: 0x21
  JobObjectServerSiloInitialize = 40,              // ordinal: 0x22
  JobObjectServerSiloRunningState = 41,            // ordinal: 0x23
  JobObjectIoAttribution = 42,                     // ordinal: 0x24
  JobObjectMemoryPartitionInformation = 43,        // ordinal: 0x25
  JobObjectContainerTelemetryId = 44,              // ordinal: 0x26
  JobObjectSiloSystemRoot = 45,                    // ordinal: 0x27
  JobObjectEnergyTrackingState = 46,               // ordinal: 0x28
  JobObjectThreadImpersonationInformation = 47,    // ordinal: 0x29
  JobObjectIoPriorityLimit = 48,                   // ordinal: 0x2a
  JobObjectPagePriorityLimit = 49,                 // ordinal: 0x2b
  JobObjectReserved1Information = 18,              // ordinal: 0x2c
  JobObjectReserved2Information = 19,              // ordinal: 0x2d
  JobObjectReserved3Information = 20,              // ordinal: 0x2e
  JobObjectReserved4Information = 21,              // ordinal: 0x2f
  JobObjectReserved5Information = 22,              // ordinal: 0x30
  JobObjectReserved6Information = 23,              // ordinal: 0x31
  JobObjectReserved7Information = 24,              // ordinal: 0x32
  JobObjectReserved8Information = 25,              // ordinal: 0x33
  JobObjectReserved9Information = 26,              // ordinal: 0x34
  JobObjectReserved10Information = 27,             // ordinal: 0x35
  JobObjectReserved11Information = 28,             // ordinal: 0x36
  JobObjectReserved12Information = 29,             // ordinal: 0x37
  JobObjectReserved13Information = 30,             // ordinal: 0x38
  JobObjectReserved14Information = 31,             // ordinal: 0x39
  JobObjectNetRateControlInformation = 32,         // ordinal: 0x3a
  JobObjectNotificationLimitInformation2 = 33,     // ordinal: 0x3b
  JobObjectLimitViolationInformation2 = 34,        // ordinal: 0x3c
  JobObjectCreateSilo = 35,                        // ordinal: 0x3d
  JobObjectSiloBasicInformation = 36,              // ordinal: 0x3e
  JobObjectReserved15Information = 37,             // ordinal: 0x3f
  JobObjectReserved16Information = 38,             // ordinal: 0x40
  JobObjectReserved17Information = 39,             // ordinal: 0x41
  JobObjectReserved18Information = 40,             // ordinal: 0x42
  JobObjectReserved19Information = 41,             // ordinal: 0x43
  JobObjectReserved20Information = 42,             // ordinal: 0x44
  JobObjectReserved21Information = 43,             // ordinal: 0x45
  JobObjectReserved22Information = 44,             // ordinal: 0x46
  JobObjectReserved23Information = 45,             // ordinal: 0x47
  JobObjectReserved24Information = 46,             // ordinal: 0x48
  JobObjectReserved25Information = 47,             // ordinal: 0x49
  JobObjectReserved26Information = 48,             // ordinal: 0x4a
  JobObjectReserved27Information = 49,             // ordinal: 0x4b
  MaxJobObjectInfoClass = 50,                      // ordinal: 0x4c
} _JOBOBJECTINFOCLASS;

typedef enum _IO_RATE_CONTROL_TYPE {
  IoRateControlTypeCapMin = 0,                         // ordinal: 0x0
  IoRateControlTypeIopsCap = 0,                        // ordinal: 0x1
  IoRateControlTypeBandwidthCap = 1,                   // ordinal: 0x2
  IoRateControlTypeTimePercentCap = 2,                 // ordinal: 0x3
  IoRateControlTypeCapMax = 2,                         // ordinal: 0x4
  IoRateControlTypeReservationMin = 3,                 // ordinal: 0x5
  IoRateControlTypeIopsReservation = 3,                // ordinal: 0x6
  IoRateControlTypeBandwidthReservation = 4,           // ordinal: 0x7
  IoRateControlTypeTimePercentReservation = 5,         // ordinal: 0x8
  IoRateControlTypeReservationMax = 5,                 // ordinal: 0x9
  IoRateControlTypeCriticalReservationMin = 6,         // ordinal: 0xa
  IoRateControlTypeIopsCriticalReservation = 6,        // ordinal: 0xb
  IoRateControlTypeBandwidthCriticalReservation = 7,   // ordinal: 0xc
  IoRateControlTypeTimePercentCriticalReservation = 8, // ordinal: 0xd
  IoRateControlTypeCriticalReservationMax = 8,         // ordinal: 0xe
  IoRateControlTypeSoftCapMin = 9,                     // ordinal: 0xf
  IoRateControlTypeIopsSoftCap = 9,                    // ordinal: 0x10
  IoRateControlTypeBandwidthSoftCap = 10,              // ordinal: 0x11
  IoRateControlTypeTimePercentSoftCap = 11,            // ordinal: 0x12
  IoRateControlTypeSoftCapMax = 11,                    // ordinal: 0x13
  IoRateControlTypeLimitExcessNotifyMin = 12,          // ordinal: 0x14
  IoRateControlTypeIopsLimitExcessNotify = 12,         // ordinal: 0x15
  IoRateControlTypeBandwidthLimitExcessNotify = 13,    // ordinal: 0x16
  IoRateControlTypeTimePercentLimitExcessNotify = 14,  // ordinal: 0x17
  IoRateControlTypeLimitExcessNotifyMax = 14,          // ordinal: 0x18
  IoRateControlTypeMax = 15,                           // ordinal: 0x19
} _IO_RATE_CONTROL_TYPE;

typedef enum _WNF_STATE_NAME_LIFETIME {
  WnfWellKnownStateName = 0,  // ordinal: 0x0
  WnfPermanentStateName = 1,  // ordinal: 0x1
  WnfPersistentStateName = 2, // ordinal: 0x2
  WnfTemporaryStateName = 3,  // ordinal: 0x3
} _WNF_STATE_NAME_LIFETIME;

typedef enum _TRANSFER_TYPE {
  ReadTransfer = 0,  // ordinal: 0x0
  WriteTransfer = 1, // ordinal: 0x1
  OtherTransfer = 2, // ordinal: 0x2
} _TRANSFER_TYPE;

typedef enum _LOCK_OPERATION {
  IoReadAccess = 0,   // ordinal: 0x0
  IoWriteAccess = 1,  // ordinal: 0x1
  IoModifyAccess = 2, // ordinal: 0x2
} _LOCK_OPERATION;

typedef enum EmptyCVariant_FeatureStaging_IoManager {
  CVariant_FeatureStaging_IoManager_Empty = 0, // ordinal: 0x0
} EmptyCVariant_FeatureStaging_IoManager;

typedef enum _KWAIT_REASON {
  Executive = 0,          // ordinal: 0x0
  FreePage = 1,           // ordinal: 0x1
  PageIn = 2,             // ordinal: 0x2
  PoolAllocation = 3,     // ordinal: 0x3
  DelayExecution = 4,     // ordinal: 0x4
  Suspended = 5,          // ordinal: 0x5
  UserRequest = 6,        // ordinal: 0x6
  WrExecutive = 7,        // ordinal: 0x7
  WrFreePage = 8,         // ordinal: 0x8
  WrPageIn = 9,           // ordinal: 0x9
  WrPoolAllocation = 10,  // ordinal: 0xa
  WrDelayExecution = 11,  // ordinal: 0xb
  WrSuspended = 12,       // ordinal: 0xc
  WrUserRequest = 13,     // ordinal: 0xd
  WrSpare0 = 14,          // ordinal: 0xe
  WrQueue = 15,           // ordinal: 0xf
  WrLpcReceive = 16,      // ordinal: 0x10
  WrLpcReply = 17,        // ordinal: 0x11
  WrVirtualMemory = 18,   // ordinal: 0x12
  WrPageOut = 19,         // ordinal: 0x13
  WrRendezvous = 20,      // ordinal: 0x14
  WrKeyedEvent = 21,      // ordinal: 0x15
  WrTerminated = 22,      // ordinal: 0x16
  WrProcessInSwap = 23,   // ordinal: 0x17
  WrCpuRateControl = 24,  // ordinal: 0x18
  WrCalloutStack = 25,    // ordinal: 0x19
  WrKernel = 26,          // ordinal: 0x1a
  WrResource = 27,        // ordinal: 0x1b
  WrPushLock = 28,        // ordinal: 0x1c
  WrMutex = 29,           // ordinal: 0x1d
  WrQuantumEnd = 30,      // ordinal: 0x1e
  WrDispatchInt = 31,     // ordinal: 0x1f
  WrPreempted = 32,       // ordinal: 0x20
  WrYieldExecution = 33,  // ordinal: 0x21
  WrFastMutex = 34,       // ordinal: 0x22
  WrGuardedMutex = 35,    // ordinal: 0x23
  WrRundown = 36,         // ordinal: 0x24
  WrAlertByThreadId = 37, // ordinal: 0x25
  WrDeferredPreempt = 38, // ordinal: 0x26
  WrPhysicalFault = 39,   // ordinal: 0x27
  WrIoRing = 40,          // ordinal: 0x28
  WrMdlCache = 41,        // ordinal: 0x29
  MaximumWaitReason = 42, // ordinal: 0x2a
} _KWAIT_REASON;

typedef enum _RTLP_HP_MEMORY_TYPE {
  HeapMemoryPaged = 0,      // ordinal: 0x0
  HeapMemoryNonPaged = 1,   // ordinal: 0x1
  HeapMemory64KPage = 2,    // ordinal: 0x2
  HeapMemoryLargePage = 3,  // ordinal: 0x3
  HeapMemoryHugePage = 4,   // ordinal: 0x4
  HeapMemoryTypeCustom = 5, // ordinal: 0x5
  HeapMemoryTypeMax = 6,    // ordinal: 0x6
} _RTLP_HP_MEMORY_TYPE;

typedef enum _RTLP_HP_ALLOCATOR {
  RtlpHpSegmentSm = 0,     // ordinal: 0x0
  RtlpHpSegmentLg = 1,     // ordinal: 0x1
  RtlpHpSegmentTypes = 2,  // ordinal: 0x2
  RtlpHpHugeAllocator = 2, // ordinal: 0x3
  RtlpHpAllocatorMax = 3,  // ordinal: 0x4
} _RTLP_HP_ALLOCATOR;

typedef enum _HEAP_SEG_RANGE_TYPE {
  HeapSegRangeUser = 0,     // ordinal: 0x0
  HeapSegRangeInternal = 1, // ordinal: 0x1
  HeapSegRangeLFH = 2,      // ordinal: 0x2
  HeapSegRangeVS = 3,       // ordinal: 0x3
  HeapSegRangeTypeMax = 3,  // ordinal: 0x4
} _HEAP_SEG_RANGE_TYPE;

typedef enum _HEAP_LFH_LOCKMODE {
  HeapLockNotHeld = 0,   // ordinal: 0x0
  HeapLockShared = 1,    // ordinal: 0x1
  HeapLockExclusive = 2, // ordinal: 0x2
} _HEAP_LFH_LOCKMODE;

typedef enum RTLP_CSPARSE_BITMAP_STATE {
  CommitBitmapInvalid = 0, // ordinal: 0x0
  UserBitmapInvalid = 1,   // ordinal: 0x1
  UserBitmapValid = 2,     // ordinal: 0x2
} RTLP_CSPARSE_BITMAP_STATE;

typedef enum EmptyCVariant_FeatureStaging_Updated_MSRC_GlobalSettings {
  CVariant_FeatureStaging_Updated_MSRC_GlobalSettings_Empty = 0, // ordinal: 0x0
} EmptyCVariant_FeatureStaging_Updated_MSRC_GlobalSettings;

typedef enum EmptyCVariant_FeatureStaging_kernelcachemanager {
  CVariant_FeatureStaging_kernelcachemanager_Empty = 0, // ordinal: 0x0
} EmptyCVariant_FeatureStaging_kernelcachemanager;

typedef enum _POWER_REQUEST_TYPE_INTERNAL {
  PowerRequestDisplayRequiredInternal = 0,   // ordinal: 0x0
  PowerRequestSystemRequiredInternal = 1,    // ordinal: 0x1
  PowerRequestAwayModeRequiredInternal = 2,  // ordinal: 0x2
  PowerRequestExecutionRequiredInternal = 3, // ordinal: 0x3
  PowerRequestPerfBoostRequiredInternal = 4, // ordinal: 0x4
  PowerRequestActiveLockScreenInternal = 5,  // ordinal: 0x5
  PowerRequestInternalInvalid = 6,           // ordinal: 0x6
} _POWER_REQUEST_TYPE_INTERNAL;

typedef enum _POWER_REQUEST_TYPE {
  PowerRequestDisplayRequired = 0,   // ordinal: 0x0
  PowerRequestSystemRequired = 1,    // ordinal: 0x1
  PowerRequestAwayModeRequired = 2,  // ordinal: 0x2
  PowerRequestExecutionRequired = 3, // ordinal: 0x3
} _POWER_REQUEST_TYPE;

typedef enum _CMP_FAILURE_INJECTION_POINT {
  CmpFailurePointPoolAllocation = 0,                    // ordinal: 0x0
  CmpFailurePointFileWrite = 1,                         // ordinal: 0x1
  CmpFailurePointFileRead = 2,                          // ordinal: 0x2
  CmpFailurePointFlush = 3,                             // ordinal: 0x3
  CmpFailurePointFlushAndPurge = 4,                     // ordinal: 0x4
  CmpFailurePointForceLargeBin = 5,                     // ordinal: 0x5
  CmpFailurePointDontFixAlignment = 6,                  // ordinal: 0x6
  CmpFailurePointAllocateCell = 7,                      // ordinal: 0x7
  CmpFailurePointMarkDirty = 8,                         // ordinal: 0x8
  CmpFailurePointForceMultiLevelMap = 9,                // ordinal: 0x9
  CmpFailurePointAllocateContiguousLogEntry = 10,       // ordinal: 0xa
  CmpFailurePointAllocateKcb = 11,                      // ordinal: 0xb
  CmpFailurePointCreateKeyBody = 12,                    // ordinal: 0xc
  CmpFailurePointForceFreeKcb = 13,                     // ordinal: 0xd
  CmpFailurePointKcbLockUpgrade = 14,                   // ordinal: 0xe
  CmpFailurePointKcbLockUpgradeDelay = 15,              // ordinal: 0xf
  CmpFailurePointKeyEnumResumeContextVerification = 16, // ordinal: 0x10
  CmpFailurePointKeyEnumForceRetry = 17,                // ordinal: 0x11
  CmpFailurePointForceReorganization = 18,              // ordinal: 0x12
  CmpFailurePointForceLazyCOWByPolicy = 19,             // ordinal: 0x13
  CmpFailurePointForceBugcheckRecoveryEnabled = 20,     // ordinal: 0x14
  CmpFailurePointCreateHiveCacheEntry = 21,             // ordinal: 0x15
  CmpFailurePointClaimHiveCacheEntry = 22,              // ordinal: 0x16
  CmpFailurePointSubscribePnpNotifications = 23,        // ordinal: 0x17
  CmpFailurePointCreateOplockMonitoringThread = 24,     // ordinal: 0x18
  CmpFailurePointOpenHiveFile = 25,                     // ordinal: 0x19
  CmpFailurePointRequestOplockOnPrimary = 26,           // ordinal: 0x1a
  CmpFailurePointRequestOplockOnLog1 = 27,              // ordinal: 0x1b
  CmpFailurePointRequestOplockOnLog2 = 28,              // ordinal: 0x1c
  CmpFailurePointCreateHive = 29,                       // ordinal: 0x1d
  CmpFailureInjectionPointCount = 30,                   // ordinal: 0x1e
} _CMP_FAILURE_INJECTION_POINT;

typedef enum _CMP_COPY_TYPE {
  Copy = 0,  // ordinal: 0x0
  Sync = 1,  // ordinal: 0x1
  Merge = 2, // ordinal: 0x2
} _CMP_COPY_TYPE;

typedef enum EmptyCVariant_FeatureStaging_Boot {
  CVariant_FeatureStaging_Boot_Empty = 0, // ordinal: 0x0
} EmptyCVariant_FeatureStaging_Boot;

typedef enum EmptyCVariant_FeatureStaging_MemoryManager {
  CVariant_FeatureStaging_MemoryManager_Empty = 0, // ordinal: 0x0
} EmptyCVariant_FeatureStaging_MemoryManager;

typedef enum EmptyCVariant_FeatureStaging_xfg {
  CVariant_FeatureStaging_xfg_Empty = 0, // ordinal: 0x0
} EmptyCVariant_FeatureStaging_xfg;

typedef enum EmptyCVariant_FeatureStaging_Poncherello {
  CVariant_FeatureStaging_Poncherello_Empty = 0, // ordinal: 0x0
} EmptyCVariant_FeatureStaging_Poncherello;

typedef enum wil_UsageReportingMode {
  wil_UsageReportingMode_Default = 0,           // ordinal: 0x0
  wil_UsageReportingMode_SuppressPotential = 1, // ordinal: 0x1
  wil_UsageReportingMode_SuppressImplicit = 2,  // ordinal: 0x2
} wil_UsageReportingMode;

typedef enum _RTL_FEATURE_CONFIGURATION_TYPE {
  RtlFeatureConfigurationBoot = 0,    // ordinal: 0x0
  RtlFeatureConfigurationRuntime = 1, // ordinal: 0x1
  RtlFeatureConfigurationCount = 2,   // ordinal: 0x2
} _RTL_FEATURE_CONFIGURATION_TYPE;

typedef enum wil_FeatureChangeTime {
  wil_FeatureChangeTime_OnRead = 0,    // ordinal: 0x0
  wil_FeatureChangeTime_OnReload = 1,  // ordinal: 0x1
  wil_FeatureChangeTime_OnSession = 2, // ordinal: 0x2
  wil_FeatureChangeTime_OnReboot = 3,  // ordinal: 0x3
} wil_FeatureChangeTime;

typedef enum wil_FeatureStore {
  wil_FeatureStore_Machine = 0, // ordinal: 0x0
  wil_FeatureStore_User = 1,    // ordinal: 0x1
  wil_FeatureStore_All = 2,     // ordinal: 0x2
} wil_FeatureStore;

typedef enum wil_VariantReportingKind {
  wil_VariantReportingKind_None = 0,        // ordinal: 0x0
  wil_VariantReportingKind_UniqueUsage = 1, // ordinal: 0x1
  wil_VariantReportingKind_DeviceUsage = 2, // ordinal: 0x2
} wil_VariantReportingKind;

typedef enum wil_ReportingKind {
  wil_ReportingKind_None = 0,              // ordinal: 0x0
  wil_ReportingKind_UniqueUsage = 1,       // ordinal: 0x1
  wil_ReportingKind_UniqueOpportunity = 2, // ordinal: 0x2
  wil_ReportingKind_DeviceUsage = 3,       // ordinal: 0x3
  wil_ReportingKind_DeviceOpportunity = 4, // ordinal: 0x4
  wil_ReportingKind_TotalDuration = 5,     // ordinal: 0x5
  wil_ReportingKind_PausedDuration = 6,    // ordinal: 0x6
} wil_ReportingKind;

typedef enum wil_details_ServiceReportingKind {
  wil_details_ServiceReportingKind_UniqueUsage = 0,          // ordinal: 0x0
  wil_details_ServiceReportingKind_UniqueOpportunity = 1,    // ordinal: 0x1
  wil_details_ServiceReportingKind_DeviceUsage = 2,          // ordinal: 0x2
  wil_details_ServiceReportingKind_DeviceOpportunity = 3,    // ordinal: 0x3
  wil_details_ServiceReportingKind_PotentialUniqueUsage = 4, // ordinal: 0x4
  wil_details_ServiceReportingKind_PotentialUniqueOpportunity =
      5,                                                     // ordinal: 0x5
  wil_details_ServiceReportingKind_PotentialDeviceUsage = 6, // ordinal: 0x6
  wil_details_ServiceReportingKind_PotentialDeviceOpportunity =
      7,                                                        // ordinal: 0x7
  wil_details_ServiceReportingKind_EnabledTotalDuration = 8,    // ordinal: 0x8
  wil_details_ServiceReportingKind_EnabledPausedDuration = 9,   // ordinal: 0x9
  wil_details_ServiceReportingKind_DisabledTotalDuration = 10,  // ordinal: 0xa
  wil_details_ServiceReportingKind_DisabledPausedDuration = 11, // ordinal: 0xb
  wil_details_ServiceReportingKind_CustomEnabledBase = 100,     // ordinal: 0xc
  wil_details_ServiceReportingKind_CustomDisabledBase = 150,    // ordinal: 0xd
  wil_details_ServiceReportingKind_Store = 254,                 // ordinal: 0xe
  wil_details_ServiceReportingKind_None = 255,                  // ordinal: 0xf
  wil_details_ServiceReportingKind_VariantDevicePotentialBase =
      256, // ordinal: 0x10
  wil_details_ServiceReportingKind_VariantDeviceUsageBase =
      320, // ordinal: 0x11
  wil_details_ServiceReportingKind_VariantUniquePotentialBase =
      384, // ordinal: 0x12
  wil_details_ServiceReportingKind_VariantUniqueUsageBase =
      448, // ordinal: 0x13
} wil_details_ServiceReportingKind;

typedef enum EmptyCVariant_ExpiredFeature {
  CVariant_ExpiredFeature_Empty = 0, // ordinal: 0x0
} EmptyCVariant_ExpiredFeature;

typedef enum _EVENT_INFO_CLASS {
  EventProviderBinaryTrackInfo = 0,   // ordinal: 0x0
  EventProviderSetReserved1 = 1,      // ordinal: 0x1
  EventProviderSetTraits = 2,         // ordinal: 0x2
  EventProviderUseDescriptorType = 3, // ordinal: 0x3
  MaxEventInfo = 4,                   // ordinal: 0x4
} _EVENT_INFO_CLASS;

typedef enum _PF_FILE_ACCESS_TYPE {
  PfFileAccessTypeRead = 0,  // ordinal: 0x0
  PfFileAccessTypeWrite = 1, // ordinal: 0x1
  PfFileAccessTypeMax = 2,   // ordinal: 0x2
} _PF_FILE_ACCESS_TYPE;

typedef enum _EX_GEN_RANDOM_DOMAIN {
  ExGenRandomDomainKernel = 0,      // ordinal: 0x0
  ExGenRandomDomainFirst = 0,       // ordinal: 0x1
  ExGenRandomDomainUserVisible = 1, // ordinal: 0x2
  ExGenRandomDomainMax = 2,         // ordinal: 0x3
} _EX_GEN_RANDOM_DOMAIN;

typedef enum _PP_NPAGED_LOOKASIDE_NUMBER {
  LookasideSmallIrpList = 0,      // ordinal: 0x0
  LookasideMediumIrpList = 1,     // ordinal: 0x1
  LookasideLargeIrpList = 2,      // ordinal: 0x2
  LookasideMdlList = 3,           // ordinal: 0x3
  LookasideCreateInfoList = 4,    // ordinal: 0x4
  LookasideNameBufferList = 5,    // ordinal: 0x5
  LookasideTwilightList = 6,      // ordinal: 0x6
  LookasideCompletionList = 7,    // ordinal: 0x7
  LookasideScratchBufferList = 8, // ordinal: 0x8
  LookasideMaximumList = 9,       // ordinal: 0x9
} _PP_NPAGED_LOOKASIDE_NUMBER;

typedef enum _PS_MITIGATION_OPTION {
  PS_MITIGATION_OPTION_NX = 0,                               // ordinal: 0x0
  PS_MITIGATION_OPTION_SEHOP = 1,                            // ordinal: 0x1
  PS_MITIGATION_OPTION_FORCE_RELOCATE_IMAGES = 2,            // ordinal: 0x2
  PS_MITIGATION_OPTION_HEAP_TERMINATE = 3,                   // ordinal: 0x3
  PS_MITIGATION_OPTION_BOTTOM_UP_ASLR = 4,                   // ordinal: 0x4
  PS_MITIGATION_OPTION_HIGH_ENTROPY_ASLR = 5,                // ordinal: 0x5
  PS_MITIGATION_OPTION_STRICT_HANDLE_CHECKS = 6,             // ordinal: 0x6
  PS_MITIGATION_OPTION_WIN32K_SYSTEM_CALL_DISABLE = 7,       // ordinal: 0x7
  PS_MITIGATION_OPTION_EXTENSION_POINT_DISABLE = 8,          // ordinal: 0x8
  PS_MITIGATION_OPTION_PROHIBIT_DYNAMIC_CODE = 9,            // ordinal: 0x9
  PS_MITIGATION_OPTION_CONTROL_FLOW_GUARD = 10,              // ordinal: 0xa
  PS_MITIGATION_OPTION_BLOCK_NON_MICROSOFT_BINARIES = 11,    // ordinal: 0xb
  PS_MITIGATION_OPTION_FONT_DISABLE = 12,                    // ordinal: 0xc
  PS_MITIGATION_OPTION_IMAGE_LOAD_NO_REMOTE = 13,            // ordinal: 0xd
  PS_MITIGATION_OPTION_IMAGE_LOAD_NO_LOW_LABEL = 14,         // ordinal: 0xe
  PS_MITIGATION_OPTION_IMAGE_LOAD_PREFER_SYSTEM32 = 15,      // ordinal: 0xf
  PS_MITIGATION_OPTION_RETURN_FLOW_GUARD = 16,               // ordinal: 0x10
  PS_MITIGATION_OPTION_LOADER_INTEGRITY_CONTINUITY = 17,     // ordinal: 0x11
  PS_MITIGATION_OPTION_STRICT_CONTROL_FLOW_GUARD = 18,       // ordinal: 0x12
  PS_MITIGATION_OPTION_RESTRICT_SET_THREAD_CONTEXT = 19,     // ordinal: 0x13
  PS_MITIGATION_OPTION_ROP_STACKPIVOT = 20,                  // ordinal: 0x14
  PS_MITIGATION_OPTION_ROP_CALLER_CHECK = 21,                // ordinal: 0x15
  PS_MITIGATION_OPTION_ROP_SIMEXEC = 22,                     // ordinal: 0x16
  PS_MITIGATION_OPTION_EXPORT_ADDRESS_FILTER = 23,           // ordinal: 0x17
  PS_MITIGATION_OPTION_EXPORT_ADDRESS_FILTER_PLUS = 24,      // ordinal: 0x18
  PS_MITIGATION_OPTION_RESTRICT_CHILD_PROCESS_CREATION = 25, // ordinal: 0x19
  PS_MITIGATION_OPTION_IMPORT_ADDRESS_FILTER = 26,           // ordinal: 0x1a
  PS_MITIGATION_OPTION_MODULE_TAMPERING_PROTECTION = 27,     // ordinal: 0x1b
  PS_MITIGATION_OPTION_RESTRICT_INDIRECT_BRANCH_PREDICTION =
      28,                                                     // ordinal: 0x1c
  PS_MITIGATION_OPTION_SPECULATIVE_STORE_BYPASS_DISABLE = 29, // ordinal: 0x1d
  PS_MITIGATION_OPTION_ALLOW_DOWNGRADE_DYNAMIC_CODE_POLICY =
      30,                                                       // ordinal: 0x1e
  PS_MITIGATION_OPTION_CET_USER_SHADOW_STACKS = 31,             // ordinal: 0x1f
  PS_MITIGATION_OPTION_USER_CET_SET_CONTEXT_IP_VALIDATION = 32, // ordinal: 0x20
  PS_MITIGATION_OPTION_BLOCK_NON_CET_BINARIES = 33,             // ordinal: 0x21
  PS_MITIGATION_OPTION_XTENDED_CONTROL_FLOW_GUARD = 34,         // ordinal: 0x22
  PS_MITIGATION_OPTION_POINTER_AUTH_USER_IP = 35,               // ordinal: 0x23
  PS_MITIGATION_OPTION_CET_DYNAMIC_APIS_OUT_OF_PROC_ONLY = 36,  // ordinal: 0x24
  PS_MITIGATION_OPTION_REDIRECTION_TRUST = 37,                  // ordinal: 0x25
  PS_MITIGATION_OPTION_RESTRICT_CORE_SHARING = 38,              // ordinal: 0x26
} _PS_MITIGATION_OPTION;

typedef enum SE_WS_APPX_SIGNATURE_ORIGIN {
  SE_WS_APPX_SIGNATURE_ORIGIN_NOT_VALIDATED = 0, // ordinal: 0x0
  SE_WS_APPX_SIGNATURE_ORIGIN_UNKNOWN = 1,       // ordinal: 0x1
  SE_WS_APPX_SIGNATURE_ORIGIN_APPSTORE = 2,      // ordinal: 0x2
  SE_WS_APPX_SIGNATURE_ORIGIN_WINDOWS = 3,       // ordinal: 0x3
  SE_WS_APPX_SIGNATURE_ORIGIN_ENTERPRISE = 4,    // ordinal: 0x4
} SE_WS_APPX_SIGNATURE_ORIGIN;

typedef enum _HV_SUBNODE_TYPE {
  HvSubnodeAny = 0,      // ordinal: 0x0
  HvSubnodeSocket = 1,   // ordinal: 0x1
  HvSubnodeAmdNode = 2,  // ordinal: 0x2
  HvSubnodeL3 = 3,       // ordinal: 0x3
  HvSubnodeCount = 4,    // ordinal: 0x4
  HvSubnodeInvalid = -1, // ordinal: 0x5
} _HV_SUBNODE_TYPE;

typedef enum _HAL_DMA_CRASH_DUMP_REGISTER_TYPE {
  HalDmaCrashDumpRegisterSet1 = 0,   // ordinal: 0x0
  HalDmaCrashDumpRegisterSet2 = 1,   // ordinal: 0x1
  HalDmaCrashDumpRegisterSetMax = 2, // ordinal: 0x2
} _HAL_DMA_CRASH_DUMP_REGISTER_TYPE;

typedef enum _USER_ACTIVITY_PRESENCE {
  PowerUserPresent = 0,    // ordinal: 0x0
  PowerUserNotPresent = 1, // ordinal: 0x1
  PowerUserInactive = 2,   // ordinal: 0x2
  PowerUserMaximum = 3,    // ordinal: 0x3
  PowerUserInvalid = 3,    // ordinal: 0x4
} _USER_ACTIVITY_PRESENCE;

typedef enum _HAL_INIT_PHASE {
  HalInitPhaseBspProcEarly = 0,                         // ordinal: 0x0
  HalInitPhaseBspProcEarlyMmReady = 1,                  // ordinal: 0x1
  HalInitPhaseBspProcEarlyTimerReady = 2,               // ordinal: 0x2
  HalInitPhaseBspProcEarlyEnd = 3,                      // ordinal: 0x3
  HalInitPhasePnProcEarly = 4,                          // ordinal: 0x4
  HalInitPhasePnProcEarlyInterruptsReady = 5,           // ordinal: 0x5
  HalInitPhasePnProcEarlyEnd = 6,                       // ordinal: 0x6
  HalInitPhaseBspSystemEarly = 7,                       // ordinal: 0x7
  HalInitPhaseBspSystemEarlyAcpiReady = 8,              // ordinal: 0x8
  HalInitPhaseBspSystemEarlyHalExtensionsReady = 9,     // ordinal: 0x9
  HalInitPhaseBspSystemEarlyInterruptsAlmostReady = 10, // ordinal: 0xa
  HalInitPhaseBspSystemEarlyIommusReady = 11,           // ordinal: 0xb
  HalInitPhaseBspSystemEarlyInterruptsReady = 12,       // ordinal: 0xc
  HalInitPhaseBspSystemEarlyDmaReady = 12,              // ordinal: 0xd
  HalInitPhaseBspSystemEarlyProcReady = 13,             // ordinal: 0xe
  HalInitPhaseBspSystemEarlyHwPerfCntReady = 14,        // ordinal: 0xf
  HalInitPhaseBspSystemEarlyAllocationDone = 15,        // ordinal: 0x10
  HalInitPhaseBspSystemEarlyEnd = 16,                   // ordinal: 0x11
  HalInitPhaseBspSystemLate = 17,                       // ordinal: 0x12
  HalInitPhaseBspSystemLateEnd = 18,                    // ordinal: 0x13
  HalInitPhasePnSystemLate = 19,                        // ordinal: 0x14
  HalInitPhasePnSystemLateEnd = 20,                     // ordinal: 0x15
  HalInitPhaseAllProcStartComplete = 21,                // ordinal: 0x16
  HalInitPhaseAllProcStartCompleteEnd = 22,             // ordinal: 0x17
  HalInitPhaseExPhase1Ready = 23,                       // ordinal: 0x18
  HalInitPhaseExPhase1ReadyEnd = 24,                    // ordinal: 0x19
  HalInitPhaseAcpiPdoStarted = 25,                      // ordinal: 0x1a
  HalInitPhaseAcpiPdoStartedEnd = 26,                   // ordinal: 0x1b
  HalInitPhaseReportResources = 27,                     // ordinal: 0x1c
  HalInitPhaseReportResourcesEnd = 28,                  // ordinal: 0x1d
  HalInitPhaseReportCoreSystemResources = 29,           // ordinal: 0x1e
  HalInitPhaseReportCoreSystemResourcesEnd = 30,        // ordinal: 0x1f
  HalInitPhaseLateSystemActions = 31,                   // ordinal: 0x20
  HalInitPhaseLateSystemActionsTelemetryReady = 32,     // ordinal: 0x21
  HalInitPhaseLateSystemActionsEnd = 33,                // ordinal: 0x22
} _HAL_INIT_PHASE;

typedef enum _INTERLOCKED_RESULT {
  ResultNegative = 1, // ordinal: 0x0
  ResultZero = 0,     // ordinal: 0x1
  ResultPositive = 2, // ordinal: 0x2
} _INTERLOCKED_RESULT;

typedef enum _MEMORY_CACHING_TYPE_ORIG {
  MmFrameBufferCached = 2, // ordinal: 0x0
} _MEMORY_CACHING_TYPE_ORIG;

typedef enum _MODE {
  KernelMode = 0,  // ordinal: 0x0
  UserMode = 1,    // ordinal: 0x1
  MaximumMode = 2, // ordinal: 0x2
} _MODE;

typedef enum _HALP_DMA_MAP_BUFFER_TYPE {
  HalpDmaContiguousMapBuffer = 0,    // ordinal: 0x0
  HalpDmaNonContiguousMapBuffer = 1, // ordinal: 0x1
  HalpDmaMaximumMapBufferType = 2,   // ordinal: 0x2
} _HALP_DMA_MAP_BUFFER_TYPE;

typedef enum _REG_NOTIFY_CLASS {
  RegNtDeleteKey = 0,                     // ordinal: 0x0
  RegNtPreDeleteKey = 0,                  // ordinal: 0x1
  RegNtSetValueKey = 1,                   // ordinal: 0x2
  RegNtPreSetValueKey = 1,                // ordinal: 0x3
  RegNtDeleteValueKey = 2,                // ordinal: 0x4
  RegNtPreDeleteValueKey = 2,             // ordinal: 0x5
  RegNtSetInformationKey = 3,             // ordinal: 0x6
  RegNtPreSetInformationKey = 3,          // ordinal: 0x7
  RegNtRenameKey = 4,                     // ordinal: 0x8
  RegNtPreRenameKey = 4,                  // ordinal: 0x9
  RegNtEnumerateKey = 5,                  // ordinal: 0xa
  RegNtPreEnumerateKey = 5,               // ordinal: 0xb
  RegNtEnumerateValueKey = 6,             // ordinal: 0xc
  RegNtPreEnumerateValueKey = 6,          // ordinal: 0xd
  RegNtQueryKey = 7,                      // ordinal: 0xe
  RegNtPreQueryKey = 7,                   // ordinal: 0xf
  RegNtQueryValueKey = 8,                 // ordinal: 0x10
  RegNtPreQueryValueKey = 8,              // ordinal: 0x11
  RegNtQueryMultipleValueKey = 9,         // ordinal: 0x12
  RegNtPreQueryMultipleValueKey = 9,      // ordinal: 0x13
  RegNtPreCreateKey = 10,                 // ordinal: 0x14
  RegNtPostCreateKey = 11,                // ordinal: 0x15
  RegNtPreOpenKey = 12,                   // ordinal: 0x16
  RegNtPostOpenKey = 13,                  // ordinal: 0x17
  RegNtKeyHandleClose = 14,               // ordinal: 0x18
  RegNtPreKeyHandleClose = 14,            // ordinal: 0x19
  RegNtPostDeleteKey = 15,                // ordinal: 0x1a
  RegNtPostSetValueKey = 16,              // ordinal: 0x1b
  RegNtPostDeleteValueKey = 17,           // ordinal: 0x1c
  RegNtPostSetInformationKey = 18,        // ordinal: 0x1d
  RegNtPostRenameKey = 19,                // ordinal: 0x1e
  RegNtPostEnumerateKey = 20,             // ordinal: 0x1f
  RegNtPostEnumerateValueKey = 21,        // ordinal: 0x20
  RegNtPostQueryKey = 22,                 // ordinal: 0x21
  RegNtPostQueryValueKey = 23,            // ordinal: 0x22
  RegNtPostQueryMultipleValueKey = 24,    // ordinal: 0x23
  RegNtPostKeyHandleClose = 25,           // ordinal: 0x24
  RegNtPreCreateKeyEx = 26,               // ordinal: 0x25
  RegNtPostCreateKeyEx = 27,              // ordinal: 0x26
  RegNtPreOpenKeyEx = 28,                 // ordinal: 0x27
  RegNtPostOpenKeyEx = 29,                // ordinal: 0x28
  RegNtPreFlushKey = 30,                  // ordinal: 0x29
  RegNtPostFlushKey = 31,                 // ordinal: 0x2a
  RegNtPreLoadKey = 32,                   // ordinal: 0x2b
  RegNtPostLoadKey = 33,                  // ordinal: 0x2c
  RegNtPreUnLoadKey = 34,                 // ordinal: 0x2d
  RegNtPostUnLoadKey = 35,                // ordinal: 0x2e
  RegNtPreQueryKeySecurity = 36,          // ordinal: 0x2f
  RegNtPostQueryKeySecurity = 37,         // ordinal: 0x30
  RegNtPreSetKeySecurity = 38,            // ordinal: 0x31
  RegNtPostSetKeySecurity = 39,           // ordinal: 0x32
  RegNtCallbackObjectContextCleanup = 40, // ordinal: 0x33
  RegNtPreRestoreKey = 41,                // ordinal: 0x34
  RegNtPostRestoreKey = 42,               // ordinal: 0x35
  RegNtPreSaveKey = 43,                   // ordinal: 0x36
  RegNtPostSaveKey = 44,                  // ordinal: 0x37
  RegNtPreReplaceKey = 45,                // ordinal: 0x38
  RegNtPostReplaceKey = 46,               // ordinal: 0x39
  RegNtPreQueryKeyName = 47,              // ordinal: 0x3a
  RegNtPostQueryKeyName = 48,             // ordinal: 0x3b
  RegNtPreSaveMergedKey = 49,             // ordinal: 0x3c
  RegNtPostSaveMergedKey = 50,            // ordinal: 0x3d
  MaxRegNtNotifyClass = 51,               // ordinal: 0x3e
} _REG_NOTIFY_CLASS;

typedef enum _MCA_AMD_BLOCK_TYPE {
  McaAMDBlockTypeLS = 0,       // ordinal: 0x0
  McaAMDBlockTypeIF = 1,       // ordinal: 0x1
  McaAMDBlockTypeL2 = 2,       // ordinal: 0x2
  McaAMDBlockTypeDE = 3,       // ordinal: 0x3
  McaAMDBlockTypeRAZ = 4,      // ordinal: 0x4
  McaAMDBlockTypeEX = 5,       // ordinal: 0x5
  McaAMDBlockTypeFP = 6,       // ordinal: 0x6
  McaAMDBlockTypeL3 = 7,       // ordinal: 0x7
  McaAMDBlockTypeUMC = 8,      // ordinal: 0x8
  McaAMDBlockTypeSMU = 9,      // ordinal: 0x9
  McaAMDBlockTypePSP = 10,     // ordinal: 0xa
  McaAMDBlockTypePB = 11,      // ordinal: 0xb
  McaAMDBlockTypeCS = 12,      // ordinal: 0xc
  McaAMDBlockTypePIE = 13,     // ordinal: 0xd
  McaAMDBlockTypeMP5 = 14,     // ordinal: 0xe
  McaAMDBlockTypeNBIO = 15,    // ordinal: 0xf
  McaAMDBlockTypePCIe = 16,    // ordinal: 0x10
  McaAMDBlockTypeUnknown = 17, // ordinal: 0x11
} _MCA_AMD_BLOCK_TYPE;

typedef enum _DEVICE_WAKE_DEPTH {
  DeviceWakeDepthNotWakeable = 0, // ordinal: 0x0
  DeviceWakeDepthD0 = 1,          // ordinal: 0x1
  DeviceWakeDepthD1 = 2,          // ordinal: 0x2
  DeviceWakeDepthD2 = 3,          // ordinal: 0x3
  DeviceWakeDepthD3hot = 4,       // ordinal: 0x4
  DeviceWakeDepthD3cold = 5,      // ordinal: 0x5
  DeviceWakeDepthMaximum = 6,     // ordinal: 0x6
} _DEVICE_WAKE_DEPTH;

typedef enum _DEVICE_POWER_STATE {
  PowerDeviceUnspecified = 0, // ordinal: 0x0
  PowerDeviceD0 = 1,          // ordinal: 0x1
  PowerDeviceD1 = 2,          // ordinal: 0x2
  PowerDeviceD2 = 3,          // ordinal: 0x3
  PowerDeviceD3 = 4,          // ordinal: 0x4
  PowerDeviceMaximum = 5,     // ordinal: 0x5
} _DEVICE_POWER_STATE;

typedef enum _EVENT_TYPE {
  NotificationEvent = 0,    // ordinal: 0x0
  SynchronizationEvent = 1, // ordinal: 0x1
} _EVENT_TYPE;

typedef enum _EX_POOL_PRIORITY {
  LowPoolPriority = 0,                        // ordinal: 0x0
  LowPoolPrioritySpecialPoolOverrun = 8,      // ordinal: 0x1
  LowPoolPrioritySpecialPoolUnderrun = 9,     // ordinal: 0x2
  NormalPoolPriority = 16,                    // ordinal: 0x3
  NormalPoolPrioritySpecialPoolOverrun = 24,  // ordinal: 0x4
  NormalPoolPrioritySpecialPoolUnderrun = 25, // ordinal: 0x5
  HighPoolPriority = 32,                      // ordinal: 0x6
  HighPoolPrioritySpecialPoolOverrun = 40,    // ordinal: 0x7
  HighPoolPrioritySpecialPoolUnderrun = 41,   // ordinal: 0x8
} _EX_POOL_PRIORITY;

typedef enum _LDR_DDAG_STATE {
  LdrModulesMerged = -5,                // ordinal: 0x0
  LdrModulesInitError = -4,             // ordinal: 0x1
  LdrModulesSnapError = -3,             // ordinal: 0x2
  LdrModulesUnloaded = -2,              // ordinal: 0x3
  LdrModulesUnloading = -1,             // ordinal: 0x4
  LdrModulesPlaceHolder = 0,            // ordinal: 0x5
  LdrModulesMapping = 1,                // ordinal: 0x6
  LdrModulesMapped = 2,                 // ordinal: 0x7
  LdrModulesWaitingForDependencies = 3, // ordinal: 0x8
  LdrModulesSnapping = 4,               // ordinal: 0x9
  LdrModulesSnapped = 5,                // ordinal: 0xa
  LdrModulesCondensed = 6,              // ordinal: 0xb
  LdrModulesReadyToInit = 7,            // ordinal: 0xc
  LdrModulesInitializing = 8,           // ordinal: 0xd
  LdrModulesReadyToRun = 9,             // ordinal: 0xe
} _LDR_DDAG_STATE;

typedef enum _LDR_HOT_PATCH_STATE {
  LdrHotPatchBaseImage = 0,      // ordinal: 0x0
  LdrHotPatchNotApplied = 1,     // ordinal: 0x1
  LdrHotPatchAppliedReverse = 2, // ordinal: 0x2
  LdrHotPatchAppliedForward = 3, // ordinal: 0x3
  LdrHotPatchFailedToPatch = 4,  // ordinal: 0x4
  LdrHotPatchStateMax = 5,       // ordinal: 0x5
} _LDR_HOT_PATCH_STATE;

typedef enum _LDR_DLL_LOAD_REASON {
  LoadReasonStaticDependency = 0,           // ordinal: 0x0
  LoadReasonStaticForwarderDependency = 1,  // ordinal: 0x1
  LoadReasonDynamicForwarderDependency = 2, // ordinal: 0x2
  LoadReasonDelayloadDependency = 3,        // ordinal: 0x3
  LoadReasonDynamicLoad = 4,                // ordinal: 0x4
  LoadReasonAsImageLoad = 5,                // ordinal: 0x5
  LoadReasonAsDataLoad = 6,                 // ordinal: 0x6
  LoadReasonEnclavePrimary = 7,             // ordinal: 0x7
  LoadReasonEnclaveDependency = 8,          // ordinal: 0x8
  LoadReasonPatchImage = 9,                 // ordinal: 0x9
  LoadReasonUnknown = -1,                   // ordinal: 0xa
} _LDR_DLL_LOAD_REASON;

typedef enum _KERNEL_STACK_LIMITS {
  BugcheckStackLimits = 0,     // ordinal: 0x0
  DPCStackLimits = 1,          // ordinal: 0x1
  ExpandedStackLimits = 2,     // ordinal: 0x2
  NormalStackLimits = 3,       // ordinal: 0x3
  Win32kStackLimits = 4,       // ordinal: 0x4
  SwapBusyStackLimits = 5,     // ordinal: 0x5
  IsrStackLimits = 6,          // ordinal: 0x6
  DebuggerStackLimits = 7,     // ordinal: 0x7
  NmiStackLimits = 8,          // ordinal: 0x8
  MachineCheckStackLimits = 9, // ordinal: 0x9
  ExceptionStackLimits = 10,   // ordinal: 0xa
  MaximumStackLimits = 11,     // ordinal: 0xb
} _KERNEL_STACK_LIMITS;

typedef enum _DUMP_EVENTS {
  DUMP_EVENT_NONE = 0,             // ordinal: 0x0
  DUMP_EVENT_HIBER_RESUME = 1,     // ordinal: 0x1
  DUMP_EVENT_HIBER_RESUME_END = 2, // ordinal: 0x2
} _DUMP_EVENTS;

typedef enum _POP_IO_STATUS {
  IoReady = 0,   // ordinal: 0x0
  IoPending = 1, // ordinal: 0x1
  IoDone = 2,    // ordinal: 0x2
} _POP_IO_STATUS;

typedef enum _POP_POWER_ACTION_WATCHDOG_STATE {
  PopPowerActionWatchdogStateDisabled = 0,      // ordinal: 0x0
  PopPowerActionWatchdogStateTransitioning = 1, // ordinal: 0x1
  PopPowerActionWatchdogStateResuming = 2,      // ordinal: 0x2
  PopPowerActionWatchdogStateMax = 3,           // ordinal: 0x3
} _POP_POWER_ACTION_WATCHDOG_STATE;

typedef enum SYSTEM_POWER_CONDITION {
  PoAc = 0,               // ordinal: 0x0
  PoDc = 1,               // ordinal: 0x1
  PoHot = 2,              // ordinal: 0x2
  PoConditionMaximum = 3, // ordinal: 0x3
} SYSTEM_POWER_CONDITION;

typedef enum _REQUESTER_TYPE {
  KernelRequester = 0,            // ordinal: 0x0
  UserProcessRequester = 1,       // ordinal: 0x1
  UserSharedServiceRequester = 2, // ordinal: 0x2
} _REQUESTER_TYPE;

// 0x4 bytes (sizeof)
typedef struct FEATURE_STATE_CHANGE_SUBSCRIPTION__ {
  LONG unused; // offset: 0x0 ordinal: 0x0
} FEATURE_STATE_CHANGE_SUBSCRIPTION__;

typedef enum _ETW_NOTIFICATION_TYPE {
  EtwNotificationTypeNoReply = 1,                // ordinal: 0x0
  EtwNotificationTypeLegacyEnable = 2,           // ordinal: 0x1
  EtwNotificationTypeEnable = 3,                 // ordinal: 0x2
  EtwNotificationTypePrivateLogger = 4,          // ordinal: 0x3
  EtwNotificationTypePerflib = 5,                // ordinal: 0x4
  EtwNotificationTypeAudio = 6,                  // ordinal: 0x5
  EtwNotificationTypeSession = 7,                // ordinal: 0x6
  EtwNotificationTypeReserved = 8,               // ordinal: 0x7
  EtwNotificationTypeCredentialUI = 9,           // ordinal: 0x8
  EtwNotificationTypeInProcSession = 10,         // ordinal: 0x9
  EtwNotificationTypeFilteredPrivateLogger = 11, // ordinal: 0xa
  EtwNotificationTypeMax = 12,                   // ordinal: 0xb
} _ETW_NOTIFICATION_TYPE;

typedef enum _EXQUEUEINDEX {
  ExPoolUntrusted = 0, // ordinal: 0x0
  IoPoolUntrusted = 1, // ordinal: 0x1
  ExPoolMax = 8,       // ordinal: 0x2
} _EXQUEUEINDEX;

typedef enum _PNP_DEVICE_IOMMU_DOMAIN_POLICY {
  IommuDomainPolicyAllowAll = 0,         // ordinal: 0x0
  IommuDomainPolicyBlockPassthrough = 1, // ordinal: 0x1
  IommuDomainPolicyMax = 2,              // ordinal: 0x2
} _PNP_DEVICE_IOMMU_DOMAIN_POLICY;

// 0x4 bytes (sizeof)
typedef struct __anon_3857 {
  enum _PNP_DEVICE_IOMMU_DOMAIN_POLICY DomainPolicy; // offset: 0x0 ordinal: 0x0
} __anon_3857;

typedef enum _PNP_DEVICE_ACTION_REQUEST {
  AssignResources = 0,                 // ordinal: 0x0
  ClearDeviceProblem = 1,              // ordinal: 0x1
  ClearProblem = 2,                    // ordinal: 0x2
  ClearEjectProblem = 3,               // ordinal: 0x3
  ReservedAction0 = 4,                 // ordinal: 0x4
  QueryPowerRelations = 5,             // ordinal: 0x5
  Rebalance = 6,                       // ordinal: 0x6
  ReenumerateBootDevices = 7,          // ordinal: 0x7
  ReenumerateDeviceOnly = 8,           // ordinal: 0x8
  ReenumerateDeviceTree = 9,           // ordinal: 0x9
  ReenumerateRootDevices = 10,         // ordinal: 0xa
  RequeryDeviceState = 11,             // ordinal: 0xb
  ResetDevice = 12,                    // ordinal: 0xc
  ResourceRequirementsChanged = 13,    // ordinal: 0xd
  RestartEnumeration = 14,             // ordinal: 0xe
  SetDeviceProblem = 15,               // ordinal: 0xf
  StartDevice = 16,                    // ordinal: 0x10
  StartSystemDevicesPass0 = 17,        // ordinal: 0x11
  StartSystemDevicesPass1 = 18,        // ordinal: 0x12
  NotifyTransportRelationsChange = 19, // ordinal: 0x13
  NotifyEjectionRelationsChange = 20,  // ordinal: 0x14
  ConfigureDevice = 21,                // ordinal: 0x15
  ConfigureDeviceClass = 22,           // ordinal: 0x16
  ConfigureDeviceExtensions = 23,      // ordinal: 0x17
  ConfigureDeviceReset = 24,           // ordinal: 0x18
  ClearDmaGuardProblem = 25,           // ordinal: 0x19
  RequestDeviceReset = 26,             // ordinal: 0x1a
  UpdateConsoleLockState = 27,         // ordinal: 0x1b
  PnpDeviceActionRequestMax = 28,      // ordinal: 0x1c
} _PNP_DEVICE_ACTION_REQUEST;

typedef enum POWER_POLICY_DEVICE_TYPE {
  PolicyDeviceSystemButton = 0,                    // ordinal: 0x0
  PolicyDeviceThermalZone = 1,                     // ordinal: 0x1
  PolicyDeviceBattery = 2,                         // ordinal: 0x2
  PolicyDeviceMemory = 3,                          // ordinal: 0x3
  PolicyInitiatePowerActionAPI = 4,                // ordinal: 0x4
  PolicySetPowerStateAPI = 5,                      // ordinal: 0x5
  PolicyImmediateDozeS4 = 6,                       // ordinal: 0x6
  PolicySystemIdle = 7,                            // ordinal: 0x7
  PolicyDeviceWakeAlarm = 8,                       // ordinal: 0x8
  PolicyDeviceFan = 9,                             // ordinal: 0x9
  PolicyCsBatterySaver = 10,                       // ordinal: 0xa
  PolicyImmediateDozeS4Predicted = 11,             // ordinal: 0xb
  PolicyImmediateDozeS4PredictedNoWake = 12,       // ordinal: 0xc
  PolicyImmediateDozeS4AdaptiveBudget = 13,        // ordinal: 0xd
  PolicyImmediateDozeS4AdaptiveReserveNoWake = 14, // ordinal: 0xe
  PolicySystemInitiatedShutdown = 15,              // ordinal: 0xf
  PolicyDeviceMax = 16,                            // ordinal: 0x10
} POWER_POLICY_DEVICE_TYPE;

typedef enum _ARBITER_RESULT {
  ArbiterResultUndefined = -1,       // ordinal: 0x0
  ArbiterResultSuccess = 0,          // ordinal: 0x1
  ArbiterResultExternalConflict = 1, // ordinal: 0x2
  ArbiterResultNullRequest = 2,      // ordinal: 0x3
} _ARBITER_RESULT;

typedef enum _ARBITER_ACTION {
  ArbiterActionTestAllocation = 0,          // ordinal: 0x0
  ArbiterActionRetestAllocation = 1,        // ordinal: 0x1
  ArbiterActionCommitAllocation = 2,        // ordinal: 0x2
  ArbiterActionRollbackAllocation = 3,      // ordinal: 0x3
  ArbiterActionQueryAllocatedResources = 4, // ordinal: 0x4
  ArbiterActionWriteReservedResources = 5,  // ordinal: 0x5
  ArbiterActionQueryConflict = 6,           // ordinal: 0x6
  ArbiterActionQueryArbitrate = 7,          // ordinal: 0x7
  ArbiterActionAddReserved = 8,             // ordinal: 0x8
  ArbiterActionBootAllocation = 9,          // ordinal: 0x9
} _ARBITER_ACTION;

typedef enum _MI_PFN_CACHE_ATTRIBUTE {
  MiNonCached = 0,     // ordinal: 0x0
  MiCached = 1,        // ordinal: 0x1
  MiWriteCombined = 2, // ordinal: 0x2
  MiNotMapped = 3,     // ordinal: 0x3
} _MI_PFN_CACHE_ATTRIBUTE;

typedef enum _MI_PAGE_HASH_ERROR_BEHAVIOR {
  MiPageHashErrorBugcheck = 0,    // ordinal: 0x0
  MiPageHashErrorReturnError = 1, // ordinal: 0x1
  MiPageHashErrorIgnore = 2,      // ordinal: 0x2
} _MI_PAGE_HASH_ERROR_BEHAVIOR;

typedef enum _IOMMU_DEVICE_CREATION_CONFIGURATION_TYPE {
  IommuDeviceCreationConfigTypeNone = 0,     // ordinal: 0x0
  IommuDeviceCreationConfigTypeAcpi = 1,     // ordinal: 0x1
  IommuDeviceCreationConfigTypeDeviceId = 2, // ordinal: 0x2
  IommuDeviceCreationConfigTypeMax = 3,      // ordinal: 0x3
} _IOMMU_DEVICE_CREATION_CONFIGURATION_TYPE;

typedef enum _IOMMU_MAP_PHYSICAL_ADDRESS_TYPE {
  MapPhysicalAddressTypeMdl = 0,             // ordinal: 0x0
  MapPhysicalAddressTypeContiguousRange = 1, // ordinal: 0x1
  MapPhysicalAddressTypePfn = 2,             // ordinal: 0x2
  MapPhysicalAddressTypeMax = 3,             // ordinal: 0x3
} _IOMMU_MAP_PHYSICAL_ADDRESS_TYPE;

typedef enum _BOOT_ENTROPY_SOURCE_RESULT_CODE {
  BootEntropySourceStructureUninitialized = 0, // ordinal: 0x0
  BootEntropySourceDisabledByPolicy = 1,       // ordinal: 0x1
  BootEntropySourceNotPresent = 2,             // ordinal: 0x2
  BootEntropySourceError = 3,                  // ordinal: 0x3
  BootEntropySourceSuccess = 4,                // ordinal: 0x4
} _BOOT_ENTROPY_SOURCE_RESULT_CODE;

typedef enum _BOOT_ENTROPY_SOURCE_ID {
  BootEntropySourceNone = 0,       // ordinal: 0x0
  BootEntropySourceSeedfile = 1,   // ordinal: 0x1
  BootEntropySourceExternal = 2,   // ordinal: 0x2
  BootEntropySourceTpm = 3,        // ordinal: 0x3
  BootEntropySourceRdrand = 4,     // ordinal: 0x4
  BootEntropySourceTime = 5,       // ordinal: 0x5
  BootEntropySourceAcpiOem0 = 6,   // ordinal: 0x6
  BootEntropySourceUefi = 7,       // ordinal: 0x7
  BootEntropySourceCng = 8,        // ordinal: 0x8
  BootEntropySourceTcbTpm = 9,     // ordinal: 0x9
  BootEntropySourceTcbRdrand = 10, // ordinal: 0xa
  BootMaxEntropySources = 10,      // ordinal: 0xb
} _BOOT_ENTROPY_SOURCE_ID;

typedef enum _DOMAIN_CONFIGURATION_ARCH {
  DomainConfigurationArm64 = 0,   // ordinal: 0x0
  DomainConfigurationX64 = 1,     // ordinal: 0x1
  DomainConfigurationInvalid = 2, // ordinal: 0x2
} _DOMAIN_CONFIGURATION_ARCH;

typedef enum _CONFIGURATION_TYPE {
  ArcSystem = 0,                // ordinal: 0x0
  CentralProcessor = 1,         // ordinal: 0x1
  FloatingPointProcessor = 2,   // ordinal: 0x2
  PrimaryIcache = 3,            // ordinal: 0x3
  PrimaryDcache = 4,            // ordinal: 0x4
  SecondaryIcache = 5,          // ordinal: 0x5
  SecondaryDcache = 6,          // ordinal: 0x6
  SecondaryCache = 7,           // ordinal: 0x7
  EisaAdapter = 8,              // ordinal: 0x8
  TcAdapter = 9,                // ordinal: 0x9
  ScsiAdapter = 10,             // ordinal: 0xa
  DtiAdapter = 11,              // ordinal: 0xb
  MultiFunctionAdapter = 12,    // ordinal: 0xc
  DiskController = 13,          // ordinal: 0xd
  TapeController = 14,          // ordinal: 0xe
  CdromController = 15,         // ordinal: 0xf
  WormController = 16,          // ordinal: 0x10
  SerialController = 17,        // ordinal: 0x11
  NetworkController = 18,       // ordinal: 0x12
  DisplayController = 19,       // ordinal: 0x13
  ParallelController = 20,      // ordinal: 0x14
  PointerController = 21,       // ordinal: 0x15
  KeyboardController = 22,      // ordinal: 0x16
  AudioController = 23,         // ordinal: 0x17
  OtherController = 24,         // ordinal: 0x18
  DiskPeripheral = 25,          // ordinal: 0x19
  FloppyDiskPeripheral = 26,    // ordinal: 0x1a
  TapePeripheral = 27,          // ordinal: 0x1b
  ModemPeripheral = 28,         // ordinal: 0x1c
  MonitorPeripheral = 29,       // ordinal: 0x1d
  PrinterPeripheral = 30,       // ordinal: 0x1e
  PointerPeripheral = 31,       // ordinal: 0x1f
  KeyboardPeripheral = 32,      // ordinal: 0x20
  TerminalPeripheral = 33,      // ordinal: 0x21
  OtherPeripheral = 34,         // ordinal: 0x22
  LinePeripheral = 35,          // ordinal: 0x23
  NetworkPeripheral = 36,       // ordinal: 0x24
  SystemMemory = 37,            // ordinal: 0x25
  DockingInformation = 38,      // ordinal: 0x26
  RealModeIrqRoutingTable = 39, // ordinal: 0x27
  RealModePCIEnumeration = 40,  // ordinal: 0x28
  MaximumType = 41,             // ordinal: 0x29
} _CONFIGURATION_TYPE;

typedef enum _CONFIGURATION_CLASS {
  SystemClass = 0,     // ordinal: 0x0
  ProcessorClass = 1,  // ordinal: 0x1
  CacheClass = 2,      // ordinal: 0x2
  AdapterClass = 3,    // ordinal: 0x3
  ControllerClass = 4, // ordinal: 0x4
  PeripheralClass = 5, // ordinal: 0x5
  MemoryClass = 6,     // ordinal: 0x6
  MaximumClass = 7,    // ordinal: 0x7
} _CONFIGURATION_CLASS;

typedef enum KD_CALLBACK_ACTION {
  KdConfigureDeviceAndContinue = 0, // ordinal: 0x0
  KdSkipDeviceAndContinue = 1,      // ordinal: 0x1
  KdConfigureDeviceAndStop = 2,     // ordinal: 0x2
  KdSkipDeviceAndStop = 3,          // ordinal: 0x3
} KD_CALLBACK_ACTION;

typedef enum _PCI_BUSMASTER_RID_TYPE {
  BusmasterRidInvalid = 0,             // ordinal: 0x0
  BusmasterRidFromDeviceRid = 1,       // ordinal: 0x1
  BusmasterRidFromBridgeRid = 2,       // ordinal: 0x2
  BusmasterRidFromMultipleBridges = 3, // ordinal: 0x3
} _PCI_BUSMASTER_RID_TYPE;

typedef enum KD_NAMESPACE_ENUM {
  KdNameSpacePCI = 0,  // ordinal: 0x0
  KdNameSpaceACPI = 1, // ordinal: 0x1
  KdNameSpaceAny = 2,  // ordinal: 0x2
  KdNameSpaceNone = 3, // ordinal: 0x3
  KdNameSpaceMax = 4,  // ordinal: 0x4
} KD_NAMESPACE_ENUM;

typedef enum _HAL_PROCESSOR_STAT_TYPE {
  HalProcessorStatResidency = 0, // ordinal: 0x0
  HalProcessorStatCount = 1,     // ordinal: 0x1
  HalProcessorStatMax = 2,       // ordinal: 0x2
} _HAL_PROCESSOR_STAT_TYPE;

typedef enum _HAL_CLOCK_TIMER_MODE {
  HalClockTimerModePeriodic = 0, // ordinal: 0x0
  HalClockTimerModeOneShot = 1,  // ordinal: 0x1
  HalClockTimerModeMax = 2,      // ordinal: 0x2
} _HAL_CLOCK_TIMER_MODE;

typedef enum _BUS_DATA_TYPE {
  ConfigurationSpaceUndefined = -1, // ordinal: 0x0
  Cmos = 0,                         // ordinal: 0x1
  EisaConfiguration = 1,            // ordinal: 0x2
  Pos = 2,                          // ordinal: 0x3
  CbusConfiguration = 3,            // ordinal: 0x4
  PCIConfiguration = 4,             // ordinal: 0x5
  VMEConfiguration = 5,             // ordinal: 0x6
  NuBusConfiguration = 6,           // ordinal: 0x7
  PCMCIAConfiguration = 7,          // ordinal: 0x8
  MPIConfiguration = 8,             // ordinal: 0x9
  MPSAConfiguration = 9,            // ordinal: 0xa
  PNPISAConfiguration = 10,         // ordinal: 0xb
  SgiInternalConfiguration = 11,    // ordinal: 0xc
  MaximumBusDataType = 12,          // ordinal: 0xd
} _BUS_DATA_TYPE;

typedef enum _TYPE_OF_MEMORY {
  LoaderExceptionBlock = 0,       // ordinal: 0x0
  LoaderSystemBlock = 1,          // ordinal: 0x1
  LoaderFree = 2,                 // ordinal: 0x2
  LoaderBad = 3,                  // ordinal: 0x3
  LoaderLoadedProgram = 4,        // ordinal: 0x4
  LoaderFirmwareTemporary = 5,    // ordinal: 0x5
  LoaderFirmwarePermanent = 6,    // ordinal: 0x6
  LoaderOsloaderHeap = 7,         // ordinal: 0x7
  LoaderOsloaderStack = 8,        // ordinal: 0x8
  LoaderSystemCode = 9,           // ordinal: 0x9
  LoaderHalCode = 10,             // ordinal: 0xa
  LoaderBootDriver = 11,          // ordinal: 0xb
  LoaderConsoleInDriver = 12,     // ordinal: 0xc
  LoaderConsoleOutDriver = 13,    // ordinal: 0xd
  LoaderStartupDpcStack = 14,     // ordinal: 0xe
  LoaderStartupKernelStack = 15,  // ordinal: 0xf
  LoaderStartupPanicStack = 16,   // ordinal: 0x10
  LoaderStartupPcrPage = 17,      // ordinal: 0x11
  LoaderStartupPdrPage = 18,      // ordinal: 0x12
  LoaderRegistryData = 19,        // ordinal: 0x13
  LoaderMemoryData = 20,          // ordinal: 0x14
  LoaderNlsData = 21,             // ordinal: 0x15
  LoaderSpecialMemory = 22,       // ordinal: 0x16
  LoaderBBTMemory = 23,           // ordinal: 0x17
  LoaderZero = 24,                // ordinal: 0x18
  LoaderXIPRom = 25,              // ordinal: 0x19
  LoaderHALCachedMemory = 26,     // ordinal: 0x1a
  LoaderLargePageFiller = 27,     // ordinal: 0x1b
  LoaderErrorLogMemory = 28,      // ordinal: 0x1c
  LoaderVsmMemory = 29,           // ordinal: 0x1d
  LoaderFirmwareCode = 30,        // ordinal: 0x1e
  LoaderFirmwareData = 31,        // ordinal: 0x1f
  LoaderFirmwareReserved = 32,    // ordinal: 0x20
  LoaderEnclaveMemory = 33,       // ordinal: 0x21
  LoaderFirmwareKsr = 34,         // ordinal: 0x22
  LoaderEnclaveKsr = 35,          // ordinal: 0x23
  LoaderSkMemory = 36,            // ordinal: 0x24
  LoaderSkFirmwareReserved = 37,  // ordinal: 0x25
  LoaderIoSpaceMemoryZeroed = 38, // ordinal: 0x26
  LoaderIoSpaceMemoryFree = 39,   // ordinal: 0x27
  LoaderIoSpaceMemoryKsr = 40,    // ordinal: 0x28
  LoaderKernelShadowStack = 41,   // ordinal: 0x29
  LoaderIsolatedHostVisible = 42, // ordinal: 0x2a
  LoaderIsolatedKsr = 43,         // ordinal: 0x2b
  LoaderMaximum = 44,             // ordinal: 0x2c
} _TYPE_OF_MEMORY;

typedef enum HAL_APIC_DESTINATION_MODE {
  ApicDestinationModePhysical = 1,         // ordinal: 0x0
  ApicDestinationModeLogicalFlat = 2,      // ordinal: 0x1
  ApicDestinationModeLogicalClustered = 3, // ordinal: 0x2
  ApicDestinationModeUnknown = 4,          // ordinal: 0x3
} HAL_APIC_DESTINATION_MODE;

// 0x4 bytes (sizeof)
typedef struct __anon_3078 {
  enum HAL_APIC_DESTINATION_MODE DestinationMode; // offset: 0x0 ordinal: 0x0
} __anon_3078;

typedef enum _INTERRUPT_STEERING_MODE {
  IntSteerModeNone = 0,            // ordinal: 0x0
  IntSteerModeController = 1,      // ordinal: 0x1
  IntSteerModeRedirect = 2,        // ordinal: 0x2
  IntSteerModeControllerFixed = 3, // ordinal: 0x3
} _INTERRUPT_STEERING_MODE;

typedef enum INTERRUPT_CONNECTION_TYPE {
  InterruptTypeControllerInput = 0, // ordinal: 0x0
  InterruptTypeXapicMessage = 1,    // ordinal: 0x1
  InterruptTypeHypertransport = 2,  // ordinal: 0x2
  InterruptTypeMessageRequest = 3,  // ordinal: 0x3
} INTERRUPT_CONNECTION_TYPE;

typedef enum _VI_DEADLOCK_RESOURCE_TYPE {
  VfDeadlockUnknown = 0,               // ordinal: 0x0
  VfDeadlockMutex = 1,                 // ordinal: 0x1
  VfDeadlockMutexAbandoned = 2,        // ordinal: 0x2
  VfDeadlockFastMutex = 3,             // ordinal: 0x3
  VfDeadlockFastMutexUnsafe = 4,       // ordinal: 0x4
  VfDeadlockSpinLock = 5,              // ordinal: 0x5
  VfDeadlockInStackQueuedSpinLock = 6, // ordinal: 0x6
  VfDeadlockUnusedSpinLock = 7,        // ordinal: 0x7
  VfDeadlockEresource = 8,             // ordinal: 0x8
  VfDeadlockTypeMaximum = 9,           // ordinal: 0x9
} _VI_DEADLOCK_RESOURCE_TYPE;

typedef enum _WNF_SUBSCRIPTION_STATE {
  WNF_SUB_STATE_QUIESCENT = 0,        // ordinal: 0x0
  WNF_SUB_STATE_READY_TO_DELIVER = 1, // ordinal: 0x1
  WNF_SUB_STATE_IN_DELIVERY = 2,      // ordinal: 0x2
  WNF_SUB_STATE_RETRY = 3,            // ordinal: 0x3
} _WNF_SUBSCRIPTION_STATE;

typedef enum _SEP_CACHED_HANDLES_ENTRY_TYPE {
  SepCachedHandlesEntryLowbox = 0,       // ordinal: 0x0
  SepCachedHandlesEntryBnoIsolation = 1, // ordinal: 0x1
} _SEP_CACHED_HANDLES_ENTRY_TYPE;

typedef enum _CREATE_FILE_TYPE {
  CreateFileTypeNone = 0,      // ordinal: 0x0
  CreateFileTypeNamedPipe = 1, // ordinal: 0x1
  CreateFileTypeMailslot = 2,  // ordinal: 0x2
} _CREATE_FILE_TYPE;

typedef enum _IOP_PRIORITY_HINT {
  IopIoPriorityNotSet = 0,   // ordinal: 0x0
  IopIoPriorityVeryLow = 1,  // ordinal: 0x1
  IopIoPriorityLow = 2,      // ordinal: 0x2
  IopIoPriorityNormal = 3,   // ordinal: 0x3
  IopIoPriorityHigh = 4,     // ordinal: 0x4
  IopIoPriorityCritical = 5, // ordinal: 0x5
  MaxIopIoPriorityTypes = 6, // ordinal: 0x6
} _IOP_PRIORITY_HINT;

typedef enum _SECURITY_OPERATION_CODE {
  SetSecurityDescriptor = 0,    // ordinal: 0x0
  QuerySecurityDescriptor = 1,  // ordinal: 0x1
  DeleteSecurityDescriptor = 2, // ordinal: 0x2
  AssignSecurityDescriptor = 3, // ordinal: 0x3
} _SECURITY_OPERATION_CODE;

typedef enum _OB_OPEN_REASON {
  ObCreateHandle = 0,    // ordinal: 0x0
  ObOpenHandle = 1,      // ordinal: 0x1
  ObDuplicateHandle = 2, // ordinal: 0x2
  ObInheritHandle = 3,   // ordinal: 0x3
  ObMaxOpenReason = 4,   // ordinal: 0x4
} _OB_OPEN_REASON;

typedef enum _BLOB_ID {
  BLOB_TYPE_UNKNOWN = 0,          // ordinal: 0x0
  BLOB_TYPE_CONNECTION_INFO = 1,  // ordinal: 0x1
  BLOB_TYPE_MESSAGE = 2,          // ordinal: 0x2
  BLOB_TYPE_SECURITY_CONTEXT = 3, // ordinal: 0x3
  BLOB_TYPE_SECTION = 4,          // ordinal: 0x4
  BLOB_TYPE_REGION = 5,           // ordinal: 0x5
  BLOB_TYPE_VIEW = 6,             // ordinal: 0x6
  BLOB_TYPE_RESERVE = 7,          // ordinal: 0x7
  BLOB_TYPE_DIRECT_TRANSFER = 8,  // ordinal: 0x8
  BLOB_TYPE_HANDLE_DATA = 9,      // ordinal: 0x9
  BLOB_TYPE_MAX_ID = 10,          // ordinal: 0xa
} _BLOB_ID;

typedef enum _RTLP_HP_LOCK_TYPE {
  HeapLockPaged = 0,    // ordinal: 0x0
  HeapLockNonPaged = 1, // ordinal: 0x1
  HeapLockTypeMax = 2,  // ordinal: 0x2
} _RTLP_HP_LOCK_TYPE;

typedef enum _HEAP_FAILURE_TYPE {
  heap_failure_internal = 0,                       // ordinal: 0x0
  heap_failure_unknown = 1,                        // ordinal: 0x1
  heap_failure_generic = 2,                        // ordinal: 0x2
  heap_failure_entry_corruption = 3,               // ordinal: 0x3
  heap_failure_multiple_entries_corruption = 4,    // ordinal: 0x4
  heap_failure_virtual_block_corruption = 5,       // ordinal: 0x5
  heap_failure_buffer_overrun = 6,                 // ordinal: 0x6
  heap_failure_buffer_underrun = 7,                // ordinal: 0x7
  heap_failure_block_not_busy = 8,                 // ordinal: 0x8
  heap_failure_invalid_argument = 9,               // ordinal: 0x9
  heap_failure_invalid_allocation_type = 10,       // ordinal: 0xa
  heap_failure_usage_after_free = 11,              // ordinal: 0xb
  heap_failure_cross_heap_operation = 12,          // ordinal: 0xc
  heap_failure_freelists_corruption = 13,          // ordinal: 0xd
  heap_failure_listentry_corruption = 14,          // ordinal: 0xe
  heap_failure_lfh_bitmap_mismatch = 15,           // ordinal: 0xf
  heap_failure_segment_lfh_bitmap_corruption = 16, // ordinal: 0x10
  heap_failure_segment_lfh_double_free = 17,       // ordinal: 0x11
  heap_failure_vs_subsegment_corruption = 18,      // ordinal: 0x12
  heap_failure_null_heap = 19,                     // ordinal: 0x13
  heap_failure_allocation_limit = 20,              // ordinal: 0x14
  heap_failure_commit_limit = 21,                  // ordinal: 0x15
  heap_failure_invalid_va_mgr_query = 22,          // ordinal: 0x16
} _HEAP_FAILURE_TYPE;

typedef enum _RTLP_HP_ADDRESS_SPACE_TYPE {
  HeapAddressUser = 0,    // ordinal: 0x0
  HeapAddressKernel = 1,  // ordinal: 0x1
  HeapAddressSession = 2, // ordinal: 0x2
  HeapAddressSecure = 3,  // ordinal: 0x3
  HeapAddressTypeMax = 4, // ordinal: 0x4
} _RTLP_HP_ADDRESS_SPACE_TYPE;

typedef enum _WORKER_FUNCTION {
  NoopFunction = 0,             // ordinal: 0x0
  ReadAhead = 1,                // ordinal: 0x1
  WriteBehind = 2,              // ordinal: 0x2
  LazyWriteScan = 3,            // ordinal: 0x3
  EventSet = 4,                 // ordinal: 0x4
  AsyncRead = 5,                // ordinal: 0x5
  CompleteAsyncRead = 6,        // ordinal: 0x6
  AsyncWriteBehind = 7,         // ordinal: 0x7
  CompleteAsyncWriteBehind = 8, // ordinal: 0x8
} _WORKER_FUNCTION;

typedef enum _CC_NUMA_TYPE {
  InvalidNumaNodeType = 0, // ordinal: 0x0
  PartitionNumaNode = 1,   // ordinal: 0x1
  VolumeNumaNode = 2,      // ordinal: 0x2
  MaxNumaNodeType = 3,     // ordinal: 0x3
} _CC_NUMA_TYPE;

typedef enum _CC_LWS_PACKET_TYPE {
  LWSPacket_Invalid = 0,    // ordinal: 0x0
  LWSPacket_Partition = 1,  // ordinal: 0x1
  LWSPacket_PrivateVCM = 2, // ordinal: 0x2
  LWSPacket_Max = 3,        // ordinal: 0x3
} _CC_LWS_PACKET_TYPE;

typedef enum _KHETERO_CPU_POLICY {
  KHeteroCpuPolicyAll = 0,         // ordinal: 0x0
  KHeteroCpuPolicyLarge = 1,       // ordinal: 0x1
  KHeteroCpuPolicyLargeOrIdle = 2, // ordinal: 0x2
  KHeteroCpuPolicySmall = 3,       // ordinal: 0x3
  KHeteroCpuPolicySmallOrIdle = 4, // ordinal: 0x4
  KHeteroCpuPolicyDynamic = 5,     // ordinal: 0x5
  KHeteroCpuPolicyStaticMax = 5,   // ordinal: 0x6
  KHeteroCpuPolicyBiasedSmall = 6, // ordinal: 0x7
  KHeteroCpuPolicyBiasedLarge = 7, // ordinal: 0x8
  KHeteroCpuPolicyDefault = 8,     // ordinal: 0x9
  KHeteroCpuPolicyMax = 9,         // ordinal: 0xa
} _KHETERO_CPU_POLICY;

typedef enum _GPIO_PIN_IORESTRICTION_TYPE {
  IoRestrictionNone = 0,            // ordinal: 0x0
  IoRestrictionInputOnly = 1,       // ordinal: 0x1
  IoRestrictionOutputOnly = 2,      // ordinal: 0x2
  IoRestrictionNoneAndPreserve = 3, // ordinal: 0x3
} _GPIO_PIN_IORESTRICTION_TYPE;

typedef enum _GPIO_PIN_CONFIG_TYPE {
  PullDefault = 0, // ordinal: 0x0
  PullUp = 1,      // ordinal: 0x1
  PullDown = 2,    // ordinal: 0x2
  PullNone = 3,    // ordinal: 0x3
} _GPIO_PIN_CONFIG_TYPE;

typedef enum _PEP_ACPI_RESOURCE_TYPE {
  PepAcpiMemory = 0,         // ordinal: 0x0
  PepAcpiIoPort = 1,         // ordinal: 0x1
  PepAcpiInterrupt = 2,      // ordinal: 0x2
  PepAcpiGpioIo = 3,         // ordinal: 0x3
  PepAcpiGpioInt = 4,        // ordinal: 0x4
  PepAcpiSpbI2c = 5,         // ordinal: 0x5
  PepAcpiSpbSpi = 6,         // ordinal: 0x6
  PepAcpiSpbUart = 7,        // ordinal: 0x7
  PepAcpiExtendedMemory = 8, // ordinal: 0x8
  PepAcpiExtendedIo = 9,     // ordinal: 0x9
} _PEP_ACPI_RESOURCE_TYPE;

typedef enum _ARBITER_REQUEST_SOURCE {
  ArbiterRequestUndefined = -1,     // ordinal: 0x0
  ArbiterRequestLegacyReported = 0, // ordinal: 0x1
  ArbiterRequestHalReported = 1,    // ordinal: 0x2
  ArbiterRequestLegacyAssigned = 2, // ordinal: 0x3
  ArbiterRequestPnpDetected = 3,    // ordinal: 0x4
  ArbiterRequestPnpEnumerated = 4,  // ordinal: 0x5
} _ARBITER_REQUEST_SOURCE;

typedef enum _INBV_PIXEL_FORMAT {
  PixelFormatUnknown = 0,    // ordinal: 0x0
  PixelFormat4BitPlanar = 1, // ordinal: 0x1
  PixelFormatR8G8B8 = 2,     // ordinal: 0x2
  PixelFormatR8G8B8X8 = 3,   // ordinal: 0x3
  PixelFormatB8G8R8 = 4,     // ordinal: 0x4
  PixelFormatB8G8R8X8 = 5,   // ordinal: 0x5
} _INBV_PIXEL_FORMAT;

typedef enum _PCW_CALLBACK_TYPE {
  PcwCallbackAddCounter = 0,         // ordinal: 0x0
  PcwCallbackRemoveCounter = 1,      // ordinal: 0x1
  PcwCallbackEnumerateInstances = 2, // ordinal: 0x2
  PcwCallbackCollectData = 3,        // ordinal: 0x3
} _PCW_CALLBACK_TYPE;

typedef enum PCW_REGISTRATION_FLAGS {
  PcwRegistrationNone = 0,        // ordinal: 0x0
  PcwRegistrationSiloNeutral = 1, // ordinal: 0x1
} PCW_REGISTRATION_FLAGS;

typedef enum _RTL_GENERIC_COMPARE_RESULTS {
  GenericLessThan = 0,    // ordinal: 0x0
  GenericGreaterThan = 1, // ordinal: 0x1
  GenericEqual = 2,       // ordinal: 0x2
} _RTL_GENERIC_COMPARE_RESULTS;

typedef enum _CM_DIRTY_VECTOR_OPERATION {
  DirtyVectorModified = 0,   // ordinal: 0x0
  DirtyDataCaptureStart = 1, // ordinal: 0x1
  DirtyDataCaptureEnd = 2,   // ordinal: 0x2
} _CM_DIRTY_VECTOR_OPERATION;

typedef enum __anon_2447 {
  KTMOH_CommitTransaction_Result = 1,   // ordinal: 0x0
  KTMOH_RollbackTransaction_Result = 2, // ordinal: 0x1
} __anon_2447;

typedef enum KTM_STATE {
  KKtmUninitialized = 0,  // ordinal: 0x0
  KKtmInitialized = 1,    // ordinal: 0x1
  KKtmRecovering = 2,     // ordinal: 0x2
  KKtmOnline = 3,         // ordinal: 0x3
  KKtmRecoveryFailed = 4, // ordinal: 0x4
  KKtmOffline = 5,        // ordinal: 0x5
} KTM_STATE;

typedef enum _KTRANSACTION_OUTCOME {
  KTxOutcomeUninitialized = 0, // ordinal: 0x0
  KTxOutcomeUndetermined = 1,  // ordinal: 0x1
  KTxOutcomeCommitted = 2,     // ordinal: 0x2
  KTxOutcomeAborted = 3,       // ordinal: 0x3
  KTxOutcomeUnavailable = 4,   // ordinal: 0x4
} _KTRANSACTION_OUTCOME;

typedef enum _KTRANSACTION_STATE {
  KTransactionUninitialized = 0, // ordinal: 0x0
  KTransactionActive = 1,        // ordinal: 0x1
  KTransactionPreparing = 2,     // ordinal: 0x2
  KTransactionPrepared = 3,      // ordinal: 0x3
  KTransactionInDoubt = 4,       // ordinal: 0x4
  KTransactionCommitted = 5,     // ordinal: 0x5
  KTransactionAborted = 6,       // ordinal: 0x6
  KTransactionDelegated = 7,     // ordinal: 0x7
  KTransactionPrePreparing = 8,  // ordinal: 0x8
  KTransactionForgotten = 9,     // ordinal: 0x9
  KTransactionRecovering = 10,   // ordinal: 0xa
  KTransactionPrePrepared = 11,  // ordinal: 0xb
} _KTRANSACTION_STATE;

typedef enum _KRESOURCEMANAGER_STATE {
  KResourceManagerUninitialized = 0, // ordinal: 0x0
  KResourceManagerOffline = 1,       // ordinal: 0x1
  KResourceManagerOnline = 2,        // ordinal: 0x2
} _KRESOURCEMANAGER_STATE;

typedef enum HSTORAGE_TYPE {
  Stable = 0,         // ordinal: 0x0
  Volatile = 1,       // ordinal: 0x1
  InvalidStorage = 2, // ordinal: 0x2
} HSTORAGE_TYPE;

typedef enum UoWActionType {
  UoWAddThisKey = 0,            // ordinal: 0x0
  UoWAddChildKey = 1,           // ordinal: 0x1
  UoWDeleteThisKey = 2,         // ordinal: 0x2
  UoWDeleteChildKey = 3,        // ordinal: 0x3
  UoWSetValueNew = 4,           // ordinal: 0x4
  UoWSetValueExisting = 5,      // ordinal: 0x5
  UoWDeleteValue = 6,           // ordinal: 0x6
  UoWSetKeyUserFlags = 7,       // ordinal: 0x7
  UoWSetLastWriteTime = 8,      // ordinal: 0x8
  UoWSetSecurityDescriptor = 9, // ordinal: 0x9
  UoWRenameSubKey = 10,         // ordinal: 0xa
  UoWRenameOldSubKey = 11,      // ordinal: 0xb
  UoWRenameNewSubKey = 12,      // ordinal: 0xc
  UoWIsolation = 13,            // ordinal: 0xd
  UoWInvalid = 14,              // ordinal: 0xe
} UoWActionType;

typedef enum _KENLISTMENT_STATE {
  KEnlistmentUninitialized = 0,           // ordinal: 0x0
  KEnlistmentActive = 256,                // ordinal: 0x1
  KEnlistmentPreparing = 257,             // ordinal: 0x2
  KEnlistmentPrepared = 258,              // ordinal: 0x3
  KEnlistmentInDoubt = 259,               // ordinal: 0x4
  KEnlistmentCommitted = 260,             // ordinal: 0x5
  KEnlistmentCommittedNotify = 261,       // ordinal: 0x6
  KEnlistmentCommitRequested = 262,       // ordinal: 0x7
  KEnlistmentAborted = 263,               // ordinal: 0x8
  KEnlistmentDelegated = 264,             // ordinal: 0x9
  KEnlistmentDelegatedDisconnected = 265, // ordinal: 0xa
  KEnlistmentPrePreparing = 266,          // ordinal: 0xb
  KEnlistmentForgotten = 267,             // ordinal: 0xc
  KEnlistmentRecovering = 268,            // ordinal: 0xd
  KEnlistmentAborting = 269,              // ordinal: 0xe
  KEnlistmentReadOnly = 270,              // ordinal: 0xf
  KEnlistmentOutcomeUnavailable = 271,    // ordinal: 0x10
  KEnlistmentOffline = 272,               // ordinal: 0x11
  KEnlistmentPrePrepared = 273,           // ordinal: 0x12
  KEnlistmentInitialized = 274,           // ordinal: 0x13
} _KENLISTMENT_STATE;

typedef enum _MI_SYSTEM_VA_TYPE {
  MiVaUnused = 0,                      // ordinal: 0x0
  MiVaSessionSpace = 1,                // ordinal: 0x1
  MiVaProcessSpace = 2,                // ordinal: 0x2
  MiVaBootLoaded = 3,                  // ordinal: 0x3
  MiVaPfnDatabase = 4,                 // ordinal: 0x4
  MiVaNonPagedPool = 5,                // ordinal: 0x5
  MiVaPagedPool = 6,                   // ordinal: 0x6
  MiVaSpecialPoolPaged = 7,            // ordinal: 0x7
  MiVaSystemCache = 8,                 // ordinal: 0x8
  MiVaSystemPtes = 9,                  // ordinal: 0x9
  MiVaHal = 10,                        // ordinal: 0xa
  MiVaFormerlySessionGlobalSpace = 11, // ordinal: 0xb
  MiVaDriverImages = 12,               // ordinal: 0xc
  MiVaSystemPtesLarge = 13,            // ordinal: 0xd
  MiVaKernelStacks = 14,               // ordinal: 0xe
  MiVaSecureNonPagedPool = 15,         // ordinal: 0xf
  MiVaKernelShadowStacks = 16,         // ordinal: 0x10
  MiVaKasan = 17,                      // ordinal: 0x11
  MiVaMaximumType = 18,                // ordinal: 0x12
} _MI_SYSTEM_VA_TYPE;

typedef enum _MI_SLAB_ALLOCATOR_TYPE {
  MiSlabAllocatorTypeSlatProtectedStart = 0,         // ordinal: 0x0
  MiSlabAllocatorTypeExecuteProtected = 0,           // ordinal: 0x1
  MiSlabAllocatorTypeReadOnlyProtected = 1,          // ordinal: 0x2
  MiSlabAllocatorTypeNoAccessProtected = 2,          // ordinal: 0x3
  MiSlabAllocatorTypeKernelShadowStackProtected = 3, // ordinal: 0x4
  MiSlabAllocatorTypeSlatProtectedLast = 3,          // ordinal: 0x5
  MiSlabAllocatorTypeSlatUnprotectedStart = 4,       // ordinal: 0x6
  MiSlabAllocatorTypeImageUnprotected = 4,           // ordinal: 0x7
  MiSlabAllocatorTypeGenericUnprotected = 5,         // ordinal: 0x8
  MiSlabAllocatorTypeNonPagedUnprotected = 6,        // ordinal: 0x9
  MiSlabAllocatorTypeSlatUnprotectedLast = 6,        // ordinal: 0xa
  MiSlabAllocatorTypeMax = 7,                        // ordinal: 0xb
} _MI_SLAB_ALLOCATOR_TYPE;

typedef enum _MMLISTS {
  ZeroedPageList = 0,          // ordinal: 0x0
  FreePageList = 1,            // ordinal: 0x1
  StandbyPageList = 2,         // ordinal: 0x2
  ModifiedPageList = 3,        // ordinal: 0x3
  ModifiedNoWritePageList = 4, // ordinal: 0x4
  BadPageList = 5,             // ordinal: 0x5
  ActiveAndValid = 6,          // ordinal: 0x6
  TransitionPage = 7,          // ordinal: 0x7
} _MMLISTS;

typedef enum wil_details_FeatureTestStateKind {
  wil_details_FeatureTestStateKind_EnabledState = 0, // ordinal: 0x0
  wil_details_FeatureTestStateKind_Variant = 1,      // ordinal: 0x1
} wil_details_FeatureTestStateKind;

typedef enum wil_FeatureEnabledState {
  wil_FeatureEnabledState_Default = 0,  // ordinal: 0x0
  wil_FeatureEnabledState_Disabled = 1, // ordinal: 0x1
  wil_FeatureEnabledState_Enabled = 2,  // ordinal: 0x2
} wil_FeatureEnabledState;

// 0x8 bytes (sizeof)
typedef struct Change {
  enum wil_details_ServiceReportingKind kind; // offset: 0x0 ordinal: 0x0
  ULONG count;                                // offset: 0x4 ordinal: 0x1
} Change;

// 0x18 bytes (sizeof)
typedef struct wil_details_RecordUsageResult {
  LONG queueBackground; // offset: 0x0 ordinal: 0x0
  ULONG countImmediate; // offset: 0x4 ordinal: 0x1
  enum wil_details_ServiceReportingKind
      kindImmediate;        // offset: 0x8 ordinal: 0x2
  ULONG payloadId;          // offset: 0xc ordinal: 0x3
  LONG ignoredUse;          // offset: 0x10 ordinal: 0x4
  LONG isWexpConfiguration; // offset: 0x14 ordinal: 0x5
} wil_details_RecordUsageResult;

typedef enum wil_FeatureVariantPayloadKind {
  wil_FeatureVariantPayloadKind_None = 0,     // ordinal: 0x0
  wil_FeatureVariantPayloadKind_Resident = 1, // ordinal: 0x1
  wil_FeatureVariantPayloadKind_External = 2, // ordinal: 0x2
} wil_FeatureVariantPayloadKind;

typedef enum _MM_PAGE_ACCESS_TYPE {
  MmPteAccessType = 0,         // ordinal: 0x0
  MmCcReadAheadType = 1,       // ordinal: 0x1
  MmPfnRepurposeType = 2,      // ordinal: 0x2
  MmMaximumPageAccessType = 3, // ordinal: 0x3
} _MM_PAGE_ACCESS_TYPE;

typedef enum _IO_PRIORITY_HINT {
  IoPriorityVeryLow = 0,  // ordinal: 0x0
  IoPriorityLow = 1,      // ordinal: 0x1
  IoPriorityNormal = 2,   // ordinal: 0x2
  IoPriorityHigh = 3,     // ordinal: 0x3
  IoPriorityCritical = 4, // ordinal: 0x4
  MaxIoPriorityTypes = 5, // ordinal: 0x5
} _IO_PRIORITY_HINT;

typedef enum _TP_CALLBACK_PRIORITY {
  TP_CALLBACK_PRIORITY_HIGH = 0,    // ordinal: 0x0
  TP_CALLBACK_PRIORITY_NORMAL = 1,  // ordinal: 0x1
  TP_CALLBACK_PRIORITY_LOW = 2,     // ordinal: 0x2
  TP_CALLBACK_PRIORITY_INVALID = 3, // ordinal: 0x3
  TP_CALLBACK_PRIORITY_COUNT = 3,   // ordinal: 0x4
} _TP_CALLBACK_PRIORITY;

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE {
  StandardDesign = 0,  // ordinal: 0x0
  NEC98x86 = 1,        // ordinal: 0x1
  EndAlternatives = 2, // ordinal: 0x2
} _ALTERNATIVE_ARCHITECTURE_TYPE;

typedef enum _INTERRUPT_LINE_SUBTYPE {
  InterruptLineSubTypeNone = 0, // ordinal: 0x0
  InterruptLineSubTypeV2m = 1,  // ordinal: 0x1
  InterruptLineSubTypeLpi = 2,  // ordinal: 0x2
} _INTERRUPT_LINE_SUBTYPE;

typedef enum _INTERRUPT_LINE_TYPE {
  InterruptLineInvalidType = 0,                // ordinal: 0x0
  InterruptLineUnusable = 1,                   // ordinal: 0x1
  InterruptLineStandardPin = 2,                // ordinal: 0x2
  InterruptLineProcessorLocal = 3,             // ordinal: 0x3
  InterruptLineSoftwareOnly = 4,               // ordinal: 0x4
  InterruptLineSoftwareOnlyProcessorLocal = 5, // ordinal: 0x5
  InterruptLineOutputPin = 6,                  // ordinal: 0x6
  InterruptLineMsi = 7,                        // ordinal: 0x7
} _INTERRUPT_LINE_TYPE;

typedef enum _HAL_HV_DMA_DOMAIN_CONFIG_ARCH {
  HalHvDmaDomainConfigArm64 = 0, // ordinal: 0x0
  HalHvDmaDomainConfigX64 = 1,   // ordinal: 0x1
} _HAL_HV_DMA_DOMAIN_CONFIG_ARCH;

typedef enum _WHEA_RECOVERY_CONTEXT_ERROR_TYPE {
  WheaRecoveryContextErrorTypeMemory = 1, // ordinal: 0x0
  WheaRecoveryContextErrorTypePmem = 2,   // ordinal: 0x1
  WheaRecoveryContextErrorTypeMax = 3,    // ordinal: 0x2
} _WHEA_RECOVERY_CONTEXT_ERROR_TYPE;

typedef enum _EXT_IOMMU_INTERRUPT_REMAPPING_POLICY {
  ExtIommuInterruptRemappingPolicyDisable = 0,      // ordinal: 0x0
  ExtIommuInterruptRemappingPolicyEnableLoose = 1,  // ordinal: 0x1
  ExtIommuInterruptRemappingPolicyEnableStrict = 2, // ordinal: 0x2
} _EXT_IOMMU_INTERRUPT_REMAPPING_POLICY;

typedef enum _EXT_IOMMU_ADDRESS_TRANSLATION_POLICY {
  ExtIommuAddressTranslationPolicyDisable = 0,                // ordinal: 0x0
  ExtIommuAddressTranslationPolicyEnableDefaultBypass = 1,    // ordinal: 0x1
  ExtIommuAddressTranslationPolicyEnableDefaultBlock = 2,     // ordinal: 0x2
  ExtIommuAddressTranslationPolicyEnableDefaultTranslate = 3, // ordinal: 0x3
} _EXT_IOMMU_ADDRESS_TRANSLATION_POLICY;

typedef enum _DMA_SPEED {
  Compatible = 0,      // ordinal: 0x0
  TypeA = 1,           // ordinal: 0x1
  TypeB = 2,           // ordinal: 0x2
  TypeC = 3,           // ordinal: 0x3
  TypeF = 4,           // ordinal: 0x4
  MaximumDmaSpeed = 5, // ordinal: 0x5
} _DMA_SPEED;

typedef enum _DMA_COMMON_BUFFER_EXTENDED_CONFIGURATION_ACCESS_TYPE {
  CommonBufferHardwareAccessReadOnly = 0,  // ordinal: 0x0
  CommonBufferHardwareAccessWriteOnly = 1, // ordinal: 0x1
  CommonBufferHardwareAccessReadWrite = 2, // ordinal: 0x2
  CommonBufferHardwareAccessMax = 3,       // ordinal: 0x3
} _DMA_COMMON_BUFFER_EXTENDED_CONFIGURATION_ACCESS_TYPE;

typedef enum _DMA_COMMON_BUFFER_EXTENDED_CONFIGURATION_TYPE {
  CommonBufferConfigTypeLogicalAddressLimits = 0,      // ordinal: 0x0
  CommonBufferConfigTypeSubSection = 1,                // ordinal: 0x1
  CommonBufferConfigTypeHardwareAccessPermissions = 2, // ordinal: 0x2
  CommonBufferConfigTypeMax = 3,                       // ordinal: 0x3
} _DMA_COMMON_BUFFER_EXTENDED_CONFIGURATION_TYPE;

typedef enum _EXT_IOMMU_DOMAIN_TYPE {
  ExtIommuDomainTypeS1 = 0,      // ordinal: 0x0
  ExtIommuDomainTypeS2 = 1,      // ordinal: 0x1
  ExtIommuDomainTypeInvalid = 2, // ordinal: 0x2
} _EXT_IOMMU_DOMAIN_TYPE;

typedef enum _IOMMU_DMA_LOGICAL_ALLOCATOR_TYPE {
  IommuDmaLogicalAllocatorNone = 0,  // ordinal: 0x0
  IommuDmaLogicalAllocatorBuddy = 1, // ordinal: 0x1
  IommuDmaLogicalAllocatorMax = 2,   // ordinal: 0x2
} _IOMMU_DMA_LOGICAL_ALLOCATOR_TYPE;

typedef enum DMA_COMPLETION_STATUS {
  DmaComplete = 0,  // ordinal: 0x0
  DmaAborted = 1,   // ordinal: 0x1
  DmaError = 2,     // ordinal: 0x2
  DmaCancelled = 3, // ordinal: 0x3
} DMA_COMPLETION_STATUS;

typedef enum _MEMORY_CACHING_TYPE {
  MmNonCached = 0,              // ordinal: 0x0
  MmCached = 1,                 // ordinal: 0x1
  MmWriteCombined = 2,          // ordinal: 0x2
  MmHardwareCoherentCached = 3, // ordinal: 0x3
  MmNonCachedUnordered = 4,     // ordinal: 0x4
  MmUSWCCached = 5,             // ordinal: 0x5
  MmMaximumCacheType = 6,       // ordinal: 0x6
  MmNotMapped = -1,             // ordinal: 0x7
} _MEMORY_CACHING_TYPE;

typedef enum _EXT_IOMMU_KNOWN_IOMMU_TYPE {
  ExtIommuInvalid = 0,    // ordinal: 0x0
  ExtIommuAmd = 1,        // ordinal: 0x1
  ExtIommuIntel = 2,      // ordinal: 0x2
  ExtIommuSmmuv1 = 3,     // ordinal: 0x3
  ExtIommuSmmuv2 = 4,     // ordinal: 0x4
  ExtIommuSmmuv3 = 5,     // ordinal: 0x5
  ExtIommuIts = 6,        // ordinal: 0x6
  ExtIommuUnknown = 4096, // ordinal: 0x7
} _EXT_IOMMU_KNOWN_IOMMU_TYPE;

typedef enum _FAULT_INFORMATION_ARM64_TYPE {
  UnsupportedUpstreamTransaction = 0, // ordinal: 0x0
  AddressSizeFault = 1,               // ordinal: 0x1
  TlbMatchConflict = 2,               // ordinal: 0x2
  ExternalFault = 3,                  // ordinal: 0x3
  PermissionFault = 4,                // ordinal: 0x4
  AccessFlagFault = 5,                // ordinal: 0x5
  TranslationFault = 6,               // ordinal: 0x6
  MaxFaultType = 7,                   // ordinal: 0x7
} _FAULT_INFORMATION_ARM64_TYPE;

typedef enum _EXT_IOMMU_TRANSLATION_TYPE {
  ExtTranslationTypePassThrough = 0, // ordinal: 0x0
  ExtTranslationTypeBlocked = 1,     // ordinal: 0x1
  ExtTranslationTypeTranslate = 2,   // ordinal: 0x2
  ExtTranslationTypeInvalid = 3,     // ordinal: 0x3
} _EXT_IOMMU_TRANSLATION_TYPE;

typedef enum _IOMMU_DMA_DOMAIN_TYPE {
  DomainTypeTranslate = 0,   // ordinal: 0x0
  DomainTypePassThrough = 1, // ordinal: 0x1
  DomainTypeUnmanaged = 2,   // ordinal: 0x2
  DomainTypeMax = 3,         // ordinal: 0x3
} _IOMMU_DMA_DOMAIN_TYPE;

typedef enum _DMA_INTERRUPT_TYPE {
  InterruptTypeCompletion = 0, // ordinal: 0x0
  InterruptTypeError = 1,      // ordinal: 0x1
  InterruptTypeCancelled = 2,  // ordinal: 0x2
} _DMA_INTERRUPT_TYPE;

typedef enum _FAULT_INFORMATION_ARCH {
  FaultInformationInvalid = 0, // ordinal: 0x0
  FaultInformationArm64 = 1,   // ordinal: 0x1
  FaultInformationX64 = 2,     // ordinal: 0x2
} _FAULT_INFORMATION_ARCH;

typedef enum _EXT_IOMMU_DEVICE_TYPE {
  EXT_IOMMU_DEVICE_TYPE_INVALID = 0, // ordinal: 0x0
  EXT_IOMMU_DEVICE_TYPE_PCI = 1,     // ordinal: 0x1
  EXT_IOMMU_DEVICE_TYPE_ACPI = 2,    // ordinal: 0x2
  EXT_IOMMU_DEVICE_TYPE_IOAPIC = 3,  // ordinal: 0x3
  EXT_IOMMU_DEVICE_TYPE_LOGICAL = 4, // ordinal: 0x4
  EXT_IOMMU_DEVICE_TYPE_GIC = 5,     // ordinal: 0x5
  EXT_IOMMU_DEVICE_TYPE_TEST = 6,    // ordinal: 0x6
  EXT_IOMMU_DEVICE_TYPE_MAX = 7,     // ordinal: 0x7
} _EXT_IOMMU_DEVICE_TYPE;

typedef enum _HALP_EMERGENCY_LA_QUEUE_TYPE {
  HalpDmaLegacyLaQueueEntry = 0, // ordinal: 0x0
  HalpDmaThinLaQueueEntry = 1,   // ordinal: 0x1
  HalpDmaLaQueueEntryMax = 2,    // ordinal: 0x2
} _HALP_EMERGENCY_LA_QUEUE_TYPE;

typedef enum _HALP_DMA_ADAPTER_ALLOCATION_STATE {
  HalpDmaAdapterAllocationStateNone = 0,           // ordinal: 0x0
  HalpDmaAdapterAllocateChannel = 1,               // ordinal: 0x1
  HalpDmaAdapterAllocateMapRegisters = 2,          // ordinal: 0x2
  HalpDmaAdapterAllocateChannelRemapResources = 3, // ordinal: 0x3
  HalpDmaAdapterAllocationStateComplete = 4,       // ordinal: 0x4
  HalpDmaAdapterAllocationStateMax = 5,            // ordinal: 0x5
} _HALP_DMA_ADAPTER_ALLOCATION_STATE;

typedef enum _HALP_DMA_TRANSLATION_TYPE {
  DmaTranslationTypePassthrough = 0,       // ordinal: 0x0
  DmaTranslationTypeSafePassthrough = 1,   // ordinal: 0x1
  DmaTranslationTypeHybridPassthrough = 2, // ordinal: 0x2
  DmaTranslationTypeTranslate = 3,         // ordinal: 0x3
  DmaTranslationTypeMax = 4,               // ordinal: 0x4
} _HALP_DMA_TRANSLATION_TYPE;

typedef enum _DMA_WIDTH {
  Width8Bits = 0,      // ordinal: 0x0
  Width16Bits = 1,     // ordinal: 0x1
  Width32Bits = 2,     // ordinal: 0x2
  Width64Bits = 3,     // ordinal: 0x3
  WidthNoWrap = 4,     // ordinal: 0x4
  MaximumDmaWidth = 5, // ordinal: 0x5
} _DMA_WIDTH;

typedef enum _WHEA_CPU_VENDOR {
  WheaCpuVendorOther = 0, // ordinal: 0x0
  WheaCpuVendorIntel = 1, // ordinal: 0x1
  WheaCpuVendorAmd = 2,   // ordinal: 0x2
} _WHEA_CPU_VENDOR;

typedef enum _INTERRUPT_TARGET_TYPE {
  InterruptTargetInvalid = 0,          // ordinal: 0x0
  InterruptTargetAllIncludingSelf = 1, // ordinal: 0x1
  InterruptTargetAllExcludingSelf = 2, // ordinal: 0x2
  InterruptTargetSelfOnly = 3,         // ordinal: 0x3
  InterruptTargetPhysical = 4,         // ordinal: 0x4
  InterruptTargetLogicalFlat = 5,      // ordinal: 0x5
  InterruptTargetLogicalClustered = 6, // ordinal: 0x6
  InterruptTargetRemapIndex = 7,       // ordinal: 0x7
  InterruptTargetHypervisor = 8,       // ordinal: 0x8
} _INTERRUPT_TARGET_TYPE;

typedef enum _INTERRUPT_RESULT {
  InterruptBeginFatalError = 0, // ordinal: 0x0
  InterruptBeginLine = 1,       // ordinal: 0x1
  InterruptBeginSpurious = 2,   // ordinal: 0x2
  InterruptBeginVector = 3,     // ordinal: 0x3
  InterruptBeginNone = 4,       // ordinal: 0x4
} _INTERRUPT_RESULT;

typedef enum _INTERRUPT_PROBLEM {
  InterruptProblemNone = 0,                              // ordinal: 0x0
  InterruptProblemMadtParsingFailure = 1,                // ordinal: 0x1
  InterruptProblemNoControllersFound = 2,                // ordinal: 0x2
  InterruptProblemFailedDiscovery = 3,                   // ordinal: 0x3
  InterruptProblemInitializeLocalUnitFailed = 4,         // ordinal: 0x4
  InterruptProblemInitializeIoUnitFailed = 5,            // ordinal: 0x5
  InterruptProblemSetLogicalIdFailed = 6,                // ordinal: 0x6
  InterruptProblemSetLineStateFailed = 7,                // ordinal: 0x7
  InterruptProblemGenerateMessageFailed = 8,             // ordinal: 0x8
  InterruptProblemConvertIdFailed = 9,                   // ordinal: 0x9
  InterruptProblemCmciSetupFailed = 10,                  // ordinal: 0xa
  InterruptProblemQueryMaxProcessorsCalledTooEarly = 11, // ordinal: 0xb
  InterruptProblemProcessorReset = 12,                   // ordinal: 0xc
  InterruptProblemStartProcessorFailed = 13,             // ordinal: 0xd
  InterruptProblemProcessorNotAlive = 14,                // ordinal: 0xe
  InterruptProblemLowerIrqlViolation = 15,               // ordinal: 0xf
  InterruptProblemInvalidIrql = 16,                      // ordinal: 0x10
  InterruptProblemNoSuchController = 17,                 // ordinal: 0x11
  InterruptProblemNoSuchLines = 18,                      // ordinal: 0x12
  InterruptProblemBadConnectionData = 19,                // ordinal: 0x13
  InterruptProblemBadRoutingData = 20,                   // ordinal: 0x14
  InterruptProblemInvalidProcessor = 21,                 // ordinal: 0x15
  InterruptProblemFailedToAttainTarget = 22,             // ordinal: 0x16
  InterruptProblemUnsupportedWiringConfiguration = 23,   // ordinal: 0x17
  InterruptProblemSpareAlreadyStarted = 24,              // ordinal: 0x18
  InterruptProblemClusterNotFullyReplaced = 25,          // ordinal: 0x19
  InterruptProblemNewClusterAlreadyActive = 26,          // ordinal: 0x1a
  InterruptProblemNewClusterTooLarge = 27,               // ordinal: 0x1b
  InterruptProblemCannotHardwareQuiesce = 28,            // ordinal: 0x1c
  InterruptProblemIpiDestinationUpdateFailed = 29,       // ordinal: 0x1d
  InterruptProblemNoMemory = 30,                         // ordinal: 0x1e
  InterruptProblemNoIrtEntries = 31,                     // ordinal: 0x1f
  InterruptProblemConnectionDataBaitAndSwitch = 32,      // ordinal: 0x20
  InterruptProblemInvalidLogicalFlatId = 33,             // ordinal: 0x21
  InterruptProblemDeinitializeLocalUnitFailed = 34,      // ordinal: 0x22
  InterruptProblemDeinitializeIoUnitFailed = 35,         // ordinal: 0x23
  InterruptProblemMismatchedThermalLvtIsr = 36,          // ordinal: 0x24
  InterruptProblemHvRetargetFailed = 37,                 // ordinal: 0x25
  InterruptProblemDeferredErrorSetupFailed = 38,         // ordinal: 0x26
  InterruptProblemBadInterruptPartition = 39,            // ordinal: 0x27
} _INTERRUPT_PROBLEM;

typedef enum _KNOWN_CONTROLLER_TYPE {
  InterruptControllerInvalid = 0,    // ordinal: 0x0
  InterruptControllerPic = 1,        // ordinal: 0x1
  InterruptControllerApic = 2,       // ordinal: 0x2
  InterruptControllerGic = 3,        // ordinal: 0x3
  InterruptControllerGicV3 = 4,      // ordinal: 0x4
  InterruptControllerGicV4 = 5,      // ordinal: 0x5
  InterruptControllerBcm = 6,        // ordinal: 0x6
  InterruptControllerUnknown = 4096, // ordinal: 0x7
} _KNOWN_CONTROLLER_TYPE;

typedef enum _KINTERRUPT_MODE {
  LevelSensitive = 0, // ordinal: 0x0
  Latched = 1,        // ordinal: 0x1
} _KINTERRUPT_MODE;

typedef enum _KINTERRUPT_POLARITY {
  InterruptPolarityUnknown = 0,       // ordinal: 0x0
  InterruptActiveHigh = 1,            // ordinal: 0x1
  InterruptRisingEdge = 1,            // ordinal: 0x2
  InterruptActiveLow = 2,             // ordinal: 0x3
  InterruptFallingEdge = 2,           // ordinal: 0x4
  InterruptActiveBoth = 3,            // ordinal: 0x5
  InterruptActiveBothTriggerLow = 3,  // ordinal: 0x6
  InterruptActiveBothTriggerHigh = 4, // ordinal: 0x7
} _KINTERRUPT_POLARITY;

typedef enum _WHEA_ERROR_PACKET_DATA_FORMAT {
  WheaDataFormatIPFSalRecord = 0, // ordinal: 0x0
  WheaDataFormatXPFMCA = 1,       // ordinal: 0x1
  WheaDataFormatMemory = 2,       // ordinal: 0x2
  WheaDataFormatPCIExpress = 3,   // ordinal: 0x3
  WheaDataFormatNMIPort = 4,      // ordinal: 0x4
  WheaDataFormatPCIXBus = 5,      // ordinal: 0x5
  WheaDataFormatPCIXDevice = 6,   // ordinal: 0x6
  WheaDataFormatGeneric = 7,      // ordinal: 0x7
  WheaDataFormatMax = 8,          // ordinal: 0x8
} _WHEA_ERROR_PACKET_DATA_FORMAT;

typedef enum _WHEA_ERROR_SEVERITY {
  WheaErrSevRecoverable = 0,   // ordinal: 0x0
  WheaErrSevFatal = 1,         // ordinal: 0x1
  WheaErrSevCorrected = 2,     // ordinal: 0x2
  WheaErrSevInformational = 3, // ordinal: 0x3
} _WHEA_ERROR_SEVERITY;

typedef enum _WHEA_ERROR_TYPE {
  WheaErrTypeProcessor = 0,  // ordinal: 0x0
  WheaErrTypeMemory = 1,     // ordinal: 0x1
  WheaErrTypePCIExpress = 2, // ordinal: 0x2
  WheaErrTypeNMI = 3,        // ordinal: 0x3
  WheaErrTypePCIXBus = 4,    // ordinal: 0x4
  WheaErrTypePCIXDevice = 5, // ordinal: 0x5
  WheaErrTypeGeneric = 6,    // ordinal: 0x6
  WheaErrTypePmem = 7,       // ordinal: 0x7
} _WHEA_ERROR_TYPE;

typedef enum _WHEA_EVENT_LOG_ENTRY_ID {
  WheaEventLogEntryIdCmcPollingTimeout = -2147483647,       // ordinal: 0x0
  WheaEventLogEntryIdWheaInit = -2147483646,                // ordinal: 0x1
  WheaEventLogEntryIdCmcSwitchToPolling = -2147483645,      // ordinal: 0x2
  WheaEventLogEntryIdDroppedCorrectedError = -2147483644,   // ordinal: 0x3
  WheaEventLogEntryIdStartedReportHwError = -2147483643,    // ordinal: 0x4
  WheaEventLogEntryIdPFAMemoryOfflined = -2147483642,       // ordinal: 0x5
  WheaEventLogEntryIdPFAMemoryRemoveMonitor = -2147483641,  // ordinal: 0x6
  WheaEventLogEntryIdPFAMemoryPolicy = -2147483640,         // ordinal: 0x7
  WheaEventLogEntryIdPshedInjectError = -2147483639,        // ordinal: 0x8
  WheaEventLogEntryIdOscCapabilities = -2147483638,         // ordinal: 0x9
  WheaEventLogEntryIdPshedPluginRegister = -2147483637,     // ordinal: 0xa
  WheaEventLogEntryIdAddRemoveErrorSource = -2147483636,    // ordinal: 0xb
  WheaEventLogEntryIdWorkQueueItem = -2147483635,           // ordinal: 0xc
  WheaEventLogEntryIdAttemptErrorRecovery = -2147483634,    // ordinal: 0xd
  WheaEventLogEntryIdMcaFoundErrorInBank = -2147483633,     // ordinal: 0xe
  WheaEventLogEntryIdMcaStuckErrorCheck = -2147483632,      // ordinal: 0xf
  WheaEventLogEntryIdMcaErrorCleared = -2147483631,         // ordinal: 0x10
  WheaEventLogEntryIdClearedPoison = -2147483630,           // ordinal: 0x11
  WheaEventLogEntryIdProcessEINJ = -2147483629,             // ordinal: 0x12
  WheaEventLogEntryIdProcessHEST = -2147483628,             // ordinal: 0x13
  WheaEventLogEntryIdCreateGenericRecord = -2147483627,     // ordinal: 0x14
  WheaEventLogEntryIdErrorRecord = -2147483626,             // ordinal: 0x15
  WheaEventLogEntryIdErrorRecordLimit = -2147483625,        // ordinal: 0x16
  WheaEventLogEntryIdAerNotGrantedToOs = -2147483624,       // ordinal: 0x17
  WheaEventLogEntryIdErrSrcArrayInvalid = -2147483623,      // ordinal: 0x18
  WheaEventLogEntryIdAcpiTimeOut = -2147483622,             // ordinal: 0x19
  WheaEventLogCmciRestart = -2147483621,                    // ordinal: 0x1a
  WheaEventLogCmciFinalRestart = -2147483620,               // ordinal: 0x1b
  WheaEventLogEntryEtwOverFlow = -2147483619,               // ordinal: 0x1c
  WheaEventLogAzccRootBusSearchErr = -2147483618,           // ordinal: 0x1d
  WheaEventLogAzccRootBusList = -2147483617,                // ordinal: 0x1e
  WheaEventLogEntryIdErrSrcInvalid = -2147483616,           // ordinal: 0x1f
  WheaEventLogEntryIdGenericErrMemMap = -2147483615,        // ordinal: 0x20
  WheaEventLogEntryIdPshedCallbackCollision = -2147483614,  // ordinal: 0x21
  WheaEventLogEntryIdSELBugCheckProgress = -2147483613,     // ordinal: 0x22
  WheaEventLogEntryIdPshedPluginLoad = -2147483612,         // ordinal: 0x23
  WheaEventLogEntryIdPshedPluginUnload = -2147483611,       // ordinal: 0x24
  WheaEventLogEntryIdPshedPluginSupported = -2147483610,    // ordinal: 0x25
  WheaEventLogEntryIdDeviceDriver = -2147483609,            // ordinal: 0x26
  WheaEventLogEntryIdCmciImplPresent = -2147483608,         // ordinal: 0x27
  WheaEventLogEntryIdCmciInitError = -2147483607,           // ordinal: 0x28
  WheaEventLogEntryIdSELBugCheckRecovery = -2147483606,     // ordinal: 0x29
  WheaEventLogEntryIdDrvErrSrcInvalid = -2147483605,        // ordinal: 0x2a
  WheaEventLogEntryIdDrvHandleBusy = -2147483604,           // ordinal: 0x2b
  WheaEventLogEntryIdWheaHeartbeat = -2147483603,           // ordinal: 0x2c
  WheaEventLogAzccRootBusPoisonSet = -2147483602,           // ordinal: 0x2d
  WheaEventLogEntryIdSELBugCheckInfo = -2147483601,         // ordinal: 0x2e
  WheaEventLogEntryIdErrDimmInfoMismatch = -2147483600,     // ordinal: 0x2f
  WheaEventLogEntryIdeDpcEnabled = -2147483599,             // ordinal: 0x30
  WheaEventLogEntryPageOfflineDone = -2147483598,           // ordinal: 0x31
  WheaEventLogEntryPageOfflinePendMax = -2147483597,        // ordinal: 0x32
  WheaEventLogEntryIdBadPageLimitReached = -2147483596,     // ordinal: 0x33
  WheaEventLogEntrySrarDetail = -2147483595,                // ordinal: 0x34
  WheaEventLogEntryEarlyError = -2147483594,                // ordinal: 0x35
  WheaEventLogEntryIdPcieOverrideInfo = -2147483593,        // ordinal: 0x36
  WheaEventLogEntryIdReadPcieOverridesErr = -2147483592,    // ordinal: 0x37
  WheaEventLogEntryIdPcieConfigInfo = -2147483591,          // ordinal: 0x38
  WheaEventLogEntryIdPcieSummaryFailed = -2147483584,       // ordinal: 0x39
  WheaEventLogEntryIdThrottleRegCorrupt = -2147483583,      // ordinal: 0x3a
  WheaEventLogEntryIdThrottleAddErrSrcFailed = -2147483582, // ordinal: 0x3b
  WheaEventLogEntryIdThrottleRegDataIgnored = -2147483581,  // ordinal: 0x3c
  WheaEventLogEntryIdEnableKeyNotifFailed = -2147483580,    // ordinal: 0x3d
  WheaEventLogEntryIdKeyNotificationFailed = -2147483579,   // ordinal: 0x3e
  WheaEventLogEntryIdPcieRemoveDevice = -2147483578,        // ordinal: 0x3f
  WheaEventLogEntryIdPcieAddDevice = -2147483577,           // ordinal: 0x40
  WheaEventLogEntryIdPcieSpuriousErrSource = -2147483576,   // ordinal: 0x41
  WheaEventLogEntryIdMemoryAddDevice = -2147483575,         // ordinal: 0x42
  WheaEventLogEntryIdMemoryRemoveDevice = -2147483574,      // ordinal: 0x43
  WheaEventLogEntryIdMemorySummaryFailed = -2147483573,     // ordinal: 0x44
  WheaEventLogEntryIdPcieDpcError = -2147483572,            // ordinal: 0x45
  WheaEventLogEntryIdCpuBusesInitFailed = -2147483571,      // ordinal: 0x46
  WheaEventLogEntryIdPshedPluginInitFailed = -2147483570,   // ordinal: 0x47
  WheaEventLogEntryIdFailedAddToDefectList = -2147483569,   // ordinal: 0x48
  WheaEventLogEntryIdDefectListFull = -2147483568,          // ordinal: 0x49
  WheaEventLogEntryIdDefectListUEFIVarFailed = -2147483567, // ordinal: 0x4a
  WheaEventLogEntryIdDefectListCorrupt = -2147483566,       // ordinal: 0x4b
  WheaEventLogEntryIdBadHestNotifyData = -2147483565,       // ordinal: 0x4c
  WheaEventLogEntryIdSrasTableNotFound = -2147483564,       // ordinal: 0x4d
  WheaEventLogEntryIdSrasTableError = -2147483563,          // ordinal: 0x4e
  WheaEventLogEntryIdSrasTableEntries = -2147483562,        // ordinal: 0x4f
  WheaEventLogEntryIdRowFailure = -2147483561,              // ordinal: 0x50
  WheaEventLogEntryIdCpusFrozen = -2147483552,              // ordinal: 0x51
  WheaEventLogEntryIdCpusFrozenNoCrashDump = -2147483551,   // ordinal: 0x52
  WheaEventLogEntryIdPshedPiTraceLog = -2147221488,         // ordinal: 0x53
} _WHEA_EVENT_LOG_ENTRY_ID;

typedef enum _WHEA_EVENT_LOG_ENTRY_TYPE {
  WheaEventLogEntryTypeInformational = 0, // ordinal: 0x0
  WheaEventLogEntryTypeWarning = 1,       // ordinal: 0x1
  WheaEventLogEntryTypeError = 2,         // ordinal: 0x2
} _WHEA_EVENT_LOG_ENTRY_TYPE;

typedef enum _WHEA_ERROR_SOURCE_STATE {
  WheaErrSrcStateStopped = 1,       // ordinal: 0x0
  WheaErrSrcStateStarted = 2,       // ordinal: 0x1
  WheaErrSrcStateRemoved = 3,       // ordinal: 0x2
  WheaErrSrcStateRemovePending = 4, // ordinal: 0x3
} _WHEA_ERROR_SOURCE_STATE;

typedef enum _WHEA_ERROR_SOURCE_TYPE {
  WheaErrSrcTypeMCE = 0,           // ordinal: 0x0
  WheaErrSrcTypeCMC = 1,           // ordinal: 0x1
  WheaErrSrcTypeCPE = 2,           // ordinal: 0x2
  WheaErrSrcTypeNMI = 3,           // ordinal: 0x3
  WheaErrSrcTypePCIe = 4,          // ordinal: 0x4
  WheaErrSrcTypeGeneric = 5,       // ordinal: 0x5
  WheaErrSrcTypeINIT = 6,          // ordinal: 0x6
  WheaErrSrcTypeBOOT = 7,          // ordinal: 0x7
  WheaErrSrcTypeSCIGeneric = 8,    // ordinal: 0x8
  WheaErrSrcTypeIPFMCA = 9,        // ordinal: 0x9
  WheaErrSrcTypeIPFCMC = 10,       // ordinal: 0xa
  WheaErrSrcTypeIPFCPE = 11,       // ordinal: 0xb
  WheaErrSrcTypeGenericV2 = 12,    // ordinal: 0xc
  WheaErrSrcTypeSCIGenericV2 = 13, // ordinal: 0xd
  WheaErrSrcTypeBMC = 14,          // ordinal: 0xe
  WheaErrSrcTypePMEM = 15,         // ordinal: 0xf
  WheaErrSrcTypeDeviceDriver = 16, // ordinal: 0x10
  WheaErrSrcTypeSea = 17,          // ordinal: 0x11
  WheaErrSrcTypeSei = 18,          // ordinal: 0x12
  WheaErrSrcTypeMax = 19,          // ordinal: 0x13
} _WHEA_ERROR_SOURCE_TYPE;

typedef enum _EXCEPTION_DISPOSITION {
  ExceptionContinueExecution = 0, // ordinal: 0x0
  ExceptionContinueSearch = 1,    // ordinal: 0x1
  ExceptionNestedException = 2,   // ordinal: 0x2
  ExceptionCollidedUnwind = 3,    // ordinal: 0x3
} _EXCEPTION_DISPOSITION;

typedef enum _DEVICE_RELATION_LEVEL {
  RELATION_LEVEL_REMOVE_EJECT = 0,      // ordinal: 0x0
  RELATION_LEVEL_DEPENDENT = 1,         // ordinal: 0x1
  RELATION_LEVEL_DIRECT_DESCENDANT = 2, // ordinal: 0x2
} _DEVICE_RELATION_LEVEL;

typedef enum _PO_FX_PERF_STATE_TYPE {
  PoFxPerfStateTypeDiscrete = 0, // ordinal: 0x0
  PoFxPerfStateTypeRange = 1,    // ordinal: 0x1
  PoFxPerfStateTypeMaximum = 2,  // ordinal: 0x2
} _PO_FX_PERF_STATE_TYPE;

typedef enum _PO_FX_PERF_STATE_UNIT {
  PoFxPerfStateUnitOther = 0,     // ordinal: 0x0
  PoFxPerfStateUnitFrequency = 1, // ordinal: 0x1
  PoFxPerfStateUnitBandwidth = 2, // ordinal: 0x2
  PoFxPerfStateUnitMaximum = 3,   // ordinal: 0x3
} _PO_FX_PERF_STATE_UNIT;

typedef enum _IRQ_PRIORITY {
  IrqPriorityUndefined = 0, // ordinal: 0x0
  IrqPriorityLow = 1,       // ordinal: 0x1
  IrqPriorityNormal = 2,    // ordinal: 0x2
  IrqPriorityHigh = 3,      // ordinal: 0x3
} _IRQ_PRIORITY;

typedef enum _NT_IORING_REG_BUFFERS_ADV_FLAGS {
  NT_IORING_REG_BUFFERS_ADV_FLAG_NONE = 0, // ordinal: 0x0
} _NT_IORING_REG_BUFFERS_ADV_FLAGS;

typedef enum _NT_IORING_REG_BUFFERS_REQ_FLAGS {
  NT_IORING_REG_BUFFERS_REQ_FLAG_NONE = 0, // ordinal: 0x0
} _NT_IORING_REG_BUFFERS_REQ_FLAGS;

// 0x8 bytes (sizeof)
typedef struct _NT_IORING_REG_BUFFERS_FLAGS {
  enum _NT_IORING_REG_BUFFERS_REQ_FLAGS Required; // offset: 0x0 ordinal: 0x0
  enum _NT_IORING_REG_BUFFERS_ADV_FLAGS Advisory; // offset: 0x4 ordinal: 0x1
} _NT_IORING_REG_BUFFERS_FLAGS;

typedef enum _NT_IORING_REG_FILES_ADV_FLAGS {
  NT_IORING_REG_FILES_ADV_FLAG_NONE = 0, // ordinal: 0x0
} _NT_IORING_REG_FILES_ADV_FLAGS;

typedef enum _NT_IORING_REG_FILES_REQ_FLAGS {
  NT_IORING_REG_FILES_REQ_FLAG_NONE = 0, // ordinal: 0x0
} _NT_IORING_REG_FILES_REQ_FLAGS;

// 0x8 bytes (sizeof)
typedef struct _NT_IORING_REG_FILES_FLAGS {
  enum _NT_IORING_REG_FILES_REQ_FLAGS Required; // offset: 0x0 ordinal: 0x0
  enum _NT_IORING_REG_FILES_ADV_FLAGS Advisory; // offset: 0x4 ordinal: 0x1
} _NT_IORING_REG_FILES_FLAGS;

typedef enum _FS_FILTER_SECTION_SYNC_TYPE {
  SyncTypeOther = 0,         // ordinal: 0x0
  SyncTypeCreateSection = 1, // ordinal: 0x1
} _FS_FILTER_SECTION_SYNC_TYPE;

typedef enum PROFILE_DEPARTURE_STYLE {
  PDS_UPDATE_DEFAULT = 1,      // ordinal: 0x0
  PDS_UPDATE_ON_REMOVE = 2,    // ordinal: 0x1
  PDS_UPDATE_ON_INTERFACE = 3, // ordinal: 0x2
  PDS_UPDATE_ON_EJECT = 4,     // ordinal: 0x3
} PROFILE_DEPARTURE_STYLE;

typedef enum _PNP_WATCHDOG_TYPE {
  PNP_WATCHDOG_NONE = 0,                    // ordinal: 0x0
  PNP_EVENT_WORKER_WATCHDOG = 1,            // ordinal: 0x1
  PNP_DEVICE_COMPLETION_QUEUE_WATCHDOG = 2, // ordinal: 0x2
  PNP_DELAYED_REMOVE_WORKER_WATCHDOG = 3,   // ordinal: 0x3
  PNP_ADD_DEVICE_WATCHDOG = 4,              // ordinal: 0x4
  PNP_DRIVER_ENTRY_WATCHDOG = 5,            // ordinal: 0x5
} _PNP_WATCHDOG_TYPE;

typedef enum _NT_WRITE_FLAGS {
  NT_WRITE_FLAG_NONE = 0,          // ordinal: 0x0
  NT_WRITE_FLAG_WRITE_THROUGH = 1, // ordinal: 0x1
} _NT_WRITE_FLAGS;

typedef enum _NT_IORING_OP_FLAGS {
  NT_IORING_OP_FLAG_NONE = 0,                // ordinal: 0x0
  NT_IORING_OP_FLAG_REGISTERED_FILE_0 = 1,   // ordinal: 0x1
  NT_IORING_OP_FLAG_REGISTERED_FILE = 1,     // ordinal: 0x2
  NT_IORING_OP_FLAG_REGISTERED_BUFFER_0 = 2, // ordinal: 0x3
  NT_IORING_OP_FLAG_REGISTERED_BUFFER = 2,   // ordinal: 0x4
} _NT_IORING_OP_FLAGS;

typedef enum _PLUGPLAY_EVENT_CATEGORY {
  HardwareProfileChangeEvent = 0,  // ordinal: 0x0
  TargetDeviceChangeEvent = 1,     // ordinal: 0x1
  DeviceClassChangeEvent = 2,      // ordinal: 0x2
  CustomDeviceEvent = 3,           // ordinal: 0x3
  DeviceInstallEvent = 4,          // ordinal: 0x4
  DeviceArrivalEvent = 5,          // ordinal: 0x5
  VetoEvent = 6,                   // ordinal: 0x6
  BlockedDriverEvent = 7,          // ordinal: 0x7
  InvalidIDEvent = 8,              // ordinal: 0x8
  DevicePropertyChangeEvent = 9,   // ordinal: 0x9
  DeviceInstanceRemovalEvent = 10, // ordinal: 0xa
  DeviceInstanceStartedEvent = 11, // ordinal: 0xb
  MaxPlugEventCategory = 12,       // ordinal: 0xc
} _PLUGPLAY_EVENT_CATEGORY;

typedef enum _PNP_VETO_TYPE {
  PNP_VetoTypeUnknown = 0,          // ordinal: 0x0
  PNP_VetoLegacyDevice = 1,         // ordinal: 0x1
  PNP_VetoPendingClose = 2,         // ordinal: 0x2
  PNP_VetoWindowsApp = 3,           // ordinal: 0x3
  PNP_VetoWindowsService = 4,       // ordinal: 0x4
  PNP_VetoOutstandingOpen = 5,      // ordinal: 0x5
  PNP_VetoDevice = 6,               // ordinal: 0x6
  PNP_VetoDriver = 7,               // ordinal: 0x7
  PNP_VetoIllegalDeviceRequest = 8, // ordinal: 0x8
  PNP_VetoInsufficientPower = 9,    // ordinal: 0x9
  PNP_VetoNonDisableable = 10,      // ordinal: 0xa
  PNP_VetoLegacyDriver = 11,        // ordinal: 0xb
  PNP_VetoInsufficientRights = 12,  // ordinal: 0xc
  PNP_VetoAlreadyRemoved = 13,      // ordinal: 0xd
} _PNP_VETO_TYPE;

typedef enum _NT_IORING_SQE_FLAGS {
  NT_IORING_SQE_FLAG_NONE = 0,                // ordinal: 0x0
  NT_IORING_SQE_FLAG_DRAIN_PRECEDING_OPS = 1, // ordinal: 0x1
} _NT_IORING_SQE_FLAGS;

typedef enum IORING_OP_CODE {
  IORING_OP_NOP = 0,              // ordinal: 0x0
  IORING_OP_READ = 1,             // ordinal: 0x1
  IORING_OP_REGISTER_FILES = 2,   // ordinal: 0x2
  IORING_OP_REGISTER_BUFFERS = 3, // ordinal: 0x3
  IORING_OP_CANCEL = 4,           // ordinal: 0x4
  IORING_OP_WRITE = 5,            // ordinal: 0x5
  IORING_OP_FLUSH = 6,            // ordinal: 0x6
} IORING_OP_CODE;

typedef enum _IOP_MC_BUFFER_ENTRY_FLAGS {
  IOP_MCBF_UNLOCK = 1,         // ordinal: 0x0
  IOP_MCBF_SIGNAL_RUNDOWN = 2, // ordinal: 0x1
  IOP_MCBF_CLEANED_UP = 4,     // ordinal: 0x2
} _IOP_MC_BUFFER_ENTRY_FLAGS;

// 0x4 bytes (sizeof)
typedef struct POHANDLE__ {
  LONG unused; // offset: 0x0 ordinal: 0x0
} POHANDLE__;

typedef enum _PNP_DEVNODE_QUERY_REBALANCE_VETO_REASON {
  DeviceQueryRebalanceSucceeded = 0,         // ordinal: 0x0
  DeviceQueryStopFailed = 1,                 // ordinal: 0x1
  DeviceFailedGetNewResourceRequirement = 2, // ordinal: 0x2
  DeviceInUnexpectedState = 3,               // ordinal: 0x3
  DeviceNotSupportQueryRebalance = 4,        // ordinal: 0x4
} _PNP_DEVNODE_QUERY_REBALANCE_VETO_REASON;

typedef enum _PNP_REBALANCE_FAILURE {
  RebalanceFailureNone = 0,                    // ordinal: 0x0
  RebalanceFailureDisabled = 1,                // ordinal: 0x1
  RebalanceFailureNoMemory = 2,                // ordinal: 0x2
  RebalanceFailureQueryStopUnexpectedVeto = 3, // ordinal: 0x3
  RebalanceFailureNoRequirements = 4,          // ordinal: 0x4
  RebalanceFailureNoCandidates = 5,            // ordinal: 0x5
  RebalanceFailureNoConfiguration = 6,         // ordinal: 0x6
} _PNP_REBALANCE_FAILURE;

typedef enum _KPROFILE_SOURCE {
  ProfileTime = 0,                  // ordinal: 0x0
  ProfileAlignmentFixup = 1,        // ordinal: 0x1
  ProfileTotalIssues = 2,           // ordinal: 0x2
  ProfilePipelineDry = 3,           // ordinal: 0x3
  ProfileLoadInstructions = 4,      // ordinal: 0x4
  ProfilePipelineFrozen = 5,        // ordinal: 0x5
  ProfileBranchInstructions = 6,    // ordinal: 0x6
  ProfileTotalNonissues = 7,        // ordinal: 0x7
  ProfileDcacheMisses = 8,          // ordinal: 0x8
  ProfileIcacheMisses = 9,          // ordinal: 0x9
  ProfileCacheMisses = 10,          // ordinal: 0xa
  ProfileBranchMispredictions = 11, // ordinal: 0xb
  ProfileStoreInstructions = 12,    // ordinal: 0xc
  ProfileFpInstructions = 13,       // ordinal: 0xd
  ProfileIntegerInstructions = 14,  // ordinal: 0xe
  Profile2Issue = 15,               // ordinal: 0xf
  Profile3Issue = 16,               // ordinal: 0x10
  Profile4Issue = 17,               // ordinal: 0x11
  ProfileSpecialInstructions = 18,  // ordinal: 0x12
  ProfileTotalCycles = 19,          // ordinal: 0x13
  ProfileIcacheIssues = 20,         // ordinal: 0x14
  ProfileDcacheAccesses = 21,       // ordinal: 0x15
  ProfileMemoryBarrierCycles = 22,  // ordinal: 0x16
  ProfileLoadLinkedIssues = 23,     // ordinal: 0x17
  ProfileMaximum = 24,              // ordinal: 0x18
} _KPROFILE_SOURCE;

typedef enum POWER_ACTION {
  PowerActionNone = 0,          // ordinal: 0x0
  PowerActionReserved = 1,      // ordinal: 0x1
  PowerActionSleep = 2,         // ordinal: 0x2
  PowerActionHibernate = 3,     // ordinal: 0x3
  PowerActionShutdown = 4,      // ordinal: 0x4
  PowerActionShutdownReset = 5, // ordinal: 0x5
  PowerActionShutdownOff = 6,   // ordinal: 0x6
  PowerActionWarmEject = 7,     // ordinal: 0x7
  PowerActionDisplayOff = 8,    // ordinal: 0x8
} POWER_ACTION;

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE {
  DeviceUsageTypeUndefined = 0,     // ordinal: 0x0
  DeviceUsageTypePaging = 1,        // ordinal: 0x1
  DeviceUsageTypeHibernation = 2,   // ordinal: 0x2
  DeviceUsageTypeDumpFile = 3,      // ordinal: 0x3
  DeviceUsageTypeBoot = 4,          // ordinal: 0x4
  DeviceUsageTypePostDisplay = 5,   // ordinal: 0x5
  DeviceUsageTypeGuestAssigned = 6, // ordinal: 0x6
} _DEVICE_USAGE_NOTIFICATION_TYPE;

typedef enum DEVICE_TEXT_TYPE {
  DeviceTextDescription = 0,         // ordinal: 0x0
  DeviceTextLocationInformation = 1, // ordinal: 0x1
} DEVICE_TEXT_TYPE;

typedef enum BUS_QUERY_ID_TYPE {
  BusQueryDeviceID = 0,           // ordinal: 0x0
  BusQueryHardwareIDs = 1,        // ordinal: 0x1
  BusQueryCompatibleIDs = 2,      // ordinal: 0x2
  BusQueryInstanceID = 3,         // ordinal: 0x3
  BusQueryDeviceSerialNumber = 4, // ordinal: 0x4
  BusQueryContainerID = 5,        // ordinal: 0x5
} BUS_QUERY_ID_TYPE;

// 0x4 bytes (sizeof)
typedef struct __anon_1015 {
  enum BUS_QUERY_ID_TYPE IdType; // offset: 0x0 ordinal: 0x0
} __anon_1015;

typedef enum _DEVICE_RELATION_TYPE {
  BusRelations = 0,         // ordinal: 0x0
  EjectionRelations = 1,    // ordinal: 0x1
  PowerRelations = 2,       // ordinal: 0x2
  RemovalRelations = 3,     // ordinal: 0x3
  TargetDeviceRelation = 4, // ordinal: 0x4
  SingleBusRelations = 5,   // ordinal: 0x5
  TransportRelations = 6,   // ordinal: 0x6
} _DEVICE_RELATION_TYPE;

// 0x4 bytes (sizeof)
typedef struct __anon_1009 {
  enum _DEVICE_RELATION_TYPE Type; // offset: 0x0 ordinal: 0x0
} __anon_1009;

typedef enum _FSINFOCLASS {
  FileFsVolumeInformation = 1,        // ordinal: 0x0
  FileFsLabelInformation = 2,         // ordinal: 0x1
  FileFsSizeInformation = 3,          // ordinal: 0x2
  FileFsDeviceInformation = 4,        // ordinal: 0x3
  FileFsAttributeInformation = 5,     // ordinal: 0x4
  FileFsControlInformation = 6,       // ordinal: 0x5
  FileFsFullSizeInformation = 7,      // ordinal: 0x6
  FileFsObjectIdInformation = 8,      // ordinal: 0x7
  FileFsDriverPathInformation = 9,    // ordinal: 0x8
  FileFsVolumeFlagsInformation = 10,  // ordinal: 0x9
  FileFsSectorSizeInformation = 11,   // ordinal: 0xa
  FileFsDataCopyInformation = 12,     // ordinal: 0xb
  FileFsMetadataSizeInformation = 13, // ordinal: 0xc
  FileFsFullSizeInformationEx = 14,   // ordinal: 0xd
  FileFsMaximumInformation = 15,      // ordinal: 0xe
} _FSINFOCLASS;

typedef enum _DIRECTORY_NOTIFY_INFORMATION_CLASS {
  DirectoryNotifyInformation = 1,         // ordinal: 0x0
  DirectoryNotifyExtendedInformation = 2, // ordinal: 0x1
  DirectoryNotifyFullInformation = 3,     // ordinal: 0x2
  DirectoryNotifyMaximumInformation = 4,  // ordinal: 0x3
} _DIRECTORY_NOTIFY_INFORMATION_CLASS;

typedef enum _FILE_INFORMATION_CLASS {
  FileDirectoryInformation = 1,                      // ordinal: 0x0
  FileFullDirectoryInformation = 2,                  // ordinal: 0x1
  FileBothDirectoryInformation = 3,                  // ordinal: 0x2
  FileBasicInformation = 4,                          // ordinal: 0x3
  FileStandardInformation = 5,                       // ordinal: 0x4
  FileInternalInformation = 6,                       // ordinal: 0x5
  FileEaInformation = 7,                             // ordinal: 0x6
  FileAccessInformation = 8,                         // ordinal: 0x7
  FileNameInformation = 9,                           // ordinal: 0x8
  FileRenameInformation = 10,                        // ordinal: 0x9
  FileLinkInformation = 11,                          // ordinal: 0xa
  FileNamesInformation = 12,                         // ordinal: 0xb
  FileDispositionInformation = 13,                   // ordinal: 0xc
  FilePositionInformation = 14,                      // ordinal: 0xd
  FileFullEaInformation = 15,                        // ordinal: 0xe
  FileModeInformation = 16,                          // ordinal: 0xf
  FileAlignmentInformation = 17,                     // ordinal: 0x10
  FileAllInformation = 18,                           // ordinal: 0x11
  FileAllocationInformation = 19,                    // ordinal: 0x12
  FileEndOfFileInformation = 20,                     // ordinal: 0x13
  FileAlternateNameInformation = 21,                 // ordinal: 0x14
  FileStreamInformation = 22,                        // ordinal: 0x15
  FilePipeInformation = 23,                          // ordinal: 0x16
  FilePipeLocalInformation = 24,                     // ordinal: 0x17
  FilePipeRemoteInformation = 25,                    // ordinal: 0x18
  FileMailslotQueryInformation = 26,                 // ordinal: 0x19
  FileMailslotSetInformation = 27,                   // ordinal: 0x1a
  FileCompressionInformation = 28,                   // ordinal: 0x1b
  FileObjectIdInformation = 29,                      // ordinal: 0x1c
  FileCompletionInformation = 30,                    // ordinal: 0x1d
  FileMoveClusterInformation = 31,                   // ordinal: 0x1e
  FileQuotaInformation = 32,                         // ordinal: 0x1f
  FileReparsePointInformation = 33,                  // ordinal: 0x20
  FileNetworkOpenInformation = 34,                   // ordinal: 0x21
  FileAttributeTagInformation = 35,                  // ordinal: 0x22
  FileTrackingInformation = 36,                      // ordinal: 0x23
  FileIdBothDirectoryInformation = 37,               // ordinal: 0x24
  FileIdFullDirectoryInformation = 38,               // ordinal: 0x25
  FileValidDataLengthInformation = 39,               // ordinal: 0x26
  FileShortNameInformation = 40,                     // ordinal: 0x27
  FileIoCompletionNotificationInformation = 41,      // ordinal: 0x28
  FileIoStatusBlockRangeInformation = 42,            // ordinal: 0x29
  FileIoPriorityHintInformation = 43,                // ordinal: 0x2a
  FileSfioReserveInformation = 44,                   // ordinal: 0x2b
  FileSfioVolumeInformation = 45,                    // ordinal: 0x2c
  FileHardLinkInformation = 46,                      // ordinal: 0x2d
  FileProcessIdsUsingFileInformation = 47,           // ordinal: 0x2e
  FileNormalizedNameInformation = 48,                // ordinal: 0x2f
  FileNetworkPhysicalNameInformation = 49,           // ordinal: 0x30
  FileIdGlobalTxDirectoryInformation = 50,           // ordinal: 0x31
  FileIsRemoteDeviceInformation = 51,                // ordinal: 0x32
  FileUnusedInformation = 52,                        // ordinal: 0x33
  FileNumaNodeInformation = 53,                      // ordinal: 0x34
  FileStandardLinkInformation = 54,                  // ordinal: 0x35
  FileRemoteProtocolInformation = 55,                // ordinal: 0x36
  FileRenameInformationBypassAccessCheck = 56,       // ordinal: 0x37
  FileLinkInformationBypassAccessCheck = 57,         // ordinal: 0x38
  FileVolumeNameInformation = 58,                    // ordinal: 0x39
  FileIdInformation = 59,                            // ordinal: 0x3a
  FileIdExtdDirectoryInformation = 60,               // ordinal: 0x3b
  FileReplaceCompletionInformation = 61,             // ordinal: 0x3c
  FileHardLinkFullIdInformation = 62,                // ordinal: 0x3d
  FileIdExtdBothDirectoryInformation = 63,           // ordinal: 0x3e
  FileDispositionInformationEx = 64,                 // ordinal: 0x3f
  FileRenameInformationEx = 65,                      // ordinal: 0x40
  FileRenameInformationExBypassAccessCheck = 66,     // ordinal: 0x41
  FileDesiredStorageClassInformation = 67,           // ordinal: 0x42
  FileStatInformation = 68,                          // ordinal: 0x43
  FileMemoryPartitionInformation = 69,               // ordinal: 0x44
  FileStatLxInformation = 70,                        // ordinal: 0x45
  FileCaseSensitiveInformation = 71,                 // ordinal: 0x46
  FileLinkInformationEx = 72,                        // ordinal: 0x47
  FileLinkInformationExBypassAccessCheck = 73,       // ordinal: 0x48
  FileStorageReserveIdInformation = 74,              // ordinal: 0x49
  FileCaseSensitiveInformationForceAccessCheck = 75, // ordinal: 0x4a
  FileKnownFolderInformation = 76,                   // ordinal: 0x4b
  FileMaximumInformation = 77,                       // ordinal: 0x4c
} _FILE_INFORMATION_CLASS;

typedef enum _NT_IORING_SQ_FLAGS {
  NT_IORING_SQ_FLAG_NONE = 0, // ordinal: 0x0
} _NT_IORING_SQ_FLAGS;

typedef enum _NT_IORING_CREATE_ADVISORY_FLAGS {
  NT_IORING_CREATE_ADVISORY_FLAG_NONE = 0, // ordinal: 0x0
} _NT_IORING_CREATE_ADVISORY_FLAGS;

typedef enum _NT_IORING_CREATE_REQUIRED_FLAGS {
  NT_IORING_CREATE_REQUIRED_FLAG_NONE = 0, // ordinal: 0x0
} _NT_IORING_CREATE_REQUIRED_FLAGS;

// 0x8 bytes (sizeof)
typedef struct _NT_IORING_CREATE_FLAGS {
  enum _NT_IORING_CREATE_REQUIRED_FLAGS Required; // offset: 0x0 ordinal: 0x0
  enum _NT_IORING_CREATE_ADVISORY_FLAGS Advisory; // offset: 0x4 ordinal: 0x1
} _NT_IORING_CREATE_FLAGS;

typedef enum _PNP_PROBLEM_CODE_LOG_OPERATION {
  ProblemCodeOpInvalid = 0, // ordinal: 0x0
  ProblemCodeOpSet = 1,     // ordinal: 0x1
  ProblemCodeOpClear = 2,   // ordinal: 0x2
  ProblemCodeOpMax = 3,     // ordinal: 0x3
} _PNP_PROBLEM_CODE_LOG_OPERATION;

typedef enum _PNP_REBALANCE_REASON {
  RebalanceReasonUnknown = 0,             // ordinal: 0x0
  RebalanceReasonRequirementsChanged = 1, // ordinal: 0x1
  RebalanceReasonNewDevice = 2,           // ordinal: 0x2
} _PNP_REBALANCE_REASON;

typedef enum _PNP_DEVICE_DELETE_TYPE {
  QueryRemoveDevice = 0,           // ordinal: 0x0
  CancelRemoveDevice = 1,          // ordinal: 0x1
  RemoveDevice = 2,                // ordinal: 0x2
  SurpriseRemoveDevice = 3,        // ordinal: 0x3
  EjectDevice = 4,                 // ordinal: 0x4
  RemoveFailedDevice = 5,          // ordinal: 0x5
  RemoveUnstartedFailedDevice = 6, // ordinal: 0x6
  MaxDeviceDeleteType = 7,         // ordinal: 0x7
} _PNP_DEVICE_DELETE_TYPE;

typedef enum IRPLOCK {
  IRPLOCK_CANCELABLE = 0,      // ordinal: 0x0
  IRPLOCK_CANCEL_STARTED = 1,  // ordinal: 0x1
  IRPLOCK_CANCEL_COMPLETE = 2, // ordinal: 0x2
  IRPLOCK_COMPLETED = 3,       // ordinal: 0x3
} IRPLOCK;

typedef enum _ETW_PERIODIC_TIMER_STATE {
  EtwpPeriodicTimerUnset = 0, // ordinal: 0x0
  EtwpPeriodicTimerSet = 1,   // ordinal: 0x1
} _ETW_PERIODIC_TIMER_STATE;

typedef enum _TOKEN_TYPE {
  TokenPrimary = 1,       // ordinal: 0x0
  TokenImpersonation = 2, // ordinal: 0x1
} _TOKEN_TYPE;

typedef enum _SECURITY_IMPERSONATION_LEVEL {
  SecurityAnonymous = 0,      // ordinal: 0x0
  SecurityIdentification = 1, // ordinal: 0x1
  SecurityImpersonation = 2,  // ordinal: 0x2
  SecurityDelegation = 3,     // ordinal: 0x3
} _SECURITY_IMPERSONATION_LEVEL;

typedef enum _ETW_BUFFER_STATE {
  EtwBufferStateFree = 0,               // ordinal: 0x0
  EtwBufferStateGeneralLogging = 1,     // ordinal: 0x1
  EtwBufferStateCSwitch = 2,            // ordinal: 0x2
  EtwBufferStateFlush = 3,              // ordinal: 0x3
  EtwBufferStatePendingCompression = 4, // ordinal: 0x4
  EtwBufferStateCompressed = 5,         // ordinal: 0x5
  EtwBufferStatePlaceholder = 6,        // ordinal: 0x6
  EtwBufferStateMaximum = 7,            // ordinal: 0x7
} _ETW_BUFFER_STATE;

typedef enum IORING_VERSION {
  IORING_VERSION_INVALID = 0, // ordinal: 0x0
  IORING_VERSION_1 = 1,       // ordinal: 0x1
  IORING_VERSION_2 = 2,       // ordinal: 0x2
  IORING_VERSION_3 = 300,     // ordinal: 0x3
} IORING_VERSION;

typedef enum _PEP_WORK_TYPE {
  PepWorkActiveComplete = 0,                    // ordinal: 0x0
  PepWorkRequestIdleState = 1,                  // ordinal: 0x1
  PepWorkDevicePower = 2,                       // ordinal: 0x2
  PepWorkRequestPowerControl = 3,               // ordinal: 0x3
  PepWorkDeviceIdle = 4,                        // ordinal: 0x4
  PepWorkCompleteIdleState = 5,                 // ordinal: 0x5
  PepWorkCompletePerfState = 6,                 // ordinal: 0x6
  PepWorkAcpiNotify = 7,                        // ordinal: 0x7
  PepWorkAcpiEvaluateControlMethodComplete = 8, // ordinal: 0x8
  PepWorkMax = 9,                               // ordinal: 0x9
} _PEP_WORK_TYPE;

typedef enum PROFILE_STATUS {
  DOCK_NOTDOCKDEVICE = 0,      // ordinal: 0x0
  DOCK_QUIESCENT = 1,          // ordinal: 0x1
  DOCK_ARRIVING = 2,           // ordinal: 0x2
  DOCK_DEPARTING = 3,          // ordinal: 0x3
  DOCK_EJECTIRP_COMPLETED = 4, // ordinal: 0x4
} PROFILE_STATUS;

typedef enum _SYSTEM_POWER_STATE {
  PowerSystemUnspecified = 0, // ordinal: 0x0
  PowerSystemWorking = 1,     // ordinal: 0x1
  PowerSystemSleeping1 = 2,   // ordinal: 0x2
  PowerSystemSleeping2 = 3,   // ordinal: 0x3
  PowerSystemSleeping3 = 4,   // ordinal: 0x4
  PowerSystemHibernate = 5,   // ordinal: 0x5
  PowerSystemShutdown = 6,    // ordinal: 0x6
  PowerSystemMaximum = 7,     // ordinal: 0x7
} _SYSTEM_POWER_STATE;

// 0x4 bytes (sizeof)
typedef struct __anon_1018 {
  enum _SYSTEM_POWER_STATE PowerState; // offset: 0x0 ordinal: 0x0
} __anon_1018;

typedef enum _INTERFACE_TYPE {
  InterfaceTypeUndefined = -1, // ordinal: 0x0
  Internal = 0,                // ordinal: 0x1
  Isa = 1,                     // ordinal: 0x2
  Eisa = 2,                    // ordinal: 0x3
  MicroChannel = 3,            // ordinal: 0x4
  TurboChannel = 4,            // ordinal: 0x5
  PCIBus = 5,                  // ordinal: 0x6
  VMEBus = 6,                  // ordinal: 0x7
  NuBus = 7,                   // ordinal: 0x8
  PCMCIABus = 8,               // ordinal: 0x9
  CBus = 9,                    // ordinal: 0xa
  MPIBus = 10,                 // ordinal: 0xb
  MPSABus = 11,                // ordinal: 0xc
  ProcessorInternal = 12,      // ordinal: 0xd
  InternalPowerBus = 13,       // ordinal: 0xe
  PNPISABus = 14,              // ordinal: 0xf
  PNPBus = 15,                 // ordinal: 0x10
  Vmcs = 16,                   // ordinal: 0x11
  ACPIBus = 17,                // ordinal: 0x12
  MaximumInterfaceType = 18,   // ordinal: 0x13
} _INTERFACE_TYPE;

typedef enum _PNP_DEVNODE_STATE {
  DeviceNodeUnspecified = 768,            // ordinal: 0x0
  DeviceNodeUninitialized = 769,          // ordinal: 0x1
  DeviceNodeUninitializedPending = 770,   // ordinal: 0x2
  DeviceNodeInitializedPending = 771,     // ordinal: 0x3
  DeviceNodeInitialized = 772,            // ordinal: 0x4
  DeviceNodeDriversAdded = 773,           // ordinal: 0x5
  DeviceNodeResourcesAssigned = 774,      // ordinal: 0x6
  DeviceNodeStartPending = 775,           // ordinal: 0x7
  DeviceNodeStartCompletion = 776,        // ordinal: 0x8
  DeviceNodeStartPostWork = 777,          // ordinal: 0x9
  DeviceNodeStarted = 778,                // ordinal: 0xa
  DeviceNodeQueryStopped = 779,           // ordinal: 0xb
  DeviceNodeStopped = 780,                // ordinal: 0xc
  DeviceNodeRestartCompletion = 781,      // ordinal: 0xd
  DeviceNodeEnumeratePending = 782,       // ordinal: 0xe
  DeviceNodeEnumerateCompletion = 783,    // ordinal: 0xf
  DeviceNodeAwaitingQueuedDeletion = 784, // ordinal: 0x10
  DeviceNodeAwaitingQueuedRemoval = 785,  // ordinal: 0x11
  DeviceNodeQueryRemoved = 786,           // ordinal: 0x12
  DeviceNodeRemovePendingCloses = 787,    // ordinal: 0x13
  DeviceNodeRemoved = 788,                // ordinal: 0x14
  DeviceNodeDeletePendingCloses = 789,    // ordinal: 0x15
  DeviceNodeDeleted = 790,                // ordinal: 0x16
  MaxDeviceNodeState = 791,               // ordinal: 0x17
} _PNP_DEVNODE_STATE;

typedef enum _POP_IRP_WATCHDOG_STATE {
  IrpWatchdogStateDisabled = 0,         // ordinal: 0x0
  IrpWatchdogStateEnabled = 1,          // ordinal: 0x1
  IrpWatchdogStateCompleted = 2,        // ordinal: 0x2
  IrpWatchdogStateBlackboxSelected = 3, // ordinal: 0x3
} _POP_IRP_WATCHDOG_STATE;

typedef enum _POP_PEP_NOTIFY_DEVICE_DSTATE_REASON {
  PepNotifyDeviceDStateReasonNone = 0,             // ordinal: 0x0
  PepNotifyDeviceDStateReasonSystemTransition = 1, // ordinal: 0x1
  PepNotifyDeviceDStateReasonDfx = 2,              // ordinal: 0x2
  PepNotifyDeviceDStateReasonMax = 3,              // ordinal: 0x3
} _POP_PEP_NOTIFY_DEVICE_DSTATE_REASON;

typedef enum _POWER_STATE_TYPE {
  SystemPowerState = 0, // ordinal: 0x0
  DevicePowerState = 1, // ordinal: 0x1
} _POWER_STATE_TYPE;

typedef enum _WNF_DATA_SCOPE {
  WnfDataScopeSystem = 0,          // ordinal: 0x0
  WnfDataScopeSession = 1,         // ordinal: 0x1
  WnfDataScopeUser = 2,            // ordinal: 0x2
  WnfDataScopeProcess = 3,         // ordinal: 0x3
  WnfDataScopeMachine = 4,         // ordinal: 0x4
  WnfDataScopePhysicalMachine = 5, // ordinal: 0x5
} _WNF_DATA_SCOPE;

typedef enum ETW_COMPRESSION_RESUMPTION_MODE {
  EtwCompressionModeRestart = 0,   // ordinal: 0x0
  EtwCompressionModeNoDisable = 1, // ordinal: 0x1
  EtwCompressionModeNoRestart = 2, // ordinal: 0x2
} ETW_COMPRESSION_RESUMPTION_MODE;

typedef enum _ETW_RT_EVENT_LOSS {
  EtwRtEventNoLoss = 0,  // ordinal: 0x0
  EtwRtEventLost = 1,    // ordinal: 0x1
  EtwRtBufferLost = 2,   // ordinal: 0x2
  EtwRtBackupLost = 3,   // ordinal: 0x3
  EtwRtEventLossMax = 4, // ordinal: 0x4
} _ETW_RT_EVENT_LOSS;

typedef enum _POP_FX_ACCOUNTING_MODE {
  PopFxAccountingModeDisabled = 0, // ordinal: 0x0
  PopFxAccountingModeBasic = 1,    // ordinal: 0x1
  PopFxAccountingModeEnhanced = 2, // ordinal: 0x2
  PopFxAccountingModeMax = 3,      // ordinal: 0x3
} _POP_FX_ACCOUNTING_MODE;

// 0x4 bytes (sizeof)
typedef struct PEPHANDLE__ {
  LONG unused; // offset: 0x0 ordinal: 0x0
} PEPHANDLE__;

typedef enum _PROCESSOR_PRESENCE {
  ProcessorPresenceNt = 0,     // ordinal: 0x0
  ProcessorPresenceHv = 1,     // ordinal: 0x1
  ProcessorPresenceHidden = 2, // ordinal: 0x2
} _PROCESSOR_PRESENCE;

// 0x4 bytes (sizeof)
typedef union _POWER_STATE {
  enum _SYSTEM_POWER_STATE SystemState; // offset: 0x0 ordinal: 0x0
  enum _DEVICE_POWER_STATE DeviceState; // offset: 0x0 ordinal: 0x1
} _POWER_STATE;

typedef enum _POP_DEVICE_IDLE_TYPE {
  DeviceIdleNormal = 0, // ordinal: 0x0
  DeviceIdleDisk = 1,   // ordinal: 0x1
} _POP_DEVICE_IDLE_TYPE;

typedef enum _IO_ALLOCATION_ACTION {
  KeepObject = 1,                    // ordinal: 0x0
  DeallocateObject = 2,              // ordinal: 0x1
  DeallocateObjectKeepRegisters = 3, // ordinal: 0x2
} _IO_ALLOCATION_ACTION;

typedef enum PPM_IDLE_BUCKET_TIME_TYPE {
  PpmIdleBucketTimeInQpc = 0,   // ordinal: 0x0
  PpmIdleBucketTimeIn100ns = 1, // ordinal: 0x1
  PpmIdleBucketTimeMaximum = 2, // ordinal: 0x2
} PPM_IDLE_BUCKET_TIME_TYPE;

typedef enum _PROCESSOR_CACHE_TYPE {
  CacheUnified = 0,     // ordinal: 0x0
  CacheInstruction = 1, // ordinal: 0x1
  CacheData = 2,        // ordinal: 0x2
  CacheTrace = 3,       // ordinal: 0x3
} _PROCESSOR_CACHE_TYPE;

typedef enum _POOL_TYPE {
  NonPagedPool = 0,                          // ordinal: 0x0
  NonPagedPoolExecute = 0,                   // ordinal: 0x1
  PagedPool = 1,                             // ordinal: 0x2
  NonPagedPoolMustSucceed = 2,               // ordinal: 0x3
  DontUseThisType = 3,                       // ordinal: 0x4
  NonPagedPoolCacheAligned = 4,              // ordinal: 0x5
  PagedPoolCacheAligned = 5,                 // ordinal: 0x6
  NonPagedPoolCacheAlignedMustS = 6,         // ordinal: 0x7
  MaxPoolType = 7,                           // ordinal: 0x8
  NonPagedPoolBase = 0,                      // ordinal: 0x9
  NonPagedPoolBaseMustSucceed = 2,           // ordinal: 0xa
  NonPagedPoolBaseCacheAligned = 4,          // ordinal: 0xb
  NonPagedPoolBaseCacheAlignedMustS = 6,     // ordinal: 0xc
  NonPagedPoolSession = 32,                  // ordinal: 0xd
  PagedPoolSession = 33,                     // ordinal: 0xe
  NonPagedPoolMustSucceedSession = 34,       // ordinal: 0xf
  DontUseThisTypeSession = 35,               // ordinal: 0x10
  NonPagedPoolCacheAlignedSession = 36,      // ordinal: 0x11
  PagedPoolCacheAlignedSession = 37,         // ordinal: 0x12
  NonPagedPoolCacheAlignedMustSSession = 38, // ordinal: 0x13
  NonPagedPoolNx = 512,                      // ordinal: 0x14
  NonPagedPoolNxCacheAligned = 516,          // ordinal: 0x15
  NonPagedPoolSessionNx = 544,               // ordinal: 0x16
} _POOL_TYPE;

typedef enum _HARDWARE_COUNTER_TYPE {
  PMCCounter = 0,             // ordinal: 0x0
  MaxHardwareCounterType = 1, // ordinal: 0x1
} _HARDWARE_COUNTER_TYPE;

typedef enum _FUNCTION_TABLE_TYPE {
  RF_SORTED = 0,         // ordinal: 0x0
  RF_UNSORTED = 1,       // ordinal: 0x1
  RF_CALLBACK = 2,       // ordinal: 0x2
  RF_KERNEL_DYNAMIC = 3, // ordinal: 0x3
} _FUNCTION_TABLE_TYPE;

typedef enum _NT_PRODUCT_TYPE {
  NtProductWinNt = 1,    // ordinal: 0x0
  NtProductLanManNt = 2, // ordinal: 0x1
  NtProductServer = 3,   // ordinal: 0x2
} _NT_PRODUCT_TYPE;

typedef enum _KCLOCK_TIMER_DEADLINE_TYPE {
  KClockTimerKTimerExpirationNonHr = 0,        // ordinal: 0x0
  KClockTimerKTimerExpirationPseudoHr = 1,     // ordinal: 0x1
  KClockTimerKTimer2ExpirationHr = 2,          // ordinal: 0x2
  KClockTimerKTimersMax = 2,                   // ordinal: 0x3
  KClockTimerQuantumEnd = 3,                   // ordinal: 0x4
  KClockTimerGroupSchedulingGenerationEnd = 4, // ordinal: 0x5
  KClockTimerIdlePromotion = 5,                // ordinal: 0x6
  KClockTimerBamQosHysteresisEnd = 6,          // ordinal: 0x7
  KClockTimerMax = 7,                          // ordinal: 0x8
} _KCLOCK_TIMER_DEADLINE_TYPE;

typedef enum _KCLOCK_TIMER_ONE_SHOT_STATE {
  KClockTimerOneShotUnarmed = 0,       // ordinal: 0x0
  KClockTimerOneShotArmed = 1,         // ordinal: 0x1
  KClockTimerOneShotRearmRequired = 2, // ordinal: 0x2
  KClockTimerOneShotInvalid = 3,       // ordinal: 0x3
} _KCLOCK_TIMER_ONE_SHOT_STATE;

typedef enum _KHETERO_CPU_QOS {
  KHeteroCpuQosDefault = 0,    // ordinal: 0x0
  KHeteroCpuQosHigh = 0,       // ordinal: 0x1
  KHeteroCpuQosMedium = 1,     // ordinal: 0x2
  KHeteroCpuQosLow = 2,        // ordinal: 0x3
  KHeteroCpuQosMultimedia = 3, // ordinal: 0x4
  KHeteroCpuQosDeadline = 4,   // ordinal: 0x5
  KHeteroCpuQosEco = 5,        // ordinal: 0x6
  KHeteroCpuQosUtility = 6,    // ordinal: 0x7
  KHeteroCpuQosDynamic = 7,    // ordinal: 0x8
  KHeteroCpuQosMax = 7,        // ordinal: 0x9
} _KHETERO_CPU_QOS;

typedef enum _PROC_HYPERVISOR_STATE {
  ProcHypervisorNone = 0,       // ordinal: 0x0
  ProcHypervisorPresent = 1,    // ordinal: 0x1
  ProcHypervisorPower = 2,      // ordinal: 0x2
  ProcHypervisorHvCounters = 3, // ordinal: 0x3
} _PROC_HYPERVISOR_STATE;

typedef enum _SERVERSILO_STATE {
  SERVERSILO_INITING = 0,       // ordinal: 0x0
  SERVERSILO_STARTED = 1,       // ordinal: 0x1
  SERVERSILO_SHUTTING_DOWN = 2, // ordinal: 0x2
  SERVERSILO_TERMINATING = 3,   // ordinal: 0x3
  SERVERSILO_TERMINATED = 4,    // ordinal: 0x4
} _SERVERSILO_STATE;

// 0x0 bytes (sizeof)
typedef struct _CHPEV2_PROCESS_INFO {
} _CHPEV2_PROCESS_INFO;

// 0x0 bytes (sizeof)
typedef struct _ASSEMBLY_STORAGE_MAP {
} _ASSEMBLY_STORAGE_MAP;

// 0x0 bytes (sizeof)
typedef struct _JOB_NET_RATE_CONTROL {
} _JOB_NET_RATE_CONTROL;

// 0x0 bytes (sizeof)
typedef struct _PSP_STORAGE {
} _PSP_STORAGE;

// 0x0 bytes (sizeof)
typedef struct _JOB_CPU_RATE_CONTROL {
} _JOB_CPU_RATE_CONTROL;

// 0x0 bytes (sizeof)
typedef struct _JOB_NOTIFICATION_INFORMATION {
} _JOB_NOTIFICATION_INFORMATION;

// 0x0 bytes (sizeof)
typedef struct _JOB_ACCESS_STATE {
} _JOB_ACCESS_STATE;

typedef short SHORT;

typedef long long LONGLONG;

typedef enum _SYSTEM_DLL_TYPE {
  PsNativeSystemDll = 0,       // ordinal: 0x0
  PsWowX86SystemDll = 1,       // ordinal: 0x1
  PsWowArm32SystemDll = 2,     // ordinal: 0x2
  PsWowChpeX86SystemDll = 3,   // ordinal: 0x3
  PsChpeV2SystemDll = 4,       // ordinal: 0x4
  PsVsmEnclaveRuntimeDll = 5,  // ordinal: 0x5
  PsTrustedAppsRuntimeDll = 6, // ordinal: 0x6
  PsSystemDllTotalTypes = 7,   // ordinal: 0x7
} _SYSTEM_DLL_TYPE;

typedef enum _IO_SESSION_STATE {
  IoSessionStateCreated = 1,              // ordinal: 0x0
  IoSessionStateInitialized = 2,          // ordinal: 0x1
  IoSessionStateConnected = 3,            // ordinal: 0x2
  IoSessionStateDisconnected = 4,         // ordinal: 0x3
  IoSessionStateDisconnectedLoggedOn = 5, // ordinal: 0x4
  IoSessionStateLoggedOn = 6,             // ordinal: 0x5
  IoSessionStateLoggedOff = 7,            // ordinal: 0x6
  IoSessionStateTerminated = 8,           // ordinal: 0x7
  IoSessionStateMax = 9,                  // ordinal: 0x8
} _IO_SESSION_STATE;

// 0x8 bytes (sizeof)
typedef struct _ARBITER_ADD_RESERVED_PARAMETERS {
  struct _DEVICE_OBJECT *ReserveDevice; // offset: 0x0 ordinal: 0x0
} _ARBITER_ADD_RESERVED_PARAMETERS;

// 0x0 bytes (sizeof)
typedef struct _PS_SYSCALL_PROVIDER {
} _PS_SYSCALL_PROVIDER;

// 0x0 bytes (sizeof)
typedef struct _PO_PROCESS_ENERGY_CONTEXT {
} _PO_PROCESS_ENERGY_CONTEXT;

// 0x0 bytes (sizeof)
typedef struct _EPROCESS_QUOTA_BLOCK {
} _EPROCESS_QUOTA_BLOCK;

// 0x0 bytes (sizeof)
typedef struct _PAGEFAULT_HISTORY {
} _PAGEFAULT_HISTORY;

// 0x44 bytes (sizeof)
typedef struct _IO_APIC_REGISTERS {
  ULONG RegisterIndex;  // offset: 0x0 ordinal: 0x0
  ULONG Reserved1[3];   // offset: 0x4 ordinal: 0x1
  ULONG RegisterValue;  // offset: 0x10 ordinal: 0x2
  ULONG Reserved2[11];  // offset: 0x14 ordinal: 0x3
  ULONG EndOfInterrupt; // offset: 0x40 ordinal: 0x4
} _IO_APIC_REGISTERS;

// 0x10 bytes (sizeof)
typedef struct _HEAP_OPPORTUNISTIC_LARGE_PAGE_STATS {
  ULONGLONG SmallPagesInUseWithinLarge;  // offset: 0x0 ordinal: 0x0
  ULONGLONG OpportunisticLargePageCount; // offset: 0x8 ordinal: 0x1
} _HEAP_OPPORTUNISTIC_LARGE_PAGE_STATS;

// 0x8 bytes (sizeof)
typedef struct _RTL_AVL_TREE {
  struct _RTL_BALANCED_NODE *Root; // offset: 0x0 ordinal: 0x0
} _RTL_AVL_TREE;

// 0x10 bytes (sizeof)
typedef struct _HIVE_WRITE_WAIT_QUEUE {
  struct _ETHREAD *ActiveThread;      // offset: 0x0 ordinal: 0x0
  struct _HIVE_WAIT_PACKET *WaitList; // offset: 0x8 ordinal: 0x1
} _HIVE_WRITE_WAIT_QUEUE;

// 0x4 bytes (sizeof)
typedef struct __anon_2846 {
  SHORT Type;           // offset: 0x0 ordinal: 0x0
  SHORT DataInfoOffset; // offset: 0x2 ordinal: 0x1
} __anon_2846;

// 0x4 bytes (sizeof)
typedef struct __anon_2844 {
  SHORT DataLength;  // offset: 0x0 ordinal: 0x0
  SHORT TotalLength; // offset: 0x2 ordinal: 0x1
} __anon_2844;

// 0x10 bytes (sizeof)
typedef struct _TIME_FIELDS {
  SHORT Year;         // offset: 0x0 ordinal: 0x0
  SHORT Month;        // offset: 0x2 ordinal: 0x1
  SHORT Day;          // offset: 0x4 ordinal: 0x2
  SHORT Hour;         // offset: 0x6 ordinal: 0x3
  SHORT Minute;       // offset: 0x8 ordinal: 0x4
  SHORT Second;       // offset: 0xa ordinal: 0x5
  SHORT Milliseconds; // offset: 0xc ordinal: 0x6
  SHORT Weekday;      // offset: 0xe ordinal: 0x7
} _TIME_FIELDS;

// 0x8 bytes (sizeof)
typedef struct __anon_3564 {
  struct _MDL *Mdl; // offset: 0x0 ordinal: 0x0
} __anon_3564;

// 0x1 bytes (sizeof)
typedef union __anon_4013 {
  UCHAR AsUCHAR;                // offset: 0x0 ordinal: 0x0
  UCHAR NoDomainAccounting : 1; // offset: 0x0 ordinal: 0x1
  UCHAR IncreasePolicy : 2;     // offset: 0x0 ordinal: 0x2
  UCHAR DecreasePolicy : 2;     // offset: 0x0 ordinal: 0x3
  UCHAR Reserved : 3;           // offset: 0x0 ordinal: 0x4
} __anon_4013;

// 0x1 bytes (sizeof)
typedef struct __anon_3854 {
  UCHAR StopRequired; // offset: 0x0 ordinal: 0x0
} __anon_3854;

// 0x1 bytes (sizeof)
typedef struct __anon_3853 {
  UCHAR ClearWaitingForFdo; // offset: 0x0 ordinal: 0x0
} __anon_3853;

// 0x1 bytes (sizeof)
typedef struct __anon_3696 {
  UCHAR EntireWsle; // offset: 0x0 ordinal: 0x0
} __anon_3696;

// 0x1 bytes (sizeof)
typedef struct __anon_3695 {
  UCHAR Age : 4;        // offset: 0x0 ordinal: 0x0
  UCHAR Protection : 3; // offset: 0x0 ordinal: 0x1
  UCHAR Reserved : 1;   // offset: 0x0 ordinal: 0x2
} __anon_3695;

// 0x1 bytes (sizeof)
typedef union __anon_3681 {
  struct __anon_3695 e1; // offset: 0x0 ordinal: 0x0
  struct __anon_3696 e2; // offset: 0x0 ordinal: 0x1
} __anon_3681;

// 0x1 bytes (sizeof)
typedef struct _MI_WSLE {
  union __anon_3681 u1; // offset: 0x0 ordinal: 0x0
} _MI_WSLE;

// 0x1 bytes (sizeof)
typedef union _PS_TRUSTLET_ATTRIBUTE_ACCESSRIGHTS {
  UCHAR Trustlet : 1;    // offset: 0x0 ordinal: 0x0
  UCHAR Ntos : 1;        // offset: 0x0 ordinal: 0x1
  UCHAR WriteHandle : 1; // offset: 0x0 ordinal: 0x2
  UCHAR ReadHandle : 1;  // offset: 0x0 ordinal: 0x3
  UCHAR Reserved : 4;    // offset: 0x0 ordinal: 0x4
  UCHAR AccessRights;    // offset: 0x0 ordinal: 0x5
} _PS_TRUSTLET_ATTRIBUTE_ACCESSRIGHTS;

// 0x1 bytes (sizeof)
typedef union _IOMMU_ATS_SETTINGS {
  UCHAR AtsSupported : 1; // offset: 0x0 ordinal: 0x0
  UCHAR AtsRequired : 1;  // offset: 0x0 ordinal: 0x1
  UCHAR Rsvd : 6;         // offset: 0x0 ordinal: 0x2
  UCHAR AsUCHAR;          // offset: 0x0 ordinal: 0x3
} _IOMMU_ATS_SETTINGS;

// 0x2 bytes (sizeof)
typedef struct __anon_3383 {
  UCHAR SecondaryBus;   // offset: 0x0 ordinal: 0x0
  UCHAR SubordinateBus; // offset: 0x1 ordinal: 0x1
} __anon_3383;

// 0x4 bytes (sizeof)
typedef struct __anon_3382 {
  UCHAR Bus;      // offset: 0x0 ordinal: 0x0
  UCHAR Device;   // offset: 0x1 ordinal: 0x1
  UCHAR Function; // offset: 0x2 ordinal: 0x2
  UCHAR Reserved; // offset: 0x3 ordinal: 0x3
} __anon_3382;

typedef UCHAR (*__anon_3292)(UCHAR);

// 0x1e bytes (sizeof)
typedef struct _TOKEN_AUDIT_POLICY {
  UCHAR PerUserPolicy[30]; // offset: 0x0 ordinal: 0x0
} _TOKEN_AUDIT_POLICY;

// 0x1f bytes (sizeof)
typedef struct _SEP_AUDIT_POLICY {
  struct _TOKEN_AUDIT_POLICY AdtTokenPolicy; // offset: 0x0 ordinal: 0x0
  UCHAR PolicySetStatus;                     // offset: 0x1e ordinal: 0x1
} _SEP_AUDIT_POLICY;

// 0x1 bytes (sizeof)
typedef struct _ETW_LOGGER_HANDLE {
  UCHAR DereferenceAndLeave; // offset: 0x0 ordinal: 0x0
} _ETW_LOGGER_HANDLE;

// 0x4 bytes (sizeof)
typedef struct __anon_2968 {
  UCHAR MajorVersion;    // offset: 0x0 ordinal: 0x0
  UCHAR MinorVersion;    // offset: 0x1 ordinal: 0x1
  UCHAR SubVersion;      // offset: 0x2 ordinal: 0x2
  UCHAR SubMinorVersion; // offset: 0x3 ordinal: 0x3
} __anon_2968;

// 0x1 bytes (sizeof)
typedef struct __anon_2855 {
  UCHAR ReferenceCache : 1; // offset: 0x0 ordinal: 0x0
  UCHAR Lookaside : 1;      // offset: 0x0 ordinal: 0x1
  UCHAR Initializing : 1;   // offset: 0x0 ordinal: 0x2
  UCHAR Deleted : 1;        // offset: 0x0 ordinal: 0x3
} __anon_2855;

// 0x1 bytes (sizeof)
typedef union __anon_2856 {
  struct __anon_2855 s1; // offset: 0x0 ordinal: 0x0
  UCHAR Flags;           // offset: 0x0 ordinal: 0x1
} __anon_2856;

// 0x2 bytes (sizeof)
typedef struct _HEAP_LFH_SUBSEGMENT_STAT {
  UCHAR Index; // offset: 0x0 ordinal: 0x0
  UCHAR Count; // offset: 0x1 ordinal: 0x1
} _HEAP_LFH_SUBSEGMENT_STAT;

// 0x1 bytes (sizeof)
typedef union __anon_2780 {
  UCHAR LargePagePolicy : 3;       // offset: 0x0 ordinal: 0x0
  UCHAR FullDecommit : 1;          // offset: 0x0 ordinal: 0x1
  UCHAR ReleaseEmptySegments : 1;  // offset: 0x0 ordinal: 0x2
  UCHAR LargeHeapFirstSegment : 1; // offset: 0x0 ordinal: 0x3
  UCHAR AllFlags;                  // offset: 0x0 ordinal: 0x4
} __anon_2780;

// 0x8 bytes (sizeof)
typedef union __anon_2702 {
  struct _CC_PARTITION *Partition; // offset: 0x0 ordinal: 0x0
  struct _PRIVATE_VOLUME_CACHEMAP
      *PrivateVolumeCacheMap; // offset: 0x0 ordinal: 0x1
} __anon_2702;

// 0x10 bytes (sizeof)
typedef struct _CC_LWS_PACKET {
  enum _CC_LWS_PACKET_TYPE Type; // offset: 0x0 ordinal: 0x0
  UCHAR Active;                  // offset: 0x4 ordinal: 0x1
  union __anon_2702 Overlay;     // offset: 0x8 ordinal: 0x2
} _CC_LWS_PACKET;

// 0x4 bytes (sizeof)
typedef struct _MMPAGE_FILE_EXPANSION_FLAGS {
  UCHAR PageFileNumber : 8;        // offset: 0x0 ordinal: 0x0
  UCHAR Spare1 : 8;                // offset: 0x1 ordinal: 0x1
  UCHAR Spare2 : 8;                // offset: 0x2 ordinal: 0x2
  UCHAR IgnoreCurrentCommit : 1;   // offset: 0x3 ordinal: 0x3
  UCHAR IncreaseMinimumSize : 1;   // offset: 0x3 ordinal: 0x4
  UCHAR AttemptForCantExtend : 1;  // offset: 0x3 ordinal: 0x5
  UCHAR UnusedSegmentDeletion : 1; // offset: 0x3 ordinal: 0x6
  UCHAR PageFileContract : 1;      // offset: 0x3 ordinal: 0x7
  UCHAR NoWait : 1;                // offset: 0x3 ordinal: 0x8
  UCHAR Spare3 : 2;                // offset: 0x3 ordinal: 0x9
} _MMPAGE_FILE_EXPANSION_FLAGS;

// 0x3 bytes (sizeof)
typedef struct _MI_RESTRICTED_MODWRITES {
  UCHAR MaximumClusterPages;  // offset: 0x0 ordinal: 0x0
  UCHAR ReducedClusterWrites; // offset: 0x1 ordinal: 0x1
  UCHAR ImposeDelay;          // offset: 0x2 ordinal: 0x2
} _MI_RESTRICTED_MODWRITES;

// 0x1 bytes (sizeof)
typedef struct __anon_2121 {
  UCHAR ModifiedListBucketIndex : 4; // offset: 0x0 ordinal: 0x0
} __anon_2121;

// 0x1 bytes (sizeof)
typedef struct _MMPFNENTRY3 {
  UCHAR Priority : 3;           // offset: 0x0 ordinal: 0x0
  UCHAR OnProtectedStandby : 1; // offset: 0x0 ordinal: 0x1
  UCHAR InPageError : 1;        // offset: 0x0 ordinal: 0x2
  UCHAR SystemChargedPage : 1;  // offset: 0x0 ordinal: 0x3
  UCHAR RemovalRequested : 1;   // offset: 0x0 ordinal: 0x4
  UCHAR ParityError : 1;        // offset: 0x0 ordinal: 0x5
} _MMPFNENTRY3;

// 0x1 bytes (sizeof)
typedef struct _MMPFNENTRY1 {
  UCHAR PageLocation : 3;    // offset: 0x0 ordinal: 0x0
  UCHAR WriteInProgress : 1; // offset: 0x0 ordinal: 0x1
  UCHAR Modified : 1;        // offset: 0x0 ordinal: 0x2
  UCHAR ReadInProgress : 1;  // offset: 0x0 ordinal: 0x3
  UCHAR CacheAttribute : 2;  // offset: 0x0 ordinal: 0x4
} _MMPFNENTRY1;

// 0x20 bytes (sizeof)
typedef struct wil_details_FeatureTestState {
  enum wil_details_FeatureTestStateKind kind;     // offset: 0x0 ordinal: 0x0
  ULONG featureId;                                // offset: 0x4 ordinal: 0x1
  enum wil_FeatureEnabledState state;             // offset: 0x8 ordinal: 0x2
  UCHAR variant;                                  // offset: 0xc ordinal: 0x3
  ULONG payload;                                  // offset: 0x10 ordinal: 0x4
  enum wil_FeatureVariantPayloadKind payloadKind; // offset: 0x14 ordinal: 0x5
  struct wil_details_FeatureTestState *next;      // offset: 0x18 ordinal: 0x6
} wil_details_FeatureTestState;

// 0x18 bytes (sizeof)
typedef struct wil_FeatureState {
  enum wil_FeatureEnabledState enabledState;      // offset: 0x0 ordinal: 0x0
  UCHAR variant;                                  // offset: 0x4 ordinal: 0x1
  enum wil_FeatureVariantPayloadKind payloadKind; // offset: 0x8 ordinal: 0x2
  ULONG payload;                                  // offset: 0xc ordinal: 0x3
  LONG hasNotification;                           // offset: 0x10 ordinal: 0x4
  LONG isWexpConfiguration;                       // offset: 0x14 ordinal: 0x5
} wil_FeatureState;

// 0x1 bytes (sizeof)
typedef struct __anon_2005 {
  UCHAR ProcessorOnly : 1;      // offset: 0x0 ordinal: 0x0
  UCHAR GroupsAssigned : 1;     // offset: 0x0 ordinal: 0x1
  UCHAR MeasurableDistance : 1; // offset: 0x0 ordinal: 0x2
} __anon_2005;

typedef UCHAR (*__anon_1853)();

// 0x1 bytes (sizeof)
typedef struct __anon_1767 {
  UCHAR EnableTranslation : 1; // offset: 0x0 ordinal: 0x0
  UCHAR Reserved : 7;          // offset: 0x0 ordinal: 0x1
} __anon_1767;

// 0x1 bytes (sizeof)
typedef struct __anon_1728 {
  UCHAR DefaultDomain : 1;  // offset: 0x0 ordinal: 0x0
  UCHAR FirmwareDomain : 1; // offset: 0x0 ordinal: 0x1
} __anon_1728;

// 0x1 bytes (sizeof)
typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS {
  UCHAR FRUId : 1;    // offset: 0x0 ordinal: 0x0
  UCHAR FRUText : 1;  // offset: 0x0 ordinal: 0x1
  UCHAR Reserved : 6; // offset: 0x0 ordinal: 0x2
  UCHAR AsUCHAR;      // offset: 0x0 ordinal: 0x3
} _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS;

// 0x1 bytes (sizeof)
typedef union _XPF_MC_BANK_FLAGS {
  UCHAR ClearOnInitializationRW : 1; // offset: 0x0 ordinal: 0x0
  UCHAR ControlDataRW : 1;           // offset: 0x0 ordinal: 0x1
  UCHAR Reserved : 6;                // offset: 0x0 ordinal: 0x2
  UCHAR AsUCHAR;                     // offset: 0x0 ordinal: 0x3
} _XPF_MC_BANK_FLAGS;

// 0x4 bytes (sizeof)
typedef struct __anon_1293 {
  UCHAR BaseMiddle; // offset: 0x0 ordinal: 0x0
  UCHAR Flags1;     // offset: 0x1 ordinal: 0x1
  UCHAR Flags2;     // offset: 0x2 ordinal: 0x2
  UCHAR BaseHigh;   // offset: 0x3 ordinal: 0x3
} __anon_1293;

// 0x1 bytes (sizeof)
typedef struct __anon_1014 {
  UCHAR Lock; // offset: 0x0 ordinal: 0x0
} __anon_1014;

// 0x10 bytes (sizeof)
typedef struct _PEP_WORK_DEVICE_IDLE {
  struct POHANDLE__ *DeviceHandle; // offset: 0x0 ordinal: 0x0
  UCHAR IgnoreIdleTimeout;         // offset: 0x8 ordinal: 0x1
} _PEP_WORK_DEVICE_IDLE;

// 0x10 bytes (sizeof)
typedef struct _PEP_WORK_DEVICE_POWER {
  struct POHANDLE__ *DeviceHandle; // offset: 0x0 ordinal: 0x0
  UCHAR PowerRequired;             // offset: 0x8 ordinal: 0x1
} _PEP_WORK_DEVICE_POWER;

typedef UCHAR (*__anon_786)(struct _FILE_OBJECT *, struct _MDL *,
                            struct _DEVICE_OBJECT *);

// 0x4 bytes (sizeof)
typedef struct _KHETERO_HWFEEDBACK_CLASS {
  UCHAR PerformanceClass;         // offset: 0x0 ordinal: 0x0
  UCHAR EfficiencyClass;          // offset: 0x1 ordinal: 0x1
  UCHAR PerformanceClassRawValue; // offset: 0x2 ordinal: 0x2
  UCHAR EfficiencyClassRawValue;  // offset: 0x3 ordinal: 0x3
} _KHETERO_HWFEEDBACK_CLASS;

// 0x2 bytes (sizeof)
typedef struct _ETW_SYSTEM_LOGGER {
  UCHAR LoggerId;  // offset: 0x0 ordinal: 0x0
  UCHAR ClockType; // offset: 0x1 ordinal: 0x1
} _ETW_SYSTEM_LOGGER;

// 0x1 bytes (sizeof)
typedef union _KHETERO_STATE {
  UCHAR Qos : 3;           // offset: 0x0 ordinal: 0x0
  UCHAR WorkloadClass : 3; // offset: 0x0 ordinal: 0x1
  UCHAR RunningType : 1;   // offset: 0x0 ordinal: 0x2
  UCHAR AllFields;         // offset: 0x0 ordinal: 0x3
} _KHETERO_STATE;

// 0x2 bytes (sizeof)
typedef struct _PROC_PERF_LOAD {
  UCHAR BusyPercentage;      // offset: 0x0 ordinal: 0x0
  UCHAR FrequencyPercentage; // offset: 0x1 ordinal: 0x1
} _PROC_PERF_LOAD;

// 0x1 bytes (sizeof)
typedef struct _flags {
  UCHAR SmtSetsPresent : 1; // offset: 0x0 ordinal: 0x0
  UCHAR Fill : 7;           // offset: 0x0 ordinal: 0x1
} _flags;

// 0x6 bytes (sizeof)
typedef struct _PROC_IDLE_POLICY {
  UCHAR PromotePercent;     // offset: 0x0 ordinal: 0x0
  UCHAR DemotePercent;      // offset: 0x1 ordinal: 0x1
  UCHAR PromotePercentBase; // offset: 0x2 ordinal: 0x2
  UCHAR DemotePercentBase;  // offset: 0x3 ordinal: 0x3
  UCHAR AllowScaling;       // offset: 0x4 ordinal: 0x4
  UCHAR ForceLightIdle;     // offset: 0x5 ordinal: 0x5
} _PROC_IDLE_POLICY;

// 0x1 bytes (sizeof)
typedef union _KPRIORITY_STATE {
  UCHAR Priority : 7;       // offset: 0x0 ordinal: 0x0
  UCHAR IsolationWidth : 1; // offset: 0x0 ordinal: 0x1
  UCHAR AllFields;          // offset: 0x0 ordinal: 0x2
} _KPRIORITY_STATE;

// 0x8 bytes (sizeof)
typedef struct __anon_3548 {
  UCHAR Pch;                // offset: 0x0 ordinal: 0x0
  UCHAR EmbeddedController; // offset: 0x1 ordinal: 0x1
  UCHAR Reserved[6];        // offset: 0x2 ordinal: 0x2
} __anon_3548;

// 0x6 bytes (sizeof)
typedef struct _SID_IDENTIFIER_AUTHORITY {
  UCHAR Value[6]; // offset: 0x0 ordinal: 0x0
} _SID_IDENTIFIER_AUTHORITY;

// 0x48 bytes (sizeof)
typedef struct _KCORE_CONTROL_BLOCK {
  UCHAR ProcessorCount;    // offset: 0x0 ordinal: 0x0
  UCHAR ScanStartIndex;    // offset: 0x1 ordinal: 0x1
  UCHAR Spare[6];          // offset: 0x2 ordinal: 0x2
  struct _KPRCB *Prcbs[8]; // offset: 0x8 ordinal: 0x3
} _KCORE_CONTROL_BLOCK;

// 0x10 bytes (sizeof)
typedef struct _VF_ADDRESS_RANGE {
  UCHAR *Start; // offset: 0x0 ordinal: 0x0
  UCHAR *End;   // offset: 0x8 ordinal: 0x1
} _VF_ADDRESS_RANGE;

// 0x10 bytes (sizeof)
typedef struct __anon_1017 {
  UCHAR InPath;                              // offset: 0x0 ordinal: 0x0
  UCHAR Reserved[3];                         // offset: 0x1 ordinal: 0x1
  enum _DEVICE_USAGE_NOTIFICATION_TYPE Type; // offset: 0x8 ordinal: 0x2
} __anon_1017;

// 0x50 bytes (sizeof)
typedef struct _RTL_FUNCTION_OVERRIDE_CAPABILITIES {
  UCHAR AMD64Capabilities[40];       // offset: 0x0 ordinal: 0x0
  UCHAR AMD64KernelCapabilities[40]; // offset: 0x28 ordinal: 0x1
} _RTL_FUNCTION_OVERRIDE_CAPABILITIES;

// 0x1 bytes (sizeof)
typedef union _KWAIT_STATUS_REGISTER {
  UCHAR Flags;        // offset: 0x0 ordinal: 0x0
  UCHAR State : 3;    // offset: 0x0 ordinal: 0x1
  UCHAR Affinity : 1; // offset: 0x0 ordinal: 0x2
  UCHAR Priority : 1; // offset: 0x0 ordinal: 0x3
  UCHAR Apc : 1;      // offset: 0x0 ordinal: 0x4
  UCHAR UserApc : 1;  // offset: 0x0 ordinal: 0x5
  UCHAR Alert : 1;    // offset: 0x0 ordinal: 0x6
} _KWAIT_STATUS_REGISTER;

// 0x10 bytes (sizeof)
typedef struct _RTL_RB_TREE {
  struct _RTL_BALANCED_NODE *Root; // offset: 0x0 ordinal: 0x0
  UCHAR Encoded : 1;               // offset: 0x8 ordinal: 0x1
  struct _RTL_BALANCED_NODE *Min;  // offset: 0x8 ordinal: 0x2
} _RTL_RB_TREE;

// 0x1 bytes (sizeof)
typedef union _KEXECUTE_OPTIONS {
  UCHAR ExecuteDisable : 1;                  // offset: 0x0 ordinal: 0x0
  UCHAR ExecuteEnable : 1;                   // offset: 0x0 ordinal: 0x1
  UCHAR DisableThunkEmulation : 1;           // offset: 0x0 ordinal: 0x2
  UCHAR Permanent : 1;                       // offset: 0x0 ordinal: 0x3
  UCHAR ExecuteDispatchEnable : 1;           // offset: 0x0 ordinal: 0x4
  UCHAR ImageDispatchEnable : 1;             // offset: 0x0 ordinal: 0x5
  UCHAR DisableExceptionChainValidation : 1; // offset: 0x0 ordinal: 0x6
  UCHAR Spare : 1;                           // offset: 0x0 ordinal: 0x7
  UCHAR ExecuteOptions;                      // offset: 0x0 ordinal: 0x8
  UCHAR ExecuteOptionsNV;                    // offset: 0x0 ordinal: 0x9
} _KEXECUTE_OPTIONS;

// 0x1 bytes (sizeof)
typedef struct _PS_PROTECTION {
  union {
    UCHAR Level;    // offset: 0x0 ordinal: 0x0
    UCHAR Type : 3; // offset: 0x0 ordinal: 0x1
  };
  UCHAR Audit : 1;  // offset: 0x0 ordinal: 0x2
  UCHAR Signer : 4; // offset: 0x0 ordinal: 0x3
} _PS_PROTECTION;

// 0x10 bytes (sizeof)
typedef struct _MM_SYSTEM_PAGE_COUNTS {
  ULONG SystemCodePage;        // offset: 0x0 ordinal: 0x0
  ULONG SystemDriverPage;      // offset: 0x4 ordinal: 0x1
  LONG TotalSystemCodePages;   // offset: 0x8 ordinal: 0x2
  LONG TotalSystemDriverPages; // offset: 0xc ordinal: 0x3
} _MM_SYSTEM_PAGE_COUNTS;

// 0x10 bytes (sizeof)
typedef struct _MI_COMBINE_PAGE_LISTHEAD {
  struct _RTL_AVL_TREE Table; // offset: 0x0 ordinal: 0x0
  LONG Lock;                  // offset: 0x8 ordinal: 0x1
} _MI_COMBINE_PAGE_LISTHEAD;

// 0x10 bytes (sizeof)
typedef struct _COPY_INFORMATION {
  struct _FILE_OBJECT *SourceFileObject; // offset: 0x0 ordinal: 0x0
  LONGLONG SourceFileOffset;             // offset: 0x8 ordinal: 0x1
} _COPY_INFORMATION;

// 0x8 bytes (sizeof)
typedef struct _QUAD {
  union {
    LONGLONG UseThisFieldToCopy; // offset: 0x0 ordinal: 0x0
    double DoNotUseThisField;    // offset: 0x0 ordinal: 0x1
  };
} _QUAD;

// 0x8 bytes (sizeof)
typedef struct _UNEXPECTED_INTERRUPT {
  UCHAR PushImm;  // offset: 0x0 ordinal: 0x0
  UCHAR Vector;   // offset: 0x1 ordinal: 0x1
  UCHAR PushRbp;  // offset: 0x2 ordinal: 0x2
  UCHAR JmpOp;    // offset: 0x3 ordinal: 0x3
  LONG JmpOffset; // offset: 0x4 ordinal: 0x4
} _UNEXPECTED_INTERRUPT;

// 0x8 bytes (sizeof)
typedef struct _ISR_THUNK {
  UCHAR PushImm;  // offset: 0x0 ordinal: 0x0
  UCHAR Vector;   // offset: 0x1 ordinal: 0x1
  UCHAR PushRbp;  // offset: 0x2 ordinal: 0x2
  UCHAR JmpOp;    // offset: 0x3 ordinal: 0x3
  LONG JmpOffset; // offset: 0x4 ordinal: 0x4
} _ISR_THUNK;

typedef LONG (*__anon_3346)(struct _BUS_HANDLER *);

typedef LONG (*__anon_3291)(UCHAR (*)(struct _KINTERRUPT *, VOID *));

typedef LONG (*__anon_3268)(enum _SYSTEM_POWER_STATE);

// 0x8 bytes (sizeof)
typedef struct _VACB_LEVEL_REFERENCE {
  LONG Reference;        // offset: 0x0 ordinal: 0x0
  LONG SpecialReference; // offset: 0x4 ordinal: 0x1
} _VACB_LEVEL_REFERENCE;

// 0x4 bytes (sizeof)
typedef struct _DBGKD_CONTINUE {
  LONG ContinueStatus; // offset: 0x0 ordinal: 0x0
} _DBGKD_CONTINUE;

// 0x18 bytes (sizeof)
typedef struct _ETW_PERF_COUNTERS {
  LONG TotalActiveSessions;           // offset: 0x0 ordinal: 0x0
  LONG TotalBufferMemoryNonPagedPool; // offset: 0x4 ordinal: 0x1
  LONG TotalBufferMemoryPagedPool;    // offset: 0x8 ordinal: 0x2
  LONG TotalGuidsEnabled;             // offset: 0xc ordinal: 0x3
  LONG TotalGuidsNotEnabled;          // offset: 0x10 ordinal: 0x4
  LONG TotalGuidsPreEnabled;          // offset: 0x14 ordinal: 0x5
} _ETW_PERF_COUNTERS;

// 0x4 bytes (sizeof)
typedef union __anon_2159 {
  LONG FlushCompleting : 1;  // offset: 0x0 ordinal: 0x0
  LONG FlushInProgress : 31; // offset: 0x0 ordinal: 0x1
  LONG Long;                 // offset: 0x0 ordinal: 0x2
} __anon_2159;

typedef LONG (*__anon_1878)(UCHAR *);

typedef LONG (*__anon_1869)(UCHAR);

typedef LONG (*__anon_1839)();

typedef LONG (*__anon_1838)(ULONG);

typedef LONG (*__anon_1837)(ULONG, UCHAR, UCHAR);

// 0x10 bytes (sizeof)
typedef struct _DMA_ADAPTER {
  USHORT Version;                        // offset: 0x0 ordinal: 0x0
  USHORT Size;                           // offset: 0x2 ordinal: 0x1
  struct _DMA_OPERATIONS *DmaOperations; // offset: 0x8 ordinal: 0x2
} _DMA_ADAPTER;

typedef LONG (*__anon_1608)(struct _DMA_ADAPTER *);

typedef LONG (*__anon_1607)(struct _DMA_ADAPTER *, struct _MDL *, UCHAR);

typedef LONG (*__anon_791)(struct _FILE_OBJECT *, struct _DEVICE_OBJECT *);

typedef LONG (*__anon_686)(struct _DEVICE_OBJECT *, struct _IRP *);

// 0x10 bytes (sizeof)
typedef struct _ETW_COUNTERS {
  LONG GuidCount;    // offset: 0x0 ordinal: 0x0
  LONG PoolUsage[2]; // offset: 0x4 ordinal: 0x1
  LONG SessionCount; // offset: 0xc ordinal: 0x2
} _ETW_COUNTERS;

typedef VOID (*__anon_3309)(struct _DEVICE_OBJECT *);

typedef VOID (*__anon_3271)(struct _HAL_PMC_COUNTERS *);

typedef VOID (*__anon_3267)(struct _MDL *, UCHAR);

typedef VOID (*__anon_3260)(UCHAR, UCHAR);

typedef VOID (*__anon_3254)(enum _SYSTEM_POWER_STATE);

typedef VOID (*__anon_3233)(UCHAR);

typedef VOID (*__anon_1761)(struct _IOMMU_DMA_LOGICAL_ALLOCATOR *);

typedef VOID (*__anon_1605)(struct _DMA_ADAPTER *, enum _IO_ALLOCATION_ACTION);

typedef VOID (*__anon_1581)(struct _DMA_ADAPTER *);

typedef VOID (*__anon_782)(struct _DEVICE_OBJECT *, struct _DEVICE_OBJECT *);

typedef VOID (*__anon_781)(struct _FILE_OBJECT *);

typedef VOID (*__anon_574)(struct _DEVICE_OBJECT *, struct _IRP *);

typedef VOID (*__anon_256)();

// 0x10 bytes (sizeof)
typedef struct __anon_4047 {
  VOID *UserData; // offset: 0x0 ordinal: 0x0
  VOID *Owner;    // offset: 0x8 ordinal: 0x1
} __anon_4047;

typedef VOID (*__anon_3992)(VOID *, struct _IRP *);

// 0x200 bytes (sizeof)
typedef struct _IOV_FORCED_PENDING_TRACE {
  struct _IRP *Irp;        // offset: 0x0 ordinal: 0x0
  struct _ETHREAD *Thread; // offset: 0x8 ordinal: 0x1
  VOID *StackTrace[62];    // offset: 0x10 ordinal: 0x2
} _IOV_FORCED_PENDING_TRACE;

// 0x48 bytes (sizeof)
typedef struct _FAST_OWNER_ENTRY {
  VOID *Reserved[9]; // offset: 0x0 ordinal: 0x0
} _FAST_OWNER_ENTRY;

// 0x10 bytes (sizeof)
typedef struct _VF_TRACKER_STAMP {
  VOID *Thread;        // offset: 0x0 ordinal: 0x0
  UCHAR Flags : 8;     // offset: 0x8 ordinal: 0x1
  UCHAR OldIrql : 8;   // offset: 0x9 ordinal: 0x2
  UCHAR NewIrql : 8;   // offset: 0xa ordinal: 0x3
  UCHAR Processor : 8; // offset: 0xb ordinal: 0x4
} _VF_TRACKER_STAMP;

// 0x8 bytes (sizeof)
typedef struct _KWAIT_CHAIN {
  VOID *Head; // offset: 0x0 ordinal: 0x0
} _KWAIT_CHAIN;

// 0x20 bytes (sizeof)
typedef struct _MI_DLL_OVERFLOW_AREA {
  VOID *RangeStart;         // offset: 0x0 ordinal: 0x0
  VOID *NextVa;             // offset: 0x8 ordinal: 0x1
  VOID *RangeStartAbove2gb; // offset: 0x10 ordinal: 0x2
  VOID *NextVaAbove2gb;     // offset: 0x18 ordinal: 0x3
} _MI_DLL_OVERFLOW_AREA;

typedef LONG (*__anon_3437)(VOID *, VOID *, UCHAR);

// 0x18 bytes (sizeof)
typedef struct _NLS_DATA_BLOCK {
  VOID *AnsiCodePageData;     // offset: 0x0 ordinal: 0x0
  VOID *OemCodePageData;      // offset: 0x8 ordinal: 0x1
  VOID *UnicodeCaseTableData; // offset: 0x10 ordinal: 0x2
} _NLS_DATA_BLOCK;

// 0x10 bytes (sizeof)
typedef struct _DEBUG_IOMMU_EFI_DATA {
  VOID *PciIoProtocolHandle; // offset: 0x0 ordinal: 0x0
  VOID *Mapping;             // offset: 0x8 ordinal: 0x1
} _DEBUG_IOMMU_EFI_DATA;

// 0x18 bytes (sizeof)
typedef struct _HAL_LBR_ENTRY {
  VOID *FromAddress; // offset: 0x0 ordinal: 0x0
  VOID *ToAddress;   // offset: 0x8 ordinal: 0x1
  VOID *Reserved;    // offset: 0x10 ordinal: 0x2
} _HAL_LBR_ENTRY;

// 0x10 bytes (sizeof)
typedef struct _MAP_REGISTER_ENTRY {
  VOID *MapRegister;   // offset: 0x0 ordinal: 0x0
  UCHAR WriteToDevice; // offset: 0x8 ordinal: 0x1
} _MAP_REGISTER_ENTRY;

typedef VOID *(*__anon_3284)();

// 0x48 bytes (sizeof)
typedef struct _VI_FAULT_TRACE {
  struct _ETHREAD *Thread; // offset: 0x0 ordinal: 0x0
  VOID *StackTrace[8];     // offset: 0x8 ordinal: 0x1
} _VI_FAULT_TRACE;

// 0x40 bytes (sizeof)
typedef struct _VF_KE_CRITICAL_REGION_TRACE {
  struct _ETHREAD *Thread; // offset: 0x0 ordinal: 0x0
  VOID *StackTrace[7];     // offset: 0x8 ordinal: 0x1
} _VF_KE_CRITICAL_REGION_TRACE;

// 0x10 bytes (sizeof)
typedef struct _OB_EXTENDED_USER_INFO {
  VOID *Context1; // offset: 0x0 ordinal: 0x0
  VOID *Context2; // offset: 0x8 ordinal: 0x1
} _OB_EXTENDED_USER_INFO;

// 0x8 bytes (sizeof)
typedef struct _ALPC_HANDLE_ENTRY {
  VOID *Object; // offset: 0x0 ordinal: 0x0
} _ALPC_HANDLE_ENTRY;

// 0x8 bytes (sizeof)
typedef union _HEAP_LFH_SUBSEGMENT_STATS {
  struct _HEAP_LFH_SUBSEGMENT_STAT Buckets[4]; // offset: 0x0 ordinal: 0x0
  VOID *AllStats;                              // offset: 0x0 ordinal: 0x1
} _HEAP_LFH_SUBSEGMENT_STATS;

// 0x10 bytes (sizeof)
typedef struct __anon_2712 {
  struct _FILE_OBJECT *FileObject; // offset: 0x0 ordinal: 0x0
  VOID *DiskIoAttribution;         // offset: 0x8 ordinal: 0x1
} __anon_2712;

typedef UCHAR (*__anon_2697)(VOID *, UCHAR);

// 0x8 bytes (sizeof)
typedef struct _CMSI_RW_LOCK {
  VOID *Reserved; // offset: 0x0 ordinal: 0x0
} _CMSI_RW_LOCK;

// 0x18 bytes (sizeof)
typedef struct _SECTION_OBJECT_POINTERS {
  VOID *DataSectionObject;  // offset: 0x0 ordinal: 0x0
  VOID *SharedCacheMap;     // offset: 0x8 ordinal: 0x1
  VOID *ImageSectionObject; // offset: 0x10 ordinal: 0x2
} _SECTION_OBJECT_POINTERS;

// 0xa8 bytes (sizeof)
typedef struct _PS_NTDLL_EXPORTS {
  VOID *LdrSystemDllInitBlock;                   // offset: 0x0 ordinal: 0x0
  VOID *LdrInitializeThunk;                      // offset: 0x8 ordinal: 0x1
  VOID *RtlUserThreadStart;                      // offset: 0x10 ordinal: 0x2
  VOID *RtlUserFiberStart;                       // offset: 0x18 ordinal: 0x3
  VOID *KiUserExceptionDispatcher;               // offset: 0x20 ordinal: 0x4
  VOID *KiUserApcDispatcher;                     // offset: 0x28 ordinal: 0x5
  VOID *KiUserCallbackDispatcher;                // offset: 0x30 ordinal: 0x6
  VOID *KiUserCallbackDispatcherReturn;          // offset: 0x38 ordinal: 0x7
  VOID *KiRaiseUserExceptionDispatcher;          // offset: 0x40 ordinal: 0x8
  VOID *ExpInterlockedPopEntrySListEnd;          // offset: 0x48 ordinal: 0x9
  VOID *ExpInterlockedPopEntrySListFault;        // offset: 0x50 ordinal: 0xa
  VOID *ExpInterlockedPopEntrySListResume;       // offset: 0x58 ordinal: 0xb
  VOID *RtlpFreezeTimeBias;                      // offset: 0x60 ordinal: 0xc
  VOID *KiUserInvertedFunctionTable;             // offset: 0x68 ordinal: 0xd
  VOID *WerReportExceptionWorker;                // offset: 0x70 ordinal: 0xe
  VOID *RtlCallEnclaveReturn;                    // offset: 0x78 ordinal: 0xf
  VOID *RtlEnclaveCallDispatch;                  // offset: 0x80 ordinal: 0x10
  VOID *RtlEnclaveCallDispatchReturn;            // offset: 0x88 ordinal: 0x11
  VOID *RtlRaiseExceptionForReturnAddressHijack; // offset: 0x90 ordinal: 0x12
  VOID *KiUserEmulationDispatcher;               // offset: 0x98 ordinal: 0x13
  VOID *LdrHotPatchNotify;                       // offset: 0xa0 ordinal: 0x14
} _PS_NTDLL_EXPORTS;

typedef VOID (*__anon_1955)(struct _TP_CALLBACK_INSTANCE *, VOID *);

typedef VOID (*__anon_1954)(VOID *, VOID *);

typedef LONG (*__anon_1879)(VOID *, ULONG, UCHAR);

// 0x10 bytes (sizeof)
typedef struct _EXT_IOMMU_S1_X64_DOMAIN_SETTINGS {
  struct __anon_1767 Flags; // offset: 0x0 ordinal: 0x0
  VOID *PasidTable;         // offset: 0x8 ordinal: 0x1
} _EXT_IOMMU_S1_X64_DOMAIN_SETTINGS;

typedef VOID (*__anon_1695)(struct _EXT_IOMMU *, struct _EXT_IOMMU_DOMAIN *,
                            VOID *);

typedef LONG (*__anon_1694)(struct _EXT_IOMMU *, struct _EXT_IOMMU_DOMAIN *,
                            struct _EXT_IOMMU_DOMAIN *, VOID *);

typedef VOID (*__anon_1616)(struct _DMA_ADAPTER *, struct _DEVICE_OBJECT *,
                            VOID *, enum DMA_COMPLETION_STATUS);

typedef VOID *(*__anon_1609)(struct _DMA_ADAPTER *);

typedef UCHAR (*__anon_1600)(struct _DMA_ADAPTER *, struct _DEVICE_OBJECT *,
                             VOID *);

typedef LONG (*__anon_1596)(struct _DMA_ADAPTER *, VOID *);

// 0x20 bytes (sizeof)
typedef struct _SECURITY_SUBJECT_CONTEXT {
  VOID *ClientToken; // offset: 0x0 ordinal: 0x0
  enum _SECURITY_IMPERSONATION_LEVEL
      ImpersonationLevel; // offset: 0x8 ordinal: 0x1
  VOID *PrimaryToken;     // offset: 0x10 ordinal: 0x2
  VOID *ProcessAuditId;   // offset: 0x18 ordinal: 0x3
} _SECURITY_SUBJECT_CONTEXT;

// 0x10 bytes (sizeof)
typedef struct IORING_BUFFER_INFO {
  VOID *Address; // offset: 0x0 ordinal: 0x0
  ULONG Length;  // offset: 0x8 ordinal: 0x1
} IORING_BUFFER_INFO;

// 0x18 bytes (sizeof)
typedef struct _NT_IORING_OP_REGISTER_BUFFERS {
  enum _NT_IORING_OP_FLAGS CommonOpFlags;    // offset: 0x0 ordinal: 0x0
  struct _NT_IORING_REG_BUFFERS_FLAGS Flags; // offset: 0x4 ordinal: 0x1
  ULONG Count;                               // offset: 0xc ordinal: 0x2
  struct IORING_BUFFER_INFO *Buffers;        // offset: 0x10 ordinal: 0x3
} _NT_IORING_OP_REGISTER_BUFFERS;

// 0x8 bytes (sizeof)
typedef struct __anon_1206 {
  VOID *Notification; // offset: 0x0 ordinal: 0x0
} __anon_1206;

// 0x8 bytes (sizeof)
typedef union _NT_IORING_BUFFERREF {
  VOID *Address;                               // offset: 0x0 ordinal: 0x0
  struct IORING_REGISTERED_BUFFER FixedBuffer; // offset: 0x0 ordinal: 0x1
} _NT_IORING_BUFFERREF;

// 0x8 bytes (sizeof)
typedef union _NT_IORING_HANDLEREF {
  VOID *Handle;      // offset: 0x0 ordinal: 0x0
  ULONG HandleIndex; // offset: 0x0 ordinal: 0x1
} _NT_IORING_HANDLEREF;

// 0x28 bytes (sizeof)
typedef struct __anon_1189 {
  VOID *Argument1; // offset: 0x0 ordinal: 0x0
  VOID *Argument2; // offset: 0x8 ordinal: 0x1
  VOID *Argument3; // offset: 0x10 ordinal: 0x2
  VOID *Argument4; // offset: 0x18 ordinal: 0x3
  VOID *Argument5; // offset: 0x20 ordinal: 0x4
} __anon_1189;

typedef LONG (*__anon_1174)(VOID *, VOID *);

typedef LONG (*__anon_1173)(VOID *);

typedef VOID (*__anon_1096)(VOID *, UCHAR);

typedef LONG (*__anon_1024)(struct _DEVICE_OBJECT *, struct _IRP *, VOID *);

// 0x20 bytes (sizeof)
typedef struct __anon_1023 {
  VOID *Argument1; // offset: 0x0 ordinal: 0x0
  VOID *Argument2; // offset: 0x8 ordinal: 0x1
  VOID *Argument3; // offset: 0x10 ordinal: 0x2
  VOID *Argument4; // offset: 0x18 ordinal: 0x3
} __anon_1023;

// 0x10 bytes (sizeof)
typedef struct _PEP_CRASHDUMP_INFORMATION {
  struct PEPHANDLE__ *DeviceHandle; // offset: 0x0 ordinal: 0x0
  VOID *DeviceContext;              // offset: 0x8 ordinal: 0x1
} _PEP_CRASHDUMP_INFORMATION;

typedef UCHAR (*__anon_757)(struct _PEP_CRASHDUMP_INFORMATION *);

// 0x10 bytes (sizeof)
typedef struct _IO_CLIENT_EXTENSION {
  struct _IO_CLIENT_EXTENSION *NextExtension; // offset: 0x0 ordinal: 0x0
  VOID *ClientIdentificationAddress;          // offset: 0x8 ordinal: 0x1
} _IO_CLIENT_EXTENSION;

typedef VOID (*__anon_768)(VOID *, VOID *, VOID *, VOID *);

typedef UCHAR (*__anon_718)(VOID *);

typedef enum _IO_ALLOCATION_ACTION (*__anon_579)(struct _DEVICE_OBJECT *,
                                                 struct _IRP *, VOID *, VOID *);

typedef VOID (*__anon_578)(struct _DEVICE_OBJECT *, VOID *);

// 0x80 bytes (sizeof)
typedef struct _OBJECT_REF_TRACE {
  VOID *StackTrace[16]; // offset: 0x0 ordinal: 0x0
} _OBJECT_REF_TRACE;

// 0x8 bytes (sizeof)
typedef union __anon_488 {
  struct _IRP *MasterIrp; // offset: 0x0 ordinal: 0x0
  LONG IrpCount;          // offset: 0x0 ordinal: 0x1
  VOID *SystemBuffer;     // offset: 0x0 ordinal: 0x2
} __anon_488;

typedef VOID (*__anon_343)(VOID *, VOID *, VOID *);

// 0x20 bytes (sizeof)
typedef struct _KREQUEST_PACKET {
  VOID *CurrentPacket[3]; // offset: 0x0 ordinal: 0x0
  VOID(*WorkerRoutine)
  (VOID *, VOID *, VOID *, VOID *); // offset: 0x18 ordinal: 0x1
} _KREQUEST_PACKET;

// 0x18 bytes (sizeof)
typedef struct _IO_COMPLETION_CONTEXT {
  VOID *Port;          // offset: 0x0 ordinal: 0x0
  VOID *Key;           // offset: 0x8 ordinal: 0x1
  LONGLONG UsageCount; // offset: 0x10 ordinal: 0x2
} _IO_COMPLETION_CONTEXT;

// 0x10 bytes (sizeof)
typedef struct _TERMINATION_PORT {
  struct _TERMINATION_PORT *Next; // offset: 0x0 ordinal: 0x0
  VOID *Port;                     // offset: 0x8 ordinal: 0x1
} _TERMINATION_PORT;

// 0x10 bytes (sizeof)
typedef struct RTL_HP_ENV_HANDLE {
  VOID *h[2]; // offset: 0x0 ordinal: 0x0
} RTL_HP_ENV_HANDLE;

typedef LONG (*__anon_3256)(VOID *, VOID **);

typedef LONG (*__anon_1880)(UCHAR, VOID **);

// 0x18 bytes (sizeof)
typedef struct _NT_IORING_OP_REGISTER_FILES {
  enum _NT_IORING_OP_FLAGS CommonOpFlags;  // offset: 0x0 ordinal: 0x0
  struct _NT_IORING_REG_FILES_FLAGS Flags; // offset: 0x4 ordinal: 0x1
  ULONG Count;                             // offset: 0xc ordinal: 0x2
  VOID **Handles;                          // offset: 0x10 ordinal: 0x3
} _NT_IORING_OP_REGISTER_FILES;

// 0x10 bytes (sizeof)
typedef struct _CLIENT_ID {
  VOID *UniqueProcess; // offset: 0x0 ordinal: 0x0
  VOID *UniqueThread;  // offset: 0x8 ordinal: 0x1
} _CLIENT_ID;

// 0x10 bytes (sizeof)
typedef struct _EWOW64PROCESS {
  VOID *Peb;                       // offset: 0x0 ordinal: 0x0
  enum _SYSTEM_DLL_TYPE NtdllType; // offset: 0x8 ordinal: 0x1
} _EWOW64PROCESS;

typedef VOID (*__anon_40)(VOID *);

// 0x20 bytes (sizeof)
typedef struct _CACHE_MANAGER_CALLBACKS {
  UCHAR (*AcquireForLazyWrite)(VOID *, UCHAR); // offset: 0x0 ordinal: 0x0
  VOID (*ReleaseFromLazyWrite)(VOID *);        // offset: 0x8 ordinal: 0x1
  UCHAR (*AcquireForReadAhead)(VOID *, UCHAR); // offset: 0x10 ordinal: 0x2
  VOID (*ReleaseFromReadAhead)(VOID *);        // offset: 0x18 ordinal: 0x3
} _CACHE_MANAGER_CALLBACKS;

// 0x20 bytes (sizeof)
typedef struct _RTL_BALANCED_LINKS {
  struct _RTL_BALANCED_LINKS *Parent;     // offset: 0x0 ordinal: 0x0
  struct _RTL_BALANCED_LINKS *LeftChild;  // offset: 0x8 ordinal: 0x1
  struct _RTL_BALANCED_LINKS *RightChild; // offset: 0x10 ordinal: 0x2
  CHAR Balance;                           // offset: 0x18 ordinal: 0x3
  UCHAR Reserved[3];                      // offset: 0x19 ordinal: 0x4
} _RTL_BALANCED_LINKS;

// 0x28 bytes (sizeof)
typedef struct _KTMOBJECT_NAMESPACE_LINK {
  struct _RTL_BALANCED_LINKS Links; // offset: 0x0 ordinal: 0x0
  UCHAR Expired;                    // offset: 0x20 ordinal: 0x1
} _KTMOBJECT_NAMESPACE_LINK;

// 0x1 bytes (sizeof)
typedef struct _WDT_HANDLE {
  CHAR Reserved; // offset: 0x0 ordinal: 0x0
} _WDT_HANDLE;

// 0x30 bytes (sizeof)
typedef struct _iobuf {
  CHAR *_ptr;      // offset: 0x0 ordinal: 0x0
  LONG _cnt;       // offset: 0x8 ordinal: 0x1
  CHAR *_base;     // offset: 0x10 ordinal: 0x2
  LONG _flag;      // offset: 0x18 ordinal: 0x3
  LONG _file;      // offset: 0x1c ordinal: 0x4
  LONG _charbuf;   // offset: 0x20 ordinal: 0x5
  LONG _bufsiz;    // offset: 0x24 ordinal: 0x6
  CHAR *_tmpfname; // offset: 0x28 ordinal: 0x7
} _iobuf;

// 0x2 bytes (sizeof)
typedef struct __anon_1210 {
  WCHAR ParentId[1]; // offset: 0x0 ordinal: 0x0
} __anon_1210;

// 0x8 bytes (sizeof)
typedef struct __anon_1208 {
  enum _PNP_VETO_TYPE VetoType;    // offset: 0x0 ordinal: 0x0
  WCHAR DeviceIdVetoNameBuffer[1]; // offset: 0x4 ordinal: 0x1
} __anon_1208;

// 0x10 bytes (sizeof)
typedef struct __anon_1205 {
  VOID *NotificationStructure; // offset: 0x0 ordinal: 0x0
  WCHAR DeviceId[1];           // offset: 0x8 ordinal: 0x1
} __anon_1205;

// 0x2 bytes (sizeof)
typedef struct __anon_1204 {
  WCHAR DeviceId[1]; // offset: 0x0 ordinal: 0x0
} __anon_1204;

// 0xac bytes (sizeof)
typedef struct _RTL_TIME_ZONE_INFORMATION {
  LONG Bias;                         // offset: 0x0 ordinal: 0x0
  WCHAR StandardName[32];            // offset: 0x4 ordinal: 0x1
  struct _TIME_FIELDS StandardStart; // offset: 0x44 ordinal: 0x2
  LONG StandardBias;                 // offset: 0x54 ordinal: 0x3
  WCHAR DaylightName[32];            // offset: 0x58 ordinal: 0x4
  struct _TIME_FIELDS DaylightStart; // offset: 0x98 ordinal: 0x5
  LONG DaylightBias;                 // offset: 0xa8 ordinal: 0x6
} _RTL_TIME_ZONE_INFORMATION;

// 0x1b0 bytes (sizeof)
typedef struct _RTL_DYNAMIC_TIME_ZONE_INFORMATION {
  struct _RTL_TIME_ZONE_INFORMATION tzi; // offset: 0x0 ordinal: 0x0
  WCHAR TimeZoneKeyName[128];            // offset: 0xac ordinal: 0x1
  UCHAR DynamicDaylightTimeDisabled;     // offset: 0x1ac ordinal: 0x2
} _RTL_DYNAMIC_TIME_ZONE_INFORMATION;

// 0x4 bytes (sizeof)
typedef struct _HEAP_FREE_ENTRY_EXTRA {
  USHORT TagIndex;           // offset: 0x0 ordinal: 0x0
  USHORT FreeBackTraceIndex; // offset: 0x2 ordinal: 0x1
} _HEAP_FREE_ENTRY_EXTRA;

// 0x2 bytes (sizeof)
typedef union __anon_3705 {
  USHORT AsUSHORT;         // offset: 0x0 ordinal: 0x0
  USHORT AllowScaling : 1; // offset: 0x0 ordinal: 0x1
  USHORT Disabled : 1;     // offset: 0x0 ordinal: 0x2
  USHORT Reserved : 14;    // offset: 0x0 ordinal: 0x3
} __anon_3705;

// 0x2 bytes (sizeof)
typedef union __anon_3668 {
  USHORT SignatureLevel : 4; // offset: 0x0 ordinal: 0x0
  USHORT SignatureType : 3;  // offset: 0x0 ordinal: 0x1
  USHORT Frozen : 2;         // offset: 0x0 ordinal: 0x2
  USHORT HotPatch : 1;       // offset: 0x0 ordinal: 0x3
  USHORT Unused : 6;         // offset: 0x0 ordinal: 0x4
  USHORT EntireField;        // offset: 0x0 ordinal: 0x5
} __anon_3668;

// 0x2 bytes (sizeof)
typedef union _HAL_UNMASKED_INTERRUPT_FLAGS {
  USHORT SecondaryInterrupt : 1; // offset: 0x0 ordinal: 0x0
  USHORT Reserved : 15;          // offset: 0x0 ordinal: 0x1
  USHORT AsUSHORT;               // offset: 0x0 ordinal: 0x2
} _HAL_UNMASKED_INTERRUPT_FLAGS;

// 0x4 bytes (sizeof)
typedef struct _MMSUBSECTION_FLAGS {
  USHORT SubsectionAccessed : 1;  // offset: 0x0 ordinal: 0x0
  USHORT Protection : 5;          // offset: 0x0 ordinal: 0x1
  USHORT StartingSector4132 : 10; // offset: 0x0 ordinal: 0x2
  USHORT SubsectionStatic : 1;    // offset: 0x2 ordinal: 0x3
  USHORT GlobalMemory : 1;        // offset: 0x2 ordinal: 0x4
  USHORT Spare : 1;               // offset: 0x2 ordinal: 0x5
  USHORT OnDereferenceList : 1;   // offset: 0x2 ordinal: 0x6
  USHORT SectorEndOffset : 12;    // offset: 0x2 ordinal: 0x7
} _MMSUBSECTION_FLAGS;

// 0x8088 bytes (sizeof)
typedef struct _STACK_TABLE {
  USHORT NumStackTraces;                    // offset: 0x0 ordinal: 0x0
  USHORT TraceCapacity;                     // offset: 0x2 ordinal: 0x1
  struct _OBJECT_REF_TRACE *StackTrace[16]; // offset: 0x8 ordinal: 0x2
  USHORT StackTableHash[16381];             // offset: 0x88 ordinal: 0x3
} _STACK_TABLE;

// 0x8 bytes (sizeof)
typedef struct _ACL {
  UCHAR AclRevision; // offset: 0x0 ordinal: 0x0
  UCHAR Sbz1;        // offset: 0x1 ordinal: 0x1
  USHORT AclSize;    // offset: 0x2 ordinal: 0x2
  USHORT AceCount;   // offset: 0x4 ordinal: 0x3
  USHORT Sbz2;       // offset: 0x6 ordinal: 0x4
} _ACL;

// 0x28 bytes (sizeof)
typedef struct _SECURITY_DESCRIPTOR {
  UCHAR Revision;    // offset: 0x0 ordinal: 0x0
  UCHAR Sbz1;        // offset: 0x1 ordinal: 0x1
  USHORT Control;    // offset: 0x2 ordinal: 0x2
  VOID *Owner;       // offset: 0x8 ordinal: 0x3
  VOID *Group;       // offset: 0x10 ordinal: 0x4
  struct _ACL *Sacl; // offset: 0x18 ordinal: 0x5
  struct _ACL *Dacl; // offset: 0x20 ordinal: 0x6
} _SECURITY_DESCRIPTOR;

// 0x10 bytes (sizeof)
typedef struct _ETW_SYSTEMTIME {
  USHORT Year;         // offset: 0x0 ordinal: 0x0
  USHORT Month;        // offset: 0x2 ordinal: 0x1
  USHORT DayOfWeek;    // offset: 0x4 ordinal: 0x2
  USHORT Day;          // offset: 0x6 ordinal: 0x3
  USHORT Hour;         // offset: 0x8 ordinal: 0x4
  USHORT Minute;       // offset: 0xa ordinal: 0x5
  USHORT Second;       // offset: 0xc ordinal: 0x6
  USHORT Milliseconds; // offset: 0xe ordinal: 0x7
} _ETW_SYSTEMTIME;

// 0x10 bytes (sizeof)
typedef struct _IO_IRP_EXT_TRACK_OFFSET_HEADER {
  USHORT Validation; // offset: 0x0 ordinal: 0x0
  USHORT Flags;      // offset: 0x2 ordinal: 0x1
  VOID(*TrackedOffsetCallback)
  (struct _IO_IRP_EXT_TRACK_OFFSET_HEADER *,
   struct _IO_IRP_EXT_TRACK_OFFSET_HEADER *,
   LONGLONG); // offset: 0x8 ordinal: 0x2
} _IO_IRP_EXT_TRACK_OFFSET_HEADER;

typedef VOID (*__anon_2951)(struct _IO_IRP_EXT_TRACK_OFFSET_HEADER *,
                            struct _IO_IRP_EXT_TRACK_OFFSET_HEADER *, LONGLONG);

// 0x2 bytes (sizeof)
typedef union _HEAP_SEGMENT_MGR_COMMIT_STATE {
  USHORT CommittedPageCount : 11;          // offset: 0x0 ordinal: 0x0
  USHORT Spare : 3;                        // offset: 0x0 ordinal: 0x1
  USHORT LargePageOperationInProgress : 1; // offset: 0x0 ordinal: 0x2
  USHORT LargePageCommit : 1;              // offset: 0x0 ordinal: 0x3
  USHORT EntireUShortV;                    // offset: 0x0 ordinal: 0x4
  USHORT EntireUShort;                     // offset: 0x0 ordinal: 0x5
} _HEAP_SEGMENT_MGR_COMMIT_STATE;

// 0x2 bytes (sizeof)
typedef struct _HEAP_VS_UNUSED_BYTES_INFO {
  USHORT UnusedBytes : 13;  // offset: 0x0 ordinal: 0x0
  USHORT LfhSubsegment : 1; // offset: 0x0 ordinal: 0x1
  USHORT ExtraPresent : 1;  // offset: 0x0 ordinal: 0x2
  USHORT OneByteUnused : 1; // offset: 0x0 ordinal: 0x3
  UCHAR Bytes[2];           // offset: 0x0 ordinal: 0x4
} _HEAP_VS_UNUSED_BYTES_INFO;

// 0x2 bytes (sizeof)
typedef struct _HEAP_LFH_UNUSED_BYTES_INFO {
  USHORT UnusedBytes : 14;  // offset: 0x0 ordinal: 0x0
  USHORT ExtraPresent : 1;  // offset: 0x0 ordinal: 0x1
  USHORT OneByteUnused : 1; // offset: 0x0 ordinal: 0x2
  UCHAR Bytes[2];           // offset: 0x0 ordinal: 0x3
} _HEAP_LFH_UNUSED_BYTES_INFO;

// 0x8 bytes (sizeof)
typedef union _HEAP_LFH_ONDEMAND_POINTER {
  USHORT Invalid : 1;              // offset: 0x0 ordinal: 0x0
  USHORT AllocationInProgress : 1; // offset: 0x0 ordinal: 0x1
  USHORT Spare0 : 14;              // offset: 0x0 ordinal: 0x2
  USHORT UsageData;                // offset: 0x2 ordinal: 0x3
  VOID *AllBits;                   // offset: 0x0 ordinal: 0x4
} _HEAP_LFH_ONDEMAND_POINTER;

// 0x4 bytes (sizeof)
typedef struct _RTL_HP_LFH_CONFIG {
  USHORT MaxBlockSize;                  // offset: 0x0 ordinal: 0x0
  USHORT WitholdPageCrossingBlocks : 1; // offset: 0x2 ordinal: 0x1
  USHORT DisableRandomization : 1;      // offset: 0x2 ordinal: 0x2
} _RTL_HP_LFH_CONFIG;

// 0x10 bytes (sizeof)
typedef struct _SEGMENT_HEAP_EXTRA {
  USHORT AllocationTag;       // offset: 0x0 ordinal: 0x0
  UCHAR InterceptorIndex : 4; // offset: 0x2 ordinal: 0x1
  UCHAR UserFlags : 4;        // offset: 0x2 ordinal: 0x2
  UCHAR ExtraSizeInUnits;     // offset: 0x3 ordinal: 0x3
  VOID *Settable;             // offset: 0x8 ordinal: 0x4
} _SEGMENT_HEAP_EXTRA;

// 0x8 bytes (sizeof)
typedef struct _PCW_COUNTER_DESCRIPTOR {
  USHORT Id;          // offset: 0x0 ordinal: 0x0
  USHORT StructIndex; // offset: 0x2 ordinal: 0x1
  USHORT Offset;      // offset: 0x4 ordinal: 0x2
  USHORT Size;        // offset: 0x6 ordinal: 0x3
} _PCW_COUNTER_DESCRIPTOR;

// 0x2 bytes (sizeof)
typedef struct _HV_GET_BIN_CONTEXT {
  USHORT OutstandingReference : 1; // offset: 0x0 ordinal: 0x0
} _HV_GET_BIN_CONTEXT;

// 0x4 bytes (sizeof)
typedef struct _MMSECTION_FLAGS2 {
  USHORT PartitionId : 10;          // offset: 0x0 ordinal: 0x0
  UCHAR NoCrossPartitionAccess : 1; // offset: 0x2 ordinal: 0x1
  UCHAR
  SubsectionCrossPartitionReferenceOverflow : 1; // offset: 0x2 ordinal: 0x2
  UCHAR UsingFileExtents : 2;                    // offset: 0x2 ordinal: 0x3
} _MMSECTION_FLAGS2;

// 0x4 bytes (sizeof)
typedef struct _SEGMENT_FLAGS {
  USHORT TotalNumberOfPtes4132 : 10; // offset: 0x0 ordinal: 0x0
  USHORT Spare0 : 1;                 // offset: 0x0 ordinal: 0x1
  USHORT SessionDriverProtos : 1;    // offset: 0x0 ordinal: 0x2
  USHORT LargePages : 1;             // offset: 0x0 ordinal: 0x3
  USHORT DebugSymbolsLoaded : 1;     // offset: 0x0 ordinal: 0x4
  USHORT WriteCombined : 1;          // offset: 0x0 ordinal: 0x5
  USHORT NoCache : 1;                // offset: 0x0 ordinal: 0x6
  USHORT Short0;                     // offset: 0x0 ordinal: 0x7
  UCHAR Spare : 1;                   // offset: 0x2 ordinal: 0x8
  UCHAR DefaultProtectionMask : 5;   // offset: 0x2 ordinal: 0x9
  UCHAR Binary32 : 1;                // offset: 0x2 ordinal: 0xa
  UCHAR ContainsDebug : 1;           // offset: 0x2 ordinal: 0xb
  UCHAR UChar1;                      // offset: 0x2 ordinal: 0xc
  UCHAR ForceCollision : 1;          // offset: 0x3 ordinal: 0xd
  UCHAR ImageSigningType : 3;        // offset: 0x3 ordinal: 0xe
  UCHAR ImageSigningLevel : 4;       // offset: 0x3 ordinal: 0xf
  UCHAR UChar2;                      // offset: 0x3 ordinal: 0x10
} _SEGMENT_FLAGS;

// 0x4 bytes (sizeof)
typedef struct __anon_2122 {
  UCHAR AnchorLargePageSize : 2; // offset: 0x0 ordinal: 0x0
  UCHAR Spare0 : 6;              // offset: 0x0 ordinal: 0x1
  UCHAR Spare1 : 8;              // offset: 0x1 ordinal: 0x2
  USHORT Spare2;                 // offset: 0x2 ordinal: 0x3
} __anon_2122;

// 0x2 bytes (sizeof)
typedef struct __anon_2111 {
  USHORT ReferenceCount; // offset: 0x0 ordinal: 0x0
} __anon_2111;

// 0x8 bytes (sizeof)
typedef struct _RTL_FEATURE_USAGE_REPORT {
  ULONG FeatureId;         // offset: 0x0 ordinal: 0x0
  USHORT ReportingKind;    // offset: 0x4 ordinal: 0x1
  USHORT ReportingOptions; // offset: 0x6 ordinal: 0x2
} _RTL_FEATURE_USAGE_REPORT;

// 0x6 bytes (sizeof)
typedef struct FEATURE_LOGGED_TRAITS {
  USHORT version;     // offset: 0x0 ordinal: 0x0
  USHORT baseVersion; // offset: 0x2 ordinal: 0x1
  UCHAR stage;        // offset: 0x4 ordinal: 0x2
} FEATURE_LOGGED_TRAITS;

// 0x68 bytes (sizeof)
typedef struct FEATURE_ERROR {
  HRESULT hr;                            // offset: 0x0 ordinal: 0x0
  USHORT lineNumber;                     // offset: 0x4 ordinal: 0x1
  CHAR *file;                            // offset: 0x8 ordinal: 0x2
  CHAR *process;                         // offset: 0x10 ordinal: 0x3
  CHAR *modulePath;                      // offset: 0x18 ordinal: 0x4
  ULONG callerReturnAddressOffset;       // offset: 0x20 ordinal: 0x5
  CHAR *callerModule;                    // offset: 0x28 ordinal: 0x6
  CHAR *message;                         // offset: 0x30 ordinal: 0x7
  USHORT originLineNumber;               // offset: 0x38 ordinal: 0x8
  CHAR *originFile;                      // offset: 0x40 ordinal: 0x9
  CHAR *originModule;                    // offset: 0x48 ordinal: 0xa
  ULONG originCallerReturnAddressOffset; // offset: 0x50 ordinal: 0xb
  CHAR *originCallerModule;              // offset: 0x58 ordinal: 0xc
  CHAR *originName;                      // offset: 0x60 ordinal: 0xd
} FEATURE_ERROR;

// 0x10 bytes (sizeof)
typedef struct _UNICODE_STRING {
  USHORT Length;        // offset: 0x0 ordinal: 0x0
  USHORT MaximumLength; // offset: 0x2 ordinal: 0x1
  WCHAR *Buffer;        // offset: 0x8 ordinal: 0x2
} _UNICODE_STRING;

// 0x2 bytes (sizeof)
typedef struct __anon_1726 {
  USHORT PciSegment : 1; // offset: 0x0 ordinal: 0x0
} __anon_1726;

// 0x2 bytes (sizeof)
typedef union _EXT_IOMMU_DEVICE_ID_FLAGS {
  USHORT AsUSHORT;      // offset: 0x0 ordinal: 0x0
  USHORT IsAliased : 1; // offset: 0x0 ordinal: 0x1
  USHORT Reserved : 15; // offset: 0x0 ordinal: 0x2
} _EXT_IOMMU_DEVICE_ID_FLAGS;

// 0x6 bytes (sizeof)
typedef struct _LOCAL_NMISOURCE {
  UCHAR Type;        // offset: 0x0 ordinal: 0x0
  UCHAR Length;      // offset: 0x1 ordinal: 0x1
  UCHAR ProcessorID; // offset: 0x2 ordinal: 0x2
  USHORT Flags;      // offset: 0x3 ordinal: 0x3
  UCHAR LINTIN;      // offset: 0x5 ordinal: 0x4
} _LOCAL_NMISOURCE;

// 0x14 bytes (sizeof)
typedef struct _XPF_RECOVERY_INFO {
  struct __anon_1441 FailureReason; // offset: 0x0 ordinal: 0x0
  struct __anon_1442 Action;        // offset: 0x4 ordinal: 0x1
  UCHAR ActionRequired;             // offset: 0x8 ordinal: 0x2
  UCHAR RecoverySucceeded;          // offset: 0x9 ordinal: 0x3
  UCHAR RecoveryKernel;             // offset: 0xa ordinal: 0x4
  UCHAR Reserved;                   // offset: 0xb ordinal: 0x5
  USHORT Reserved2;                 // offset: 0xc ordinal: 0x6
  USHORT Reserved3;                 // offset: 0xe ordinal: 0x7
  ULONG Reserved4;                  // offset: 0x10 ordinal: 0x8
} _XPF_RECOVERY_INFO;

// 0x2 bytes (sizeof)
typedef union _WHEA_REVISION {
  UCHAR MinorRevision; // offset: 0x0 ordinal: 0x0
  UCHAR MajorRevision; // offset: 0x1 ordinal: 0x1
  USHORT AsUSHORT;     // offset: 0x0 ordinal: 0x2
} _WHEA_REVISION;

// 0x2 bytes (sizeof)
typedef union _WHEA_NOTIFICATION_FLAGS {
  USHORT PollIntervalRW : 1;             // offset: 0x0 ordinal: 0x0
  USHORT SwitchToPollingThresholdRW : 1; // offset: 0x0 ordinal: 0x1
  USHORT SwitchToPollingWindowRW : 1;    // offset: 0x0 ordinal: 0x2
  USHORT ErrorThresholdRW : 1;           // offset: 0x0 ordinal: 0x3
  USHORT ErrorThresholdWindowRW : 1;     // offset: 0x0 ordinal: 0x4
  USHORT Reserved : 11;                  // offset: 0x0 ordinal: 0x5
  USHORT AsUSHORT;                       // offset: 0x0 ordinal: 0x6
} _WHEA_NOTIFICATION_FLAGS;

// 0x2 bytes (sizeof)
typedef union _AER_BRIDGE_DESCRIPTOR_FLAGS {
  USHORT UncorrectableErrorMaskRW : 1;          // offset: 0x0 ordinal: 0x0
  USHORT UncorrectableErrorSeverityRW : 1;      // offset: 0x0 ordinal: 0x1
  USHORT CorrectableErrorMaskRW : 1;            // offset: 0x0 ordinal: 0x2
  USHORT AdvancedCapsAndControlRW : 1;          // offset: 0x0 ordinal: 0x3
  USHORT SecondaryUncorrectableErrorMaskRW : 1; // offset: 0x0 ordinal: 0x4
  USHORT SecondaryUncorrectableErrorSevRW : 1;  // offset: 0x0 ordinal: 0x5
  USHORT SecondaryCapsAndControlRW : 1;         // offset: 0x0 ordinal: 0x6
  USHORT Reserved : 9;                          // offset: 0x0 ordinal: 0x7
  USHORT AsUSHORT;                              // offset: 0x0 ordinal: 0x8
} _AER_BRIDGE_DESCRIPTOR_FLAGS;

// 0x2 bytes (sizeof)
typedef union _AER_ENDPOINT_DESCRIPTOR_FLAGS {
  USHORT UncorrectableErrorMaskRW : 1;     // offset: 0x0 ordinal: 0x0
  USHORT UncorrectableErrorSeverityRW : 1; // offset: 0x0 ordinal: 0x1
  USHORT CorrectableErrorMaskRW : 1;       // offset: 0x0 ordinal: 0x2
  USHORT AdvancedCapsAndControlRW : 1;     // offset: 0x0 ordinal: 0x3
  USHORT Reserved : 12;                    // offset: 0x0 ordinal: 0x4
  USHORT AsUSHORT;                         // offset: 0x0 ordinal: 0x5
} _AER_ENDPOINT_DESCRIPTOR_FLAGS;

// 0x2 bytes (sizeof)
typedef union _AER_ROOTPORT_DESCRIPTOR_FLAGS {
  USHORT UncorrectableErrorMaskRW : 1;     // offset: 0x0 ordinal: 0x0
  USHORT UncorrectableErrorSeverityRW : 1; // offset: 0x0 ordinal: 0x1
  USHORT CorrectableErrorMaskRW : 1;       // offset: 0x0 ordinal: 0x2
  USHORT AdvancedCapsAndControlRW : 1;     // offset: 0x0 ordinal: 0x3
  USHORT RootErrorCommandRW : 1;           // offset: 0x0 ordinal: 0x4
  USHORT Reserved : 11;                    // offset: 0x0 ordinal: 0x5
  USHORT AsUSHORT;                         // offset: 0x0 ordinal: 0x6
} _AER_ROOTPORT_DESCRIPTOR_FLAGS;

// 0x4 bytes (sizeof)
typedef struct _WHEA_IPF_CPE_DESCRIPTOR {
  USHORT Type;    // offset: 0x0 ordinal: 0x0
  UCHAR Enabled;  // offset: 0x2 ordinal: 0x1
  UCHAR Reserved; // offset: 0x3 ordinal: 0x2
} _WHEA_IPF_CPE_DESCRIPTOR;

// 0x4 bytes (sizeof)
typedef struct _WHEA_IPF_CMC_DESCRIPTOR {
  USHORT Type;    // offset: 0x0 ordinal: 0x0
  UCHAR Enabled;  // offset: 0x2 ordinal: 0x1
  UCHAR Reserved; // offset: 0x3 ordinal: 0x2
} _WHEA_IPF_CMC_DESCRIPTOR;

// 0x4 bytes (sizeof)
typedef struct _WHEA_IPF_MCA_DESCRIPTOR {
  USHORT Type;    // offset: 0x0 ordinal: 0x0
  UCHAR Enabled;  // offset: 0x2 ordinal: 0x1
  UCHAR Reserved; // offset: 0x3 ordinal: 0x2
} _WHEA_IPF_MCA_DESCRIPTOR;

// 0x3 bytes (sizeof)
typedef struct _WHEA_XPF_NMI_DESCRIPTOR {
  USHORT Type;   // offset: 0x0 ordinal: 0x0
  UCHAR Enabled; // offset: 0x2 ordinal: 0x1
} _WHEA_XPF_NMI_DESCRIPTOR;

// 0x10 bytes (sizeof)
typedef struct _TXN_PARAMETER_BLOCK {
  USHORT Length;           // offset: 0x0 ordinal: 0x0
  USHORT TxFsContext;      // offset: 0x2 ordinal: 0x1
  VOID *TransactionObject; // offset: 0x8 ordinal: 0x2
} _TXN_PARAMETER_BLOCK;

// 0x20 bytes (sizeof)
typedef struct _INTERFACE {
  USHORT Size;                          // offset: 0x0 ordinal: 0x0
  USHORT Version;                       // offset: 0x2 ordinal: 0x1
  VOID *Context;                        // offset: 0x8 ordinal: 0x2
  VOID (*InterfaceReference)(VOID *);   // offset: 0x10 ordinal: 0x3
  VOID (*InterfaceDereference)(VOID *); // offset: 0x18 ordinal: 0x4
} _INTERFACE;

// 0x10 bytes (sizeof)
typedef struct _ETW_FILTER_STRING_TOKEN_ELEMENT {
  USHORT Length; // offset: 0x0 ordinal: 0x0
  WCHAR *String; // offset: 0x8 ordinal: 0x1
} _ETW_FILTER_STRING_TOKEN_ELEMENT;

// 0x40 bytes (sizeof)
typedef struct _IMAGE_DOS_HEADER {
  USHORT e_magic;    // offset: 0x0 ordinal: 0x0
  USHORT e_cblp;     // offset: 0x2 ordinal: 0x1
