#include <stdint.h>

// 0x0 (0) bytes
struct _LDRP_LOAD_CONTEXT

{};

// 0x0 (0) bytes
struct _VERIFIER_SHARED_EXPORT_THUNK

{};

// 0x20 (32) bytes
struct _VF_TARGET_ALL_SHARED_EXPORT_THUNKS {
  struct _VERIFIER_SHARED_EXPORT_THUNK *SharedExportThunks; // offset: 0x0 (0)
  struct _VERIFIER_SHARED_EXPORT_THUNK
      *PoolSharedExportThunks; // offset: 0x8 (8)
  struct _VERIFIER_SHARED_EXPORT_THUNK
      *OrderDependentSharedExportThunks; // offset: 0x10 (16)
  struct _VERIFIER_SHARED_EXPORT_THUNK
      *XdvSharedExportThunks; // offset: 0x18 (24)
};

// 0x0 (0) bytes
struct _ACTIVATION_CONTEXT_DATA

{};

// 0x0 (0) bytes
struct __WIL__WNF_USER_SUBSCRIPTION

{};

// 0x0 (0) bytes
struct _IOMMU_DMA_DOMAIN

{};

// 0x0 (0) bytes
struct _CALLBACK_OBJECT

{};

typedef uint8_t UCHAR;

typedef uint64_t ULONGLONG;

typedef void VOID;

// 0x0 (0) bytes
struct _PCW_INSTANCE

{};

// 0x0 (0) bytes
struct _PCW_BUFFER

{};

// 0x0 (0) bytes
struct _PCW_REGISTRATION

{};

// 0x0 (0) bytes
struct _KTMNOTIFICATION_PACKET

{};

// 0x0 (0) bytes
struct _AWEINFO

{};

// 0x0 (0) bytes
struct _MI_SLAB_ALLOCATOR_ENTRY

{};

// 0x0 (0) bytes
struct _MI_ZERO_THREAD_CONTEXT

{};

// 0x0 (0) bytes
struct wil_StagingConfig

{};

typedef int32_t HRESULT;

typedef uint16_t USHORT;

// 0x0 (0) bytes
struct _TP_CALLBACK_INSTANCE

{};

// 0x0 (0) bytes
struct _ACTIVATION_CONTEXT

{};

// 0x0 (0) bytes
struct _TP_CLEANUP_GROUP

{};

// 0x0 (0) bytes
struct _TP_POOL

{};

typedef uint32_t ULONG;

// 0xc (12) bytes
struct _RTL_FEATURE_CONFIGURATION {
  ULONG FeatureId;               // offset: 0x0 (0)
  ULONG Priority : 4;            // offset: 0x4 (4)
  ULONG EnabledState : 2;        // offset: 0x4 (4)
  ULONG IsWexpConfiguration : 1; // offset: 0x4 (4)
  ULONG HasSubscriptions : 1;    // offset: 0x4 (4)
  ULONG Variant : 6;             // offset: 0x4 (4)
  ULONG VariantPayloadKind : 2;  // offset: 0x4 (4)
  ULONG VariantPayload;          // offset: 0x8 (8)
};

// 0x4 (4) bytes
struct wil_details_StagingConfigHeaderProperties {
  ULONG ignoreServiceState : 1; // offset: 0x0 (0)
  ULONG ignoreUserState : 1;    // offset: 0x0 (0)
  ULONG ignoreTestState : 1;    // offset: 0x0 (0)
  ULONG ignoreVariants : 1;     // offset: 0x0 (0)
  ULONG unused : 28;            // offset: 0x0 (0)
};

// 0xc (12) bytes
struct wil_details_StagingConfigFeature {
  ULONG featureId;            // offset: 0x0 (0)
  ULONG changedInSession : 1; // offset: 0x4 (4)
  ULONG isVariantConfig : 1;  // offset: 0x4 (4)
  ULONG unused1 : 6;          // offset: 0x4 (4)
  ULONG serviceState : 2;     // offset: 0x4 (4)
  ULONG userState : 2;        // offset: 0x4 (4)
  ULONG testState : 2;        // offset: 0x4 (4)
  ULONG unused2 : 2;          // offset: 0x4 (4)
  ULONG unused3 : 8;          // offset: 0x4 (4)
  ULONG variant : 6;          // offset: 0x4 (4)
  ULONG payloadKind : 2;      // offset: 0x4 (4)
  ULONG payload;              // offset: 0x8 (8)
};

// 0x4 (4) bytes
union wil_details_RecordedState {
  ULONG exchange;                               // offset: 0x0 (0)
  ULONG recordedDeviceUsage : 1;                // offset: 0x0 (0)
  ULONG recordedDevicePotential : 1;            // offset: 0x0 (0)
  ULONG recordedDeviceOpportunity : 1;          // offset: 0x0 (0)
  ULONG recordedDevicePotentialOpportunity : 1; // offset: 0x0 (0)
  ULONG recordedVariantDeviceUsage : 1;         // offset: 0x0 (0)
  ULONG recordedVariant : 6;                    // offset: 0x0 (0)
  ULONG unused : 21;                            // offset: 0x0 (0)
};

// 0x4 (4) bytes
union wil_details_ReportedState {
  ULONG exchange;                                // offset: 0x0 (0)
  ULONG queuedForReporting : 1;                  // offset: 0x0 (0)
  ULONG reportedDeviceUsage : 1;                 // offset: 0x0 (0)
  ULONG reportedDevicePotential : 1;             // offset: 0x0 (0)
  ULONG reportedDeviceOpportunity : 1;           // offset: 0x0 (0)
  ULONG reportedDevicePotentialOpportunity : 1;  // offset: 0x0 (0)
  ULONG usageCount : 9;                          // offset: 0x0 (0)
  ULONG usageCountRepresentsPotential : 1;       // offset: 0x0 (0)
  ULONG opportunityCount : 7;                    // offset: 0x0 (0)
  ULONG opportunityCountRepresentsPotential : 1; // offset: 0x0 (0)
  ULONG unused : 9;                              // offset: 0x0 (0)
};

// 0x8 (8) bytes
struct wil_details_FeatureReportingCache {
  union wil_details_ReportedState reported; // offset: 0x0 (0)
  union wil_details_RecordedState recorded; // offset: 0x4 (4)
};

// 0x8 (8) bytes
struct wil_details_StagingConfigWnfStateName {
  ULONG Data[2]; // offset: 0x0 (0)
};

// 0x10 (16) bytes
struct wil_details_StagingConfigUsageTrigger {
  ULONG featureId;                                      // offset: 0x0 (0)
  struct wil_details_StagingConfigWnfStateName trigger; // offset: 0x4 (4)
  ULONG serviceReportingKind : 16;                      // offset: 0xc (12)
  ULONG isVariantConfig : 1;                            // offset: 0xc (12)
  ULONG unused : 15;                                    // offset: 0xc (12)
};

// 0x4 (4) bytes
struct _EXT_IOMMU_DEVICE_ID_GIC {
  ULONG LineNumber; // offset: 0x0 (0)
};

typedef int8_t CHAR;

// 0x8 (8) bytes
struct _EXT_IOMMU_DEVICE_ID_ACPI {
  const CHAR *ObjectName; // offset: 0x0 (0)
};

typedef uint16_t WCHAR;

// 0x18 (24) bytes
struct _RTL_SPLAY_LINKS {
  struct _RTL_SPLAY_LINKS *Parent;     // offset: 0x0 (0)
  struct _RTL_SPLAY_LINKS *LeftChild;  // offset: 0x8 (8)
  struct _RTL_SPLAY_LINKS *RightChild; // offset: 0x10 (16)
};

// 0x0 (0) bytes
struct _HAL_PMC_COUNTERS

{};

// 0x0 (0) bytes
struct _SCSI_REQUEST_BLOCK

{};

// 0x0 (0) bytes
struct _DEVICE_NODE_IOMMU_EXTENSION

{};

// 0x0 (0) bytes
struct _ETW_EVENT_CALLBACK_CONTEXT

{};

// 0x0 (0) bytes
struct _ETW_SOFT_RESTART_CONTEXT

{};

// 0x0 (0) bytes
struct _EX_TIMER

{};

// 0x0 (0) bytes
struct _ETW_STACK_CACHE

{};

// 0x0 (0) bytes
struct _ETW_PERFECT_HASH_FUNCTION

{};

// 0x8 (8) bytes
struct _ETW_PARTITION_CONTEXT {
  struct _EPARTITION *Partition; // offset: 0x0 (0)
};

// 0x0 (0) bytes
struct _EX_WNF_SUBSCRIPTION

{};

// 0x0 (0) bytes
struct _DBGKP_ERROR_PORT

{};

// 0x0 (0) bytes
struct _CI_NGEN_PATHS

{};

// 0x0 (0) bytes
struct _EXP_LICENSE_STATE

{};

// 0x10 (16) bytes
struct _PO_IRP_QUEUE {
  struct _IRP *CurrentIrp;     // offset: 0x0 (0)
  struct _IRP *PendingIrpList; // offset: 0x8 (8)
};

// 0x20 (32) bytes
struct _PO_IRP_MANAGER {
  struct _PO_IRP_QUEUE DeviceIrpQueue; // offset: 0x0 (0)
  struct _PO_IRP_QUEUE SystemIrpQueue; // offset: 0x10 (16)
};

// 0x0 (0) bytes
struct _ASSEMBLY_STORAGE_MAP

{};

// 0x0 (0) bytes
struct _JOB_NET_RATE_CONTROL

{};

// 0x0 (0) bytes
struct _PSP_STORAGE

{};

// 0x0 (0) bytes
struct _JOB_CPU_RATE_CONTROL

{};

// 0x0 (0) bytes
struct _JOB_NOTIFICATION_INFORMATION

{};

// 0x0 (0) bytes
struct _JOB_ACCESS_STATE

{};

typedef int16_t SHORT;

typedef int64_t LONGLONG;

// 0x8 (8) bytes
struct _ARBITER_ADD_RESERVED_PARAMETERS {
  struct _DEVICE_OBJECT *ReserveDevice; // offset: 0x0 (0)
};

// 0x0 (0) bytes
struct _PO_PROCESS_ENERGY_CONTEXT

{};

// 0x0 (0) bytes
struct _EPROCESS_QUOTA_BLOCK

{};

// 0x0 (0) bytes
struct _PAGEFAULT_HISTORY

{};

// 0x44 (68) bytes
struct _IO_APIC_REGISTERS {
  volatile ULONG RegisterIndex;  // offset: 0x0 (0)
  volatile ULONG Reserved1[3];   // offset: 0x4 (4)
  volatile ULONG RegisterValue;  // offset: 0x10 (16)
  volatile ULONG Reserved2[11];  // offset: 0x14 (20)
  volatile ULONG EndOfInterrupt; // offset: 0x40 (64)
};

// 0x10 (16) bytes
struct _HEAP_OPPORTUNISTIC_LARGE_PAGE_STATS {
  volatile ULONGLONG SmallPagesInUseWithinLarge;  // offset: 0x0 (0)
  volatile ULONGLONG OpportunisticLargePageCount; // offset: 0x8 (8)
};

// 0x8 (8) bytes
struct _RTL_AVL_TREE {
  struct _RTL_BALANCED_NODE *Root; // offset: 0x0 (0)
};

// 0x10 (16) bytes
struct _HIVE_WRITE_WAIT_QUEUE {
  struct _ETHREAD *ActiveThread;      // offset: 0x0 (0)
  struct _HIVE_WAIT_PACKET *WaitList; // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct _TIME_FIELDS {
  SHORT Year;         // offset: 0x0 (0)
  SHORT Month;        // offset: 0x2 (2)
  SHORT Day;          // offset: 0x4 (4)
  SHORT Hour;         // offset: 0x6 (6)
  SHORT Minute;       // offset: 0x8 (8)
  SHORT Second;       // offset: 0xa (10)
  SHORT Milliseconds; // offset: 0xc (12)
  SHORT Weekday;      // offset: 0xe (14)
};

// 0x10 (16) bytes
struct _SLIST_ENTRY {
  struct _SLIST_ENTRY *Next; // offset: 0x0 (0)
};

typedef int32_t LONG;

// 0x4 (4) bytes
enum _MACHINE_CHECK_NESTING_LEVEL {

  McheckNormal = 0,
  McheckNmi = 1,
  McheckNestingLevels = 2
};

// 0x4 (4) bytes
enum _CM_SHARE_DISPOSITION {

  CmResourceShareUndetermined = 0,
  CmResourceShareDeviceExclusive = 1,
  CmResourceShareDriverExclusive = 2,
  CmResourceShareShared = 3
};

// 0x4 (4) bytes
enum _ETW_HEADER_TYPE {

  EtwHeaderTypeNative = 0,
  EtwHeaderTypeWow = 1,
  EtwHeaderTypeMax = 2
};

// 0x4 (4) bytes
enum _MI_AVAILABLE_PAGE_WAIT_TYPES {

  AvailablePagesWaitLow = 0,
  AvailablePagesWaitHigh = 1,
  AvailablePagesWaitVeryHigh = 2,
  AvailablePagesWaitMaximum = 3
};

// 0x4 (4) bytes
enum _PO_MODERN_SLEEP_ACTION {

  PoModernSleepActionGlobalActivatorsVeto = 0,
  PoModernSleepActionNonBlockingPhases = 1,
  PoModernSleepActionForceIdle = 2,
  PoModernSleepActionMinimalBlockingNotificationClients = 3,
  PoModernSleepActionMax = 4
};

// 0x4 (4) bytes
enum _KCONTINUE_TYPE {

  KCONTINUE_UNWIND = 0,
  KCONTINUE_RESUME = 1,
  KCONTINUE_LONGJUMP = 2,
  KCONTINUE_SET = 3,
  KCONTINUE_LAST = 4
};

// 0x4 (4) bytes
enum _MI_MIRROR_BITMAP_TYPES {

  MirrorBitmapTypeNormal = 0,
  MirrorBitmapTypeInterlocked = 1,
  MirrorBitmapTypeMaximum = 2
};

// 0x4 (4) bytes
enum _MI_INPAGE_SUPPORT_TYPES {

  MiInPageSupportExpanded = 0,
  MiInPageSupportRegular = 1,
  MiInPageSupportMaximum = 2
};

// 0x4 (4) bytes
enum JOB_OBJECT_NET_RATE_CONTROL_FLAGS {

  JOB_OBJECT_NET_RATE_CONTROL_ENABLE = 1,
  JOB_OBJECT_NET_RATE_CONTROL_MAX_BANDWIDTH = 2,
  JOB_OBJECT_NET_RATE_CONTROL_DSCP_TAG = 4,
  JOB_OBJECT_NET_RATE_CONTROL_VALID_FLAGS = 7
};

// 0x4 (4) bytes
enum PDC_ACTIVITY_TYPE {

  PdcNetwork = 0,
  PdcSystem = 1,
  PdcTimer = 2,
  PdcAllNetworks = 3,
  PdcAnyNetwork = 4,
  PdcInvalidActivity = 5,
  PdcMaxActivity = 5
};

// 0x4 (4) bytes
enum ReplacesCorHdrNumericDefines {

  COMIMAGE_FLAGS_ILONLY = 1,
  COMIMAGE_FLAGS_32BITREQUIRED = 2,
  COMIMAGE_FLAGS_IL_LIBRARY = 4,
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,
  COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 16,
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 65536,
  COMIMAGE_FLAGS_32BITPREFERRED = 131072,
  COR_VERSION_MAJOR_V2 = 2,
  COR_VERSION_MAJOR = 2,
  COR_VERSION_MINOR = 5,
  COR_DELETED_NAME_LENGTH = 8,
  COR_VTABLEGAP_NAME_LENGTH = 8,
  NATIVE_TYPE_MAX_CB = 1,
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,
  IMAGE_COR_MIH_METHODRVA = 1,
  IMAGE_COR_MIH_EHRVA = 2,
  IMAGE_COR_MIH_BASICBLOCK = 8,
  COR_VTABLE_32BIT = 1,
  COR_VTABLE_64BIT = 2,
  COR_VTABLE_FROM_UNMANAGED = 4,
  COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8,
  COR_VTABLE_CALL_MOST_DERIVED = 16,
  IMAGE_COR_EATJ_THUNK_SIZE = 32,
  MAX_CLASS_NAME = 1024,
  MAX_PACKAGE_NAME = 1024
};

// 0x4 (4) bytes
enum _VRF_TRIAGE_CONTEXT {

  VRF_TRIAGE_CONTEXT_NONE = 0,
  VRF_TRIAGE_CONTEXT_DEFAULT = 1,
  VRF_TRIAGE_CONTEXT_DEVELOPMENT = 1,
  VRF_TRIAGE_CONTEXT_CERTIFICATION = 2,
  VRF_TRIAGE_CONTEXT_FLIGHT_TARGETED = 3,
  VRF_TRIAGE_CONTEXT_FLIGHT_DIAGNOSTICS = 4,
  VRF_TRIAGE_CONTEXT_FLIGHT_MONITORING = 5,
  NUM_VRF_TRIAGE_CONTEXTS = 6
};

// 0x4 (4) bytes
enum _PROCESS_TERMINATE_REQUEST_REASON {

  ProcessTerminateRequestReasonNone = 0,
  ProcessTerminateCommitFail = 1,
  ProcessTerminateWriteToExecuteMemory = 2,
  ProcessTerminateAttachedWriteToExecuteMemory = 3,
  ProcessTerminateRequestReasonMax = 4
};

// 0x4 (4) bytes
enum _SYSTEM_INFORMATION_CLASS {

  SystemBasicInformation = 0,
  SystemProcessorInformation = 1,
  SystemPerformanceInformation = 2,
  SystemTimeOfDayInformation = 3,
  SystemPathInformation = 4,
  SystemProcessInformation = 5,
  SystemCallCountInformation = 6,
  SystemDeviceInformation = 7,
  SystemProcessorPerformanceInformation = 8,
  SystemFlagsInformation = 9,
  SystemCallTimeInformation = 10,
  SystemModuleInformation = 11,
  SystemLocksInformation = 12,
  SystemStackTraceInformation = 13,
  SystemPagedPoolInformation = 14,
  SystemNonPagedPoolInformation = 15,
  SystemHandleInformation = 16,
  SystemObjectInformation = 17,
  SystemPageFileInformation = 18,
  SystemVdmInstemulInformation = 19,
  SystemVdmBopInformation = 20,
  SystemFileCacheInformation = 21,
  SystemPoolTagInformation = 22,
  SystemInterruptInformation = 23,
  SystemDpcBehaviorInformation = 24,
  SystemFullMemoryInformation = 25,
  SystemLoadGdiDriverInformation = 26,
  SystemUnloadGdiDriverInformation = 27,
  SystemTimeAdjustmentInformation = 28,
  SystemSummaryMemoryInformation = 29,
  SystemMirrorMemoryInformation = 30,
  SystemPerformanceTraceInformation = 31,
  SystemObsolete0 = 32,
  SystemExceptionInformation = 33,
  SystemCrashDumpStateInformation = 34,
  SystemKernelDebuggerInformation = 35,
  SystemContextSwitchInformation = 36,
  SystemRegistryQuotaInformation = 37,
  SystemExtendServiceTableInformation = 38,
  SystemPrioritySeperation = 39,
  SystemVerifierAddDriverInformation = 40,
  SystemVerifierRemoveDriverInformation = 41,
  SystemProcessorIdleInformation = 42,
  SystemLegacyDriverInformation = 43,
  SystemCurrentTimeZoneInformation = 44,
  SystemLookasideInformation = 45,
  SystemTimeSlipNotification = 46,
  SystemSessionCreate = 47,
  SystemSessionDetach = 48,
  SystemSessionInformation = 49,
  SystemRangeStartInformation = 50,
  SystemVerifierInformation = 51,
  SystemVerifierThunkExtend = 52,
  SystemSessionProcessInformation = 53,
  SystemLoadGdiDriverInSystemSpace = 54,
  SystemNumaProcessorMap = 55,
  SystemPrefetcherInformation = 56,
  SystemExtendedProcessInformation = 57,
  SystemRecommendedSharedDataAlignment = 58,
  SystemComPlusPackage = 59,
  SystemNumaAvailableMemory = 60,
  SystemProcessorPowerInformation = 61,
  SystemEmulationBasicInformation = 62,
  SystemEmulationProcessorInformation = 63,
  SystemExtendedHandleInformation = 64,
  SystemLostDelayedWriteInformation = 65,
  SystemBigPoolInformation = 66,
  SystemSessionPoolTagInformation = 67,
  SystemSessionMappedViewInformation = 68,
  SystemHotpatchInformation = 69,
  SystemObjectSecurityMode = 70,
  SystemWatchdogTimerHandler = 71,
  SystemWatchdogTimerInformation = 72,
  SystemLogicalProcessorInformation = 73,
  SystemWow64SharedInformationObsolete = 74,
  SystemRegisterFirmwareTableInformationHandler = 75,
  SystemFirmwareTableInformation = 76,
  SystemModuleInformationEx = 77,
  SystemVerifierTriageInformation = 78,
  SystemSuperfetchInformation = 79,
  SystemMemoryListInformation = 80,
  SystemFileCacheInformationEx = 81,
  SystemThreadPriorityClientIdInformation = 82,
  SystemProcessorIdleCycleTimeInformation = 83,
  SystemVerifierCancellationInformation = 84,
  SystemProcessorPowerInformationEx = 85,
  SystemRefTraceInformation = 86,
  SystemSpecialPoolInformation = 87,
  SystemProcessIdInformation = 88,
  SystemErrorPortInformation = 89,
  SystemBootEnvironmentInformation = 90,
  SystemHypervisorInformation = 91,
  SystemVerifierInformationEx = 92,
  SystemTimeZoneInformation = 93,
  SystemImageFileExecutionOptionsInformation = 94,
  SystemCoverageInformation = 95,
  SystemPrefetchPatchInformation = 96,
  SystemVerifierFaultsInformation = 97,
  SystemSystemPartitionInformation = 98,
  SystemSystemDiskInformation = 99,
  SystemProcessorPerformanceDistribution = 100,
  SystemNumaProximityNodeInformation = 101,
  SystemDynamicTimeZoneInformation = 102,
  SystemCodeIntegrityInformation = 103,
  SystemProcessorMicrocodeUpdateInformation = 104,
  SystemProcessorBrandString = 105,
  SystemVirtualAddressInformation = 106,
  SystemLogicalProcessorAndGroupInformation = 107,
  SystemProcessorCycleTimeInformation = 108,
  SystemStoreInformation = 109,
  SystemRegistryAppendString = 110,
  SystemAitSamplingValue = 111,
  SystemVhdBootInformation = 112,
  SystemCpuQuotaInformation = 113,
  SystemNativeBasicInformation = 114,
  SystemErrorPortTimeouts = 115,
  SystemLowPriorityIoInformation = 116,
  SystemBootEntropyInformation = 117,
  SystemVerifierCountersInformation = 118,
  SystemPagedPoolInformationEx = 119,
  SystemSystemPtesInformationEx = 120,
  SystemNodeDistanceInformation = 121,
  SystemAcpiAuditInformation = 122,
  SystemBasicPerformanceInformation = 123,
  SystemQueryPerformanceCounterInformation = 124,
  SystemSessionBigPoolInformation = 125,
  SystemBootGraphicsInformation = 126,
  SystemScrubPhysicalMemoryInformation = 127,
  SystemBadPageInformation = 128,
  SystemProcessorProfileControlArea = 129,
  SystemCombinePhysicalMemoryInformation = 130,
  SystemEntropyInterruptTimingInformation = 131,
  SystemConsoleInformation = 132,
  SystemPlatformBinaryInformation = 133,
  SystemPolicyInformation = 134,
  SystemHypervisorProcessorCountInformation = 135,
  SystemDeviceDataInformation = 136,
  SystemDeviceDataEnumerationInformation = 137,
  SystemMemoryTopologyInformation = 138,
  SystemMemoryChannelInformation = 139,
  SystemBootLogoInformation = 140,
  SystemProcessorPerformanceInformationEx = 141,
  SystemCriticalProcessErrorLogInformation = 142,
  SystemSecureBootPolicyInformation = 143,
  SystemPageFileInformationEx = 144,
  SystemSecureBootInformation = 145,
  SystemEntropyInterruptTimingRawInformation = 146,
  SystemPortableWorkspaceEfiLauncherInformation = 147,
  SystemFullProcessInformation = 148,
  SystemKernelDebuggerInformationEx = 149,
  SystemBootMetadataInformation = 150,
  SystemSoftRebootInformation = 151,
  SystemElamCertificateInformation = 152,
  SystemOfflineDumpConfigInformation = 153,
  SystemProcessorFeaturesInformation = 154,
  SystemRegistryReconciliationInformation = 155,
  SystemEdidInformation = 156,
  SystemManufacturingInformation = 157,
  SystemEnergyEstimationConfigInformation = 158,
  SystemHypervisorDetailInformation = 159,
  SystemProcessorCycleStatsInformation = 160,
  SystemVmGenerationCountInformation = 161,
  SystemTrustedPlatformModuleInformation = 162,
  SystemKernelDebuggerFlags = 163,
  SystemCodeIntegrityPolicyInformation = 164,
  SystemIsolatedUserModeInformation = 165,
  SystemHardwareSecurityTestInterfaceResultsInformation = 166,
  SystemSingleModuleInformation = 167,
  SystemAllowedCpuSetsInformation = 168,
  SystemVsmProtectionInformation = 169,
  SystemInterruptCpuSetsInformation = 170,
  SystemSecureBootPolicyFullInformation = 171,
  SystemCodeIntegrityPolicyFullInformation = 172,
  SystemAffinitizedInterruptProcessorInformation = 173,
  SystemRootSiloInformation = 174,
  SystemCpuSetInformation = 175,
  SystemCpuSetTagInformation = 176,
  SystemWin32WerStartCallout = 177,
  SystemSecureKernelProfileInformation = 178,
  SystemCodeIntegrityPlatformManifestInformation = 179,
  SystemInterruptSteeringInformation = 180,
  SystemSupportedProcessorArchitectures = 181,
  SystemMemoryUsageInformation = 182,
  SystemCodeIntegrityCertificateInformation = 183,
  SystemPhysicalMemoryInformation = 184,
  SystemControlFlowTransition = 185,
  SystemKernelDebuggingAllowed = 186,
  SystemActivityModerationExeState = 187,
  SystemActivityModerationUserSettings = 188,
  SystemCodeIntegrityPoliciesFullInformation = 189,
  SystemCodeIntegrityUnlockInformation = 190,
  SystemIntegrityQuotaInformation = 191,
  SystemFlushInformation = 192,
  SystemProcessorIdleMaskInformation = 193,
  SystemSecureDumpEncryptionInformation = 194,
  SystemWriteConstraintInformation = 195,
  SystemKernelVaShadowInformation = 196,
  SystemHypervisorSharedPageInformation = 197,
  SystemFirmwareBootPerformanceInformation = 198,
  SystemCodeIntegrityVerificationInformation = 199,
  SystemFirmwarePartitionInformation = 200,
  SystemSpeculationControlInformation = 201,
  SystemDmaGuardPolicyInformation = 202,
  SystemEnclaveLaunchControlInformation = 203,
  SystemWorkloadAllowedCpuSetsInformation = 204,
  SystemCodeIntegrityUnlockModeInformation = 205,
  SystemLeapSecondInformation = 206,
  SystemFlags2Information = 207,
  SystemSecurityModelInformation = 208,
  SystemCodeIntegritySyntheticCacheInformation = 209,
  SystemFeatureConfigurationInformation = 210,
  SystemFeatureConfigurationSectionInformation = 211,
  SystemFeatureUsageSubscriptionInformation = 212,
  SystemSecureSpeculationControlInformation = 213,
  SystemSpacesBootInformation = 214,
  SystemFwRamdiskInformation = 215,
  SystemWheaIpmiHardwareInformation = 216,
  SystemDifSetRuleClassInformation = 217,
  SystemDifClearRuleClassInformation = 218,
  SystemDifApplyPluginVerificationOnDriver = 219,
  SystemDifRemovePluginVerificationOnDriver = 220,
  SystemShadowStackInformation = 221,
  SystemBuildVersionInformation = 222,
  SystemPoolLimitInformation = 223,
  SystemCodeIntegrityAddDynamicStore = 224,
  SystemCodeIntegrityClearDynamicStores = 225,
  SystemPoolZeroingInformation = 227,
  MaxSystemInfoClass = 228
};

// 0x4 (4) bytes
enum _ConnectionResourceConsumerDesc {

  ConnectionResourceConsumerDescIsUndefined = 0,
  ConnectionResourceConsumerDescIsDevice = 1,
  ConnectionResourceConsumerDescIsOpregion = 2,
  ConnectionResourceConsumerDescMax = 3
};

// 0x4 (4) bytes
enum _MI_VAD_ALLOCATION_CELL_TYPE {

  MiVadBottomUp = 0,
  MiVadStackPebTeb = 1,
  MiVadReserved64 = 2,
  MiVadAllocationCellMaximum = 3
};

// 0x4 (4) bytes
enum _PPM_PERF_QOS_DISABLE_REASON {

  PpmPerfQosDisableInternal = 0,
  PpmPerfQosDisableNoProfile = 1,
  PpmPerfQosDisableNoPolicy = 2,
  PpmPerfQosDisableInsufficientPolicy = 3,
  PpmPerfQosDisableMaxOverride = 4,
  PpmPerfQosDisableLowLatency = 5,
  PpmPerfQosDisableSmtScheduler = 6,
  PpmPerfQosDisableNoHardwareSupport = 7,
  PpmPerfQosDisableGroupPolicy = 8,
  PpmPerfQosDisableMax = 9
};

// 0x4 (4) bytes
enum _PS_ATTRIBUTE_NUM {

  PsAttributeParentProcess = 0,
  PsAttributeDebugObject = 1,
  PsAttributeToken = 2,
  PsAttributeClientId = 3,
  PsAttributeTebAddress = 4,
  PsAttributeImageName = 5,
  PsAttributeImageInfo = 6,
  PsAttributeMemoryReserve = 7,
  PsAttributePriorityClass = 8,
  PsAttributeErrorMode = 9,
  PsAttributeStdHandleInfo = 10,
  PsAttributeHandleList = 11,
  PsAttributeGroupAffinity = 12,
  PsAttributePreferredNode = 13,
  PsAttributeIdealProcessor = 14,
  PsAttributeUmsThread = 15,
  PsAttributeMitigationOptions = 16,
  PsAttributeProtectionLevel = 17,
  PsAttributeSecureProcess = 18,
  PsAttributeJobList = 19,
  PsAttributeChildProcessPolicy = 20,
  PsAttributeAllApplicationPackagesPolicy = 21,
  PsAttributeWin32kFilter = 22,
  PsAttributeSafeOpenPromptOriginClaim = 23,
  PsAttributeBnoIsolation = 24,
  PsAttributeDesktopAppPolicy = 25,
  PsAttributeChpe = 26,
  PsAttributeMitigationAuditOptions = 27,
  PsAttributeMachineType = 28,
  PsAttributeComponentFilter = 29,
  PsAttributeMax = 30
};

// 0x4 (4) bytes
enum _SYSTEM_FEATURE_CONFIGURATION_SECTION_TYPE {

  SystemFeatureConfigurationSectionTypeBoot = 0,
  SystemFeatureConfigurationSectionTypeRuntime = 1,
  SystemFeatureConfigurationSectionTypeUsageTriggers = 2,
  SystemFeatureConfigurationSectionTypeCount = 3
};

// 0x4 (4) bytes
enum _HV_EXT_EPF_MODE {

  HvExtEpfModeMin = 0,
  HvExtEpfModeNt = 0,
  HvExtEpfModeMax = 1
};

// 0x4 (4) bytes
enum _MI_CROSS_PARTITION_CHARGE_TYPE {

  MiCrossPartitionSectionResAvailCharge = 0,
  MiCrossPartitionSectionCommitCharge = 1,
  MiCrossPartitionPageCombineResAvailCharge = 2,
  MiCrossPartitionPageCombineCommitCharge = 3,
  MiCrossPartitionLargePageResAvailCharge = 4,
  MiCrossPartitionLargePageCommitCharge = 5,
  MiCrossPartitionPageCloneResAvailCharge = 6,
  MiCrossPartitionMaximumCharge = 7
};

// 0x4 (4) bytes
enum _THREAD_WORKLOAD_CLASS {

  ThreadWorkloadClassDefault = 0,
  ThreadWorkloadClassGraphics = 1,
  MaxThreadWorkloadClass = 2
};

// 0x4 (4) bytes
enum LSA_FOREST_TRUST_RECORD_TYPE {

  ForestTrustTopLevelName = 0,
  ForestTrustTopLevelNameEx = 1,
  ForestTrustDomainInfo = 2,
  ForestTrustRecordTypeLast = 2
};

// 0x4 (4) bytes
enum SLEEPSTUDY_SPM_SCENARIO_CS_EXIT {

  SpmScenarioStopReasonUnspecified = 16,
  SpmScenarioStopReasonCsExit = 17,
  SpmScenarioStopReasonInternalSegmentTransition = 18,
  SpmScenarioStopReasonMax = 19
};

// 0x4 (4) bytes
enum PDCCLIENTID {

  PDC_INVALID_CLIENT = 0,
  PDC_PLM_CLIENT = 1,
  PDC_NQM_CLIENT = 2,
  PDC_WNS_CLIENT = 3,
  PDC_DAM_CLIENT = 4,
  PDC_WCM_CLIENT = 5,
  PDC_NCSI_CLIENT = 7,
  PDC_DHCP_CLIENT = 8,
  PDC_TCPIP_CLIENT = 9,
  PDC_WU_CLIENT = 11,
  PDC_GP_CLIENT = 12,
  PDC_NCA_CLIENT = 14,
  PDC_BI_CLIENT = 15,
  PDC_MSCHED_CLIENT = 16,
  PDC_SUSPENDRESUME_CLIENT = 17,
  PDC_INTERNAL_CLIENT = 18,
  PDC_DEFAULT_KM_TEST_CLIENT_EXEMPTED = 19,
  PDC_DEFAULT_UM_TEST_CLIENT_EXEMPTED = 20,
  PDC_DAM_PHASE_TEST_CLIENT = 21,
  PDC_LOW_POWER_PHASE_TEST_CLIENT = 22,
  PDC_RESILIENCY_NOTIFICATION_PHASE_TEST_CLIENT = 23,
  PDC_NQM_RESILIENCY_TEST_CLIENT = 24,
  PDC_DAM_RESILIENCY_TEST_CLIENT = 25,
  PDC_DAM_KM_TEST_CLIENT = 26,
  PDC_DAM_UM_TEST_CLIENT = 27,
  PDC_SINGLETON_TEST_CLIENT = 28,
  PDC_NETWORK_SERVICE_TEST_CLIENT = 29,
  PDC_NETWORK_SERVICE2_TEST_CLIENT = 30,
  PDC_SYSTEM_SERVICE_TEST_CLIENT = 31,
  PDC_ACTIV_NOTIF_DAM_RESIL_TEST_CLIENT = 32,
  PDC_ACTIV_NOTIF_NET_RESIL_TEST_CLIENT = 33,
  PDC_SHELL_CLIENT = 34,
  PDC_MAINTENANCE_CLIENT = 35,
  PDC_SYNC_CLIENT = 36,
  PDC_IDM_CLIENT = 37,
  PDC_CORTANA_VOICE_ACTIVATION_CLIENT = 38,
  PDC_TETHERING_CLIENT = 39,
  PDC_AUDIO_CLIENT = 40,
  PDC_LOCK_SCREEN = 41,
  PDC_LREC_CLIENT = 42,
  PDC_WP_BW_CLIENT = 43,
  PDC_WP_MEDIA_STREAMING_CLIENT = 44,
  PDC_WP_MAPS_CLIENT = 46,
  PDC_WP_SYNC_CLIENT = 47,
  PDC_SETTING_SYNC_CLIENT = 48,
  PDC_WP_EDM_CLIENT = 49,
  PDC_WP_WALLET_CLIENT = 50,
  PDC_WP_LOCATION_CLIENT = 51,
  PDC_WP_CM_CLIENT = 53,
  PDC_WP_DCP_CLIENT = 54,
  PDC_WP_WIFIAUTO_CLIENT = 55,
  PDC_BITLOCKER_CLIENT = 56,
  PDC_MDM_CERTINSTALLER_CLIENT = 57,
  PDC_WP_IM_CLIENT = 58,
  PDC_WP_MMS_CLIENT = 59,
  PDC_DEVICEENROLLER_CLIENT = 60,
  PDC_WP_WIFI_SCANNING_CLIENT = 61,
  PDC_WP_OMADM_CLIENT = 62,
  PDC_WP_TELEMETRY_CHECK_CLIENT = 63,
  PDC_WP_DIS_CLIENT = 64,
  PDC_BITS_CLIENT = 65,
  PDC_WP_VOIP_EXECUTION_CLIENT = 66,
  PDC_WP_RESERVED_CLIENT3 = 67,
  PDC_SLEEP_STUDY_CLIENT = 68,
  PDC_WP_AUTOTIMEUPDATE_CLIENT = 69,
  PDC_HYPERV_CLIENT = 70,
  PDC_KM_SIGNAL_CLIENT = 71,
  PDC_UM_SIGNAL_CLIENT = 72,
  PDC_DEVICE_HEALTH_ATTESTATION_CLIENT = 73,
  PDC_XB_SYSTEM_CLIENT = 74,
  PDC_XB_HOST_CLIENT = 75,
  PDC_PRINT_JOB_MANAGER_CLIENT = 76,
  PDC_TELEMETRY_CLIENT = 77,
  PDC_ERROR_REPORTING_CLIENT = 78,
  PDC_XBOX_NTM = 79,
  PDC_CBE_CLIENT = 80,
  PDC_FIND_MY_PHONE_CLIENT = 81,
  PDC_COMMAND_CHANNEL_CLIENT = 82,
  PDC_PPM_PROFILES_CLIENT = 83,
  PDC_WIFI_CALLING_CLIENT = 84,
  PDC_WU_REBOOT_CLIENT = 85,
  PDC_SYSMAIN_CLIENT = 86,
  PDC_XBOX_UPDATE_CLIENT = 87,
  PDC_CHAT_SERVICE_CLIENT = 88,
  PDC_FIND_MY_DEVICE_CLIENT = 89,
  PDC_NOTIFICATION_FORWARDING_AND_ACTION_CLIENT = 90,
  PDC_INSTALL_AGENT_CLIENT = 91,
  PDC_XBOX_WAKE_ON_VOICE = 92,
  PDC_PLM_AUDIO_CLIENT = 93,
  PDC_WP_BCKAUDIO_CLIENT = 94,
  PDC_WAKE_ON_LAN_CLIENT = 95,
  PDC_WP_CLOUD_MESSAGING_CLIENT = 96,
  PDC_DATA_MIGRATION_MANAGER = 97,
  PDC_EVENT_SOUND_MANAGER_CLIENT = 98,
  PDC_WWAN_DORMANCY_HINT_CLIENT = 99,
  PDC_HAM_CLIENT = 100,
  PDC_FILESHARINGSERVER_CLIENT = 101,
  PDC_DIRECTED_DRIPS_TASK_CLIENT = 102,
  PDC_DIRECTED_DRIPS_LPE_CLIENT = 103,
  PDC_DIRECTED_DRIPS_PLM_CLIENT = 104,
  PDC_HTTPSDATASOURCE_CLIENT = 105,
  PDC_TERMINALSERVER_CONNECTION_CLIENT = 106,
  PDC_TERMINALSERVER_SESSION_CLIENT = 107,
  PDC_ANYNETWORK_RESILIENCY_CLIENT = 108,
  PDC_XBOX_NUI_CLIENT = 110,
  PDC_WIFI_CALLING_IMS_CLIENT = 111,
  PDC_SLEEPSTUDY_HELPER_USER_CLIENT = 112,
  PDC_SLEEPSTUDY_HELPER_KERNEL_CLIENT = 113,
  PDC_CONTAINER_MANAGER_CLIENT = 114,
  PDC_NUMBER_OF_CLIENTS = 115
};

// 0x4 (4) bytes
enum _PERFINFO_MM_STAT {

  PerfInfoMMStatNotUsed = 0,
  PerfInfoMMStatAggregatePageCombine = 1,
  PerfInfoMMStatIterationPageCombine = 2,
  PerfInfoMMStatMax = 3
};

// 0x4 (4) bytes
enum _MI_PARTITION_THREAD {

  MiZeroPageThreadSlot = 0,
  MiRebuildLargePagesThreadSlot = 1,
  MiPartitionWorkingSetManagerSlot = 2,
  MiDereferenceSegmentThreadSlot = 3,
  MiModifiedPageWriterSlot = 4,
  MiMappedPageWriterSlot = 5,
  MiNumberOfPartitionThreads = 6
};

// 0x4 (4) bytes
enum _TRACE_INFORMATION_CLASS {

  TraceIdClass = 0,
  TraceHandleClass = 1,
  TraceEnableFlagsClass = 2,
  TraceEnableLevelClass = 3,
  GlobalLoggerHandleClass = 4,
  EventLoggerHandleClass = 5,
  AllLoggerHandlesClass = 6,
  TraceHandleByNameClass = 7,
  LoggerEventsLostClass = 8,
  TraceSessionSettingsClass = 9,
  LoggerEventsLoggedClass = 10,
  DiskIoNotifyRoutinesClass = 11,
  TraceInformationClassReserved1 = 12,
  AllPossibleNotifyRoutinesClass = 12,
  FltIoNotifyRoutinesClass = 13,
  TraceInformationClassReserved2 = 14,
  WdfNotifyRoutinesClass = 15,
  MaxTraceInformationClass = 16
};

// 0x4 (4) bytes
enum _MI_IO_PFN_TYPE {

  MiIoPfnProbes = 0,
  MiIoPfnMaps = 1,
  MiIoPfnUnmapped = 2,
  MiMaximumIoPfnType = 3
};

// 0x4 (4) bytes
enum TlgOut_t {

  TlgOutNULL = 0,
  TlgOutNOPRINT = 1,
  TlgOutSTRING = 2,
  TlgOutBOOLEAN = 3,
  TlgOutHEX = 4,
  TlgOutPID = 5,
  TlgOutTID = 6,
  TlgOutPORT = 7,
  TlgOutIPV4 = 8,
  TlgOutIPV6 = 9,
  TlgOutSOCKETADDRESS = 10,
  TlgOutXML = 11,
  TlgOutJSON = 12,
  TlgOutWIN32ERROR = 13,
  TlgOutNTSTATUS = 14,
  TlgOutHRESULT = 15,
  TlgOutFILETIME = 16,
  TlgOutSIGNED = 17,
  TlgOutUNSIGNED = 18,
  TlgOutUTF8 = 35,
  TlgOutPKCS7_WITH_TYPE_INFO = 36,
  TlgOutCODE_POINTER = 37,
  TlgOutDATETIME_UTC = 38,
  _TlgOutMax = 39,
  _TlgOutChain = 128,
  _TlgOutTypeMask = 127
};

// 0x4 (4) bytes
enum _INVPCID_TYPE {

  InvpcidIndividualAddress = 0,
  InvpcidSingleContext = 1,
  InvpcidAllContextAndGlobals = 2,
  InvpcidAllContext = 3
};

// 0x4 (4) bytes
enum _ADD_DRIVER_STAGE {

  ClassConfigFilters = 0,
  LowerDeviceFilters = 1,
  LowerClassFilters = 2,
  DeviceService = 3,
  UpperDeviceFilters = 4,
  UpperClassFilters = 5,
  MaximumAddStage = 6
};

// 0x4 (4) bytes
enum _KPROCESS_STATE {

  ProcessInMemory = 0,
  ProcessOutOfMemory = 1,
  ProcessInTransition = 2,
  ProcessOutTransition = 3,
  ProcessInSwap = 4,
  ProcessOutSwap = 5,
  ProcessRetryOutSwap = 6,
  ProcessAllSwapStates = 7
};

// 0x4 (4) bytes
enum _MI_VAD_64K_TYPES {

  MiVad64KPrivate = 0,
  MiVad64KShared = 1,
  MiVad64KTypes = 2
};

// 0x4 (4) bytes
enum _PO_CS_DEVICE_NOTIFICATION_TYPE {

  PoCsDeviceNotificationStorage = 0,
  PoCsDeviceNotificationWiFi = 1,
  PoCsDeviceNotificationMbn = 2,
  PoCsDeviceNotificationAudio = 3,
  PoCsDeviceNotificationEthernet = 4,
  PoCsDeviceNotificationMaximum = 5
};

// 0x4 (4) bytes
enum _POLICY_AUDIT_EVENT_TYPE {

  AuditCategorySystem = 0,
  AuditCategoryLogon = 1,
  AuditCategoryObjectAccess = 2,
  AuditCategoryPrivilegeUse = 3,
  AuditCategoryDetailedTracking = 4,
  AuditCategoryPolicyChange = 5,
  AuditCategoryAccountManagement = 6,
  AuditCategoryDirectoryServiceAccess = 7,
  AuditCategoryAccountLogon = 8
};

// 0x4 (4) bytes
enum _MI_ASSIGNED_REGION_TYPES {

  AssignedRegionNonPagedPool = 0,
  AssignedRegionPagedPool = 1,
  AssignedRegionSystemCache = 2,
  AssignedRegionSystemPtes = 3,
  AssignedRegionUltraZero = 4,
  AssignedRegionPfnDatabase = 5,
  AssignedRegionCfg = 6,
  AssignedRegionHyperSpace = 7,
  AssignedRegionKernelStacks = 8,
  AssignedRegionPageTables = 9,
  AssignedRegionSession = 10,
  AssignedRegionSecureNonPagedPool = 11,
  AssignedRegionSystemImages = 12,
  AssignedRegionMaximum = 13
};

// 0x4 (4) bytes
enum _MI_SUBVAD_LISTS {

  MiSubVadPebTebAny = 0,
  MiSubVadPebTebBelow4gb = 1,
  MiSubVadMaximum = 2
};

// 0x4 (4) bytes
enum _KWAIT_STATE {

  WaitInProgress = 0,
  WaitCommitted = 1,
  WaitAborted = 2,
  WaitSuspendInProgress = 3,
  WaitSuspended = 4,
  WaitResumeInProgress = 5,
  WaitResumeAborted = 6,
  WaitFirstSuspendState = 3,
  WaitLastSuspendState = 6,
  MaximumWaitState = 7
};

// 0x4 (4) bytes
enum _KI_CALLBACK {

  KiCallbackNmi = 0,
  KiCallbackBound = 1,
  KiCallbackSx = 2,
  KiCallbackCount = 3,
  KiFirstCallback = 0
};

// 0x4 (4) bytes
enum _POP_DEEP_SLEEP_DISENGAGE_REASON {

  PopDeepSleepDisengageReasonInactive = 0,
  PopDeepSleepDisengageReasonNonAoAc = 1,
  PopDeepSleepDisengageReasonPendingIrps = 2,
  PopDeepSleepDisengageReasonPowerSettings = 3,
  PopDeepSleepDisengageReasonDozeS4WorkerQueued = 4,
  PopDeepSleepDisengageReasonSystemPowerTransition = 5,
  PopDeepSleepDisengageReasonDeviceBlockingDrips = 6,
  PopDeepSleepDisengageReasonAcpi = 7,
  PopDeepSleepDisengageReasonDirectedDripsTransition = 8,
  PopDeepSleepDisengageReasonPepPreVeto = 9,
  PopDeepSleepDisengageReasonMax = 10
};

// 0x4 (4) bytes
enum _ETW_GUID_TYPE {

  EtwTraceGuidType = 0,
  EtwNotificationGuidType = 1,
  EtwGroupGuidType = 2,
  EtwGuidTypeMax = 3
};

// 0x4 (4) bytes
enum _MI_KSTACK_TYPE {

  MiRegularKstack = 0,
  MiShortLivedKstack = 1,
  MiMaximumKstack = 2
};

// 0x4 (4) bytes
enum _WOW64_SHARED_INFORMATION {

  SharedNtdll32LdrInitializeThunk = 0,
  SharedNtdll32KiUserExceptionDispatcher = 1,
  SharedNtdll32KiUserApcDispatcher = 2,
  SharedNtdll32KiUserCallbackDispatcher = 3,
  SharedNtdll32RtlUserThreadStart = 4,
  SharedNtdll32pQueryProcessDebugInformationRemote = 5,
  SharedNtdll32BaseAddress = 6,
  SharedNtdll32LdrSystemDllInitBlock = 7,
  SharedNtdll32RtlpFreezeTimeBias = 8,
  Wow64SharedPageEntriesCount = 9
};

// 0x4 (4) bytes
enum _PO_HIBER_FORCE_DISABLE_REASON {

  PoHiberForceDisableReasonPolicy = 0,
  PoHiberForceDisableReasonGuardedHost = 1,
  PoHiberForceDisableReasonMax = 2
};

// 0x4 (4) bytes
enum _SYSTEM_PROCESS_CLASSIFICATION {

  SystemProcessClassificationNormal = 0,
  SystemProcessClassificationSystem = 1,
  SystemProcessClassificationSecureSystem = 2,
  SystemProcessClassificationMemCompression = 3,
  SystemProcessClassificationRegistry = 4,
  SystemProcessClassificationMaximum = 5
};

// 0x4 (4) bytes
enum _KTHREAD_STATE {

  Initialized = 0,
  Ready = 1,
  Running = 2,
  Standby = 3,
  Terminated = 4,
  Waiting = 5,
  Transition = 6,
  DeferredReady = 7,
  GateWaitObsolete = 8,
  WaitingForProcessInSwap = 9
};

// 0x4 (4) bytes
enum _TlgBlob_t {

  _TlgBlobNone = 0,
  _TlgBlobEnd = 1,
  _TlgBlobProvider = 2,
  _TlgBlobEvent3 = 3,
  _TlgBlobProvider3 = 4,
  _TlgBlobEvent2 = 5,
  _TlgBlobEvent4 = 6,
  _TlgBlobMax = 7
};

// 0x4 (4) bytes
enum _MI_SHARED_USER_PAGE_TYPES {

  MiSharedUserPageKernel = 0,
  MiSharedUserPageHypervisor = 1,
  MiSharedUserPageMaximum = 2
};

// 0x4 (4) bytes
enum _KPROCESS_PPM_POLICY {

  ProcessPpmDefault = 0,
  ProcessPpmThrottle = 1,
  ProcessPpmSemiThrottle = 2,
  ProcessPpmNoThrottle = 3,
  ProcessPpmWindowMinimized = 4,
  ProcessPpmWindowOccluded = 5,
  ProcessPpmWindowVisible = 6,
  ProcessPpmWindowInFocus = 7,
  MaxProcessPpmPolicy = 8
};

// 0x4 (4) bytes
enum _KTHREAD_PPM_POLICY {

  ThreadPpmDefault = 0,
  ThreadPpmThrottle = 1,
  ThreadPpmSemiThrottle = 2,
  ThreadPpmNoThrottle = 3,
  MaxThreadPpmPolicy = 4
};

// 0x4 (4) bytes
enum PS_CREATE_STATE {

  PsCreateInitialState = 0,
  PsCreateFailOnFileOpen = 1,
  PsCreateFailOnSectionCreate = 2,
  PsCreateFailExeFormat = 3,
  PsCreateFailMachineMismatch = 4,
  PsCreateFailExeName = 5,
  PsCreateSuccess = 6,
  PsCreateMaximumStates = 7
};

// 0x4 (4) bytes
enum _MI_DYNAMICBASE_BITMAP {

  DynamicBaseBitMapNative = 0,
  DynamicBaseBitMap64Low = 1,
  DynamicBaseBitMap64LowWow = 2,
  DynamicBaseBitMap32WowFirst = 3,
  DynamicBaseBitMap32WowLast = 3,
  DynamicBaseBitMapInvalid = 4,
  DynamicBaseBitMapMax = 4
};

// 0x4 (4) bytes
enum _POP_SYSTEM_IDLE_EVENT_TYPE {

  PopSystemIdleEventTypeMonitorOffUserInput = 0,
  PopSystemIdleEventTypeMonitorOnUserInput = 1,
  PopSystemIdleEventTypeUserPresence = 2,
  PopSystemIdleEventTypeResumeFromSxSystemPowerState = 3,
  PopSystemIdleEventTypeMax = 4,
  PopSystemIdleEventTypeInvalid = 4
};

// 0x4 (4) bytes
enum _POP_FX_WORK_POOL_QUEUE {

  PopFxWorkPoolQueueEmergency = 0,
  PopFxWorkPoolQueuePlugin = 1,
  PopFxWorkPoolQueueMax = 2
};

// 0x4 (4) bytes
enum _ETW_STRING_TOKEN_TYPE {

  ETW_STRING_TOKEN_EXE = 0,
  ETW_STRING_TOKEN_PACKAGE_ID = 1,
  ETW_STRING_TOKEN_PKG_APP_ID = 2,
  ETW_STRING_TOKEN_CONTAINER = 3,
  ETW_STRING_TOKEN_MAX_COUNT = 4
};

// 0x4 (4) bytes
enum _WORKING_SET_TYPE {

  WorkingSetTypeUser = 0,
  WorkingSetTypeSession = 1,
  WorkingSetTypeSystemTypes = 2,
  WorkingSetTypeSystemCache = 2,
  WorkingSetTypePagedPool = 3,
  WorkingSetTypeSystemViews = 4,
  WorkingSetTypePagableMaximum = 4,
  WorkingSetTypeSystemPtes = 5,
  WorkingSetTypeKernelStacks = 6,
  WorkingSetTypeNonPagedPool = 7,
  WorkingSetTypeMaximum = 8
};

// 0x4 (4) bytes
enum _PS_PROTECTED_SIGNER {

  PsProtectedSignerNone = 0,
  PsProtectedSignerAuthenticode = 1,
  PsProtectedSignerCodeGen = 2,
  PsProtectedSignerAntimalware = 3,
  PsProtectedSignerLsa = 4,
  PsProtectedSignerWindows = 5,
  PsProtectedSignerWinTcb = 6,
  PsProtectedSignerWinSystem = 7,
  PsProtectedSignerApp = 8,
  PsProtectedSignerMax = 9
};

// 0x4 (4) bytes
enum _MI_MEMORY_HIGHLOW {

  MiMemoryHigh = 0,
  MiMemoryLow = 1,
  MiMemoryHighLow = 2
};

// 0x4 (4) bytes
enum FEATURE_ENABLED_STATE {

  FEATURE_ENABLED_STATE_DEFAULT = 0,
  FEATURE_ENABLED_STATE_DISABLED = 1,
  FEATURE_ENABLED_STATE_ENABLED = 2,
  FEATURE_ENABLED_STATE_HAS_NOTIFICATION = 128,
  FEATURE_ENABLED_STATE_HAS_VARIANT_CONFIGURATION = 64
};

// 0x4 (4) bytes
enum _PERFINFO_KERNELMEMORY_USAGE_TYPE {

  PerfInfoMemUsagePfnMetadata = 0,
  PerfInfoMemUsageMax = 1
};

// 0x4 (4) bytes
enum _RTL_FEATURE_CONFIGURATION_PRIORITY {

  FeatureConfigurationPriorityImageDefault = 0,
  FeatureConfigurationPriorityService = 4,
  FeatureConfigurationPriorityUser = 8,
  FeatureConfigurationPriorityUserPolicy = 10,
  FeatureConfigurationPriorityTest = 12,
  FeatureConfigurationPriorityImageOverride = 15,
  FeatureConfigurationPriorityMax = 15
};

// 0x4 (4) bytes
enum _HEAP_SEGMGR_LARGE_PAGE_POLICY {

  HeapSegMgrNoLargePages = 0,
  HeapSegMgrEnableLargePages = 1,
  HeapSegMgrNormalPolicy = 1,
  HeapSegMgrForceSmall = 2,
  HeapSegMgrForceLarge = 3,
  HeapSegMgrForceRandom = 4,
  HeapSegMgrLargePagePolicyMax = 5
};

// 0x4 (4) bytes
enum _PS_RESOURCE_TYPE {

  PsResourceNonPagedPool = 0,
  PsResourcePagedPool = 1,
  PsResourcePageFile = 2,
  PsResourceWorkingSet = 3,
  PsResourceMax = 4
};

// 0x4 (4) bytes
enum _PROCESS_VA_TYPE {

  ProcessVAImage = 0,
  ProcessVASection = 1,
  ProcessVAPrivate = 2,
  ProcessVAMax = 3
};

// 0x4 (4) bytes
enum _MI_CFG_BITMAP_TYPE {

  CfgBitMapNative = 0,
  CfgBitMapWow64 = 1,
  CfgBitMapMax = 2
};

// 0x4 (4) bytes
enum _PS_PROTECTED_TYPE {

  PsProtectedTypeNone = 0,
  PsProtectedTypeProtectedLight = 1,
  PsProtectedTypeProtected = 2,
  PsProtectedTypeMax = 3
};

// 0x4 (4) bytes
enum _SKSERVICE {

  SECURESERVICE_NONE = 0,
  SECURESERVICE_PHASE4_INIT = 1,
  SECURESERVICE_START_PROCESSOR = 2,
  SECURESERVICE_FINISH_START_PROCESSOR = 3,
  SECURESERVICE_REGISTER_SYSTEM_DLLS = 4,
  SECURESERVICE_REGISTER_SYSTEM_PROCESS = 5,
  SECURESERVICE_CREATE_PROCESS = 6,
  SECURESERVICE_INITIALIZE_PROCESS = 7,
  SECURESERVICE_CREATE_THREAD = 8,
  SECURESERVICE_REQUEST_THREAD_EXIT = 9,
  SECURESERVICE_TERMINATE_THREAD = 10,
  SECURESERVICE_RUNDOWN_PROCESS = 11,
  SECURESERVICE_DEBUG_PROCESS = 12,
  SECURESERVICE_GET_TEB_ADDRESS = 13,
  SECURESERVICE_GET_CONTEXT = 14,
  SECURESERVICE_SET_CONTEXT = 15,
  SECURESERVICE_SEND_ATTACH_NOTIFICATIONS = 16,
  SECURESERVICE_GET_ETW_DEBUG_ID = 17,
  SECURESERVICE_GET_ON_DEMAND_DEBUG_CHALLENGE = 18,
  SECURESERVICE_ENABLE_ON_DEMAND_DEBUG_WITH_RESPONSE = 19,
  SECURESERVICE_RETRIEVE_MAILBOX = 20,
  SECURESERVICE_IS_TRUSTLET_RUNNING = 21,
  SECURESERVICE_CREATE_SECURE_ALLOCATION = 22,
  SECURESERVICE_FILL_SECURE_ALLOCATION = 23,
  SECURESERVICE_MAKE_CODE_CATALOG = 24,
  SECURESERVICE_CREATE_SECURE_IMAGE = 25,
  SECURESERVICE_FINALIZE_SECURE_IMAGE_HASH = 26,
  SECURESERVICE_FINISH_SECURE_IMAGE_VALIDATION = 27,
  SECURESERVICE_PREPARE_IMAGE_RELOCATIONS = 28,
  SECURESERVICE_RELOCATE_IMAGE = 29,
  SECURESERVICE_CLOSE_SECURE_HANDLE = 30,
  SECURESERVICE_VALIDATE_DYNAMIC_CODE = 31,
  SECURESERVICE_TRANSFER_IMAGE_VERSION_RESOURCE = 32,
  SECURESERVICE_SET_CODE_INTEGRITY_POLICY = 33,
  SECURESERVICE_EXCHANGE_ENTROPY = 34,
  SECURESERVICE_ALLOCATE_HIBERNATE_RESOURCES = 35,
  SECURESERVICE_FREE_HIBERNATE_RESOURCES = 36,
  SECURESERVICE_CONFIGURE_DYNAMIC_MEMORY = 37,
  SECURESERVICE_DEBUG_PROTECT_MEMORY = 38,
  SECURESERVICE_DEBUG_READ_WRITE_MEMORY = 39,
  SECURESERVICE_QUERY_VIRTUAL_MEMORY = 40,
  SECURESERVICE_CAPTURE_IMAGE_IAT = 41,
  SECURESERVICE_FREE_IMAGE_IAT = 42,
  SECURESERVICE_APPLY_FIXUPS = 43,
  SECURESERVICE_MARK_IMAGE_PROTECTED = 44,
  SECURESERVICE_CREATE_ENCLAVE = 45,
  SECURESERVICE_LOAD_ENCLAVE_DATA = 46,
  SECURESERVICE_LOAD_ENCLAVE_MODULE = 47,
  SECURESERVICE_INITIALIZE_ENCLAVE = 48,
  SECURESERVICE_TERMINATE_ENCLAVE = 49,
  SECURESERVICE_DELETE_ENCLAVE = 50,
  SECURESERVICE_CONNECT_SW_INTERRUPT = 51,
  SECURESERVICE_RELAX_HYPERGUARD_QUOTA = 52,
  SECURESERVICE_LIVEDUMP_QUERY_SECONDARYDATA_SIZE = 53,
  SECURESERVICE_LIVEDUMP_START = 54,
  SECURESERVICE_LIVEDUMP_ADD_BUFFER = 55,
  SECURESERVICE_LIVEDUMP_SETUP_BUFFER = 56,
  SECURESERVICE_LIVEDUMP_FINALIZE = 57,
  SECURESERVICE_LIVEDUMP_ABORT = 58,
  SECURESERVICE_LIVEDUMP_CAPTURE_PROCESS = 59,
  SECURESERVICE_NOTIFY_POWER_STATE = 60,
  SECURESERVICE_QUERY_PROFILE_INFORMATION = 61,
  SECURESERVICE_UPDATE_FREEZE_BIAS = 62,
  SECURESERVICE_CREATE_SECURE_SECTION = 63,
  SECURESERVICE_DELETE_SECURE_SECTION = 64,
  SECURESERVICE_QUERY_SECURE_DEVICE = 65,
  SECURESERVICE_UNPROTECT_SECURE_DEVICE = 66,
  SECURESERVICE_DETERMINE_HOT_PATCH_TYPE = 67,
  SECURESERVICE_OBTAIN_PATCH_UNDO_TABLE_SIZE = 68,
  SECURESERVICE_OBTAIN_PATCH_UNDO_TABLE = 69,
  SECURESERVICE_APPLY_HOT_PATCH = 70,
  SECURESERVICE_REVERT_HOT_PATCH = 71,
  SECURESERVICE_PREPARE_DRIVER_FOR_PATCH = 72,
  SECURESERVICE_PROVISION_DUMP_KEYS = 73,
  SECURESERVICE_CAPTURE_PGO_DATA = 74,
  SECURESERVICE_START_PROFILE = 75,
  SECURESERVICE_STOP_PROFILE = 76,
  SECURESERVICE_SET_TRACEPOINT = 77,
  SECURESERVICE_NO_TRACING_FIRST = 191,
  SECURESERVICE_GET_PEB_ADDRESS = 192,
  SECURESERVICE_VALIDATE_SECURE_IMAGE_PAGES = 193,
  SECURESERVICE_PRE_INIT_FIRST = 207,
  SECURESERVICE_PHASE3_INIT = 208,
  SECURESERVICE_PERIODIC = 209,
  SECURESERVICE_WORK_QUEUE = 210,
  SECURESERVICE_RESERVE_PROTECTED_PAGES = 211,
  SECURESERVICE_APPLY_DYNAMIC_RELOCATIONS = 212,
  SECURESERVICE_ETW_ENABLE_CALLBACK = 213,
  SECURESERVICE_INITIALIZE_SECURE_POOL = 214,
  SECURESERVICE_INITIALIZE_KERNEL_CFG = 215,
  SECURESERVICE_LOAD_DRIVER = 216,
  SECURESERVICE_UNLOAD_DRIVER = 217,
  SECURESERVICE_ENABLE_CFG_TARGET = 218,
  SECURESERVICE_COMPLETE_SLAB_CONFIGURATION = 219,
  SECURESERVICE_INITIALIZE_RETPOLINE = 220,
  SECURESERVICE_PERFORM_RETPOLINE_RELOCATIONS = 221,
  SECURESERVICE_UPDATE_IMPORT_RELOCATIONS = 222,
  SECURESERVICE_DISPATCH_LEVEL_FIRST = 239,
  SECURESERVICE_FLUSH_ADDRESS_SPACE = 240,
  SECURESERVICE_FAST_FLUSH_RANGE_LIST = 241,
  SECURESERVICE_SLOW_FLUSH_RANGE_LIST = 242,
  SECURESERVICE_REMOVE_PROTECTED_PAGE = 243,
  SECURESERVICE_COPY_PROTECTED_PAGE = 244,
  SECURESERVICE_REGISTER_PROTECTED_PAGE = 245,
  SECURESERVICE_DISAMBIGUATE_PROTECTED_PAGE = 246,
  SECURESERVICE_MAKE_PROTECTED_PAGE_WRITABLE = 247,
  SECURESERVICE_MAKE_PROTECTED_PAGE_EXECUTABLE = 248,
  SECURESERVICE_QUERY_STRONG_CODE_FEATURES = 249,
  SECURESERVICE_INVOKE_EFI_RUNTIME_SERVICE = 250,
  SECURESERVICE_LIVEDUMP_COLLECT_LIVE_DUMP = 251,
  SECURESERVICE_REGISTER_LOG_PAGES = 252,
  SECURESERVICE_RECLAIM_PARTITION_PAGES = 253,
  SECURESERVICE_BIND_NT_KERNEL_IMPORTS = 254,
  SECURESERVICE_SET_PLACEHOLDER_PAGES = 255,
  SECURESERVICE_QUERY_SPECULATION_CONTROL_FEATURES = 256,
  SECURESERVICE_PROTECT_KERNEL_DATA_PAGE = 257,
  SECURESERVICE_VERIFY_PAGE = 258,
  SECURESERVICE_PREPARE_FOR_HIBERNATION = 259,
  SECURESERVICE_PREPARE_FOR_CRASHDUMP = 260,
  SECURESERVICE_REPORT_BUGCHECK_PROGRESS = 261,
  SECURESERVICE_SHUTDOWN = 262,
  SECURESERVICE_QUERY_SECURE_PCI_INFO = 263,
  SECURESERVICE_ACCESS_PCI_DEVICE = 264,
  SECURESERVICE_REINITIALIZE_DEBUGGER_TRANSPORT = 265,
  SECURESERVICE_KSR_CALL = 266,
  SECURESERVICE_SVC_CALL = 267,
  SECURESERVICE_BUGCHECK = 1792,
  SECURESERVICE_LIMITED_MODE_SERVICE_START = 2048
};

// 0x4 (4) bytes
enum _KTIMER2_COLLECTION_INDEX {

  KTimer2CollectionNoWake = 0,
  KTimer2CollectionHr = 1,
  KTimer2CollectionPseudoHr = 2,
  KTimer2CollectionFinite = 3,
  KTimer2CollectionIr = 4,
  KTimer2CollectionNotInserted = 16,
  KTimer2CollectionInvalid = 21,
  KTimer2CollectionOptional = 32,
  KTimer2CollectionMin = 0,
  KTimer2CollectionMax = 5,
  KTimer2CollectionNode1 = 2
};

// 0x4 (4) bytes
enum _MI_WORKING_SET_TYPE {

  MiWorkingSetTypeSystemCache = 0,
  MiWorkingSetTypeSystemViews = 1,
  MiWorkingSetTypePartitionMaximum = 1,
  MiWorkingSetTypePagedPool = 2,
  MiWorkingSetTypePagableMaximum = 2,
  MiWorkingSetTypeSystemPtes = 3,
  MiWorkingSetTypeKernelStacks = 4,
  MiWorkingSetTypeNonPagedPool = 5,
  MiWorkingSetTypeMaximum = 6
};

// 0x4 (4) bytes
enum _KE_WAKE_SOURCE_TYPE {

  KeWakeSourceTypeSpuriousWake = 0,
  KeWakeSourceTypeSpuriousClock = 1,
  KeWakeSourceTypeSpuriousInterrupt = 2,
  KeWakeSourceTypeQueryFailure = 3,
  KeWakeSourceTypeAccountingFailure = 4,
  KeWakeSourceTypeStaticSourceMax = 4,
  KeWakeSourceTypeInterrupt = 5,
  KeWakeSourceTypeIRTimer = 6,
  KeWakeSourceTypeMax = 7
};

// 0x4 (4) bytes
enum _VRF_RULE_CLASS_ID {

  VrfSpecialPoolRuleClass = 0,
  VrfForceIrqlRuleClass = 1,
  VrfAllocationFailuresRuleClass = 2,
  VrfTrackingPoolAllocationsRuleClass = 3,
  VrfIORuleClass = 4,
  VrfDeadlockPreventionRuleClass = 5,
  VrfEnhancedIORuleClass = 6,
  VrfDMARuleClass = 7,
  VrfSecurityRuleClass = 8,
  VrfForcePendingIORequestRuleClass = 9,
  VrfIRPTrackingRuleClass = 10,
  VrfMiscellaneousRuleClass = 11,
  VrfMoreDebuggingRuleClass = 12,
  VrfMDLInvariantStackRuleClass = 13,
  VrfMDLInvariantDriverRuleClass = 14,
  VrfPowerDelayFuzzingRuleClass = 15,
  VrfPortMiniportRuleClass = 16,
  VrfStandardDDIRuleClass = 17,
  VrfAutoFailRuleClass = 18,
  VrfAdditionalDDIRuleClass = 19,
  VrfRuleClassBase = 20,
  VrfNdisWifiRuleClass = 21,
  VrfDriverLoggingRuleClass = 22,
  VrfSyncDelayFuzzingRuleClass = 23,
  VrfVMSwitchingRuleClass = 24,
  VrfCodeIntegrityRuleClass = 25,
  VrfBelow4GBAllocationRuleClass = 26,
  VrfProcessorBranchTraceRuleClass = 27,
  VrfAdvancedMMRuleClass = 28,
  VrfExtendingXDVTimeLimit = 29,
  VrfSystemBIOSRuleClass = 30,
  VrfHardwareRuleClass = 31,
  VrfStateSepRuleClass = 32,
  VrfWDFRuleClass = 33,
  VrfMoreIrqlRuleClass = 34,
  VrfXDVPlatformMode = 35,
  VrfStandalonePlatformMode = 36,
  VrfPlatformModeTest = 37,
  VrfInfoDisclosureIRPRule = 38,
  VrfLwSpecialPool = 39,
  VrfAVXCorruption = 40,
  VrfAccessModeMismatch = 41,
  ReservedForDVRF42 = 42,
  ReservedForDVRF43 = 43,
  ReservedForDVRF44 = 44,
  ReservedForDVRF45 = 45,
  ReservedForDVRF46 = 46,
  ReservedForDVRF47 = 47,
  ReservedForDVRF48 = 48,
  ReservedForDVRF49 = 49,
  ReservedForDVRF50 = 50,
  ReservedForDVRF51 = 51,
  ReservedForDVRF52 = 52,
  ReservedForDVRF53 = 53,
  ReservedForDVRF54 = 54,
  ReservedForDVRF55 = 55,
  ReservedForDVRF56 = 56,
  ReservedForDVRF57 = 57,
  ReservedForDVRF58 = 58,
  ReservedForDVRF59 = 59,
  ReservedForDVRF60 = 60,
  ReservedForDVRF61 = 61,
  ReservedForDVRF62 = 62,
  ReservedForDVRF63 = 63,
  VrfRuleClassSizeMax = 64
};

// 0x4 (4) bytes
enum _POWER_INFORMATION_LEVEL_INTERNAL_TTMTCAPI {

  PowerInformationInternalTtmFirst = 4096,
  PowerInternalTtmOpenTerminal = 4096,
  PowerInternalTtmCreateTerminal = 4097,
  PowerInternalTtmEvacuateDevices = 4098,
  PowerInternalTtmCreateTerminalEventQueue = 4099,
  PowerInternalTtmGetTerminalEvent = 4100,
  PowerInternalTtmSetDefaultDeviceAssignment = 4101,
  PowerInternalTtmAssignDevice = 4102,
  PowerInternalTtmSetDisplayState = 4103,
  PowerInternalTtmSetDisplayTimeouts = 4104,
  PowerInternalTtmSetDisplayPowerRequest = 4105,
  PowerInternalTtmSetInputWakeCapability = 4106,
  PowerInformationInternalTtmLast = 4106
};

// 0x4 (4) bytes
enum _MI_ENCLAVE_TYPE {

  MiEnclaveNone = 0,
  MiEnclaveHardware = 1,
  MiEnclaveVsm = 2,
  MiEnclaveMax = 3
};

// 0x4 (4) bytes
enum _ETW_PERFECT_HASH_FUNCTION_TYPE {

  ETW_PHF_EVENT_ID = 0,
  ETW_PHF_STACK_WALK = 1,
  ETW_PHF_MAX_COUNT = 2
};

// 0x4 (4) bytes
enum _KTHREAD_TAG {

  KThreadTagNone = 0,
  KThreadTagMediaBuffering = 1,
  KThreadTagDeadline = 2,
  KThreadTagMax = 3
};

// 0x4 (4) bytes
enum _KHETERO_RUNNING_TYPE {

  KHeteroShortRunning = 0,
  KHeteroLongRunning = 1,
  KHeteroRunningTypeMax = 2
};

// 0x4 (4) bytes
enum wil_FeatureStage {

  wil_FeatureStage_AlwaysDisabled = 0,
  wil_FeatureStage_DisabledByDefault = 1,
  wil_FeatureStage_EnabledByDefault = 2,
  wil_FeatureStage_AlwaysEnabled = 3
};

// 0x4 (4) bytes
enum _RTL_MEMORY_TYPE {

  MemoryTypePaged = 0,
  MemoryTypeNonPaged = 1,
  MemoryTypeLargePage = 2,
  MemoryTypeHugePage = 3,
  MemoryTypeMax = 4
};

// 0x4 (4) bytes
enum _PS_WAKE_REASON {

  PsWakeReasonUser = 0,
  PsWakeReasonExecutionRequired = 1,
  PsWakeReasonKernel = 2,
  PsWakeReasonInstrumentation = 3,
  PsWakeReasonPreserveProcess = 4,
  PsWakeReasonActivityReference = 5,
  PsWakeReasonWorkOnBehalf = 6,
  PsMaxWakeReasons = 7
};

// 0x4 (4) bytes
enum _MEMORY_PHYSICAL_CONTIGUITY_UNIT_STATE {

  MemoryNotContiguous = 0,
  MemoryAlignedAndContiguous = 1,
  MemoryNotResident = 2,
  MemoryNotEligibleToMakeContiguous = 3,
  MemoryContiguityStateMax = 4
};

// 0x4 (4) bytes
enum _PS_STD_HANDLE_STATE {

  PsNeverDuplicate = 0,
  PsRequestDuplicate = 1,
  PsAlwaysDuplicate = 2,
  PsMaxStdHandleStates = 3
};

// 0x4 (4) bytes
enum _POWER_INFORMATION_LEVEL_INTERNAL {

  PowerInternalAcpiInterfaceRegister = 0,
  PowerInternalS0LowPowerIdleInfo = 1,
  PowerInternalReapplyBrightnessSettings = 2,
  PowerInternalUserAbsencePrediction = 3,
  PowerInternalUserAbsencePredictionCapability = 4,
  PowerInternalPoProcessorLatencyHint = 5,
  PowerInternalStandbyNetworkRequest = 6,
  PowerInternalDirtyTransitionInformation = 7,
  PowerInternalSetBackgroundTaskState = 8,
  PowerInternalReservedDoNotUseEnum9 = 9,
  PowerInternalReservedDoNotUseEnum10 = 10,
  PowerInternalReservedDoNotUseEnum11 = 11,
  PowerInternalReservedDoNotUseEnum12 = 12,
  PowerInternalReservedDoNotUseEnum13 = 13,
  PowerInternalReservedDoNotUseEnum14 = 14,
  PowerInternalReservedDoNotUseEnum15 = 15,
  PowerInternalReservedDoNotUseEnum16 = 16,
  PowerInternalReservedDoNotUseEnum17 = 17,
  PowerInternalBootSessionStandbyActivationInformation = 18,
  PowerInternalSessionPowerState = 19,
  PowerInternalSessionTerminalInput = 20,
  PowerInternalSetWatchdog = 21,
  PowerInternalPhysicalPowerButtonPressInfoAtBoot = 22,
  PowerInternalExternalMonitorConnected = 23,
  PowerInternalHighPrecisionBrightnessSettings = 24,
  PowerInternalWinrtScreenToggle = 25,
  PowerInternalPpmQosDisable = 26,
  PowerInternalTransitionCheckpoint = 27,
  PowerInternalInputControllerState = 28,
  PowerInternalFirmwareResetReason = 29,
  PowerInternalPpmSchedulerQosSupport = 30,
  PowerInternalBootStatGet = 31,
  PowerInternalBootStatSet = 32,
  PowerInternalCallHasNotReturnedWatchdog = 33,
  PowerInternalBootStatCheckIntegrity = 34,
  PowerInternalBootStatRestoreDefaults = 35,
  PowerInternalHostEsStateUpdate = 36,
  PowerInternalGetPowerActionState = 37,
  PowerInternalBootStatUnlock = 38,
  PowerInternalWakeOnVoiceState = 39,
  PowerInternalDeepSleepBlock = 40,
  PowerInternalIsPoFxDevice = 41,
  PowerInternalPowerTransitionExtensionAtBoot = 42,
  PowerInternalProcessorBrandedFrequency = 43,
  PowerInternalTimeBrokerExpirationReason = 44,
  PowerInternalNotifyUserShutdownStatus = 45,
  PowerInternalPowerRequestTerminalCoreWindow = 46,
  PowerInternalProcessorIdleVeto = 47,
  PowerInternalPlatformIdleVeto = 48,
  PowerInternalIsLongPowerButtonBugcheckEnabled = 49,
  PowerInternalAutoChkCausedReboot = 50,
  PowerInternalSetWakeAlarmOverride = 51,
  PowerInternalDirectedFxAddTestDevice = 53,
  PowerInternalDirectedFxRemoveTestDevice = 54,
  PowerInternalDirectedFxSetMode = 56,
  PowerInternalRegisterPowerPlane = 57,
  PowerInternalSetDirectedDripsFlags = 58,
  PowerInternalClearDirectedDripsFlags = 59,
  PowerInternalRetrieveHiberFileResumeContext = 60,
  PowerInternalReadHiberFilePage = 61,
  PowerInternalLastBootSucceeded = 62,
  PowerInternalQuerySleepStudyHelperRoutineBlock = 63,
  PowerInternalDirectedDripsQueryCapabilities = 64,
  PowerInternalClearConstraints = 65,
  PowerInternalSoftParkVelocityEnabled = 66,
  PowerInternalQueryIntelPepCapabilities = 67,
  PowerInformationInternalMaximum = 68
};

// 0x4 (4) bytes
enum _BUGCHECK_RECOVERY_LOG_EVENT {

  RecoveryEventStart = 0,
  RecoveryEventPhase1Status = 1,
  RecoveryEventPhase2Status = 2,
  RecoveryEventMax = 3
};

// 0x4 (4) bytes
enum TlgIn_t {

  TlgInNULL = 0,
  TlgInUNICODESTRING = 1,
  TlgInANSISTRING = 2,
  TlgInINT8 = 3,
  TlgInUINT8 = 4,
  TlgInINT16 = 5,
  TlgInUINT16 = 6,
  TlgInINT32 = 7,
  TlgInUINT32 = 8,
  TlgInINT64 = 9,
  TlgInUINT64 = 10,
  TlgInFLOAT = 11,
  TlgInDOUBLE = 12,
  TlgInBOOL32 = 13,
  TlgInBINARY = 14,
  TlgInGUID = 15,
  _TlgInPOINTER_unsupported = 16,
  TlgInFILETIME = 17,
  TlgInSYSTEMTIME = 18,
  TlgInSID = 19,
  TlgInHEXINT32 = 20,
  TlgInHEXINT64 = 21,
  TlgInCOUNTEDSTRING = 22,
  TlgInCOUNTEDANSISTRING = 23,
  _TlgInSTRUCT = 24,
  TlgInCOUNTEDBINARY = 25,
  _TlgInMax = 26,
  TlgInINTPTR = 9,
  TlgInUINTPTR = 10,
  TlgInPOINTER = 21,
  TlgInLONG = 7,
  TlgInULONG = 8,
  TlgInHEXLONG = 20,
  _TlgInCcount = 32,
  TlgInVcount = 64,
  _TlgInChain = 128,
  _TlgInCustom = 96,
  _TlgInTypeMask = 31,
  _TlgInCountMask = 96,
  _TlgInFlagMask = 224
};

// 0x4 (4) bytes
enum PDC_RESOURCE {

  PdcResourceSystemForeground = 0,
  PdcResourceUniversalApplications = 1,
  PdcResourceWin32 = 2,
  PdcResourceNetwork = 3,
  PdcResourceSystemBackground = 4,
  PdcResourceMin = 0,
  PdcResourceMax = 4
};

// 0x4 (4) bytes
enum _POP_SLEEP_CHECKPOINT_STATUS {

  PopSleepCheckpointStatusDisabled = 0,
  PopSleepCheckpointStatusEnabledDueToDirtyShutdown = 1,
  PopSleepCheckpointStatusEnabledManually = 4,
  PopSleepCheckpointStatusEnabledExperiment = 4,
  PopSleepCheckpointStatusEnabledMax = 7,
  PopSleepCheckpointStatusFailedNotEfiSystem = 8,
  PopSleepCheckpointStatusFailedInsufficientSpace = 9,
  PopSleepCheckpointStatusFailedTooSlow = 10,
  PopSleepCheckpointStatusFailedOtherError = 15,
  PopSleepCheckpointStatusMax = 15
};

// 0x4 (4) bytes
enum _KOBJECTS {

  EventNotificationObject = 0,
  EventSynchronizationObject = 1,
  MutantObject = 2,
  ProcessObject = 3,
  QueueObject = 4,
  SemaphoreObject = 5,
  ThreadObject = 6,
  GateObject = 7,
  TimerNotificationObject = 8,
  TimerSynchronizationObject = 9,
  Spare2Object = 10,
  Spare3Object = 11,
  Spare4Object = 12,
  Spare5Object = 13,
  Spare6Object = 14,
  Spare7Object = 15,
  Spare8Object = 16,
  ProfileCallbackObject = 17,
  ApcObject = 18,
  DpcObject = 19,
  DeviceQueueObject = 20,
  PriQueueObject = 21,
  InterruptObject = 22,
  ProfileObject = 23,
  Timer2NotificationObject = 24,
  Timer2SynchronizationObject = 25,
  ThreadedDpcObject = 26,
  MaximumKernelObject = 27
};

// 0x4 (4) bytes
enum JOB_OBJECT_IO_RATE_CONTROL_FLAGS {

  JOB_OBJECT_IO_RATE_CONTROL_ENABLE = 1,
  JOB_OBJECT_IO_RATE_CONTROL_STANDALONE_VOLUME = 2,
  JOB_OBJECT_IO_RATE_CONTROL_FORCE_UNIT_ACCESS_ALL = 4,
  JOB_OBJECT_IO_RATE_CONTROL_FORCE_UNIT_ACCESS_ON_SOFT_CAP = 8,
  JOB_OBJECT_IO_RATE_CONTROL_VALID_FLAGS = 15
};

// 0x4 (4) bytes
enum _MI_MEMORY_EVENT_TYPES {

  LowPagedPoolEvent = 0,
  HighPagedPoolEvent = 1,
  LowNonPagedPoolEvent = 2,
  HighNonPagedPoolEvent = 3,
  LowAvailablePagesEvent = 4,
  HighAvailablePagesEvent = 5,
  LowCommitEvent = 6,
  HighCommitEvent = 7,
  MaximumCommitEvent = 8,
  BadMemoryDetectedEvent = 9,
  PhysicalMemoryChangeEvent = 10,
  TotalNumberOfMemoryEvents = 11
};

// 0x4 (4) bytes
enum PDC_CS_PHASE {

  PdcNoCsPhase = 0,
  PdcConnectionPhase = 1,
  PdcShellPhase = 2,
  PdcPlmPhase = 3,
  PdcMaintenancePhase = 4,
  PdcDamPhase = 5,
  PdcLowPowerPhase = 6,
  PdcResiliencyNotificationPhase = 7,
  PdcResiliencyPhase = 8,
  PdcInvalidPhase = 9,
  PdcMaxPhase = 9
};

// 0x4 (4) bytes
enum _POP_SLEEP_CHECKPOINT {

  PopSleepCheckpointInvalid = 0,
  PopSleepCheckpointPowerTransitionStart = 1,
  PopSleepCheckpointSuspendAppsBefore = 2,
  PopSleepCheckpointSuspendAppsAfter = 3,
  PopSleepCheckpointSuspendServicesBefore = 4,
  PopSleepCheckpointSuspendServicesAfter = 5,
  PopSleepCheckpointNotifySuperfetchBefore = 6,
  PopSleepCheckpointNotifySuperfetchAfter = 7,
  PopSleepCheckpointNotifyCallbacksBefore = 8,
  PopSleepCheckpointNotifyCallbacksAfter = 9,
  PopSleepCheckpointSleepTransactionCommitted = 10,
  PopSleepCheckpointQueryDriversBefore = 11,
  PopSleepCheckpointQueryDriversAfter = 12,
  PopSleepCheckpointAllocatingHiberContext = 13,
  PopSleepCheckpointSuspendDriversBefore = 14,
  PopSleepCheckpointPreSleepNotification = 16,
  PopSleepCheckpointInterruptsDisabledBegin = 17,
  PopSleepCheckpointInvokeHandlerBefore = 18,
  PopSleepCheckpointSaveHiberContextBegin = 19,
  PopSleepCheckpointInitializeDumpStackFailed = 20,
  PopSleepCheckpointHiberWriteFailed = 21,
  PopSleepCheckpointHiberFileTooSmall = 22,
  PopSleepCheckpointSaveHiberContextFailed = 23,
  PopSleepCheckpointSaveHiberContextEnd = 24,
  PopSleepCheckpointHiberKernelHandoff = 25,
  PopSleepCheckpointInvokeHandlerAfter = 26,
  PopSleepCheckpointReadHiberfileBefore = 27,
  PopSleepCheckpointInitializeDumpStackForReadFailed = 28,
  PopSleepCheckpointHiberReadFailed = 29,
  PopSleepCheckpointChecksumFailure = 30,
  PopSleepCheckpointDecompressionFailed = 31,
  PopSleepCheckpointReadHiberfileAfter = 32,
  PopSleepCheckpointInterruptsDisabledEnd = 33,
  PopSleepCheckpointWakeDriversAfter = 36,
  PopSleepCheckpointResumeAppsBefore = 37,
  PopSleepCheckpointResumeAppsAfter = 38,
  PopSleepCheckpointResumeServicesBefore = 39,
  PopSleepCheckpointResumeServicesAfter = 40,
  PopSleepCheckpointPowerTransitionEnd = 41,
  PopSleepCheckpointAllocatingHiberContextNoFileObject = 42,
  PopSleepCheckpointAllocatingHiberContextGetDumpStackFailed = 43,
  PopSleepCheckpointAllocatingHiberContextLoadResumeContextFailed = 44,
  PopSleepCheckpointAllocatingHiberContextBcdOpenFailed = 45,
  PopSleepCheckpointAllocatingHiberContextEstablishResumeObjectFailed = 46,
  PopSleepCheckpointAllocatingHiberContextSetPendingResumeFailed = 47,
  PopSleepCheckpointAllocatingHiberContextAllocateIoPagesPagesFailed = 48,
  PopSleepCheckpointAllocatingHiberContextAdapterBuffersInvalid1 = 49,
  PopSleepCheckpointAllocatingHiberContextAllocateDumpPagesFailed = 50,
  PopSleepCheckpointAllocatingHiberContextAdapterBuffersInvalid2 = 51,
  PopSleepCheckpointAllocatingHiberContextUnHibernatedMdlFailed = 52,
  PopSleepCheckpointAllocatingHiberContextSecureResourcesFailed = 53,
  PopSleepCheckpointPrepareSleepBefore = 54,
  PopSleepCheckpointPrepareSleepAfter = 55,
  PopSleepCheckpointBootstatAvailable = 56,
  PopSleepCheckpointMax = 57
};

// 0x4 (4) bytes
enum _MI_ALTERNATE_LOCK_VA_TYPE {

  AlternateLockVaTypeSystemPtes = 0,
  AlternateLockVaTypeNonPagedPool = 1,
  AlternateLockVaTypeUser = 2,
  AlternateLockVaTypeSystem = 3,
  AlternateLockVaTypeMaximum = 4
};

// 0x4 (4) bytes
enum _KWAIT_BLOCK_STATE {

  WaitBlockBypassStart = 0,
  WaitBlockBypassComplete = 1,
  WaitBlockSuspendBypassStart = 2,
  WaitBlockSuspendBypassComplete = 3,
  WaitBlockActive = 4,
  WaitBlockInactive = 5,
  WaitBlockSuspended = 6,
  WaitBlockAllStates = 7
};

// 0x4 (4) bytes
enum _DEVPROP_OPERATOR {

  DEVPROP_OPERATOR_MODIFIER_NOT = 65536,
  DEVPROP_OPERATOR_MODIFIER_IGNORE_CASE = 131072,
  DEVPROP_OPERATOR_NONE = 0,
  DEVPROP_OPERATOR_EXISTS = 1,
  DEVPROP_OPERATOR_NOT_EXISTS = 65537,
  DEVPROP_OPERATOR_EQUALS = 2,
  DEVPROP_OPERATOR_NOT_EQUALS = 65538,
  DEVPROP_OPERATOR_GREATER_THAN = 3,
  DEVPROP_OPERATOR_LESS_THAN = 4,
  DEVPROP_OPERATOR_GREATER_THAN_EQUALS = 5,
  DEVPROP_OPERATOR_LESS_THAN_EQUALS = 6,
  DEVPROP_OPERATOR_EQUALS_IGNORE_CASE = 131074,
  DEVPROP_OPERATOR_NOT_EQUALS_IGNORE_CASE = 196610,
  DEVPROP_OPERATOR_BITWISE_AND = 7,
  DEVPROP_OPERATOR_BITWISE_OR = 8,
  DEVPROP_OPERATOR_BEGINS_WITH = 9,
  DEVPROP_OPERATOR_ENDS_WITH = 10,
  DEVPROP_OPERATOR_CONTAINS = 11,
  DEVPROP_OPERATOR_BEGINS_WITH_IGNORE_CASE = 131081,
  DEVPROP_OPERATOR_ENDS_WITH_IGNORE_CASE = 131082,
  DEVPROP_OPERATOR_CONTAINS_IGNORE_CASE = 131083,
  DEVPROP_OPERATOR_LIST_CONTAINS = 4096,
  DEVPROP_OPERATOR_LIST_ELEMENT_BEGINS_WITH = 8192,
  DEVPROP_OPERATOR_LIST_ELEMENT_ENDS_WITH = 12288,
  DEVPROP_OPERATOR_LIST_ELEMENT_CONTAINS = 16384,
  DEVPROP_OPERATOR_LIST_CONTAINS_IGNORE_CASE = 135168,
  DEVPROP_OPERATOR_LIST_ELEMENT_BEGINS_WITH_IGNORE_CASE = 139264,
  DEVPROP_OPERATOR_LIST_ELEMENT_ENDS_WITH_IGNORE_CASE = 143360,
  DEVPROP_OPERATOR_LIST_ELEMENT_CONTAINS_IGNORE_CASE = 147456,
  DEVPROP_OPERATOR_AND_OPEN = 1048576,
  DEVPROP_OPERATOR_AND_CLOSE = 2097152,
  DEVPROP_OPERATOR_OR_OPEN = 3145728,
  DEVPROP_OPERATOR_OR_CLOSE = 4194304,
  DEVPROP_OPERATOR_NOT_OPEN = 5242880,
  DEVPROP_OPERATOR_NOT_CLOSE = 6291456,
  DEVPROP_OPERATOR_ARRAY_CONTAINS = 268435456,
  DEVPROP_OPERATOR_MASK_EVAL = 4095,
  DEVPROP_OPERATOR_MASK_LIST = 61440,
  DEVPROP_OPERATOR_MASK_MODIFIER = 983040,
  DEVPROP_OPERATOR_MASK_NOT_LOGICAL = -267386881,
  DEVPROP_OPERATOR_MASK_LOGICAL = 267386880,
  DEVPROP_OPERATOR_MASK_ARRAY = -268435456
};

// 0x4 (4) bytes
enum _RTLP_HP_MEMORY_TYPE {

  HeapMemoryPaged = 0,
  HeapMemoryNonPaged = 1,
  HeapMemoryLargePage = 2,
  HeapMemoryHugePage = 3,
  HeapMemoryTypeMax = 4
};

// 0x4 (4) bytes
enum _RTL_FEATURE_ENABLED_STATE_OPTIONS {

  FeatureEnabledStateOptionsNone = 0,
  FeatureEnabledStateOptionsWexpConfig = 1
};

// 0x4 (4) bytes
enum _EX_HEAP_TYPE {

  ExHeapTypeNonPagedMin = 0,
  ExHeapTypeNonPaged = 0,
  ExHeapTypeNonPagedMax = 1,
  ExHeapTypeNonPagedNx = 1,
  ExHeapTypePagedMin = 2,
  ExHeapTypePaged = 2,
  ExHeapTypePagedMax = 3,
  ExHeapTypeMmSt = 3,
  ExHeapTypeMax = 4,
  ExHeapTypeSpecialMax = 4
};

// 0x4 (4) bytes
enum FEATURE_CHANGE_TIME {

  FEATURE_CHANGE_TIME_READ = 0,
  FEATURE_CHANGE_TIME_MODULE_RELOAD = 1,
  FEATURE_CHANGE_TIME_SESSION = 2,
  FEATURE_CHANGE_TIME_REBOOT = 3,
  FEATURE_CHANGE_TIME_USER_FLAG = 128
};

// 0x4 (4) bytes
enum _POP_DIRECTED_DRIPS_PROBLEM_DEVICE_REASON {

  DirectedDripsProblemDeviceReasonSpecialDevice = 0,
  DirectedDripsProblemDeviceReasonNoDfx = 1,
  DirectedDripsProblemDeviceReasonNoPs4 = 2,
  DirectedDripsProblemDeviceReasonNoPs4Root = 3,
  DirectedDripsProblemDeviceReasonComponentContraint = 4,
  DirectedDripsProblemDeviceReasonDfxFailure = 5,
  DirectedDripsProblemDeviceReasonPagingDevice = 6,
  DirectedDripsProblemDeviceReasonDebuggingDevice = 7,
  DirectedDripsProblemDeviceReasonDfxNotAllowed = 8,
  DirectedDripsProblemDeviceReasonMax = 9
};

// 0x4 (4) bytes
enum _PROCESS_SECTION_TYPE {

  ProcessSectionData = 0,
  ProcessSectionImage = 1,
  ProcessSectionImageNx = 2,
  ProcessSectionPagefileBacked = 3,
  ProcessSectionMax = 4
};

// 0x4 (4) bytes
enum _FILE_OBJECT_EXTENSION_TYPE {

  FoExtTypeTransactionParams = 0,
  FoExtTypeInternal = 1,
  FoExtTypeIosbRange = 2,
  FoExtTypeGeneric = 3,
  FoExtTypeSfio = 4,
  FoExtTypeSymlink = 5,
  FoExtTypeOplockKey = 6,
  FoExtTypeSilo = 7,
  FoExtTypeMemoryPartitionInfo = 8,
  MaxFoExtTypes = 9
};

// 0x4 (4) bytes
enum _OBJECT_INFORMATION_CLASS {

  ObjectBasicInformation = 0,
  ObjectNameInformation = 1,
  ObjectTypeInformation = 2,
  ObjectTypesInformation = 3,
  ObjectHandleFlagInformation = 4,
  ObjectSessionInformation = 5,
  ObjectSessionObjectInformation = 6,
  MaxObjectInfoClass = 7
};

// 0x4 (4) bytes
enum _JOBOBJECTINFOCLASS {

  JobObjectBasicAccountingInformation = 1,
  JobObjectBasicLimitInformation = 2,
  JobObjectBasicProcessIdList = 3,
  JobObjectBasicUIRestrictions = 4,
  JobObjectSecurityLimitInformation = 5,
  JobObjectEndOfJobTimeInformation = 6,
  JobObjectAssociateCompletionPortInformation = 7,
  JobObjectBasicAndIoAccountingInformation = 8,
  JobObjectExtendedLimitInformation = 9,
  JobObjectJobSetInformation = 10,
  JobObjectGroupInformation = 11,
  JobObjectNotificationLimitInformation = 12,
  JobObjectLimitViolationInformation = 13,
  JobObjectGroupInformationEx = 14,
  JobObjectCpuRateControlInformation = 15,
  JobObjectCompletionFilter = 16,
  JobObjectCompletionCounter = 17,
  JobObjectFreezeInformation = 18,
  JobObjectExtendedAccountingInformation = 19,
  JobObjectWakeInformation = 20,
  JobObjectBackgroundInformation = 21,
  JobObjectSchedulingRankBiasInformation = 22,
  JobObjectTimerVirtualizationInformation = 23,
  JobObjectCycleTimeNotification = 24,
  JobObjectClearEvent = 25,
  JobObjectInterferenceInformation = 26,
  JobObjectClearPeakJobMemoryUsed = 27,
  JobObjectMemoryUsageInformation = 28,
  JobObjectSharedCommit = 29,
  JobObjectContainerId = 30,
  JobObjectIoRateControlInformation = 31,
  JobObjectSiloRootDirectory = 37,
  JobObjectServerSiloBasicInformation = 38,
  JobObjectServerSiloUserSharedData = 39,
  JobObjectServerSiloInitialize = 40,
  JobObjectServerSiloRunningState = 41,
  JobObjectIoAttribution = 42,
  JobObjectMemoryPartitionInformation = 43,
  JobObjectContainerTelemetryId = 44,
  JobObjectSiloSystemRoot = 45,
  JobObjectEnergyTrackingState = 46,
  JobObjectThreadImpersonationInformation = 47,
  JobObjectReserved1Information = 18,
  JobObjectReserved2Information = 19,
  JobObjectReserved3Information = 20,
  JobObjectReserved4Information = 21,
  JobObjectReserved5Information = 22,
  JobObjectReserved6Information = 23,
  JobObjectReserved7Information = 24,
  JobObjectReserved8Information = 25,
  JobObjectReserved9Information = 26,
  JobObjectReserved10Information = 27,
  JobObjectReserved11Information = 28,
  JobObjectReserved12Information = 29,
  JobObjectReserved13Information = 30,
  JobObjectReserved14Information = 31,
  JobObjectNetRateControlInformation = 32,
  JobObjectNotificationLimitInformation2 = 33,
  JobObjectLimitViolationInformation2 = 34,
  JobObjectCreateSilo = 35,
  JobObjectSiloBasicInformation = 36,
  JobObjectReserved15Information = 37,
  JobObjectReserved16Information = 38,
  JobObjectReserved17Information = 39,
  JobObjectReserved18Information = 40,
  JobObjectReserved19Information = 41,
  JobObjectReserved20Information = 42,
  JobObjectReserved21Information = 43,
  JobObjectReserved22Information = 44,
  JobObjectReserved23Information = 45,
  JobObjectReserved24Information = 46,
  JobObjectReserved25Information = 47,
  MaxJobObjectInfoClass = 48
};

// 0x4 (4) bytes
enum _IO_RATE_CONTROL_TYPE {

  IoRateControlTypeCapMin = 0,
  IoRateControlTypeIopsCap = 0,
  IoRateControlTypeBandwidthCap = 1,
  IoRateControlTypeTimePercentCap = 2,
  IoRateControlTypeCapMax = 2,
  IoRateControlTypeReservationMin = 3,
  IoRateControlTypeIopsReservation = 3,
  IoRateControlTypeBandwidthReservation = 4,
  IoRateControlTypeTimePercentReservation = 5,
  IoRateControlTypeReservationMax = 5,
  IoRateControlTypeCriticalReservationMin = 6,
  IoRateControlTypeIopsCriticalReservation = 6,
  IoRateControlTypeBandwidthCriticalReservation = 7,
  IoRateControlTypeTimePercentCriticalReservation = 8,
  IoRateControlTypeCriticalReservationMax = 8,
  IoRateControlTypeSoftCapMin = 9,
  IoRateControlTypeIopsSoftCap = 9,
  IoRateControlTypeBandwidthSoftCap = 10,
  IoRateControlTypeTimePercentSoftCap = 11,
  IoRateControlTypeSoftCapMax = 11,
  IoRateControlTypeLimitExcessNotifyMin = 12,
  IoRateControlTypeIopsLimitExcessNotify = 12,
  IoRateControlTypeBandwidthLimitExcessNotify = 13,
  IoRateControlTypeTimePercentLimitExcessNotify = 14,
  IoRateControlTypeLimitExcessNotifyMax = 14,
  IoRateControlTypeMax = 15
};

// 0x4 (4) bytes
enum _WNF_STATE_NAME_LIFETIME {

  WnfWellKnownStateName = 0,
  WnfPermanentStateName = 1,
  WnfPersistentStateName = 2,
  WnfTemporaryStateName = 3
};

// 0x4 (4) bytes
enum _TRANSFER_TYPE {

  ReadTransfer = 0,
  WriteTransfer = 1,
  OtherTransfer = 2
};

// 0x4 (4) bytes
enum _LOCK_OPERATION {

  IoReadAccess = 0,
  IoWriteAccess = 1,
  IoModifyAccess = 2
};

// 0x4 (4) bytes
enum _KWAIT_REASON {

  Executive = 0,
  FreePage = 1,
  PageIn = 2,
  PoolAllocation = 3,
  DelayExecution = 4,
  Suspended = 5,
  UserRequest = 6,
  WrExecutive = 7,
  WrFreePage = 8,
  WrPageIn = 9,
  WrPoolAllocation = 10,
  WrDelayExecution = 11,
  WrSuspended = 12,
  WrUserRequest = 13,
  WrSpare0 = 14,
  WrQueue = 15,
  WrLpcReceive = 16,
  WrLpcReply = 17,
  WrVirtualMemory = 18,
  WrPageOut = 19,
  WrRendezvous = 20,
  WrKeyedEvent = 21,
  WrTerminated = 22,
  WrProcessInSwap = 23,
  WrCpuRateControl = 24,
  WrCalloutStack = 25,
  WrKernel = 26,
  WrResource = 27,
  WrPushLock = 28,
  WrMutex = 29,
  WrQuantumEnd = 30,
  WrDispatchInt = 31,
  WrPreempted = 32,
  WrYieldExecution = 33,
  WrFastMutex = 34,
  WrGuardedMutex = 35,
  WrRundown = 36,
  WrAlertByThreadId = 37,
  WrDeferredPreempt = 38,
  WrPhysicalFault = 39,
  MaximumWaitReason = 40
};

// 0x4 (4) bytes
enum _RTLP_HP_ALLOCATOR {

  RtlpHpSegmentSm = 0,
  RtlpHpSegmentLg = 1,
  RtlpHpSegmentTypes = 2,
  RtlpHpHugeAllocator = 2,
  RtlpHpAllocatorMax = 3
};

// 0x4 (4) bytes
enum _HEAP_SEG_RANGE_TYPE {

  HeapSegRangeUser = 0,
  HeapSegRangeInternal = 1,
  HeapSegRangeLFH = 2,
  HeapSegRangeVS = 3,
  HeapSegRangeTypeMax = 3
};

// 0x4 (4) bytes
enum _HEAP_LFH_LOCKMODE {

  HeapLockNotHeld = 0,
  HeapLockShared = 1,
  HeapLockExclusive = 2
};

// 0x4 (4) bytes
enum RTLP_CSPARSE_BITMAP_STATE {

  CommitBitmapInvalid = 0,
  UserBitmapInvalid = 1,
  UserBitmapValid = 2
};

// 0x4 (4) bytes
enum _OPENCOUNT_REASON {

  OpenCount_SkipLogging = 0,
  OpenCount_AsyncRead = 1,
  OpenCount_FlushCache = 2,
  OpenCount_GetDirtyPage = 3,
  OpenCount_GetFlushedVDL = 4,
  OpenCount_InitCachemap1 = 5,
  OpenCount_InitCachemap2 = 6,
  OpenCount_InitCachemap3 = 7,
  OpenCount_InitCachemap4 = 8,
  OpenCount_InitCachemap5 = 9,
  OpenCount_MdlWrite = 10,
  OpenCount_MdlWriteAbort = 11,
  OpenCount_NotifyMappedWrite = 12,
  OpenCount_NotifyMappedWriteCompCallback = 13,
  OpenCount_PurgeCache = 14,
  OpenCount_PurgeCacheActiveViews = 15,
  OpenCount_ReadAhead = 16,
  OpenCount_SetFileSize = 17,
  OpenCount_SetFileSizeSection = 18,
  OpenCount_UninitCachemapReadAhead = 19,
  OpenCount_UninitCachemapReg = 20,
  OpenCount_UnmapInactiveViews = 21,
  OpenCount_UnmapInactiveViews1 = 22,
  OpenCount_UnmapInactiveViews2 = 23,
  OpenCount_UnmapInactiveViews3 = 24,
  OpenCount_WriteBehind = 25,
  OpenCount_WriteBehindComplete = 26,
  OpenCount_WriteBehindFailAcquire = 27
};

// 0x4 (4) bytes
enum _POWER_REQUEST_TYPE_INTERNAL {

  PowerRequestDisplayRequiredInternal = 0,
  PowerRequestSystemRequiredInternal = 1,
  PowerRequestAwayModeRequiredInternal = 2,
  PowerRequestExecutionRequiredInternal = 3,
  PowerRequestPerfBoostRequiredInternal = 4,
  PowerRequestActiveLockScreenInternal = 5,
  PowerRequestInternalInvalid = 6
};

// 0x4 (4) bytes
enum _POWER_REQUEST_TYPE {

  PowerRequestDisplayRequired = 0,
  PowerRequestSystemRequired = 1,
  PowerRequestAwayModeRequired = 2,
  PowerRequestExecutionRequired = 3
};

// 0x4 (4) bytes
enum _CMP_FAILURE_INJECTION_POINT {

  CmpFailurePointPoolAllocation = 0,
  CmpFailurePointViewMapping = 1,
  CmpFailurePointViewPinning = 2,
  CmpFailurePointResourceCharging = 3,
  CmpFailurePointFileWrite = 4,
  CmpFailurePointFileRead = 5,
  CmpFailurePointCacheFlush = 6,
  CmpFailurePointFlush = 7,
  CmpFailurePointFlushAndPurge = 8,
  CmpFailurePointForceLargeBin = 9,
  CmpFailurePointDontFixAlignment = 10,
  CmpFailurePointAllocateCell = 11,
  CmpFailurePointMarkDirty = 12,
  CmpFailurePointForceMultiLevelMap = 13,
  CmpFailurePointAllocateContiguousLogEntry = 14,
  CmpFailurePointAllocateKcb = 15,
  CmpFailurePointCreateKeyBody = 16,
  CmpFailurePointForceFreeKcb = 17,
  CmpFailurePointKcbLockUpgrade = 18,
  CmpFailurePointKcbLockUpgradeDelay = 19,
  CmpFailurePointKeyEnumResumeContextVerification = 20,
  CmpFailurePointKeyEnumForceRetry = 21,
  CmpFailurePointForceReorganization = 22,
  CmpFailurePointForceLazyCOWByPolicy = 23,
  CmpFailureInjectionPointCount = 24
};

// 0x4 (4) bytes
enum wil_UsageReportingMode {

  wil_UsageReportingMode_Default = 0,
  wil_UsageReportingMode_SuppressPotential = 1,
  wil_UsageReportingMode_SuppressImplicit = 2
};

// 0x4 (4) bytes
enum wil_details_ServiceReportingOptions {

  wil_details_ServiceReportingOptions_None = 0,
  wil_details_ServiceReportingOptions_VariantConfig = 1
};

// 0x4 (4) bytes
enum _RTL_FEATURE_CONFIGURATION_TYPE {

  RtlFeatureConfigurationBoot = 0,
  RtlFeatureConfigurationRuntime = 1,
  RtlFeatureConfigurationCount = 2
};

// 0x4 (4) bytes
enum wil_FeatureChangeTime {

  wil_FeatureChangeTime_OnRead = 0,
  wil_FeatureChangeTime_OnReload = 1,
  wil_FeatureChangeTime_OnSession = 2,
  wil_FeatureChangeTime_OnReboot = 3
};

// 0x4 (4) bytes
enum wil_details_StagingConfigFeatureFields {

  wil_details_StagingConfigFeatureFields_None = 0,
  wil_details_StagingConfigFeatureFields_ServiceState = 1,
  wil_details_StagingConfigFeatureFields_UserState = 2,
  wil_details_StagingConfigFeatureFields_TestState = 4,
  wil_details_StagingConfigFeatureFields_Variant = 8
};

// 0x4 (4) bytes
enum wil_FeatureEnabledStateKind {

  wil_FeatureEnabledStateKind_Service = 1,
  wil_FeatureEnabledStateKind_User = 2,
  wil_FeatureEnabledStateKind_Test = 3
};

// 0x4 (4) bytes
enum wil_FeatureEnabledStateOptions {

  wil_FeatureEnabledStateOptions_None = 0,
  wil_FeatureEnabledStateOptions_VariantConfig = 1
};

// 0x4 (4) bytes
enum wil_VariantReportingKind {

  wil_VariantReportingKind_None = 0,
  wil_VariantReportingKind_UniqueUsage = 1,
  wil_VariantReportingKind_DeviceUsage = 2
};

// 0x4 (4) bytes
enum wil_ReportingKind {

  wil_ReportingKind_None = 0,
  wil_ReportingKind_UniqueUsage = 1,
  wil_ReportingKind_UniqueOpportunity = 2,
  wil_ReportingKind_DeviceUsage = 3,
  wil_ReportingKind_DeviceOpportunity = 4,
  wil_ReportingKind_TotalDuration = 5,
  wil_ReportingKind_PausedDuration = 6
};

// 0x4 (4) bytes
enum wil_details_ServiceReportingKind {

  wil_details_ServiceReportingKind_UniqueUsage = 0,
  wil_details_ServiceReportingKind_UniqueOpportunity = 1,
  wil_details_ServiceReportingKind_DeviceUsage = 2,
  wil_details_ServiceReportingKind_DeviceOpportunity = 3,
  wil_details_ServiceReportingKind_PotentialUniqueUsage = 4,
  wil_details_ServiceReportingKind_PotentialUniqueOpportunity = 5,
  wil_details_ServiceReportingKind_PotentialDeviceUsage = 6,
  wil_details_ServiceReportingKind_PotentialDeviceOpportunity = 7,
  wil_details_ServiceReportingKind_EnabledTotalDuration = 8,
  wil_details_ServiceReportingKind_EnabledPausedDuration = 9,
  wil_details_ServiceReportingKind_DisabledTotalDuration = 10,
  wil_details_ServiceReportingKind_DisabledPausedDuration = 11,
  wil_details_ServiceReportingKind_CustomEnabledBase = 100,
  wil_details_ServiceReportingKind_CustomDisabledBase = 150,
  wil_details_ServiceReportingKind_Store = 254,
  wil_details_ServiceReportingKind_None = 255,
  wil_details_ServiceReportingKind_VariantDevicePotentialBase = 256,
  wil_details_ServiceReportingKind_VariantDeviceUsageBase = 320,
  wil_details_ServiceReportingKind_VariantUniquePotentialBase = 384,
  wil_details_ServiceReportingKind_VariantUniqueUsageBase = 448
};

// 0x4 (4) bytes
enum _EVENT_INFO_CLASS {

  EventProviderBinaryTrackInfo = 0,
  EventProviderSetReserved1 = 1,
  EventProviderSetTraits = 2,
  EventProviderUseDescriptorType = 3,
  MaxEventInfo = 4
};

// 0x4 (4) bytes
enum _PF_FILE_ACCESS_TYPE {

  PfFileAccessTypeRead = 0,
  PfFileAccessTypeWrite = 1,
  PfFileAccessTypeMax = 2
};

// 0x4 (4) bytes
enum _EX_GEN_RANDOM_DOMAIN {

  ExGenRandomDomainKernel = 0,
  ExGenRandomDomainFirst = 0,
  ExGenRandomDomainUserVisible = 1,
  ExGenRandomDomainMax = 2
};

// 0x4 (4) bytes
enum _PP_NPAGED_LOOKASIDE_NUMBER {

  LookasideSmallIrpList = 0,
  LookasideMediumIrpList = 1,
  LookasideLargeIrpList = 2,
  LookasideMdlList = 3,
  LookasideCreateInfoList = 4,
  LookasideNameBufferList = 5,
  LookasideTwilightList = 6,
  LookasideCompletionList = 7,
  LookasideScratchBufferList = 8,
  LookasideMaximumList = 9
};

// 0x4 (4) bytes
enum _PS_MITIGATION_OPTION {

  PS_MITIGATION_OPTION_NX = 0,
  PS_MITIGATION_OPTION_SEHOP = 1,
  PS_MITIGATION_OPTION_FORCE_RELOCATE_IMAGES = 2,
  PS_MITIGATION_OPTION_HEAP_TERMINATE = 3,
  PS_MITIGATION_OPTION_BOTTOM_UP_ASLR = 4,
  PS_MITIGATION_OPTION_HIGH_ENTROPY_ASLR = 5,
  PS_MITIGATION_OPTION_STRICT_HANDLE_CHECKS = 6,
  PS_MITIGATION_OPTION_WIN32K_SYSTEM_CALL_DISABLE = 7,
  PS_MITIGATION_OPTION_EXTENSION_POINT_DISABLE = 8,
  PS_MITIGATION_OPTION_PROHIBIT_DYNAMIC_CODE = 9,
  PS_MITIGATION_OPTION_CONTROL_FLOW_GUARD = 10,
  PS_MITIGATION_OPTION_BLOCK_NON_MICROSOFT_BINARIES = 11,
  PS_MITIGATION_OPTION_FONT_DISABLE = 12,
  PS_MITIGATION_OPTION_IMAGE_LOAD_NO_REMOTE = 13,
  PS_MITIGATION_OPTION_IMAGE_LOAD_NO_LOW_LABEL = 14,
  PS_MITIGATION_OPTION_IMAGE_LOAD_PREFER_SYSTEM32 = 15,
  PS_MITIGATION_OPTION_RETURN_FLOW_GUARD = 16,
  PS_MITIGATION_OPTION_LOADER_INTEGRITY_CONTINUITY = 17,
  PS_MITIGATION_OPTION_STRICT_CONTROL_FLOW_GUARD = 18,
  PS_MITIGATION_OPTION_RESTRICT_SET_THREAD_CONTEXT = 19,
  PS_MITIGATION_OPTION_ROP_STACKPIVOT = 20,
  PS_MITIGATION_OPTION_ROP_CALLER_CHECK = 21,
  PS_MITIGATION_OPTION_ROP_SIMEXEC = 22,
  PS_MITIGATION_OPTION_EXPORT_ADDRESS_FILTER = 23,
  PS_MITIGATION_OPTION_EXPORT_ADDRESS_FILTER_PLUS = 24,
  PS_MITIGATION_OPTION_RESTRICT_CHILD_PROCESS_CREATION = 25,
  PS_MITIGATION_OPTION_IMPORT_ADDRESS_FILTER = 26,
  PS_MITIGATION_OPTION_MODULE_TAMPERING_PROTECTION = 27,
  PS_MITIGATION_OPTION_RESTRICT_INDIRECT_BRANCH_PREDICTION = 28,
  PS_MITIGATION_OPTION_SPECULATIVE_STORE_BYPASS_DISABLE = 29,
  PS_MITIGATION_OPTION_ALLOW_DOWNGRADE_DYNAMIC_CODE_POLICY = 30,
  PS_MITIGATION_OPTION_CET_USER_SHADOW_STACKS = 31,
  PS_MITIGATION_OPTION_USER_CET_SET_CONTEXT_IP_VALIDATION = 32,
  PS_MITIGATION_OPTION_BLOCK_NON_CET_BINARIES = 33,
  PS_MITIGATION_OPTION_CET_DYNAMIC_APIS_OUT_OF_PROC_ONLY = 36
};

// 0x4 (4) bytes
enum SE_WS_APPX_SIGNATURE_ORIGIN {

  SE_WS_APPX_SIGNATURE_ORIGIN_NOT_VALIDATED = 0,
  SE_WS_APPX_SIGNATURE_ORIGIN_UNKNOWN = 1,
  SE_WS_APPX_SIGNATURE_ORIGIN_APPSTORE = 2,
  SE_WS_APPX_SIGNATURE_ORIGIN_WINDOWS = 3,
  SE_WS_APPX_SIGNATURE_ORIGIN_ENTERPRISE = 4
};

// 0x4 (4) bytes
enum _HAL_DMA_CRASH_DUMP_REGISTER_TYPE {

  HalDmaCrashDumpRegisterSet1 = 0,
  HalDmaCrashDumpRegisterSet2 = 1,
  HalDmaCrashDumpRegisterSetMax = 2
};

// 0x4 (4) bytes
enum _USER_ACTIVITY_PRESENCE {

  PowerUserPresent = 0,
  PowerUserNotPresent = 1,
  PowerUserInactive = 2,
  PowerUserMaximum = 3,
  PowerUserInvalid = 3
};

// 0x4 (4) bytes
enum _HAL_INIT_PHASE {

  HalInitPhaseBspProcEarly = 0,
  HalInitPhaseBspProcEarlyMmReady = 1,
  HalInitPhaseBspProcEarlyTimerReady = 2,
  HalInitPhaseBspProcEarlyEnd = 3,
  HalInitPhasePnProcEarly = 4,
  HalInitPhasePnProcEarlyInterruptsReady = 5,
  HalInitPhasePnProcEarlyEnd = 6,
  HalInitPhaseBspSystemEarly = 7,
  HalInitPhaseBspSystemEarlyAcpiReady = 8,
  HalInitPhaseBspSystemEarlyHalExtensionsReady = 9,
  HalInitPhaseBspSystemEarlyInterruptsAlmostReady = 10,
  HalInitPhaseBspSystemEarlyIommusReady = 11,
  HalInitPhaseBspSystemEarlyInterruptsReady = 12,
  HalInitPhaseBspSystemEarlyDmaReady = 12,
  HalInitPhaseBspSystemEarlyProcReady = 13,
  HalInitPhaseBspSystemEarlyHwPerfCntReady = 14,
  HalInitPhaseBspSystemEarlyAllocationDone = 15,
  HalInitPhaseBspSystemEarlyEnd = 16,
  HalInitPhaseBspSystemLate = 17,
  HalInitPhaseBspSystemLateEnd = 18,
  HalInitPhasePnSystemLate = 19,
  HalInitPhasePnSystemLateEnd = 20,
  HalInitPhaseAllProcStartComplete = 21,
  HalInitPhaseAllProcStartCompleteEnd = 22,
  HalInitPhaseExPhase1Ready = 23,
  HalInitPhaseExPhase1ReadyEnd = 24,
  HalInitPhaseAcpiPdoStarted = 25,
  HalInitPhaseAcpiPdoStartedEnd = 26,
  HalInitPhaseReportResources = 27,
  HalInitPhaseReportResourcesEnd = 28,
  HalInitPhaseReportCoreSystemResources = 29,
  HalInitPhaseReportCoreSystemResourcesEnd = 30,
  HalInitPhaseLateSystemActions = 31,
  HalInitPhaseLateSystemActionsTelemetryReady = 32,
  HalInitPhaseLateSystemActionsEnd = 33
};

// 0x4 (4) bytes
enum _INTERLOCKED_RESULT {

  ResultNegative = 1,
  ResultZero = 0,
  ResultPositive = 2
};

// 0x4 (4) bytes
enum _MEMORY_CACHING_TYPE_ORIG {

  MmFrameBufferCached = 2
};

// 0x4 (4) bytes
enum _MODE {

  KernelMode = 0,
  UserMode = 1,
  MaximumMode = 2
};

// 0x4 (4) bytes
enum _HALP_DMA_MAP_BUFFER_TYPE {

  HalpDmaContiguousMapBuffer = 0,
  HalpDmaNonContiguousMapBuffer = 1,
  HalpDmaMaximumMapBufferType = 2
};

// 0x4 (4) bytes
enum _REG_NOTIFY_CLASS {

  RegNtDeleteKey = 0,
  RegNtPreDeleteKey = 0,
  RegNtSetValueKey = 1,
  RegNtPreSetValueKey = 1,
  RegNtDeleteValueKey = 2,
  RegNtPreDeleteValueKey = 2,
  RegNtSetInformationKey = 3,
  RegNtPreSetInformationKey = 3,
  RegNtRenameKey = 4,
  RegNtPreRenameKey = 4,
  RegNtEnumerateKey = 5,
  RegNtPreEnumerateKey = 5,
  RegNtEnumerateValueKey = 6,
  RegNtPreEnumerateValueKey = 6,
  RegNtQueryKey = 7,
  RegNtPreQueryKey = 7,
  RegNtQueryValueKey = 8,
  RegNtPreQueryValueKey = 8,
  RegNtQueryMultipleValueKey = 9,
  RegNtPreQueryMultipleValueKey = 9,
  RegNtPreCreateKey = 10,
  RegNtPostCreateKey = 11,
  RegNtPreOpenKey = 12,
  RegNtPostOpenKey = 13,
  RegNtKeyHandleClose = 14,
  RegNtPreKeyHandleClose = 14,
  RegNtPostDeleteKey = 15,
  RegNtPostSetValueKey = 16,
  RegNtPostDeleteValueKey = 17,
  RegNtPostSetInformationKey = 18,
  RegNtPostRenameKey = 19,
  RegNtPostEnumerateKey = 20,
  RegNtPostEnumerateValueKey = 21,
  RegNtPostQueryKey = 22,
  RegNtPostQueryValueKey = 23,
  RegNtPostQueryMultipleValueKey = 24,
  RegNtPostKeyHandleClose = 25,
  RegNtPreCreateKeyEx = 26,
  RegNtPostCreateKeyEx = 27,
  RegNtPreOpenKeyEx = 28,
  RegNtPostOpenKeyEx = 29,
  RegNtPreFlushKey = 30,
  RegNtPostFlushKey = 31,
  RegNtPreLoadKey = 32,
  RegNtPostLoadKey = 33,
  RegNtPreUnLoadKey = 34,
  RegNtPostUnLoadKey = 35,
  RegNtPreQueryKeySecurity = 36,
  RegNtPostQueryKeySecurity = 37,
  RegNtPreSetKeySecurity = 38,
  RegNtPostSetKeySecurity = 39,
  RegNtCallbackObjectContextCleanup = 40,
  RegNtPreRestoreKey = 41,
  RegNtPostRestoreKey = 42,
  RegNtPreSaveKey = 43,
  RegNtPostSaveKey = 44,
  RegNtPreReplaceKey = 45,
  RegNtPostReplaceKey = 46,
  RegNtPreQueryKeyName = 47,
  RegNtPostQueryKeyName = 48,
  MaxRegNtNotifyClass = 49
};

// 0x4 (4) bytes
enum _DEVICE_WAKE_DEPTH {

  DeviceWakeDepthNotWakeable = 0,
  DeviceWakeDepthD0 = 1,
  DeviceWakeDepthD1 = 2,
  DeviceWakeDepthD2 = 3,
  DeviceWakeDepthD3hot = 4,
  DeviceWakeDepthD3cold = 5,
  DeviceWakeDepthMaximum = 6
};

// 0x4 (4) bytes
enum _DEVICE_POWER_STATE {

  PowerDeviceUnspecified = 0,
  PowerDeviceD0 = 1,
  PowerDeviceD1 = 2,
  PowerDeviceD2 = 3,
  PowerDeviceD3 = 4,
  PowerDeviceMaximum = 5
};

// 0x4 (4) bytes
enum _EVENT_TYPE {

  NotificationEvent = 0,
  SynchronizationEvent = 1
};

// 0x4 (4) bytes
enum _EX_POOL_PRIORITY {

  LowPoolPriority = 0,
  LowPoolPrioritySpecialPoolOverrun = 8,
  LowPoolPrioritySpecialPoolUnderrun = 9,
  NormalPoolPriority = 16,
  NormalPoolPrioritySpecialPoolOverrun = 24,
  NormalPoolPrioritySpecialPoolUnderrun = 25,
  HighPoolPriority = 32,
  HighPoolPrioritySpecialPoolOverrun = 40,
  HighPoolPrioritySpecialPoolUnderrun = 41
};

// 0x4 (4) bytes
enum _DMA_SPEED {

  Compatible = 0,
  TypeA = 1,
  TypeB = 2,
  TypeC = 3,
  TypeF = 4,
  MaximumDmaSpeed = 5
};

// 0x4 (4) bytes
enum _LDR_DDAG_STATE {

  LdrModulesMerged = -5,
  LdrModulesInitError = -4,
  LdrModulesSnapError = -3,
  LdrModulesUnloaded = -2,
  LdrModulesUnloading = -1,
  LdrModulesPlaceHolder = 0,
  LdrModulesMapping = 1,
  LdrModulesMapped = 2,
  LdrModulesWaitingForDependencies = 3,
  LdrModulesSnapping = 4,
  LdrModulesSnapped = 5,
  LdrModulesCondensed = 6,
  LdrModulesReadyToInit = 7,
  LdrModulesInitializing = 8,
  LdrModulesReadyToRun = 9
};

// 0x4 (4) bytes
enum _LDR_DLL_LOAD_REASON {

  LoadReasonStaticDependency = 0,
  LoadReasonStaticForwarderDependency = 1,
  LoadReasonDynamicForwarderDependency = 2,
  LoadReasonDelayloadDependency = 3,
  LoadReasonDynamicLoad = 4,
  LoadReasonAsImageLoad = 5,
  LoadReasonAsDataLoad = 6,
  LoadReasonEnclavePrimary = 7,
  LoadReasonEnclaveDependency = 8,
  LoadReasonUnknown = -1
};

// 0x4 (4) bytes
enum _KERNEL_STACK_LIMITS {

  BugcheckStackLimits = 0,
  DPCStackLimits = 1,
  ExpandedStackLimits = 2,
  NormalStackLimits = 3,
  Win32kStackLimits = 4,
  SwapBusyStackLimits = 5,
  IsrStackLimits = 6,
  DebuggerStackLimits = 7,
  NmiStackLimits = 8,
  MachineCheckStackLimits = 9,
  ExceptionStackLimits = 10,
  MaximumStackLimits = 11
};

// 0x4 (4) bytes
enum _DUMP_EVENTS {

  DUMP_EVENT_NONE = 0,
  DUMP_EVENT_HIBER_RESUME = 1,
  DUMP_EVENT_HIBER_RESUME_END = 2
};

// 0x4 (4) bytes
enum _POP_IO_STATUS {

  IoReady = 0,
  IoPending = 1,
  IoDone = 2
};

// 0x4 (4) bytes
enum _POP_POWER_ACTION_WATCHDOG_STATE {

  PopPowerActionWatchdogStateDisabled = 0,
  PopPowerActionWatchdogStateTransitioning = 1,
  PopPowerActionWatchdogStateResuming = 2,
  PopPowerActionWatchdogStateMax = 3
};

// 0x4 (4) bytes
enum SYSTEM_POWER_CONDITION {

  PoAc = 0,
  PoDc = 1,
  PoHot = 2,
  PoConditionMaximum = 3
};

// 0x4 (4) bytes
struct FEATURE_STATE_CHANGE_SUBSCRIPTION__ {
  LONG unused; // offset: 0x0 (0)
};

// 0x4 (4) bytes
enum _REQUESTER_TYPE {

  KernelRequester = 0,
  UserProcessRequester = 1,
  UserSharedServiceRequester = 2
};

// 0x4 (4) bytes
enum _ETW_NOTIFICATION_TYPE {

  EtwNotificationTypeNoReply = 1,
  EtwNotificationTypeLegacyEnable = 2,
  EtwNotificationTypeEnable = 3,
  EtwNotificationTypePrivateLogger = 4,
  EtwNotificationTypePerflib = 5,
  EtwNotificationTypeAudio = 6,
  EtwNotificationTypeSession = 7,
  EtwNotificationTypeReserved = 8,
  EtwNotificationTypeCredentialUI = 9,
  EtwNotificationTypeInProcSession = 10,
  EtwNotificationTypeFilteredPrivateLogger = 11,
  EtwNotificationTypeMax = 12
};

// 0x4 (4) bytes
enum _EXQUEUEINDEX {

  ExPoolUntrusted = 0,
  IoPoolUntrusted = 1,
  ExPoolMax = 8
};

// 0x4 (4) bytes
enum _PNP_DEVICE_ACTION_REQUEST {

  AssignResources = 0,
  ClearDeviceProblem = 1,
  ClearProblem = 2,
  ClearEjectProblem = 3,
  HaltDevice = 4,
  QueryPowerRelations = 5,
  Rebalance = 6,
  ReenumerateBootDevices = 7,
  ReenumerateDeviceOnly = 8,
  ReenumerateDeviceTree = 9,
  ReenumerateRootDevices = 10,
  RequeryDeviceState = 11,
  ResetDevice = 12,
  ResourceRequirementsChanged = 13,
  RestartEnumeration = 14,
  SetDeviceProblem = 15,
  StartDevice = 16,
  StartSystemDevicesPass0 = 17,
  StartSystemDevicesPass1 = 18,
  NotifyTransportRelationsChange = 19,
  NotifyEjectionRelationsChange = 20,
  ConfigureDevice = 21,
  ConfigureDeviceClass = 22,
  ConfigureDeviceExtensions = 23,
  ConfigureDeviceReset = 24,
  ClearDmaGuardProblem = 25,
  PnpDeviceActionRequestMax = 26
};

// 0x4 (4) bytes
enum POWER_POLICY_DEVICE_TYPE {

  PolicyDeviceSystemButton = 0,
  PolicyDeviceThermalZone = 1,
  PolicyDeviceBattery = 2,
  PolicyDeviceMemory = 3,
  PolicyInitiatePowerActionAPI = 4,
  PolicySetPowerStateAPI = 5,
  PolicyImmediateDozeS4 = 6,
  PolicySystemIdle = 7,
  PolicyDeviceWakeAlarm = 8,
  PolicyDeviceFan = 9,
  PolicyCsBatterySaver = 10,
  PolicyImmediateDozeS4Predicted = 11,
  PolicyImmediateDozeS4PredictedNoWake = 12,
  PolicyImmediateDozeS4AdaptiveBudget = 13,
  PolicyImmediateDozeS4AdaptiveReserveNoWake = 14,
  PolicySystemInitiatedShutdown = 15,
  PolicyDeviceMax = 16
};

// 0x4 (4) bytes
enum _ARBITER_RESULT {

  ArbiterResultUndefined = -1,
  ArbiterResultSuccess = 0,
  ArbiterResultExternalConflict = 1,
  ArbiterResultNullRequest = 2
};

// 0x4 (4) bytes
enum _ARBITER_ACTION {

  ArbiterActionTestAllocation = 0,
  ArbiterActionRetestAllocation = 1,
  ArbiterActionCommitAllocation = 2,
  ArbiterActionRollbackAllocation = 3,
  ArbiterActionQueryAllocatedResources = 4,
  ArbiterActionWriteReservedResources = 5,
  ArbiterActionQueryConflict = 6,
  ArbiterActionQueryArbitrate = 7,
  ArbiterActionAddReserved = 8,
  ArbiterActionBootAllocation = 9
};

// 0x4 (4) bytes
enum _MI_PFN_CACHE_ATTRIBUTE {

  MiNonCached = 0,
  MiCached = 1,
  MiWriteCombined = 2,
  MiNotMapped = 3
};

// 0x4 (4) bytes
enum _BOOT_ENTROPY_SOURCE_RESULT_CODE {

  BootEntropySourceStructureUninitialized = 0,
  BootEntropySourceDisabledByPolicy = 1,
  BootEntropySourceNotPresent = 2,
  BootEntropySourceError = 3,
  BootEntropySourceSuccess = 4
};

// 0x4 (4) bytes
enum _BOOT_ENTROPY_SOURCE_ID {

  BootEntropySourceNone = 0,
  BootEntropySourceSeedfile = 1,
  BootEntropySourceExternal = 2,
  BootEntropySourceTpm = 3,
  BootEntropySourceRdrand = 4,
  BootEntropySourceTime = 5,
  BootEntropySourceAcpiOem0 = 6,
  BootEntropySourceUefi = 7,
  BootEntropySourceCng = 8,
  BootEntropySourceTcbTpm = 9,
  BootEntropySourceTcbRdrand = 10,
  BootMaxEntropySources = 10
};

// 0x4 (4) bytes
enum _DOMAIN_CONFIGURATION_ARCH {

  DomainConfigurationArm64 = 0,
  DomainConfigurationInvalid = 1
};

// 0x4 (4) bytes
enum _CONFIGURATION_TYPE {

  ArcSystem = 0,
  CentralProcessor = 1,
  FloatingPointProcessor = 2,
  PrimaryIcache = 3,
  PrimaryDcache = 4,
  SecondaryIcache = 5,
  SecondaryDcache = 6,
  SecondaryCache = 7,
  EisaAdapter = 8,
  TcAdapter = 9,
  ScsiAdapter = 10,
  DtiAdapter = 11,
  MultiFunctionAdapter = 12,
  DiskController = 13,
  TapeController = 14,
  CdromController = 15,
  WormController = 16,
  SerialController = 17,
  NetworkController = 18,
  DisplayController = 19,
  ParallelController = 20,
  PointerController = 21,
  KeyboardController = 22,
  AudioController = 23,
  OtherController = 24,
  DiskPeripheral = 25,
  FloppyDiskPeripheral = 26,
  TapePeripheral = 27,
  ModemPeripheral = 28,
  MonitorPeripheral = 29,
  PrinterPeripheral = 30,
  PointerPeripheral = 31,
  KeyboardPeripheral = 32,
  TerminalPeripheral = 33,
  OtherPeripheral = 34,
  LinePeripheral = 35,
  NetworkPeripheral = 36,
  SystemMemory = 37,
  DockingInformation = 38,
  RealModeIrqRoutingTable = 39,
  RealModePCIEnumeration = 40,
  MaximumType = 41
};

// 0x4 (4) bytes
enum _CONFIGURATION_CLASS {

  SystemClass = 0,
  ProcessorClass = 1,
  CacheClass = 2,
  AdapterClass = 3,
  ControllerClass = 4,
  PeripheralClass = 5,
  MemoryClass = 6,
  MaximumClass = 7
};

// 0x4 (4) bytes
enum _FAULT_INFORMATION_ARM64_TYPE {

  UnsupportedUpstreamTransaction = 0,
  AddressSizeFault = 1,
  TlbMatchConflict = 2,
  ExternalFault = 3,
  PermissionFault = 4,
  AccessFlagFault = 5,
  TranslationFault = 6,
  MaxFaultType = 7
};

// 0x4 (4) bytes
enum HAL_APIC_DESTINATION_MODE {

  ApicDestinationModePhysical = 1,
  ApicDestinationModeLogicalFlat = 2,
  ApicDestinationModeLogicalClustered = 3,
  ApicDestinationModeUnknown = 4
};

// 0x4 (4) bytes
enum _FAULT_INFORMATION_ARCH {

  FaultInformationInvalid = 0,
  FaultInformationArm64 = 1,
  FaultInformationX64 = 2
};

// 0x4 (4) bytes
enum KD_CALLBACK_ACTION {

  KdConfigureDeviceAndContinue = 0,
  KdSkipDeviceAndContinue = 1,
  KdConfigureDeviceAndStop = 2,
  KdSkipDeviceAndStop = 3
};

// 0x4 (4) bytes
enum _PCI_BUSMASTER_RID_TYPE {

  BusmasterRidInvalid = 0,
  BusmasterRidFromDeviceRid = 1,
  BusmasterRidFromBridgeRid = 2,
  BusmasterRidFromMultipleBridges = 3
};

// 0x4 (4) bytes
enum INTERRUPT_CONNECTION_TYPE {

  InterruptTypeControllerInput = 0,
  InterruptTypeXapicMessage = 1,
  InterruptTypeHypertransport = 2,
  InterruptTypeMessageRequest = 3
};

// 0x4 (4) bytes
enum KD_NAMESPACE_ENUM {

  KdNameSpacePCI = 0,
  KdNameSpaceACPI = 1,
  KdNameSpaceAny = 2,
  KdNameSpaceNone = 3,
  KdNameSpaceMax = 4
};

// 0x4 (4) bytes
enum _HAL_PROCESSOR_STAT_TYPE {

  HalProcessorStatResidency = 0,
  HalProcessorStatCount = 1,
  HalProcessorStatMax = 2
};

// 0x4 (4) bytes
enum _HAL_CLOCK_TIMER_MODE {

  HalClockTimerModePeriodic = 0,
  HalClockTimerModeOneShot = 1,
  HalClockTimerModeMax = 2
};

// 0x4 (4) bytes
enum _BUS_DATA_TYPE {

  ConfigurationSpaceUndefined = -1,
  Cmos = 0,
  EisaConfiguration = 1,
  Pos = 2,
  CbusConfiguration = 3,
  PCIConfiguration = 4,
  VMEConfiguration = 5,
  NuBusConfiguration = 6,
  PCMCIAConfiguration = 7,
  MPIConfiguration = 8,
  MPSAConfiguration = 9,
  PNPISAConfiguration = 10,
  SgiInternalConfiguration = 11,
  MaximumBusDataType = 12
};

// 0x4 (4) bytes
enum _TYPE_OF_MEMORY {

  LoaderExceptionBlock = 0,
  LoaderSystemBlock = 1,
  LoaderFree = 2,
  LoaderBad = 3,
  LoaderLoadedProgram = 4,
  LoaderFirmwareTemporary = 5,
  LoaderFirmwarePermanent = 6,
  LoaderOsloaderHeap = 7,
  LoaderOsloaderStack = 8,
  LoaderSystemCode = 9,
  LoaderHalCode = 10,
  LoaderBootDriver = 11,
  LoaderConsoleInDriver = 12,
  LoaderConsoleOutDriver = 13,
  LoaderStartupDpcStack = 14,
  LoaderStartupKernelStack = 15,
  LoaderStartupPanicStack = 16,
  LoaderStartupPcrPage = 17,
  LoaderStartupPdrPage = 18,
  LoaderRegistryData = 19,
  LoaderMemoryData = 20,
  LoaderNlsData = 21,
  LoaderSpecialMemory = 22,
  LoaderBBTMemory = 23,
  LoaderZero = 24,
  LoaderXIPRom = 25,
  LoaderHALCachedMemory = 26,
  LoaderLargePageFiller = 27,
  LoaderErrorLogMemory = 28,
  LoaderVsmMemory = 29,
  LoaderFirmwareCode = 30,
  LoaderFirmwareData = 31,
  LoaderFirmwareReserved = 32,
  LoaderEnclaveMemory = 33,
  LoaderFirmwareKsr = 34,
  LoaderEnclaveKsr = 35,
  LoaderSkMemory = 36,
  LoaderSkFirmwareReserved = 37,
  LoaderIoSpaceMemoryZeroed = 38,
  LoaderIoSpaceMemoryFree = 39,
  LoaderIoSpaceMemoryKsr = 40,
  LoaderMaximum = 41
};

// 0x4 (4) bytes
enum _VI_DEADLOCK_RESOURCE_TYPE {

  VfDeadlockUnknown = 0,
  VfDeadlockMutex = 1,
  VfDeadlockMutexAbandoned = 2,
  VfDeadlockFastMutex = 3,
  VfDeadlockFastMutexUnsafe = 4,
  VfDeadlockSpinLock = 5,
  VfDeadlockInStackQueuedSpinLock = 6,
  VfDeadlockUnusedSpinLock = 7,
  VfDeadlockEresource = 8,
  VfDeadlockTypeMaximum = 9
};

// 0x4 (4) bytes
enum _WNF_SUBSCRIPTION_STATE {

  WNF_SUB_STATE_QUIESCENT = 0,
  WNF_SUB_STATE_READY_TO_DELIVER = 1,
  WNF_SUB_STATE_IN_DELIVERY = 2,
  WNF_SUB_STATE_RETRY = 3
};

// 0x4 (4) bytes
enum _SEP_CACHED_HANDLES_ENTRY_TYPE {

  SepCachedHandlesEntryLowbox = 0,
  SepCachedHandlesEntryBnoIsolation = 1
};

// 0x4 (4) bytes
enum _CREATE_FILE_TYPE {

  CreateFileTypeNone = 0,
  CreateFileTypeNamedPipe = 1,
  CreateFileTypeMailslot = 2
};

// 0x4 (4) bytes
enum _IOP_PRIORITY_HINT {

  IopIoPriorityNotSet = 0,
  IopIoPriorityVeryLow = 1,
  IopIoPriorityLow = 2,
  IopIoPriorityNormal = 3,
  IopIoPriorityHigh = 4,
  IopIoPriorityCritical = 5,
  MaxIopIoPriorityTypes = 6
};

// 0x4 (4) bytes
enum _SECURITY_OPERATION_CODE {

  SetSecurityDescriptor = 0,
  QuerySecurityDescriptor = 1,
  DeleteSecurityDescriptor = 2,
  AssignSecurityDescriptor = 3
};

// 0x4 (4) bytes
enum _OB_OPEN_REASON {

  ObCreateHandle = 0,
  ObOpenHandle = 1,
  ObDuplicateHandle = 2,
  ObInheritHandle = 3,
  ObMaxOpenReason = 4
};

// 0x4 (4) bytes
enum _BLOB_ID {

  BLOB_TYPE_UNKNOWN = 0,
  BLOB_TYPE_CONNECTION_INFO = 1,
  BLOB_TYPE_MESSAGE = 2,
  BLOB_TYPE_SECURITY_CONTEXT = 3,
  BLOB_TYPE_SECTION = 4,
  BLOB_TYPE_REGION = 5,
  BLOB_TYPE_VIEW = 6,
  BLOB_TYPE_RESERVE = 7,
  BLOB_TYPE_DIRECT_TRANSFER = 8,
  BLOB_TYPE_HANDLE_DATA = 9,
  BLOB_TYPE_MAX_ID = 10
};

// 0x4 (4) bytes
enum _RTLP_HP_LOCK_TYPE {

  HeapLockPaged = 0,
  HeapLockNonPaged = 1,
  HeapLockTypeMax = 2
};

// 0x4 (4) bytes
enum _HEAP_FAILURE_TYPE {

  heap_failure_internal = 0,
  heap_failure_unknown = 1,
  heap_failure_generic = 2,
  heap_failure_entry_corruption = 3,
  heap_failure_multiple_entries_corruption = 4,
  heap_failure_virtual_block_corruption = 5,
  heap_failure_buffer_overrun = 6,
  heap_failure_buffer_underrun = 7,
  heap_failure_block_not_busy = 8,
  heap_failure_invalid_argument = 9,
  heap_failure_invalid_allocation_type = 10,
  heap_failure_usage_after_free = 11,
  heap_failure_cross_heap_operation = 12,
  heap_failure_freelists_corruption = 13,
  heap_failure_listentry_corruption = 14,
  heap_failure_lfh_bitmap_mismatch = 15,
  heap_failure_segment_lfh_bitmap_corruption = 16,
  heap_failure_segment_lfh_double_free = 17,
  heap_failure_vs_subsegment_corruption = 18,
  heap_failure_null_heap = 19,
  heap_failure_allocation_limit = 20,
  heap_failure_commit_limit = 21,
  heap_failure_invalid_va_mgr_query = 22
};

// 0x4 (4) bytes
enum _RTLP_HP_ADDRESS_SPACE_TYPE {

  HeapAddressUser = 0,
  HeapAddressKernel = 1,
  HeapAddressSession = 2,
  HeapAddressSecureKernel = 3,
  HeapAddressTypeMax = 4
};

// 0x4 (4) bytes
enum _KHETERO_CPU_POLICY {

  KHeteroCpuPolicyAll = 0,
  KHeteroCpuPolicyLarge = 1,
  KHeteroCpuPolicyLargeOrIdle = 2,
  KHeteroCpuPolicySmall = 3,
  KHeteroCpuPolicySmallOrIdle = 4,
  KHeteroCpuPolicyDynamic = 5,
  KHeteroCpuPolicyStaticMax = 5,
  KHeteroCpuPolicyBiasedSmall = 6,
  KHeteroCpuPolicyBiasedLarge = 7,
  KHeteroCpuPolicyDefault = 8,
  KHeteroCpuPolicyMax = 9
};

// 0x4 (4) bytes
enum _GPIO_PIN_IORESTRICTION_TYPE {

  IoRestrictionNone = 0,
  IoRestrictionInputOnly = 1,
  IoRestrictionOutputOnly = 2,
  IoRestrictionNoneAndPreserve = 3
};

// 0x4 (4) bytes
enum _GPIO_PIN_CONFIG_TYPE {

  PullDefault = 0,
  PullUp = 1,
  PullDown = 2,
  PullNone = 3
};

// 0x4 (4) bytes
enum _PEP_ACPI_RESOURCE_TYPE {

  PepAcpiMemory = 0,
  PepAcpiIoPort = 1,
  PepAcpiInterrupt = 2,
  PepAcpiGpioIo = 3,
  PepAcpiGpioInt = 4,
  PepAcpiSpbI2c = 5,
  PepAcpiSpbSpi = 6,
  PepAcpiSpbUart = 7,
  PepAcpiExtendedMemory = 8,
  PepAcpiExtendedIo = 9
};

// 0x4 (4) bytes
enum _ARBITER_REQUEST_SOURCE {

  ArbiterRequestUndefined = -1,
  ArbiterRequestLegacyReported = 0,
  ArbiterRequestHalReported = 1,
  ArbiterRequestLegacyAssigned = 2,
  ArbiterRequestPnpDetected = 3,
  ArbiterRequestPnpEnumerated = 4
};

// 0x4 (4) bytes
enum _PCW_CALLBACK_TYPE {

  PcwCallbackAddCounter = 0,
  PcwCallbackRemoveCounter = 1,
  PcwCallbackEnumerateInstances = 2,
  PcwCallbackCollectData = 3
};

// 0x4 (4) bytes
enum _CM_LOAD_FAILURE_TYPE {

  _None = 0,
  _CmpCreateHive = 1,
  _HvpBuildMap = 3,
  _HvpBuildMapForLoaderHive = 4,
  _HvpInitMap = 5,
  _HvLoadHive = 6,
  _HvpMapHiveImage = 7,
  _HvpRecoverData = 8,
  _CmpValidateHiveSecurityDescriptors = 9,
  _HvpEnlistBinInMap = 10,
  _CmCheckRegistry = 11,
  _CmRegistryIO = 12,
  _CmCheckRegistry2 = 13,
  _CmpCheckKey = 14,
  _CmpCheckValueList = 15,
  _HvCheckHive = 16,
  _HvCheckBin = 17,
  _HvpGetLogEntryDirtyVector = 18,
  _HvpReadLogEntryHeader = 19,
  _HvpReadLogEntry = 20,
  _CmpMountPreloadedHives = 21,
  _CmpLoadHiveThread = 22,
  _CmpCheckLeaf = 23,
  _HvHiveStartFileBacked = 24,
  _HvStartHiveMemoryBacked = 25,
  _HvpEnlistFreeCells = 26,
  _HvpPerformLogFileRecovery = 27,
  _CmpInitHiveFromFile = 28,
  _CmpLoadKeyCommon = 29,
  _CmpLinkHiveToMaster = 30,
  _CmLoadKey = 31,
  _CmLoadAppKey = 32,
  _CmpResolveHiveLoadConflict = 33
};

// 0x4 (4) bytes
enum _RTL_GENERIC_COMPARE_RESULTS {

  GenericLessThan = 0,
  GenericGreaterThan = 1,
  GenericEqual = 2
};

// 0x4 (4) bytes
enum _CM_DIRTY_VECTOR_OPERATION {

  DirtyVectorModified = 0,
  DirtyDataCaptureStart = 1,
  DirtyDataCaptureEnd = 2
};

// 0x4 (4) bytes
enum KTM_STATE {

  KKtmUninitialized = 0,
  KKtmInitialized = 1,
  KKtmRecovering = 2,
  KKtmOnline = 3,
  KKtmRecoveryFailed = 4,
  KKtmOffline = 5
};

// 0x4 (4) bytes
enum _KTRANSACTION_OUTCOME {

  KTxOutcomeUninitialized = 0,
  KTxOutcomeUndetermined = 1,
  KTxOutcomeCommitted = 2,
  KTxOutcomeAborted = 3,
  KTxOutcomeUnavailable = 4
};

// 0x4 (4) bytes
enum _KTRANSACTION_STATE {

  KTransactionUninitialized = 0,
  KTransactionActive = 1,
  KTransactionPreparing = 2,
  KTransactionPrepared = 3,
  KTransactionInDoubt = 4,
  KTransactionCommitted = 5,
  KTransactionAborted = 6,
  KTransactionDelegated = 7,
  KTransactionPrePreparing = 8,
  KTransactionForgotten = 9,
  KTransactionRecovering = 10,
  KTransactionPrePrepared = 11
};

// 0x4 (4) bytes
enum _KRESOURCEMANAGER_STATE {

  KResourceManagerUninitialized = 0,
  KResourceManagerOffline = 1,
  KResourceManagerOnline = 2
};

// 0x4 (4) bytes
enum HSTORAGE_TYPE {

  Stable = 0,
  Volatile = 1,
  InvalidStorage = 2
};

// 0x4 (4) bytes
enum UoWActionType {

  UoWAddThisKey = 0,
  UoWAddChildKey = 1,
  UoWDeleteThisKey = 2,
  UoWDeleteChildKey = 3,
  UoWSetValueNew = 4,
  UoWSetValueExisting = 5,
  UoWDeleteValue = 6,
  UoWSetKeyUserFlags = 7,
  UoWSetLastWriteTime = 8,
  UoWSetSecurityDescriptor = 9,
  UoWRenameSubKey = 10,
  UoWRenameOldSubKey = 11,
  UoWRenameNewSubKey = 12,
  UoWIsolation = 13,
  UoWInvalid = 14
};

// 0x4 (4) bytes
enum _KENLISTMENT_STATE {

  KEnlistmentUninitialized = 0,
  KEnlistmentActive = 256,
  KEnlistmentPreparing = 257,
  KEnlistmentPrepared = 258,
  KEnlistmentInDoubt = 259,
  KEnlistmentCommitted = 260,
  KEnlistmentCommittedNotify = 261,
  KEnlistmentCommitRequested = 262,
  KEnlistmentAborted = 263,
  KEnlistmentDelegated = 264,
  KEnlistmentDelegatedDisconnected = 265,
  KEnlistmentPrePreparing = 266,
  KEnlistmentForgotten = 267,
  KEnlistmentRecovering = 268,
  KEnlistmentAborting = 269,
  KEnlistmentReadOnly = 270,
  KEnlistmentOutcomeUnavailable = 271,
  KEnlistmentOffline = 272,
  KEnlistmentPrePrepared = 273,
  KEnlistmentInitialized = 274
};

// 0x4 (4) bytes
enum _MI_SLAB_ALLOCATOR_PROTECTION {

  MiSlabAllocatorProtectionReadExecute = 0,
  MiSlabAllocatorProtectionReadOnly = 1,
  MiSlabAllocatorProtectionNoAccess = 2,
  MiSlabAllocatorProtectionReadWrite = 3,
  MiSlabAllocatorProtectionMax = 4
};

// 0x4 (4) bytes
enum _MI_SLAB_ALLOCATOR_TYPE {

  MiSlabAllocatorTypeSlatProtected = 0,
  MiSlabAllocatorTypeUnprotected = 1,
  MiSlabAllocatorTypeMax = 2
};

// 0x4 (4) bytes
enum _MI_WRITE_TYPES {

  WriteTypeCached = 0,
  WriteTypeNonTemporal = 1,
  WriteTypeMaximum = 2
};

// 0x4 (4) bytes
enum _MMLISTS {

  ZeroedPageList = 0,
  FreePageList = 1,
  StandbyPageList = 2,
  ModifiedPageList = 3,
  ModifiedNoWritePageList = 4,
  BadPageList = 5,
  ActiveAndValid = 6,
  TransitionPage = 7
};

// 0x4 (4) bytes
enum wil_details_FeatureTestStateKind {

  wil_details_FeatureTestStateKind_EnabledState = 0,
  wil_details_FeatureTestStateKind_Variant = 1
};

// 0x4 (4) bytes
enum wil_FeatureVariantPayloadKind {

  wil_FeatureVariantPayloadKind_None = 0,
  wil_FeatureVariantPayloadKind_Resident = 1,
  wil_FeatureVariantPayloadKind_External = 2
};

// 0x4 (4) bytes
enum wil_FeatureEnabledState {

  wil_FeatureEnabledState_Default = 0,
  wil_FeatureEnabledState_Disabled = 1,
  wil_FeatureEnabledState_Enabled = 2
};

// 0x4 (4) bytes
enum wil_FeatureStore {

  wil_FeatureStore_Machine = 0,
  wil_FeatureStore_User = 1,
  wil_FeatureStore_All = 2
};

// 0x18 (24) bytes
struct wil_details_RecordUsageResult {
  LONG queueBackground;                                // offset: 0x0 (0)
  ULONG countImmediate;                                // offset: 0x4 (4)
  enum wil_details_ServiceReportingKind kindImmediate; // offset: 0x8 (8)
  ULONG payloadId;                                     // offset: 0xc (12)
  LONG ignoredUse;                                     // offset: 0x10 (16)
  LONG isVariantConfiguration;                         // offset: 0x14 (20)
};

// 0x4 (4) bytes
enum _MM_PAGE_ACCESS_TYPE {

  MmPteAccessType = 0,
  MmCcReadAheadType = 1,
  MmPfnRepurposeType = 2,
  MmMaximumPageAccessType = 3
};

// 0x4 (4) bytes
enum _IO_PRIORITY_HINT {

  IoPriorityVeryLow = 0,
  IoPriorityLow = 1,
  IoPriorityNormal = 2,
  IoPriorityHigh = 3,
  IoPriorityCritical = 4,
  MaxIoPriorityTypes = 5
};

// 0x4 (4) bytes
enum _TP_CALLBACK_PRIORITY {

  TP_CALLBACK_PRIORITY_HIGH = 0,
  TP_CALLBACK_PRIORITY_NORMAL = 1,
  TP_CALLBACK_PRIORITY_LOW = 2,
  TP_CALLBACK_PRIORITY_INVALID = 3,
  TP_CALLBACK_PRIORITY_COUNT = 3
};

// 0x4 (4) bytes
enum _ALTERNATIVE_ARCHITECTURE_TYPE {

  StandardDesign = 0,
  NEC98x86 = 1,
  EndAlternatives = 2
};

// 0x4 (4) bytes
enum _WHEA_RECOVERY_CONTEXT_ERROR_TYPE {

  WheaRecoveryContextErrorTypeMemory = 1,
  WheaRecoveryContextErrorTypePmem = 2,
  WheaRecoveryContextErrorTypeMax = 3
};

// 0x4 (4) bytes
enum DMA_COMPLETION_STATUS {

  DmaComplete = 0,
  DmaAborted = 1,
  DmaError = 2,
  DmaCancelled = 3
};

// 0x4 (4) bytes
enum _MEMORY_CACHING_TYPE {

  MmNonCached = 0,
  MmCached = 1,
  MmWriteCombined = 2,
  MmHardwareCoherentCached = 3,
  MmNonCachedUnordered = 4,
  MmUSWCCached = 5,
  MmMaximumCacheType = 6,
  MmNotMapped = -1
};

// 0x4 (4) bytes
enum _DMA_INTERRUPT_TYPE {

  InterruptTypeCompletion = 0,
  InterruptTypeError = 1,
  InterruptTypeCancelled = 2
};

// 0x4 (4) bytes
enum _EXT_IOMMU_DEVICE_TYPE {

  EXT_IOMMU_DEVICE_TYPE_INVALID = 0,
  EXT_IOMMU_DEVICE_TYPE_PCI = 1,
  EXT_IOMMU_DEVICE_TYPE_ACPI = 2,
  EXT_IOMMU_DEVICE_TYPE_IOAPIC = 3,
  EXT_IOMMU_DEVICE_TYPE_LOGICAL = 4,
  EXT_IOMMU_DEVICE_TYPE_GIC = 5,
  EXT_IOMMU_DEVICE_TYPE_TEST = 6,
  EXT_IOMMU_DEVICE_TYPE_MAX = 7
};

// 0x4 (4) bytes
enum _HALP_EMERGENCY_LA_QUEUE_TYPE {

  HalpDmaLegacyLaQueueEntry = 0,
  HalpDmaThinLaQueueEntry = 1,
  HalpDmaLaQueueEntryMax = 2
};

// 0x4 (4) bytes
enum _HALP_DMA_ADAPTER_ALLOCATION_STATE {

  HalpDmaAdapterAllocationStateNone = 0,
  HalpDmaAdapterAllocateChannel = 1,
  HalpDmaAdapterAllocateMapRegisters = 2,
  HalpDmaAdapterAllocateChannelRemapResources = 3,
  HalpDmaAdapterAllocationStateComplete = 4,
  HalpDmaAdapterAllocationStateMax = 5
};

// 0x4 (4) bytes
enum _EXT_IOMMU_TRANSLATION_TYPE {

  ExtTranslationTypePassThrough = 0,
  ExtTranslationTypeBlocked = 1,
  ExtTranslationTypeTranslate = 2,
  ExtTranslationTypeSafePassThrough = 3,
  ExtTranslationTypeInvalid = 4
};

// 0x4 (4) bytes
enum _DMA_WIDTH {

  Width8Bits = 0,
  Width16Bits = 1,
  Width32Bits = 2,
  Width64Bits = 3,
  WidthNoWrap = 4,
  MaximumDmaWidth = 5
};

// 0x4 (4) bytes
enum _WHEA_CPU_VENDOR {

  WheaCpuVendorOther = 0,
  WheaCpuVendorIntel = 1,
  WheaCpuVendorAmd = 2
};

// 0x4 (4) bytes
enum _INTERRUPT_TARGET_TYPE {

  InterruptTargetInvalid = 0,
  InterruptTargetAllIncludingSelf = 1,
  InterruptTargetAllExcludingSelf = 2,
  InterruptTargetSelfOnly = 3,
  InterruptTargetPhysical = 4,
  InterruptTargetLogicalFlat = 5,
  InterruptTargetLogicalClustered = 6,
  InterruptTargetRemapIndex = 7,
  InterruptTargetHypervisor = 8
};

// 0x4 (4) bytes
enum _INTERRUPT_RESULT {

  InterruptBeginFatalError = 0,
  InterruptBeginLine = 1,
  InterruptBeginSpurious = 2,
  InterruptBeginVector = 3,
  InterruptBeginNone = 4
};

// 0x4 (4) bytes
enum _INTERRUPT_PROBLEM {

  InterruptProblemNone = 0,
  InterruptProblemMadtParsingFailure = 1,
  InterruptProblemNoControllersFound = 2,
  InterruptProblemFailedDiscovery = 3,
  InterruptProblemInitializeLocalUnitFailed = 4,
  InterruptProblemInitializeIoUnitFailed = 5,
  InterruptProblemSetLogicalIdFailed = 6,
  InterruptProblemSetLineStateFailed = 7,
  InterruptProblemGenerateMessageFailed = 8,
  InterruptProblemConvertIdFailed = 9,
  InterruptProblemCmciSetupFailed = 10,
  InterruptProblemQueryMaxProcessorsCalledTooEarly = 11,
  InterruptProblemProcessorReset = 12,
  InterruptProblemStartProcessorFailed = 13,
  InterruptProblemProcessorNotAlive = 14,
  InterruptProblemLowerIrqlViolation = 15,
  InterruptProblemInvalidIrql = 16,
  InterruptProblemNoSuchController = 17,
  InterruptProblemNoSuchLines = 18,
  InterruptProblemBadConnectionData = 19,
  InterruptProblemBadRoutingData = 20,
  InterruptProblemInvalidProcessor = 21,
  InterruptProblemFailedToAttainTarget = 22,
  InterruptProblemUnsupportedWiringConfiguration = 23,
  InterruptProblemSpareAlreadyStarted = 24,
  InterruptProblemClusterNotFullyReplaced = 25,
  InterruptProblemNewClusterAlreadyActive = 26,
  InterruptProblemNewClusterTooLarge = 27,
  InterruptProblemCannotHardwareQuiesce = 28,
  InterruptProblemIpiDestinationUpdateFailed = 29,
  InterruptProblemNoMemory = 30,
  InterruptProblemNoIrtEntries = 31,
  InterruptProblemConnectionDataBaitAndSwitch = 32,
  InterruptProblemInvalidLogicalFlatId = 33,
  InterruptProblemDeinitializeLocalUnitFailed = 34,
  InterruptProblemDeinitializeIoUnitFailed = 35,
  InterruptProblemMismatchedThermalLvtIsr = 36,
  InterruptProblemHvRetargetFailed = 37,
  InterruptProblemDeferredErrorSetupFailed = 38
};

// 0x4 (4) bytes
enum _KNOWN_CONTROLLER_TYPE {

  InterruptControllerInvalid = 0,
  InterruptControllerPic = 1,
  InterruptControllerApic = 2,
  InterruptControllerGic = 3,
  InterruptControllerGicV3 = 4,
  InterruptControllerGicV4 = 5,
  InterruptControllerBcm = 6,
  InterruptControllerUnknown = 4096
};

// 0x4 (4) bytes
enum _KINTERRUPT_MODE {

  LevelSensitive = 0,
  Latched = 1
};

// 0x4 (4) bytes
enum _KINTERRUPT_POLARITY {

  InterruptPolarityUnknown = 0,
  InterruptActiveHigh = 1,
  InterruptRisingEdge = 1,
  InterruptActiveLow = 2,
  InterruptFallingEdge = 2,
  InterruptActiveBoth = 3,
  InterruptActiveBothTriggerLow = 3,
  InterruptActiveBothTriggerHigh = 4
};

// 0x4 (4) bytes
enum _WHEA_ERROR_PACKET_DATA_FORMAT {

  WheaDataFormatIPFSalRecord = 0,
  WheaDataFormatXPFMCA = 1,
  WheaDataFormatMemory = 2,
  WheaDataFormatPCIExpress = 3,
  WheaDataFormatNMIPort = 4,
  WheaDataFormatPCIXBus = 5,
  WheaDataFormatPCIXDevice = 6,
  WheaDataFormatGeneric = 7,
  WheaDataFormatMax = 8
};

// 0x4 (4) bytes
enum _WHEA_ERROR_SEVERITY {

  WheaErrSevRecoverable = 0,
  WheaErrSevFatal = 1,
  WheaErrSevCorrected = 2,
  WheaErrSevInformational = 3
};

// 0x4 (4) bytes
enum _WHEA_ERROR_TYPE {

  WheaErrTypeProcessor = 0,
  WheaErrTypeMemory = 1,
  WheaErrTypePCIExpress = 2,
  WheaErrTypeNMI = 3,
  WheaErrTypePCIXBus = 4,
  WheaErrTypePCIXDevice = 5,
  WheaErrTypeGeneric = 6,
  WheaErrTypePmem = 7
};

// 0x4 (4) bytes
enum _WHEA_EVENT_LOG_ENTRY_ID {

  WheaEventLogEntryIdCmcPollingTimeout = -2147483647,
  WheaEventLogEntryIdWheaInit = -2147483646,
  WheaEventLogEntryIdCmcSwitchToPolling = -2147483645,
  WheaEventLogEntryIdDroppedCorrectedError = -2147483644,
  WheaEventLogEntryIdStartedReportHwError = -2147483643,
  WheaEventLogEntryIdPFAMemoryOfflined = -2147483642,
  WheaEventLogEntryIdPFAMemoryRemoveMonitor = -2147483641,
  WheaEventLogEntryIdPFAMemoryPolicy = -2147483640,
  WheaEventLogEntryIdPshedInjectError = -2147483639,
  WheaEventLogEntryIdOscCapabilities = -2147483638,
  WheaEventLogEntryIdPshedPluginRegister = -2147483637,
  WheaEventLogEntryIdAddRemoveErrorSource = -2147483636,
  WheaEventLogEntryIdWorkQueueItem = -2147483635,
  WheaEventLogEntryIdAttemptErrorRecovery = -2147483634,
  WheaEventLogEntryIdMcaFoundErrorInBank = -2147483633,
  WheaEventLogEntryIdMcaStuckErrorCheck = -2147483632,
  WheaEventLogEntryIdMcaErrorCleared = -2147483631,
  WheaEventLogEntryIdClearedPoison = -2147483630,
  WheaEventLogEntryIdProcessEINJ = -2147483629,
  WheaEventLogEntryIdProcessHEST = -2147483628,
  WheaEventLogEntryIdCreateGenericRecord = -2147483627,
  WheaEventLogEntryIdErrorRecord = -2147483626,
  WheaEventLogEntryIdErrorRecordLimit = -2147483625,
  WheaEventLogEntryIdErrSrcArrayInvalid = -2147483623,
  WheaEventLogEntryIdAcpiTimeOut = -2147483622,
  WheaEventLogCmciRestart = -2147483621,
  WheaEventLogCmciFinalRestart = -2147483620,
  WheaEventLogEntryEtwOverFlow = -2147483619,
  WheaEventLogAzccRootBusSearchErr = -2147483618,
  WheaEventLogAzccRootBusList = -2147483617,
  WheaEventLogEntryIdErrSrcInvalid = -2147483616,
  WheaEventLogEntryIdGenericErrMemMap = -2147483615,
  WheaEventLogEntryIdPshedCallbackCollision = -2147483614,
  WheaEventLogEntryIdSELBugCheckProgress = -2147483613,
  WheaEventLogEntryIdPshedPluginLoad = -2147483612,
  WheaEventLogEntryIdPshedPluginUnload = -2147483611,
  WheaEventLogEntryIdPshedPluginSupported = -2147483610,
  WheaEventLogEntryIdDeviceDriver = -2147483609,
  WheaEventLogEntryIdCmciImplPresent = -2147483608,
  WheaEventLogEntryIdCmciInitError = -2147483607,
  WheaEventLogEntryIdSELBugCheckRecovery = -2147483606,
  WheaEventLogEntryIdDrvErrSrcInvalid = -2147483605,
  WheaEventLogEntryIdDrvHandleBusy = -2147483604,
  WheaEventLogEntryIdWheaHeartbeat = -2147483603,
  WheaEventLogAzccRootBusPoisonSet = -2147483602,
  WheaEventLogEntryIdSELBugCheckInfo = -2147483601,
  WheaEventLogEntryIdErrDimmInfoMismatch = -2147483600,
  WheaEventLogEntryIdeDpcEnabled = -2147483599
};

// 0x4 (4) bytes
enum _WHEA_EVENT_LOG_ENTRY_TYPE {

  WheaEventLogEntryTypeInformational = 0,
  WheaEventLogEntryTypeWarning = 1,
  WheaEventLogEntryTypeError = 2
};

// 0x4 (4) bytes
enum _WHEA_ERROR_SOURCE_STATE {

  WheaErrSrcStateStopped = 1,
  WheaErrSrcStateStarted = 2,
  WheaErrSrcStateRemoved = 3,
  WheaErrSrcStateRemovePending = 4
};

// 0x4 (4) bytes
enum _WHEA_ERROR_SOURCE_TYPE {

  WheaErrSrcTypeMCE = 0,
  WheaErrSrcTypeCMC = 1,
  WheaErrSrcTypeCPE = 2,
  WheaErrSrcTypeNMI = 3,
  WheaErrSrcTypePCIe = 4,
  WheaErrSrcTypeGeneric = 5,
  WheaErrSrcTypeINIT = 6,
  WheaErrSrcTypeBOOT = 7,
  WheaErrSrcTypeSCIGeneric = 8,
  WheaErrSrcTypeIPFMCA = 9,
  WheaErrSrcTypeIPFCMC = 10,
  WheaErrSrcTypeIPFCPE = 11,
  WheaErrSrcTypeGenericV2 = 12,
  WheaErrSrcTypeSCIGenericV2 = 13,
  WheaErrSrcTypeBMC = 14,
  WheaErrSrcTypePMEM = 15,
  WheaErrSrcTypeDeviceDriver = 16,
  WheaErrSrcTypeMax = 17
};

// 0x4 (4) bytes
enum _EXCEPTION_DISPOSITION {

  ExceptionContinueExecution = 0,
  ExceptionContinueSearch = 1,
  ExceptionNestedException = 2,
  ExceptionCollidedUnwind = 3
};

// 0x4 (4) bytes
enum _DEVICE_RELATION_LEVEL {

  RELATION_LEVEL_REMOVE_EJECT = 0,
  RELATION_LEVEL_DEPENDENT = 1,
  RELATION_LEVEL_DIRECT_DESCENDANT = 2
};

// 0x4 (4) bytes
enum _PO_FX_PERF_STATE_TYPE {

  PoFxPerfStateTypeDiscrete = 0,
  PoFxPerfStateTypeRange = 1,
  PoFxPerfStateTypeMaximum = 2
};

// 0x4 (4) bytes
enum _PO_FX_PERF_STATE_UNIT {

  PoFxPerfStateUnitOther = 0,
  PoFxPerfStateUnitFrequency = 1,
  PoFxPerfStateUnitBandwidth = 2,
  PoFxPerfStateUnitMaximum = 3
};

// 0x4 (4) bytes
enum _IRQ_PRIORITY {

  IrqPriorityUndefined = 0,
  IrqPriorityLow = 1,
  IrqPriorityNormal = 2,
  IrqPriorityHigh = 3
};

// 0x4 (4) bytes
enum _FS_FILTER_SECTION_SYNC_TYPE {

  SyncTypeOther = 0,
  SyncTypeCreateSection = 1
};

// 0x4 (4) bytes
enum PROFILE_DEPARTURE_STYLE {

  PDS_UPDATE_DEFAULT = 1,
  PDS_UPDATE_ON_REMOVE = 2,
  PDS_UPDATE_ON_INTERFACE = 3,
  PDS_UPDATE_ON_EJECT = 4
};

// 0x4 (4) bytes
enum _PNP_WATCHDOG_TYPE {

  PNP_EVENT_WORKER_WATCHDOG = 1,
  PNP_DEVICE_COMPLETION_QUEUE_WATCHDOG = 2,
  PNP_DELAYED_REMOVE_WORKER_WATCHDOG = 3,
  PNP_ADD_DEVICE_WATCHDOG = 4,
  PNP_DRIVER_ENTRY_WATCHDOG = 5
};

// 0x4 (4) bytes
enum _PLUGPLAY_EVENT_CATEGORY {

  HardwareProfileChangeEvent = 0,
  TargetDeviceChangeEvent = 1,
  DeviceClassChangeEvent = 2,
  CustomDeviceEvent = 3,
  DeviceInstallEvent = 4,
  DeviceArrivalEvent = 5,
  VetoEvent = 6,
  BlockedDriverEvent = 7,
  InvalidIDEvent = 8,
  DevicePropertyChangeEvent = 9,
  DeviceInstanceRemovalEvent = 10,
  DeviceInstanceStartedEvent = 11,
  MaxPlugEventCategory = 12
};

// 0x4 (4) bytes
enum _PNP_VETO_TYPE {

  PNP_VetoTypeUnknown = 0,
  PNP_VetoLegacyDevice = 1,
  PNP_VetoPendingClose = 2,
  PNP_VetoWindowsApp = 3,
  PNP_VetoWindowsService = 4,
  PNP_VetoOutstandingOpen = 5,
  PNP_VetoDevice = 6,
  PNP_VetoDriver = 7,
  PNP_VetoIllegalDeviceRequest = 8,
  PNP_VetoInsufficientPower = 9,
  PNP_VetoNonDisableable = 10,
  PNP_VetoLegacyDriver = 11,
  PNP_VetoInsufficientRights = 12,
  PNP_VetoAlreadyRemoved = 13
};

// 0x4 (4) bytes
struct POHANDLE__ {
  LONG unused; // offset: 0x0 (0)
};

// 0x4 (4) bytes
enum _PNP_DEVNODE_QUERY_REBALANCE_VETO_REASON {

  DeviceQueryRebalanceSucceeded = 0,
  DeviceQueryStopFailed = 1,
  DeviceFailedGetNewResourceRequirement = 2,
  DeviceInUnexpectedState = 3,
  DeviceNotSupportQueryRebalance = 4
};

// 0x4 (4) bytes
enum _PNP_REBALANCE_FAILURE {

  RebalanceFailureNone = 0,
  RebalanceFailureDisabled = 1,
  RebalanceFailureNoMemory = 2,
  RebalanceFailureQueryStopUnexpectedVeto = 3,
  RebalanceFailureNoRequirements = 4,
  RebalanceFailureNoCandidates = 5,
  RebalanceFailureNoConfiguration = 6
};

// 0x4 (4) bytes
enum _PNP_REBALANCE_REASON {

  RebalanceReasonUnknown = 0,
  RebalanceReasonRequirementsChanged = 1,
  RebalanceReasonNewDevice = 2
};

// 0x4 (4) bytes
enum _KPROFILE_SOURCE {

  ProfileTime = 0,
  ProfileAlignmentFixup = 1,
  ProfileTotalIssues = 2,
  ProfilePipelineDry = 3,
  ProfileLoadInstructions = 4,
  ProfilePipelineFrozen = 5,
  ProfileBranchInstructions = 6,
  ProfileTotalNonissues = 7,
  ProfileDcacheMisses = 8,
  ProfileIcacheMisses = 9,
  ProfileCacheMisses = 10,
  ProfileBranchMispredictions = 11,
  ProfileStoreInstructions = 12,
  ProfileFpInstructions = 13,
  ProfileIntegerInstructions = 14,
  Profile2Issue = 15,
  Profile3Issue = 16,
  Profile4Issue = 17,
  ProfileSpecialInstructions = 18,
  ProfileTotalCycles = 19,
  ProfileIcacheIssues = 20,
  ProfileDcacheAccesses = 21,
  ProfileMemoryBarrierCycles = 22,
  ProfileLoadLinkedIssues = 23,
  ProfileMaximum = 24
};

// 0x4 (4) bytes
enum POWER_ACTION {

  PowerActionNone = 0,
  PowerActionReserved = 1,
  PowerActionSleep = 2,
  PowerActionHibernate = 3,
  PowerActionShutdown = 4,
  PowerActionShutdownReset = 5,
  PowerActionShutdownOff = 6,
  PowerActionWarmEject = 7,
  PowerActionDisplayOff = 8
};

// 0x4 (4) bytes
enum _DEVICE_USAGE_NOTIFICATION_TYPE {

  DeviceUsageTypeUndefined = 0,
  DeviceUsageTypePaging = 1,
  DeviceUsageTypeHibernation = 2,
  DeviceUsageTypeDumpFile = 3,
  DeviceUsageTypeBoot = 4,
  DeviceUsageTypePostDisplay = 5,
  DeviceUsageTypeGuestAssigned = 6
};

// 0x4 (4) bytes
enum DEVICE_TEXT_TYPE {

  DeviceTextDescription = 0,
  DeviceTextLocationInformation = 1
};

// 0x4 (4) bytes
enum BUS_QUERY_ID_TYPE {

  BusQueryDeviceID = 0,
  BusQueryHardwareIDs = 1,
  BusQueryCompatibleIDs = 2,
  BusQueryInstanceID = 3,
  BusQueryDeviceSerialNumber = 4,
  BusQueryContainerID = 5
};

// 0x4 (4) bytes
enum _DEVICE_RELATION_TYPE {

  BusRelations = 0,
  EjectionRelations = 1,
  PowerRelations = 2,
  RemovalRelations = 3,
  TargetDeviceRelation = 4,
  SingleBusRelations = 5,
  TransportRelations = 6
};

// 0x4 (4) bytes
enum _FSINFOCLASS {

  FileFsVolumeInformation = 1,
  FileFsLabelInformation = 2,
  FileFsSizeInformation = 3,
  FileFsDeviceInformation = 4,
  FileFsAttributeInformation = 5,
  FileFsControlInformation = 6,
  FileFsFullSizeInformation = 7,
  FileFsObjectIdInformation = 8,
  FileFsDriverPathInformation = 9,
  FileFsVolumeFlagsInformation = 10,
  FileFsSectorSizeInformation = 11,
  FileFsDataCopyInformation = 12,
  FileFsMetadataSizeInformation = 13,
  FileFsFullSizeInformationEx = 14,
  FileFsMaximumInformation = 15
};

// 0x4 (4) bytes
enum _DIRECTORY_NOTIFY_INFORMATION_CLASS {

  DirectoryNotifyInformation = 1,
  DirectoryNotifyExtendedInformation = 2
};

// 0x4 (4) bytes
enum _FILE_INFORMATION_CLASS {

  FileDirectoryInformation = 1,
  FileFullDirectoryInformation = 2,
  FileBothDirectoryInformation = 3,
  FileBasicInformation = 4,
  FileStandardInformation = 5,
  FileInternalInformation = 6,
  FileEaInformation = 7,
  FileAccessInformation = 8,
  FileNameInformation = 9,
  FileRenameInformation = 10,
  FileLinkInformation = 11,
  FileNamesInformation = 12,
  FileDispositionInformation = 13,
  FilePositionInformation = 14,
  FileFullEaInformation = 15,
  FileModeInformation = 16,
  FileAlignmentInformation = 17,
  FileAllInformation = 18,
  FileAllocationInformation = 19,
  FileEndOfFileInformation = 20,
  FileAlternateNameInformation = 21,
  FileStreamInformation = 22,
  FilePipeInformation = 23,
  FilePipeLocalInformation = 24,
  FilePipeRemoteInformation = 25,
  FileMailslotQueryInformation = 26,
  FileMailslotSetInformation = 27,
  FileCompressionInformation = 28,
  FileObjectIdInformation = 29,
  FileCompletionInformation = 30,
  FileMoveClusterInformation = 31,
  FileQuotaInformation = 32,
  FileReparsePointInformation = 33,
  FileNetworkOpenInformation = 34,
  FileAttributeTagInformation = 35,
  FileTrackingInformation = 36,
  FileIdBothDirectoryInformation = 37,
  FileIdFullDirectoryInformation = 38,
  FileValidDataLengthInformation = 39,
  FileShortNameInformation = 40,
  FileIoCompletionNotificationInformation = 41,
  FileIoStatusBlockRangeInformation = 42,
  FileIoPriorityHintInformation = 43,
  FileSfioReserveInformation = 44,
  FileSfioVolumeInformation = 45,
  FileHardLinkInformation = 46,
  FileProcessIdsUsingFileInformation = 47,
  FileNormalizedNameInformation = 48,
  FileNetworkPhysicalNameInformation = 49,
  FileIdGlobalTxDirectoryInformation = 50,
  FileIsRemoteDeviceInformation = 51,
  FileUnusedInformation = 52,
  FileNumaNodeInformation = 53,
  FileStandardLinkInformation = 54,
  FileRemoteProtocolInformation = 55,
  FileRenameInformationBypassAccessCheck = 56,
  FileLinkInformationBypassAccessCheck = 57,
  FileVolumeNameInformation = 58,
  FileIdInformation = 59,
  FileIdExtdDirectoryInformation = 60,
  FileReplaceCompletionInformation = 61,
  FileHardLinkFullIdInformation = 62,
  FileIdExtdBothDirectoryInformation = 63,
  FileDispositionInformationEx = 64,
  FileRenameInformationEx = 65,
  FileRenameInformationExBypassAccessCheck = 66,
  FileDesiredStorageClassInformation = 67,
  FileStatInformation = 68,
  FileMemoryPartitionInformation = 69,
  FileStatLxInformation = 70,
  FileCaseSensitiveInformation = 71,
  FileLinkInformationEx = 72,
  FileLinkInformationExBypassAccessCheck = 73,
  FileStorageReserveIdInformation = 74,
  FileCaseSensitiveInformationForceAccessCheck = 75,
  FileMaximumInformation = 76
};

// 0x4 (4) bytes
enum _PNP_DEVICE_DELETE_TYPE {

  QueryRemoveDevice = 0,
  CancelRemoveDevice = 1,
  RemoveDevice = 2,
  SurpriseRemoveDevice = 3,
  EjectDevice = 4,
  RemoveFailedDevice = 5,
  RemoveUnstartedFailedDevice = 6,
  MaxDeviceDeleteType = 7
};

// 0x4 (4) bytes
enum IRPLOCK {

  IRPLOCK_CANCELABLE = 0,
  IRPLOCK_CANCEL_STARTED = 1,
  IRPLOCK_CANCEL_COMPLETE = 2,
  IRPLOCK_COMPLETED = 3
};

// 0x4 (4) bytes
enum _TOKEN_TYPE {

  TokenPrimary = 1,
  TokenImpersonation = 2
};

// 0x4 (4) bytes
enum _SECURITY_IMPERSONATION_LEVEL {

  SecurityAnonymous = 0,
  SecurityIdentification = 1,
  SecurityImpersonation = 2,
  SecurityDelegation = 3
};

// 0x4 (4) bytes
enum _ETW_BUFFER_STATE {

  EtwBufferStateFree = 0,
  EtwBufferStateGeneralLogging = 1,
  EtwBufferStateCSwitch = 2,
  EtwBufferStateFlush = 3,
  EtwBufferStatePendingCompression = 4,
  EtwBufferStateCompressed = 5,
  EtwBufferStatePlaceholder = 6,
  EtwBufferStateMaximum = 7
};

// 0x4 (4) bytes
enum _PEP_WORK_TYPE {

  PepWorkActiveComplete = 0,
  PepWorkRequestIdleState = 1,
  PepWorkDevicePower = 2,
  PepWorkRequestPowerControl = 3,
  PepWorkDeviceIdle = 4,
  PepWorkCompleteIdleState = 5,
  PepWorkCompletePerfState = 6,
  PepWorkAcpiNotify = 7,
  PepWorkAcpiEvaluateControlMethodComplete = 8,
  PepWorkMax = 9
};

// 0x4 (4) bytes
enum PROFILE_STATUS {

  DOCK_NOTDOCKDEVICE = 0,
  DOCK_QUIESCENT = 1,
  DOCK_ARRIVING = 2,
  DOCK_DEPARTING = 3,
  DOCK_EJECTIRP_COMPLETED = 4
};

// 0x4 (4) bytes
enum _SYSTEM_POWER_STATE {

  PowerSystemUnspecified = 0,
  PowerSystemWorking = 1,
  PowerSystemSleeping1 = 2,
  PowerSystemSleeping2 = 3,
  PowerSystemSleeping3 = 4,
  PowerSystemHibernate = 5,
  PowerSystemShutdown = 6,
  PowerSystemMaximum = 7
};

// 0x4 (4) bytes
enum _INTERFACE_TYPE {

  InterfaceTypeUndefined = -1,
  Internal = 0,
  Isa = 1,
  Eisa = 2,
  MicroChannel = 3,
  TurboChannel = 4,
  PCIBus = 5,
  VMEBus = 6,
  NuBus = 7,
  PCMCIABus = 8,
  CBus = 9,
  MPIBus = 10,
  MPSABus = 11,
  ProcessorInternal = 12,
  InternalPowerBus = 13,
  PNPISABus = 14,
  PNPBus = 15,
  Vmcs = 16,
  ACPIBus = 17,
  MaximumInterfaceType = 18
};

// 0x4 (4) bytes
enum _PNP_DEVNODE_STATE {

  DeviceNodeUnspecified = 768,
  DeviceNodeUninitialized = 769,
  DeviceNodeInitialized = 770,
  DeviceNodeDriversAdded = 771,
  DeviceNodeResourcesAssigned = 772,
  DeviceNodeStartPending = 773,
  DeviceNodeStartCompletion = 774,
  DeviceNodeStartPostWork = 775,
  DeviceNodeStarted = 776,
  DeviceNodeQueryStopped = 777,
  DeviceNodeStopped = 778,
  DeviceNodeRestartCompletion = 779,
  DeviceNodeEnumeratePending = 780,
  DeviceNodeEnumerateCompletion = 781,
  DeviceNodeAwaitingQueuedDeletion = 782,
  DeviceNodeAwaitingQueuedRemoval = 783,
  DeviceNodeQueryRemoved = 784,
  DeviceNodeRemovePendingCloses = 785,
  DeviceNodeRemoved = 786,
  DeviceNodeDeletePendingCloses = 787,
  DeviceNodeDeleted = 788,
  MaxDeviceNodeState = 789
};

// 0x4 (4) bytes
enum _POP_PEP_NOTIFY_DEVICE_DSTATE_REASON {

  PepNotifyDeviceDStateReasonNone = 0,
  PepNotifyDeviceDStateReasonSystemTransition = 1,
  PepNotifyDeviceDStateReasonDfx = 2,
  PepNotifyDeviceDStateReasonMax = 3
};

// 0x4 (4) bytes
enum _POWER_STATE_TYPE {

  SystemPowerState = 0,
  DevicePowerState = 1
};

// 0x4 (4) bytes
enum _WNF_DATA_SCOPE {

  WnfDataScopeSystem = 0,
  WnfDataScopeSession = 1,
  WnfDataScopeUser = 2,
  WnfDataScopeProcess = 3,
  WnfDataScopeMachine = 4,
  WnfDataScopePhysicalMachine = 5
};

// 0x4 (4) bytes
enum ETW_COMPRESSION_RESUMPTION_MODE {

  EtwCompressionModeRestart = 0,
  EtwCompressionModeNoDisable = 1,
  EtwCompressionModeNoRestart = 2
};

// 0x4 (4) bytes
enum _ETW_PERIODIC_TIMER_STATE {

  EtwpPeriodicTimerUnset = 0,
  EtwpPeriodicTimerSet = 1
};

// 0x4 (4) bytes
enum _ETW_RT_EVENT_LOSS {

  EtwRtEventNoLoss = 0,
  EtwRtEventLost = 1,
  EtwRtBufferLost = 2,
  EtwRtBackupLost = 3,
  EtwRtEventLossMax = 4
};

// 0x4 (4) bytes
struct PEPHANDLE__ {
  LONG unused; // offset: 0x0 (0)
};

// 0x4 (4) bytes
enum _PROCESSOR_PRESENCE {

  ProcessorPresenceNt = 0,
  ProcessorPresenceHv = 1,
  ProcessorPresenceHidden = 2
};

// 0x4 (4) bytes
union _POWER_STATE {
  enum _SYSTEM_POWER_STATE SystemState; // offset: 0x0 (0)
  enum _DEVICE_POWER_STATE DeviceState; // offset: 0x0 (0)
};

// 0x4 (4) bytes
enum _POP_DEVICE_IDLE_TYPE {

  DeviceIdleNormal = 0,
  DeviceIdleDisk = 1
};

// 0x4 (4) bytes
enum _IO_ALLOCATION_ACTION {

  KeepObject = 1,
  DeallocateObject = 2,
  DeallocateObjectKeepRegisters = 3
};

// 0x4 (4) bytes
enum PPM_IDLE_BUCKET_TIME_TYPE {

  PpmIdleBucketTimeInQpc = 0,
  PpmIdleBucketTimeIn100ns = 1,
  PpmIdleBucketTimeMaximum = 2
};

// 0x4 (4) bytes
enum _PROCESSOR_CACHE_TYPE {

  CacheUnified = 0,
  CacheInstruction = 1,
  CacheData = 2,
  CacheTrace = 3
};

// 0x4 (4) bytes
enum _HARDWARE_COUNTER_TYPE {

  PMCCounter = 0,
  MaxHardwareCounterType = 1
};

// 0x4 (4) bytes
enum _FUNCTION_TABLE_TYPE {

  RF_SORTED = 0,
  RF_UNSORTED = 1,
  RF_CALLBACK = 2,
  RF_KERNEL_DYNAMIC = 3
};

// 0x4 (4) bytes
enum _NT_PRODUCT_TYPE {

  NtProductWinNt = 1,
  NtProductLanManNt = 2,
  NtProductServer = 3
};

// 0x4 (4) bytes
enum _KHETERO_CPU_QOS {

  KHeteroCpuQosDefault = 0,
  KHeteroCpuQosHigh = 0,
  KHeteroCpuQosMedium = 1,
  KHeteroCpuQosLow = 2,
  KHeteroCpuQosMultimedia = 3,
  KHeteroCpuQosDeadline = 4,
  KHeteroCpuQosDynamic = 5,
  KHeteroCpuQosMax = 5
};

// 0x4 (4) bytes
enum _PROC_HYPERVISOR_STATE {

  ProcHypervisorNone = 0,
  ProcHypervisorPresent = 1,
  ProcHypervisorPower = 2,
  ProcHypervisorHvCounters = 3
};

// 0x4 (4) bytes
enum _SERVERSILO_STATE {

  SERVERSILO_INITING = 0,
  SERVERSILO_STARTED = 1,
  SERVERSILO_SHUTTING_DOWN = 2,
  SERVERSILO_TERMINATING = 3,
  SERVERSILO_TERMINATED = 4
};

// 0x4 (4) bytes
enum _MI_SYSTEM_VA_TYPE {

  MiVaUnused = 0,
  MiVaSessionSpace = 1,
  MiVaProcessSpace = 2,
  MiVaBootLoaded = 3,
  MiVaPfnDatabase = 4,
  MiVaNonPagedPool = 5,
  MiVaPagedPool = 6,
  MiVaSpecialPoolPaged = 7,
  MiVaSystemCache = 8,
  MiVaSystemPtes = 9,
  MiVaHal = 10,
  MiVaSessionGlobalSpace = 11,
  MiVaDriverImages = 12,
  MiVaSystemPtesLarge = 13,
  MiVaKernelStacks = 14,
  MiVaSecureNonPagedPool = 15,
  MiVaMaximumType = 16
};

// 0x4 (4) bytes
enum _SYSTEM_DLL_TYPE {

  PsNativeSystemDll = 0,
  PsWowX86SystemDll = 1,
  PsWowArm32SystemDll = 2,
  PsWowAmd64SystemDll = 3,
  PsWowChpeX86SystemDll = 4,
  PsVsmEnclaveRuntimeDll = 5,
  PsSystemDllTotalTypes = 6
};

// 0x4 (4) bytes
enum _IO_SESSION_STATE {

  IoSessionStateCreated = 1,
  IoSessionStateInitialized = 2,
  IoSessionStateConnected = 3,
  IoSessionStateDisconnected = 4,
  IoSessionStateDisconnectedLoggedOn = 5,
  IoSessionStateLoggedOn = 6,
  IoSessionStateLoggedOff = 7,
  IoSessionStateTerminated = 8,
  IoSessionStateMax = 9
};

// 0x4 (4) bytes
enum _POOL_TYPE {

  NonPagedPool = 0,
  NonPagedPoolExecute = 0,
  PagedPool = 1,
  NonPagedPoolMustSucceed = 2,
  DontUseThisType = 3,
  NonPagedPoolCacheAligned = 4,
  PagedPoolCacheAligned = 5,
  NonPagedPoolCacheAlignedMustS = 6,
  MaxPoolType = 7,
  NonPagedPoolBase = 0,
  NonPagedPoolBaseMustSucceed = 2,
  NonPagedPoolBaseCacheAligned = 4,
  NonPagedPoolBaseCacheAlignedMustS = 6,
  NonPagedPoolSession = 32,
  PagedPoolSession = 33,
  NonPagedPoolMustSucceedSession = 34,
  DontUseThisTypeSession = 35,
  NonPagedPoolCacheAlignedSession = 36,
  PagedPoolCacheAlignedSession = 37,
  NonPagedPoolCacheAlignedMustSSession = 38,
  NonPagedPoolNx = 512,
  NonPagedPoolNxCacheAligned = 516,
  NonPagedPoolSessionNx = 544
};

// 0x1 (1) bytes
struct _MI_WSLE {
  union {
    struct {
      UCHAR Age : 4;        // offset: 0x0 (0)
      UCHAR Protection : 3; // offset: 0x0 (0)
      UCHAR Reserved : 1;   // offset: 0x0 (0)
    } e1;                   // offset: 0x0 (0)
    struct {
      UCHAR EntireWsle; // offset: 0x0 (0)
    } e2;               // offset: 0x0 (0)

  } u1; // offset: 0x0 (0)
};

// 0x1 (1) bytes
union _PS_TRUSTLET_ATTRIBUTE_ACCESSRIGHTS {
  UCHAR Trustlet : 1;    // offset: 0x0 (0)
  UCHAR Ntos : 1;        // offset: 0x0 (0)
  UCHAR WriteHandle : 1; // offset: 0x0 (0)
  UCHAR ReadHandle : 1;  // offset: 0x0 (0)
  UCHAR Reserved : 4;    // offset: 0x0 (0)
  UCHAR AccessRights;    // offset: 0x0 (0)
};

// 0x1e (30) bytes
struct _TOKEN_AUDIT_POLICY {
  UCHAR PerUserPolicy[30]; // offset: 0x0 (0)
};

// 0x1f (31) bytes
struct _SEP_AUDIT_POLICY {
  struct _TOKEN_AUDIT_POLICY AdtTokenPolicy; // offset: 0x0 (0)
  UCHAR PolicySetStatus;                     // offset: 0x1e (30)
};

// 0x1 (1) bytes
struct _ETW_LOGGER_HANDLE {
  UCHAR DereferenceAndLeave; // offset: 0x0 (0)
};

// 0x2 (2) bytes
struct _HEAP_LFH_SUBSEGMENT_STAT {
  UCHAR Index; // offset: 0x0 (0)
  UCHAR Count; // offset: 0x1 (1)
};

// 0x1 (1) bytes
struct _MMPFNENTRY3 {
  UCHAR Priority : 3;           // offset: 0x0 (0)
  UCHAR OnProtectedStandby : 1; // offset: 0x0 (0)
  UCHAR InPageError : 1;        // offset: 0x0 (0)
  UCHAR SystemChargedPage : 1;  // offset: 0x0 (0)
  UCHAR RemovalRequested : 1;   // offset: 0x0 (0)
  UCHAR ParityError : 1;        // offset: 0x0 (0)
};

// 0x1 (1) bytes
struct _MMPFNENTRY1 {
  UCHAR PageLocation : 3;    // offset: 0x0 (0)
  UCHAR WriteInProgress : 1; // offset: 0x0 (0)
  UCHAR Modified : 1;        // offset: 0x0 (0)
  UCHAR ReadInProgress : 1;  // offset: 0x0 (0)
  UCHAR CacheAttribute : 2;  // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _MMPAGE_FILE_EXPANSION_FLAGS {
  UCHAR PageFileNumber : 8;        // offset: 0x0 (0)
  UCHAR Spare1 : 8;                // offset: 0x1 (1)
  UCHAR Spare2 : 8;                // offset: 0x2 (2)
  UCHAR IgnoreCurrentCommit : 1;   // offset: 0x3 (3)
  UCHAR IncreaseMinimumSize : 1;   // offset: 0x3 (3)
  UCHAR AttemptForCantExtend : 1;  // offset: 0x3 (3)
  UCHAR UnusedSegmentDeletion : 1; // offset: 0x3 (3)
  UCHAR PageFileContract : 1;      // offset: 0x3 (3)
  UCHAR NoWait : 1;                // offset: 0x3 (3)
  UCHAR Spare3 : 2;                // offset: 0x3 (3)
};

// 0x3 (3) bytes
struct _MI_RESTRICTED_MODWRITES {
  UCHAR MaximumClusterPages;  // offset: 0x0 (0)
  UCHAR ReducedClusterWrites; // offset: 0x1 (1)
  UCHAR ImposeDelay;          // offset: 0x2 (2)
};

// 0x20 (32) bytes
struct wil_details_FeatureTestState {
  enum wil_details_FeatureTestStateKind kind;     // offset: 0x0 (0)
  ULONG featureId;                                // offset: 0x4 (4)
  enum wil_FeatureEnabledState state;             // offset: 0x8 (8)
  UCHAR variant;                                  // offset: 0xc (12)
  ULONG payload;                                  // offset: 0x10 (16)
  enum wil_FeatureVariantPayloadKind payloadKind; // offset: 0x14 (20)
  struct wil_details_FeatureTestState *next;      // offset: 0x18 (24)
};

// 0x18 (24) bytes
struct wil_FeatureState {
  enum wil_FeatureEnabledState enabledState;      // offset: 0x0 (0)
  UCHAR variant;                                  // offset: 0x4 (4)
  enum wil_FeatureVariantPayloadKind payloadKind; // offset: 0x8 (8)
  ULONG payload;                                  // offset: 0xc (12)
  LONG hasNotification;                           // offset: 0x10 (16)
  LONG isVariantConfiguration;                    // offset: 0x14 (20)
};

// 0x1 (1) bytes
union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS {
  UCHAR FRUId : 1;    // offset: 0x0 (0)
  UCHAR FRUText : 1;  // offset: 0x0 (0)
  UCHAR Reserved : 6; // offset: 0x0 (0)
  UCHAR AsUCHAR;      // offset: 0x0 (0)
};

// 0x1 (1) bytes
union _XPF_MC_BANK_FLAGS {
  UCHAR ClearOnInitializationRW : 1; // offset: 0x0 (0)
  UCHAR ControlDataRW : 1;           // offset: 0x0 (0)
  UCHAR Reserved : 6;                // offset: 0x0 (0)
  UCHAR AsUCHAR;                     // offset: 0x0 (0)
};

// 0x10 (16) bytes
struct _PEP_WORK_DEVICE_IDLE {
  struct POHANDLE__ *DeviceHandle; // offset: 0x0 (0)
  UCHAR IgnoreIdleTimeout;         // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct _PEP_WORK_DEVICE_POWER {
  struct POHANDLE__ *DeviceHandle; // offset: 0x0 (0)
  UCHAR PowerRequired;             // offset: 0x8 (8)
};

// 0x2 (2) bytes
struct _ETW_SYSTEM_LOGGER {
  UCHAR LoggerId;  // offset: 0x0 (0)
  UCHAR ClockType; // offset: 0x1 (1)
};

// 0x2 (2) bytes
struct _PROC_PERF_LOAD {
  UCHAR BusyPercentage;      // offset: 0x0 (0)
  UCHAR FrequencyPercentage; // offset: 0x1 (1)
};

// 0x1 (1) bytes
struct _flags {
  UCHAR Removable : 1;            // offset: 0x0 (0)
  UCHAR GroupAssigned : 1;        // offset: 0x0 (0)
  UCHAR GroupCommitted : 1;       // offset: 0x0 (0)
  UCHAR GroupAssignmentFixed : 1; // offset: 0x0 (0)
  UCHAR ProcessorOnly : 1;        // offset: 0x0 (0)
  UCHAR SmtSetsPresent : 1;       // offset: 0x0 (0)
  UCHAR Fill : 2;                 // offset: 0x0 (0)
};

// 0x6 (6) bytes
struct _PROC_IDLE_POLICY {
  UCHAR PromotePercent;     // offset: 0x0 (0)
  UCHAR DemotePercent;      // offset: 0x1 (1)
  UCHAR PromotePercentBase; // offset: 0x2 (2)
  UCHAR DemotePercentBase;  // offset: 0x3 (3)
  UCHAR AllowScaling;       // offset: 0x4 (4)
  UCHAR ForceLightIdle;     // offset: 0x5 (5)
};

// 0x6 (6) bytes
struct _SID_IDENTIFIER_AUTHORITY {
  UCHAR Value[6]; // offset: 0x0 (0)
};

// 0x10 (16) bytes
struct _VF_ADDRESS_RANGE {
  UCHAR *Start; // offset: 0x0 (0)
  UCHAR *End;   // offset: 0x8 (8)
};

// 0x1 (1) bytes
union _KWAIT_STATUS_REGISTER {
  UCHAR Flags;        // offset: 0x0 (0)
  UCHAR State : 3;    // offset: 0x0 (0)
  UCHAR Affinity : 1; // offset: 0x0 (0)
  UCHAR Priority : 1; // offset: 0x0 (0)
  UCHAR Apc : 1;      // offset: 0x0 (0)
  UCHAR UserApc : 1;  // offset: 0x0 (0)
  UCHAR Alert : 1;    // offset: 0x0 (0)
};

// 0x10 (16) bytes
struct _RTL_RB_TREE {
  struct _RTL_BALANCED_NODE *Root; // offset: 0x0 (0)
  union {
    UCHAR Encoded : 1;              // offset: 0x8 (8)
    struct _RTL_BALANCED_NODE *Min; // offset: 0x8 (8)
  };
};

// 0x1 (1) bytes
union _KEXECUTE_OPTIONS {
  UCHAR ExecuteDisable : 1;                  // offset: 0x0 (0)
  UCHAR ExecuteEnable : 1;                   // offset: 0x0 (0)
  UCHAR DisableThunkEmulation : 1;           // offset: 0x0 (0)
  UCHAR Permanent : 1;                       // offset: 0x0 (0)
  UCHAR ExecuteDispatchEnable : 1;           // offset: 0x0 (0)
  UCHAR ImageDispatchEnable : 1;             // offset: 0x0 (0)
  UCHAR DisableExceptionChainValidation : 1; // offset: 0x0 (0)
  UCHAR Spare : 1;                           // offset: 0x0 (0)
  volatile UCHAR ExecuteOptions;             // offset: 0x0 (0)
  UCHAR ExecuteOptionsNV;                    // offset: 0x0 (0)
};

// 0x1 (1) bytes
struct _PS_PROTECTION {
  union {
    UCHAR Level; // offset: 0x0 (0)
    struct {
      UCHAR Type : 3;   // offset: 0x0 (0)
      UCHAR Audit : 1;  // offset: 0x0 (0)
      UCHAR Signer : 4; // offset: 0x0 (0)
    };
  };
};

// 0x10 (16) bytes
struct _MI_COMBINE_PAGE_LISTHEAD {
  struct _RTL_AVL_TREE Table; // offset: 0x0 (0)
  volatile LONG Lock;         // offset: 0x8 (8)
};

// 0x8 (8) bytes
struct _QUAD {
  union {
    LONGLONG UseThisFieldToCopy; // offset: 0x0 (0)
    double DoNotUseThisField;    // offset: 0x0 (0)
  };
};

// 0x8 (8) bytes
struct _UNEXPECTED_INTERRUPT {
  UCHAR PushImm;  // offset: 0x0 (0)
  UCHAR Vector;   // offset: 0x1 (1)
  UCHAR PushRbp;  // offset: 0x2 (2)
  UCHAR JmpOp;    // offset: 0x3 (3)
  LONG JmpOffset; // offset: 0x4 (4)
};

// 0x8 (8) bytes
struct _ISR_THUNK {
  UCHAR PushImm;  // offset: 0x0 (0)
  UCHAR Vector;   // offset: 0x1 (1)
  UCHAR PushRbp;  // offset: 0x2 (2)
  UCHAR JmpOp;    // offset: 0x3 (3)
  LONG JmpOffset; // offset: 0x4 (4)
};

// 0x8 (8) bytes
struct _VACB_LEVEL_REFERENCE {
  LONG Reference;        // offset: 0x0 (0)
  LONG SpecialReference; // offset: 0x4 (4)
};

// 0x4 (4) bytes
struct _DBGKD_CONTINUE {
  LONG ContinueStatus; // offset: 0x0 (0)
};

// 0x18 (24) bytes
struct _ETW_PERF_COUNTERS {
  LONG TotalActiveSessions;           // offset: 0x0 (0)
  LONG TotalBufferMemoryNonPagedPool; // offset: 0x4 (4)
  LONG TotalBufferMemoryPagedPool;    // offset: 0x8 (8)
  LONG TotalGuidsEnabled;             // offset: 0xc (12)
  LONG TotalGuidsNotEnabled;          // offset: 0x10 (16)
  LONG TotalGuidsPreEnabled;          // offset: 0x14 (20)
};

// 0x10 (16) bytes
struct _ETW_COUNTERS {
  LONG GuidCount;    // offset: 0x0 (0)
  LONG PoolUsage[2]; // offset: 0x4 (4)
  LONG SessionCount; // offset: 0xc (12)
};

// 0x200 (512) bytes
struct _IOV_FORCED_PENDING_TRACE {
  struct _IRP *Irp;        // offset: 0x0 (0)
  struct _ETHREAD *Thread; // offset: 0x8 (8)
  VOID *StackTrace[62];    // offset: 0x10 (16)
};

// 0x10 (16) bytes
struct _VF_TRACKER_STAMP {
  VOID *Thread;        // offset: 0x0 (0)
  UCHAR Flags : 8;     // offset: 0x8 (8)
  UCHAR OldIrql : 8;   // offset: 0x9 (9)
  UCHAR NewIrql : 8;   // offset: 0xa (10)
  UCHAR Processor : 8; // offset: 0xb (11)
};

// 0x8 (8) bytes
struct _KWAIT_CHAIN {
  VOID *Head; // offset: 0x0 (0)
};

// 0x20 (32) bytes
struct _MI_DLL_OVERFLOW_AREA {
  VOID *RangeStart;         // offset: 0x0 (0)
  VOID *NextVa;             // offset: 0x8 (8)
  VOID *RangeStartAbove2gb; // offset: 0x10 (16)
  VOID *NextVaAbove2gb;     // offset: 0x18 (24)
};

// 0x18 (24) bytes
struct _NLS_DATA_BLOCK {
  VOID *AnsiCodePageData;     // offset: 0x0 (0)
  VOID *OemCodePageData;      // offset: 0x8 (8)
  VOID *UnicodeCaseTableData; // offset: 0x10 (16)
};

// 0x18 (24) bytes
struct _HAL_LBR_ENTRY {
  VOID *FromAddress; // offset: 0x0 (0)
  VOID *ToAddress;   // offset: 0x8 (8)
  VOID *Reserved;    // offset: 0x10 (16)
};

// 0x10 (16) bytes
struct _MAP_REGISTER_ENTRY {
  VOID *MapRegister;   // offset: 0x0 (0)
  UCHAR WriteToDevice; // offset: 0x8 (8)
};

// 0x48 (72) bytes
struct _VI_FAULT_TRACE {
  struct _ETHREAD *Thread; // offset: 0x0 (0)
  VOID *StackTrace[8];     // offset: 0x8 (8)
};

// 0x40 (64) bytes
struct _VF_KE_CRITICAL_REGION_TRACE {
  struct _ETHREAD *Thread; // offset: 0x0 (0)
  VOID *StackTrace[7];     // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct _OB_EXTENDED_USER_INFO {
  VOID *Context1; // offset: 0x0 (0)
  VOID *Context2; // offset: 0x8 (8)
};

// 0x48 (72) bytes
struct _FAST_OWNER_ENTRY {
  VOID *Reserved[9]; // offset: 0x0 (0)
};

// 0x8 (8) bytes
struct _ALPC_HANDLE_ENTRY {
  VOID *Object; // offset: 0x0 (0)
};

// 0x8 (8) bytes
union _HEAP_LFH_SUBSEGMENT_STATS {
  struct _HEAP_LFH_SUBSEGMENT_STAT Buckets[4]; // offset: 0x0 (0)
  VOID *AllStats;                              // offset: 0x0 (0)
};

// 0x10 (16) bytes
struct _CMSI_PROCESS_TUPLE {
  VOID *ProcessHandle;    // offset: 0x0 (0)
  VOID *ProcessReference; // offset: 0x8 (8)
};

// 0x8 (8) bytes
struct _CMSI_RW_LOCK {
  VOID *Reserved; // offset: 0x0 (0)
};

// 0x20 (32) bytes
struct _SECURITY_SUBJECT_CONTEXT {
  VOID *ClientToken;                                     // offset: 0x0 (0)
  enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel; // offset: 0x8 (8)
  VOID *PrimaryToken;                                    // offset: 0x10 (16)
  VOID *ProcessAuditId;                                  // offset: 0x18 (24)
};

// 0x10 (16) bytes
struct _PEP_CRASHDUMP_INFORMATION {
  struct PEPHANDLE__ *DeviceHandle; // offset: 0x0 (0)
  VOID *DeviceContext;              // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct _IO_CLIENT_EXTENSION {
  struct _IO_CLIENT_EXTENSION *NextExtension; // offset: 0x0 (0)
  VOID *ClientIdentificationAddress;          // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct RTL_HP_ENV_HANDLE {
  VOID *h[2]; // offset: 0x0 (0)
};

// 0x80 (128) bytes
struct _OBJECT_REF_TRACE {
  VOID *StackTrace[16]; // offset: 0x0 (0)
};

// 0x20 (32) bytes
struct _KREQUEST_PACKET {
  VOID *CurrentPacket[3]; // offset: 0x0 (0)
  VOID (*WorkerRoutine)
  (VOID *arg1, VOID *arg2, VOID *arg3, VOID *arg4); // offset: 0x18 (24)
};

// 0x10 (16) bytes
struct _IO_COMPLETION_CONTEXT {
  VOID *Port; // offset: 0x0 (0)
  VOID *Key;  // offset: 0x8 (8)
};

// 0x18 (24) bytes
struct _SECTION_OBJECT_POINTERS {
  VOID *DataSectionObject;  // offset: 0x0 (0)
  VOID *SharedCacheMap;     // offset: 0x8 (8)
  VOID *ImageSectionObject; // offset: 0x10 (16)
};

// 0x10 (16) bytes
struct _TERMINATION_PORT {
  struct _TERMINATION_PORT *Next; // offset: 0x0 (0)
  VOID *Port;                     // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct _CLIENT_ID {
  VOID *UniqueProcess; // offset: 0x0 (0)
  VOID *UniqueThread;  // offset: 0x8 (8)
};

// 0x20 (32) bytes
struct _CACHE_MANAGER_CALLBACKS {
  UCHAR (*AcquireForLazyWrite)(VOID *arg1, UCHAR arg2); // offset: 0x0 (0)
  VOID (*ReleaseFromLazyWrite)(VOID *arg1);             // offset: 0x8 (8)
  UCHAR (*AcquireForReadAhead)(VOID *arg1, UCHAR arg2); // offset: 0x10 (16)
  VOID (*ReleaseFromReadAhead)(VOID *arg1);             // offset: 0x18 (24)
};

// 0x20 (32) bytes
struct _RTL_BALANCED_LINKS {
  struct _RTL_BALANCED_LINKS *Parent;     // offset: 0x0 (0)
  struct _RTL_BALANCED_LINKS *LeftChild;  // offset: 0x8 (8)
  struct _RTL_BALANCED_LINKS *RightChild; // offset: 0x10 (16)
  CHAR Balance;                           // offset: 0x18 (24)
  UCHAR Reserved[3];                      // offset: 0x19 (25)
};

// 0x28 (40) bytes
struct _KTMOBJECT_NAMESPACE_LINK {
  struct _RTL_BALANCED_LINKS Links; // offset: 0x0 (0)
  UCHAR Expired;                    // offset: 0x20 (32)
};

// 0x1 (1) bytes
struct _WDT_HANDLE {
  CHAR Reserved; // offset: 0x0 (0)
};

// 0x30 (48) bytes
struct _iobuf {
  CHAR *_ptr;      // offset: 0x0 (0)
  LONG _cnt;       // offset: 0x8 (8)
  CHAR *_base;     // offset: 0x10 (16)
  LONG _flag;      // offset: 0x18 (24)
  LONG _file;      // offset: 0x1c (28)
  LONG _charbuf;   // offset: 0x20 (32)
  LONG _bufsiz;    // offset: 0x24 (36)
  CHAR *_tmpfname; // offset: 0x28 (40)
};

// 0xac (172) bytes
struct _RTL_TIME_ZONE_INFORMATION {
  LONG Bias;                         // offset: 0x0 (0)
  WCHAR StandardName[32];            // offset: 0x4 (4)
  struct _TIME_FIELDS StandardStart; // offset: 0x44 (68)
  LONG StandardBias;                 // offset: 0x54 (84)
  WCHAR DaylightName[32];            // offset: 0x58 (88)
  struct _TIME_FIELDS DaylightStart; // offset: 0x98 (152)
  LONG DaylightBias;                 // offset: 0xa8 (168)
};

// 0x1b0 (432) bytes
struct _RTL_DYNAMIC_TIME_ZONE_INFORMATION {
  struct _RTL_TIME_ZONE_INFORMATION tzi; // offset: 0x0 (0)
  WCHAR TimeZoneKeyName[128];            // offset: 0xac (172)
  UCHAR DynamicDaylightTimeDisabled;     // offset: 0x1ac (428)
};

// 0x4 (4) bytes
struct _HEAP_FREE_ENTRY_EXTRA {
  USHORT TagIndex;           // offset: 0x0 (0)
  USHORT FreeBackTraceIndex; // offset: 0x2 (2)
};

// 0x2 (2) bytes
union _HAL_UNMASKED_INTERRUPT_FLAGS {
  USHORT SecondaryInterrupt : 1; // offset: 0x0 (0)
  USHORT Reserved : 15;          // offset: 0x0 (0)
  USHORT AsUSHORT;               // offset: 0x0 (0)
};

// 0x8088 (32904) bytes
struct _STACK_TABLE {
  USHORT NumStackTraces;                    // offset: 0x0 (0)
  USHORT TraceCapacity;                     // offset: 0x2 (2)
  struct _OBJECT_REF_TRACE *StackTrace[16]; // offset: 0x8 (8)
  USHORT StackTableHash[16381];             // offset: 0x88 (136)
};

// 0x8 (8) bytes
struct _ACL {
  UCHAR AclRevision; // offset: 0x0 (0)
  UCHAR Sbz1;        // offset: 0x1 (1)
  USHORT AclSize;    // offset: 0x2 (2)
  USHORT AceCount;   // offset: 0x4 (4)
  USHORT Sbz2;       // offset: 0x6 (6)
};

// 0x28 (40) bytes
struct _SECURITY_DESCRIPTOR {
  UCHAR Revision;    // offset: 0x0 (0)
  UCHAR Sbz1;        // offset: 0x1 (1)
  USHORT Control;    // offset: 0x2 (2)
  VOID *Owner;       // offset: 0x8 (8)
  VOID *Group;       // offset: 0x10 (16)
  struct _ACL *Sacl; // offset: 0x18 (24)
  struct _ACL *Dacl; // offset: 0x20 (32)
};

// 0x10 (16) bytes
struct _ETW_SYSTEMTIME {
  USHORT Year;         // offset: 0x0 (0)
  USHORT Month;        // offset: 0x2 (2)
  USHORT DayOfWeek;    // offset: 0x4 (4)
  USHORT Day;          // offset: 0x6 (6)
  USHORT Hour;         // offset: 0x8 (8)
  USHORT Minute;       // offset: 0xa (10)
  USHORT Second;       // offset: 0xc (12)
  USHORT Milliseconds; // offset: 0xe (14)
};

// 0x10 (16) bytes
struct _IO_IRP_EXT_TRACK_OFFSET_HEADER {
  USHORT Validation; // offset: 0x0 (0)
  USHORT Flags;      // offset: 0x2 (2)
  VOID (*TrackedOffsetCallback)
  (struct _IO_IRP_EXT_TRACK_OFFSET_HEADER *arg1,
   struct _IO_IRP_EXT_TRACK_OFFSET_HEADER *arg2,
   LONGLONG arg3); // offset: 0x8 (8)
};

// 0x2 (2) bytes
union _HEAP_SEGMENT_MGR_COMMIT_STATE {
  USHORT CommittedPageCount : 11;          // offset: 0x0 (0)
  USHORT Spare : 3;                        // offset: 0x0 (0)
  USHORT LargePageOperationInProgress : 1; // offset: 0x0 (0)
  USHORT LargePageCommit : 1;              // offset: 0x0 (0)
  volatile USHORT EntireUShortV;           // offset: 0x0 (0)
  USHORT EntireUShort;                     // offset: 0x0 (0)
};

// 0x2 (2) bytes
struct _HEAP_VS_UNUSED_BYTES_INFO {
  union {
    struct {
      USHORT UnusedBytes : 13;  // offset: 0x0 (0)
      USHORT LfhSubsegment : 1; // offset: 0x0 (0)
      USHORT ExtraPresent : 1;  // offset: 0x0 (0)
      USHORT OneByteUnused : 1; // offset: 0x0 (0)
    };
    UCHAR Bytes[2]; // offset: 0x0 (0)
  };
};

// 0x2 (2) bytes
struct _HEAP_LFH_UNUSED_BYTES_INFO {
  union {
    struct {
      USHORT UnusedBytes : 14;  // offset: 0x0 (0)
      USHORT ExtraPresent : 1;  // offset: 0x0 (0)
      USHORT OneByteUnused : 1; // offset: 0x0 (0)
    };
    UCHAR Bytes[2]; // offset: 0x0 (0)
  };
};

// 0x8 (8) bytes
union _HEAP_LFH_ONDEMAND_POINTER {
  USHORT Invalid : 1;              // offset: 0x0 (0)
  USHORT AllocationInProgress : 1; // offset: 0x0 (0)
  struct {
    USHORT Spare0 : 14; // offset: 0x0 (0)
    USHORT UsageData;   // offset: 0x2 (2)
  };
  VOID *AllBits; // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _RTL_HP_LFH_CONFIG {
  USHORT MaxBlockSize;                  // offset: 0x0 (0)
  USHORT WitholdPageCrossingBlocks : 1; // offset: 0x2 (2)
  USHORT DisableRandomization : 1;      // offset: 0x2 (2)
};

// 0x10 (16) bytes
struct _SEGMENT_HEAP_EXTRA {
  USHORT AllocationTag;       // offset: 0x0 (0)
  UCHAR InterceptorIndex : 4; // offset: 0x2 (2)
  UCHAR UserFlags : 4;        // offset: 0x2 (2)
  UCHAR ExtraSizeInUnits;     // offset: 0x3 (3)
  VOID *Settable;             // offset: 0x8 (8)
};

// 0x8 (8) bytes
struct _PCW_COUNTER_DESCRIPTOR {
  USHORT Id;          // offset: 0x0 (0)
  USHORT StructIndex; // offset: 0x2 (2)
  USHORT Offset;      // offset: 0x4 (4)
  USHORT Size;        // offset: 0x6 (6)
};

// 0x2 (2) bytes
struct _HV_GET_BIN_CONTEXT {
  USHORT OutstandingReference : 1; // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _MMSUBSECTION_FLAGS {
  USHORT SubsectionAccessed : 1;  // offset: 0x0 (0)
  USHORT Protection : 5;          // offset: 0x0 (0)
  USHORT StartingSector4132 : 10; // offset: 0x0 (0)
  USHORT SubsectionStatic : 1;    // offset: 0x2 (2)
  USHORT GlobalMemory : 1;        // offset: 0x2 (2)
  USHORT Spare : 1;               // offset: 0x2 (2)
  USHORT OnDereferenceList : 1;   // offset: 0x2 (2)
  USHORT SectorEndOffset : 12;    // offset: 0x2 (2)
};

// 0x4 (4) bytes
struct _MMSECTION_FLAGS2 {
  USHORT PartitionId : 10;                             // offset: 0x0 (0)
  UCHAR NoCrossPartitionAccess : 1;                    // offset: 0x2 (2)
  UCHAR SubsectionCrossPartitionReferenceOverflow : 1; // offset: 0x2 (2)
};

// 0x4 (4) bytes
struct _SEGMENT_FLAGS {
  union {
    struct {
      USHORT TotalNumberOfPtes4132 : 10; // offset: 0x0 (0)
      USHORT Spare0 : 1;                 // offset: 0x0 (0)
      USHORT SessionDriverProtos : 1;    // offset: 0x0 (0)
      USHORT LargePages : 1;             // offset: 0x0 (0)
      USHORT DebugSymbolsLoaded : 1;     // offset: 0x0 (0)
      USHORT WriteCombined : 1;          // offset: 0x0 (0)
      USHORT NoCache : 1;                // offset: 0x0 (0)
    };
    USHORT Short0; // offset: 0x0 (0)
  };
  union {
    struct {
      UCHAR Spare : 1;                 // offset: 0x2 (2)
      UCHAR DefaultProtectionMask : 5; // offset: 0x2 (2)
      UCHAR Binary32 : 1;              // offset: 0x2 (2)
      UCHAR ContainsDebug : 1;         // offset: 0x2 (2)
    };
    UCHAR UChar1; // offset: 0x2 (2)
  };
  union {
    struct {
      UCHAR ForceCollision : 1;    // offset: 0x3 (3)
      UCHAR ImageSigningType : 3;  // offset: 0x3 (3)
      UCHAR ImageSigningLevel : 4; // offset: 0x3 (3)
    };
    UCHAR UChar2; // offset: 0x3 (3)
  };
};

// 0x8 (8) bytes
struct _RTL_FEATURE_USAGE_REPORT {
  ULONG FeatureId;         // offset: 0x0 (0)
  USHORT ReportingKind;    // offset: 0x4 (4)
  USHORT ReportingOptions; // offset: 0x6 (6)
};

// 0x8 (8) bytes
struct _wil_details_UsageSubscriptionData {
  ULONG featureId;             // offset: 0x0 (0)
  USHORT serviceReportingKind; // offset: 0x4 (4)
};

// 0x10 (16) bytes
struct wil_details_StagingConfigHeader {
  UCHAR version;                   // offset: 0x0 (0)
  UCHAR versionMinor;              // offset: 0x1 (1)
  USHORT headerSizeBytes;          // offset: 0x2 (2)
  USHORT featureCount;             // offset: 0x4 (4)
  USHORT featureUsageTriggerCount; // offset: 0x6 (6)
  struct wil_details_StagingConfigHeaderProperties
      sessionProperties; // offset: 0x8 (8)
  struct wil_details_StagingConfigHeaderProperties
      properties; // offset: 0xc (12)
};

// 0x6 (6) bytes
struct FEATURE_LOGGED_TRAITS {
  USHORT version;     // offset: 0x0 (0)
  USHORT baseVersion; // offset: 0x2 (2)
  UCHAR stage;        // offset: 0x4 (4)
};

// 0x68 (104) bytes
struct FEATURE_ERROR {
  HRESULT hr;                            // offset: 0x0 (0)
  USHORT lineNumber;                     // offset: 0x4 (4)
  const CHAR *file;                      // offset: 0x8 (8)
  const CHAR *process;                   // offset: 0x10 (16)
  const CHAR *modulePath;                // offset: 0x18 (24)
  ULONG callerReturnAddressOffset;       // offset: 0x20 (32)
  const CHAR *callerModule;              // offset: 0x28 (40)
  const CHAR *message;                   // offset: 0x30 (48)
  USHORT originLineNumber;               // offset: 0x38 (56)
  const CHAR *originFile;                // offset: 0x40 (64)
  const CHAR *originModule;              // offset: 0x48 (72)
  ULONG originCallerReturnAddressOffset; // offset: 0x50 (80)
  const CHAR *originCallerModule;        // offset: 0x58 (88)
  const CHAR *originName;                // offset: 0x60 (96)
};

// 0x10 (16) bytes
struct _UNICODE_STRING {
  USHORT Length;        // offset: 0x0 (0)
  USHORT MaximumLength; // offset: 0x2 (2)
  WCHAR *Buffer;        // offset: 0x8 (8)
};

// 0x6 (6) bytes
struct _LOCAL_NMISOURCE {
  UCHAR Type;        // offset: 0x0 (0)
  UCHAR Length;      // offset: 0x1 (1)
  UCHAR ProcessorID; // offset: 0x2 (2)
  USHORT Flags;      // offset: 0x3 (3)
  UCHAR LINTIN;      // offset: 0x5 (5)
};

// 0x2 (2) bytes
union _WHEA_REVISION {
  struct {
    UCHAR MinorRevision; // offset: 0x0 (0)
    UCHAR MajorRevision; // offset: 0x1 (1)
  };
  USHORT AsUSHORT; // offset: 0x0 (0)
};

// 0x2 (2) bytes
union _WHEA_NOTIFICATION_FLAGS {
  USHORT PollIntervalRW : 1;             // offset: 0x0 (0)
  USHORT SwitchToPollingThresholdRW : 1; // offset: 0x0 (0)
  USHORT SwitchToPollingWindowRW : 1;    // offset: 0x0 (0)
  USHORT ErrorThresholdRW : 1;           // offset: 0x0 (0)
  USHORT ErrorThresholdWindowRW : 1;     // offset: 0x0 (0)
  USHORT Reserved : 11;                  // offset: 0x0 (0)
  USHORT AsUSHORT;                       // offset: 0x0 (0)
};

// 0x2 (2) bytes
union _AER_BRIDGE_DESCRIPTOR_FLAGS {
  USHORT UncorrectableErrorMaskRW : 1;          // offset: 0x0 (0)
  USHORT UncorrectableErrorSeverityRW : 1;      // offset: 0x0 (0)
  USHORT CorrectableErrorMaskRW : 1;            // offset: 0x0 (0)
  USHORT AdvancedCapsAndControlRW : 1;          // offset: 0x0 (0)
  USHORT SecondaryUncorrectableErrorMaskRW : 1; // offset: 0x0 (0)
  USHORT SecondaryUncorrectableErrorSevRW : 1;  // offset: 0x0 (0)
  USHORT SecondaryCapsAndControlRW : 1;         // offset: 0x0 (0)
  USHORT Reserved : 9;                          // offset: 0x0 (0)
  USHORT AsUSHORT;                              // offset: 0x0 (0)
};

// 0x2 (2) bytes
union _AER_ENDPOINT_DESCRIPTOR_FLAGS {
  USHORT UncorrectableErrorMaskRW : 1;     // offset: 0x0 (0)
  USHORT UncorrectableErrorSeverityRW : 1; // offset: 0x0 (0)
  USHORT CorrectableErrorMaskRW : 1;       // offset: 0x0 (0)
  USHORT AdvancedCapsAndControlRW : 1;     // offset: 0x0 (0)
  USHORT Reserved : 12;                    // offset: 0x0 (0)
  USHORT AsUSHORT;                         // offset: 0x0 (0)
};

// 0x2 (2) bytes
union _AER_ROOTPORT_DESCRIPTOR_FLAGS {
  USHORT UncorrectableErrorMaskRW : 1;     // offset: 0x0 (0)
  USHORT UncorrectableErrorSeverityRW : 1; // offset: 0x0 (0)
  USHORT CorrectableErrorMaskRW : 1;       // offset: 0x0 (0)
  USHORT AdvancedCapsAndControlRW : 1;     // offset: 0x0 (0)
  USHORT RootErrorCommandRW : 1;           // offset: 0x0 (0)
  USHORT Reserved : 11;                    // offset: 0x0 (0)
  USHORT AsUSHORT;                         // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _WHEA_IPF_CPE_DESCRIPTOR {
  USHORT Type;    // offset: 0x0 (0)
  UCHAR Enabled;  // offset: 0x2 (2)
  UCHAR Reserved; // offset: 0x3 (3)
};

// 0x4 (4) bytes
struct _WHEA_IPF_CMC_DESCRIPTOR {
  USHORT Type;    // offset: 0x0 (0)
  UCHAR Enabled;  // offset: 0x2 (2)
  UCHAR Reserved; // offset: 0x3 (3)
};

// 0x4 (4) bytes
struct _WHEA_IPF_MCA_DESCRIPTOR {
  USHORT Type;    // offset: 0x0 (0)
  UCHAR Enabled;  // offset: 0x2 (2)
  UCHAR Reserved; // offset: 0x3 (3)
};

// 0x3 (3) bytes
struct _WHEA_XPF_NMI_DESCRIPTOR {
  USHORT Type;   // offset: 0x0 (0)
  UCHAR Enabled; // offset: 0x2 (2)
};

// 0x10 (16) bytes
struct _TXN_PARAMETER_BLOCK {
  USHORT Length;           // offset: 0x0 (0)
  USHORT TxFsContext;      // offset: 0x2 (2)
  VOID *TransactionObject; // offset: 0x8 (8)
};

// 0x20 (32) bytes
struct _INTERFACE {
  USHORT Size;                              // offset: 0x0 (0)
  USHORT Version;                           // offset: 0x2 (2)
  VOID *Context;                            // offset: 0x8 (8)
  VOID (*InterfaceReference)(VOID *arg1);   // offset: 0x10 (16)
  VOID (*InterfaceDereference)(VOID *arg1); // offset: 0x18 (24)
};

// 0x10 (16) bytes
struct _ETW_FILTER_STRING_TOKEN_ELEMENT {
  USHORT Length; // offset: 0x0 (0)
  WCHAR *String; // offset: 0x8 (8)
};

// 0x40 (64) bytes
struct _IMAGE_DOS_HEADER {
  USHORT e_magic;    // offset: 0x0 (0)
  USHORT e_cblp;     // offset: 0x2 (2)
  USHORT e_cp;       // offset: 0x4 (4)
  USHORT e_crlc;     // offset: 0x6 (6)
  USHORT e_cparhdr;  // offset: 0x8 (8)
  USHORT e_minalloc; // offset: 0xa (10)
  USHORT e_maxalloc; // offset: 0xc (12)
  USHORT e_ss;       // offset: 0xe (14)
  USHORT e_sp;       // offset: 0x10 (16)
  USHORT e_csum;     // offset: 0x12 (18)
  USHORT e_ip;       // offset: 0x14 (20)
  USHORT e_cs;       // offset: 0x16 (22)
  USHORT e_lfarlc;   // offset: 0x18 (24)
  USHORT e_ovno;     // offset: 0x1a (26)
  USHORT e_res[4];   // offset: 0x1c (28)
  USHORT e_oemid;    // offset: 0x24 (36)
  USHORT e_oeminfo;  // offset: 0x26 (38)
  USHORT e_res2[10]; // offset: 0x28 (40)
  LONG e_lfanew;     // offset: 0x3c (60)
};

// 0x20 (32) bytes
struct _ETW_PMC_SUPPORT {
  enum _KPROFILE_SOURCE *Source;              // offset: 0x0 (0)
  volatile ULONG HookIdCount;                 // offset: 0x8 (8)
  USHORT HookId[4];                           // offset: 0xc (12)
  volatile ULONG CountersCount;               // offset: 0x14 (20)
  struct _HAL_PMC_COUNTERS *ProcessorCtrs[1]; // offset: 0x18 (24)
};

// 0x4 (4) bytes
struct _ETW_BUFFER_CONTEXT {
  union {
    struct {
      UCHAR ProcessorNumber; // offset: 0x0 (0)
      UCHAR Alignment;       // offset: 0x1 (1)
    };
    USHORT ProcessorIndex; // offset: 0x0 (0)
  };
  USHORT LoggerId; // offset: 0x2 (2)
};

// 0x18 (24) bytes
struct _ETW_FILTER_STRING_TOKEN {
  USHORT Count;                                      // offset: 0x0 (0)
  struct _ETW_FILTER_STRING_TOKEN_ELEMENT Tokens[1]; // offset: 0x8 (8)
};

// 0xa (10) bytes
struct _PROC_PERF_HISTORY_ENTRY {
  USHORT Utility;            // offset: 0x0 (0)
  USHORT AffinitizedUtility; // offset: 0x2 (2)
  USHORT Frequency;          // offset: 0x4 (4)
  UCHAR TaggedPercent[3];    // offset: 0x6 (6)
};

// 0x4 (4) bytes
struct _WNF_NODE_HEADER {
  USHORT NodeTypeCode; // offset: 0x0 (0)
  USHORT NodeByteSize; // offset: 0x2 (2)
};

// 0x4 (4) bytes
struct _PROCESSOR_NUMBER {
  USHORT Group;   // offset: 0x0 (0)
  UCHAR Number;   // offset: 0x2 (2)
  UCHAR Reserved; // offset: 0x3 (3)
};

// 0x10 (16) bytes
struct _KDESCRIPTOR {
  USHORT Pad[3]; // offset: 0x0 (0)
  USHORT Limit;  // offset: 0x6 (6)
  VOID *Base;    // offset: 0x8 (8)
};

// 0x4 (4) bytes
struct _MMSUPPORT_FLAGS {
  union {
    struct {
      UCHAR WorkingSetType : 3;        // offset: 0x0 (0)
      UCHAR Reserved0 : 3;             // offset: 0x0 (0)
      UCHAR MaximumWorkingSetHard : 1; // offset: 0x0 (0)
      UCHAR MinimumWorkingSetHard : 1; // offset: 0x0 (0)
      UCHAR SessionMaster : 1;         // offset: 0x1 (1)
      UCHAR TrimmerState : 2;          // offset: 0x1 (1)
      UCHAR Reserved : 1;              // offset: 0x1 (1)
      UCHAR PageStealers : 4;          // offset: 0x1 (1)
    };
    USHORT u1; // offset: 0x0 (0)
  };
  UCHAR MemoryPriority; // offset: 0x2 (2)
  union {
    struct {
      UCHAR WsleDeleted : 1;        // offset: 0x3 (3)
      UCHAR SvmEnabled : 1;         // offset: 0x3 (3)
      UCHAR ForceAge : 1;           // offset: 0x3 (3)
      UCHAR ForceTrim : 1;          // offset: 0x3 (3)
      UCHAR NewMaximum : 1;         // offset: 0x3 (3)
      UCHAR CommitReleaseState : 2; // offset: 0x3 (3)
    };
    UCHAR u2; // offset: 0x3 (3)
  };
};

// 0x10 (16) bytes
struct _EWOW64PROCESS {
  VOID *Peb;                       // offset: 0x0 (0)
  USHORT Machine;                  // offset: 0x8 (8)
  enum _SYSTEM_DLL_TYPE NtdllType; // offset: 0xc (12)
};

// 0x10 (16) bytes
struct _STRING {
  USHORT Length;        // offset: 0x0 (0)
  USHORT MaximumLength; // offset: 0x2 (2)
  CHAR *Buffer;         // offset: 0x8 (8)
};

// 0x18 (24) bytes
struct _SEP_CACHED_HANDLES_ENTRY_DESCRIPTOR {
  enum _SEP_CACHED_HANDLES_ENTRY_TYPE DescriptorType; // offset: 0x0 (0)
  union {
    VOID *PackageSid;                       // offset: 0x8 (8)
    struct _UNICODE_STRING IsolationPrefix; // offset: 0x8 (8)
  };
};

// 0x20 (32) bytes
struct _RELATIVE_SYMLINK_INFO {
  USHORT ExposedNamespaceLength;                     // offset: 0x0 (0)
  USHORT Flags;                                      // offset: 0x2 (2)
  USHORT DeviceNameLength;                           // offset: 0x4 (4)
  USHORT Reserved;                                   // offset: 0x6 (6)
  struct _RELATIVE_SYMLINK_INFO *InteriorMountPoint; // offset: 0x8 (8)
  struct _UNICODE_STRING OpenedName;                 // offset: 0x10 (16)
};

// 0x18 (24) bytes
struct _CURDIR {
  struct _UNICODE_STRING DosPath; // offset: 0x0 (0)
  VOID *Handle;                   // offset: 0x10 (16)
};

// 0x10 (16) bytes
struct _OBJECT_NAME_INFORMATION {
  struct _UNICODE_STRING Name; // offset: 0x0 (0)
};

// 0x8 (8) bytes
struct _SE_AUDIT_PROCESS_CREATION_INFO {
  struct _OBJECT_NAME_INFORMATION *ImageFileName; // offset: 0x0 (0)
};

// 0x30 (48) bytes
struct _SEP_SILOSTATE {
  struct _SEP_LOGON_SESSION_REFERENCES *SystemLogonSession; // offset: 0x0 (0)
  struct _SEP_LOGON_SESSION_REFERENCES
      *AnonymousLogonSession;             // offset: 0x8 (8)
  VOID *AnonymousLogonToken;              // offset: 0x10 (16)
  VOID *AnonymousLogonTokenNoEveryone;    // offset: 0x18 (24)
  struct _UNICODE_STRING *UncSystemPaths; // offset: 0x20 (32)
  struct _CI_NGEN_PATHS *NgenPaths;       // offset: 0x28 (40)
};

// 0x8 (8) bytes
struct _LDRP_CSLIST {
  struct _SINGLE_LIST_ENTRY *Tail; // offset: 0x0 (0)
};

// 0x8 (8) bytes
struct _SINGLE_LIST_ENTRY {
  struct _SINGLE_LIST_ENTRY *Next; // offset: 0x0 (0)
};

// 0x10 (16) bytes
struct _ETW_BUFFER_QUEUE {
  struct _SINGLE_LIST_ENTRY *QueueTail; // offset: 0x0 (0)
  struct _SINGLE_LIST_ENTRY QueueEntry; // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct _KDPC_LIST {
  struct _SINGLE_LIST_ENTRY ListHead;   // offset: 0x0 (0)
  struct _SINGLE_LIST_ENTRY *LastEntry; // offset: 0x8 (8)
};

// 0x8 (8) bytes
struct _ARBITER_QUERY_ARBITRATE_PARAMETERS {
  struct _LIST_ENTRY *ArbitrationList; // offset: 0x0 (0)
};

// 0x8 (8) bytes
struct _ARBITER_BOOT_ALLOCATION_PARAMETERS {
  struct _LIST_ENTRY *ArbitrationList; // offset: 0x0 (0)
};

// 0x10 (16) bytes
struct _LIST_ENTRY {
  struct _LIST_ENTRY *Flink; // offset: 0x0 (0)
  struct _LIST_ENTRY *Blink; // offset: 0x8 (8)
};

// 0x48 (72) bytes
struct _FAST_OWNER_ENTRY_INTERNAL {
  struct _LIST_ENTRY ListEntry;     // offset: 0x0 (0)
  UCHAR AbLockHandle;               // offset: 0x10 (16)
  UCHAR Disowned : 1;               // offset: 0x11 (17)
  UCHAR DynamicallyAllocated : 1;   // offset: 0x11 (17)
  UCHAR CallerExclusive : 1;        // offset: 0x11 (17)
  UCHAR IsSublistHead;              // offset: 0x12 (18)
  UCHAR IsWaiting;                  // offset: 0x13 (19)
  VOID *LockAddress;                // offset: 0x18 (24)
  VOID *ThreadAddress;              // offset: 0x20 (32)
  struct _LIST_ENTRY SublistHead;   // offset: 0x28 (40)
  struct _LIST_ENTRY LockListEntry; // offset: 0x38 (56)
};

// 0x20 (32) bytes
struct _TRIAGE_POP_IRP_DATA {
  struct _LIST_ENTRY Link;    // offset: 0x0 (0)
  struct _IRP *Irp;           // offset: 0x10 (16)
  struct _DEVICE_OBJECT *Pdo; // offset: 0x18 (24)
};

// 0x38 (56) bytes
struct _TRIAGE_POP_FX_DEVICE {
  struct _LIST_ENTRY Link;                // offset: 0x0 (0)
  struct _IRP *Irp;                       // offset: 0x10 (16)
  struct _TRIAGE_POP_IRP_DATA *IrpData;   // offset: 0x18 (24)
  LONG Status;                            // offset: 0x20 (32)
  LONG PowerReqCall;                      // offset: 0x24 (36)
  LONG PowerNotReqCall;                   // offset: 0x28 (40)
  struct _TRIAGE_DEVICE_NODE *DeviceNode; // offset: 0x30 (48)
};

// 0x58 (88) bytes
struct _TRIAGE_DEVICE_NODE {
  struct _TRIAGE_DEVICE_NODE *Sibling;         // offset: 0x0 (0)
  struct _TRIAGE_DEVICE_NODE *Child;           // offset: 0x8 (8)
  struct _TRIAGE_DEVICE_NODE *Parent;          // offset: 0x10 (16)
  struct _TRIAGE_DEVICE_NODE *LastChild;       // offset: 0x18 (24)
  struct _DEVICE_OBJECT *PhysicalDeviceObject; // offset: 0x20 (32)
  struct _UNICODE_STRING InstancePath;         // offset: 0x28 (40)
  struct _UNICODE_STRING ServiceName;          // offset: 0x38 (56)
  struct _IRP *PendingIrp;                     // offset: 0x48 (72)
  struct _TRIAGE_POP_FX_DEVICE *FxDevice;      // offset: 0x50 (80)
};

// 0x18 (24) bytes
struct _TRIAGE_PNP_DEVICE_COMPLETION_REQUEST {
  struct _LIST_ENTRY ListEntry;           // offset: 0x0 (0)
  struct _TRIAGE_DEVICE_NODE *DeviceNode; // offset: 0x10 (16)
};

// 0x40 (64) bytes
struct _POP_POLICY_DEVICE {
  struct _LIST_ENTRY Link;                  // offset: 0x0 (0)
  enum POWER_POLICY_DEVICE_TYPE DeviceType; // offset: 0x10 (16)
  VOID *Notification;                       // offset: 0x18 (24)
  struct _UNICODE_STRING Name;              // offset: 0x20 (32)
  struct _DEVICE_OBJECT *Device;            // offset: 0x30 (48)
  struct _IRP *Irp;                         // offset: 0x38 (56)
};

// 0x10 (16) bytes
struct _ARC_DISK_INFORMATION {
  struct _LIST_ENTRY DiskSignatures; // offset: 0x0 (0)
};

// 0x18 (24) bytes
struct _DELAY_ACK_FO {
  struct _LIST_ENTRY Links;                // offset: 0x0 (0)
  struct _FILE_OBJECT *OriginalFileObject; // offset: 0x10 (16)
};

// 0x10 (16) bytes
struct _TRIAGE_PNP_DEVICE_COMPLETION_QUEUE {
  struct _LIST_ENTRY DispatchedList; // offset: 0x0 (0)
};

// 0x30 (48) bytes
struct _POP_IRP_WORKER_ENTRY {
  struct _LIST_ENTRY Link;       // offset: 0x0 (0)
  struct _ETHREAD *Thread;       // offset: 0x10 (16)
  struct _IRP *Irp;              // offset: 0x18 (24)
  struct _DEVICE_OBJECT *Device; // offset: 0x20 (32)
  UCHAR Static;                  // offset: 0x28 (40)
};

// 0x18 (24) bytes
struct _CMP_VOLUME_MANAGER {
  struct _CMSI_RW_LOCK VolumeContextListLock; // offset: 0x0 (0)
  struct _LIST_ENTRY VolumeContextListHead;   // offset: 0x8 (8)
};

// 0x20 (32) bytes
struct _CMP_DISCARD_AND_REPLACE_KCB_CONTEXT {
  struct _CM_KEY_CONTROL_BLOCK *BaseKcb; // offset: 0x0 (0)
  LONG PrepareStatus;                    // offset: 0x8 (8)
  struct _LIST_ENTRY ClonedKcbListHead;  // offset: 0x10 (16)
};

// 0x30 (48) bytes
struct _CM_KCB_LAYER_INFO {
  struct _LIST_ENTRY LayerListEntry;     // offset: 0x0 (0)
  struct _CM_KEY_CONTROL_BLOCK *Kcb;     // offset: 0x10 (16)
  struct _CM_KCB_LAYER_INFO *LowerLayer; // offset: 0x18 (24)
  struct _LIST_ENTRY UpperLayerListHead; // offset: 0x20 (32)
};

// 0x10 (16) bytes
struct _MMWORKING_SET_EXPANSION_HEAD {
  struct _LIST_ENTRY ListHead; // offset: 0x0 (0)
};

// 0x18 (24) bytes
struct _HALP_EMERGENCY_LA_QUEUE_ENTRY {
  struct _LIST_ENTRY ListEntry;                 // offset: 0x0 (0)
  enum _HALP_EMERGENCY_LA_QUEUE_TYPE EntryType; // offset: 0x10 (16)
};

// 0x30 (48) bytes
struct _IO_TIMER {
  SHORT Type;                   // offset: 0x0 (0)
  SHORT TimerFlag;              // offset: 0x2 (2)
  struct _LIST_ENTRY TimerList; // offset: 0x8 (8)
  VOID (*TimerRoutine)
  (struct _DEVICE_OBJECT *arg1, VOID *arg2); // offset: 0x18 (24)
  VOID *Context;                             // offset: 0x20 (32)
  struct _DEVICE_OBJECT *DeviceObject;       // offset: 0x28 (40)
};

// 0x20 (32) bytes
struct _WORK_QUEUE_ITEM {
  struct _LIST_ENTRY List;           // offset: 0x0 (0)
  VOID (*WorkerRoutine)(VOID *arg1); // offset: 0x10 (16)
  VOID *Parameter;                   // offset: 0x18 (24)
};

// 0x30 (48) bytes
struct _WNF_DISPATCHER {
  struct _WNF_NODE_HEADER Header;   // offset: 0x0 (0)
  struct _WORK_QUEUE_ITEM WorkItem; // offset: 0x8 (8)
  LONG State;                       // offset: 0x28 (40)
};

// 0x28 (40) bytes
struct _MI_REBUILD_LARGE_PAGE_TIMER {
  struct _WORK_QUEUE_ITEM WorkItem; // offset: 0x0 (0)
  UCHAR SecondsLeft;                // offset: 0x20 (32)
  UCHAR RebuildActive;              // offset: 0x21 (33)
  UCHAR NextPassDelta;              // offset: 0x22 (34)
  UCHAR LargeSubPagesActive;        // offset: 0x23 (35)
};

// 0x28 (40) bytes
struct _MI_COMBINE_WORKITEM {
  VOID *NextEntry;                  // offset: 0x0 (0)
  struct _WORK_QUEUE_ITEM WorkItem; // offset: 0x8 (8)
};

// 0x38 (56) bytes
struct _MI_LDW_WORK_CONTEXT {
  struct _WORK_QUEUE_ITEM WorkItem; // offset: 0x0 (0)
  struct _FILE_OBJECT *FileObject;  // offset: 0x20 (32)
  LONG ErrorStatus;                 // offset: 0x28 (40)
  volatile LONG Active;             // offset: 0x2c (44)
  UCHAR FreeWhenDone;               // offset: 0x30 (48)
};

// 0x38 (56) bytes
struct _POP_FX_WORK_ORDER {
  struct _WORK_QUEUE_ITEM WorkItem; // offset: 0x0 (0)
  LONG WorkCount;                   // offset: 0x20 (32)
  VOID *Context;                    // offset: 0x28 (40)
  struct _POP_FX_WORK_ORDER_WATCHDOG_INFO
      *WatchdogTimerInfo; // offset: 0x30 (48)
};

// 0x18 (24) bytes
struct _DISPATCHER_HEADER {
  union {
    volatile LONG Lock; // offset: 0x0 (0)
    LONG LockNV;        // offset: 0x0 (0)
    struct {
      UCHAR Type;       // offset: 0x0 (0)
      UCHAR Signalling; // offset: 0x1 (1)
      UCHAR Size;       // offset: 0x2 (2)
      UCHAR Reserved1;  // offset: 0x3 (3)
    };
    struct {
      UCHAR TimerType; // offset: 0x0 (0)
      union {
        UCHAR TimerControlFlags; // offset: 0x1 (1)
        struct {
          UCHAR Absolute : 1;              // offset: 0x1 (1)
          UCHAR Wake : 1;                  // offset: 0x1 (1)
          UCHAR EncodedTolerableDelay : 6; // offset: 0x1 (1)
        };
      };
      UCHAR Hand; // offset: 0x2 (2)
      union {
        UCHAR TimerMiscFlags; // offset: 0x3 (3)
        struct {
          UCHAR Index : 6;            // offset: 0x3 (3)
          UCHAR Inserted : 1;         // offset: 0x3 (3)
          volatile UCHAR Expired : 1; // offset: 0x3 (3)
        };
      };
    };
    struct {
      UCHAR Timer2Type; // offset: 0x0 (0)
      union {
        UCHAR Timer2Flags; // offset: 0x1 (1)
        struct {
          UCHAR Timer2Inserted : 1;      // offset: 0x1 (1)
          UCHAR Timer2Expiring : 1;      // offset: 0x1 (1)
          UCHAR Timer2CancelPending : 1; // offset: 0x1 (1)
          UCHAR Timer2SetPending : 1;    // offset: 0x1 (1)
          UCHAR Timer2Running : 1;       // offset: 0x1 (1)
          UCHAR Timer2Disabled : 1;      // offset: 0x1 (1)
          UCHAR Timer2ReservedFlags : 2; // offset: 0x1 (1)
        };
      };
      UCHAR Timer2ComponentId; // offset: 0x2 (2)
      UCHAR Timer2RelativeId;  // offset: 0x3 (3)
    };
    struct {
      UCHAR QueueType; // offset: 0x0 (0)
      union {
        UCHAR QueueControlFlags; // offset: 0x1 (1)
        struct {
          UCHAR Abandoned : 1;                 // offset: 0x1 (1)
          UCHAR DisableIncrement : 1;          // offset: 0x1 (1)
          UCHAR QueueReservedControlFlags : 6; // offset: 0x1 (1)
        };
      };
      UCHAR QueueSize;     // offset: 0x2 (2)
      UCHAR QueueReserved; // offset: 0x3 (3)
    };
    struct {
      UCHAR ThreadType;     // offset: 0x0 (0)
      UCHAR ThreadReserved; // offset: 0x1 (1)
      union {
        UCHAR ThreadControlFlags; // offset: 0x2 (2)
        struct {
          UCHAR CycleProfiling : 1;             // offset: 0x2 (2)
          UCHAR CounterProfiling : 1;           // offset: 0x2 (2)
          UCHAR GroupScheduling : 1;            // offset: 0x2 (2)
          UCHAR AffinitySet : 1;                // offset: 0x2 (2)
          UCHAR Tagged : 1;                     // offset: 0x2 (2)
          UCHAR EnergyProfiling : 1;            // offset: 0x2 (2)
          UCHAR SchedulerAssist : 1;            // offset: 0x2 (2)
          UCHAR ThreadReservedControlFlags : 1; // offset: 0x2 (2)
        };
      };
      union {
        UCHAR DebugActive; // offset: 0x3 (3)
        struct {
          UCHAR ActiveDR7 : 1;    // offset: 0x3 (3)
          UCHAR Instrumented : 1; // offset: 0x3 (3)
          UCHAR Minimal : 1;      // offset: 0x3 (3)
          UCHAR Reserved4 : 2;    // offset: 0x3 (3)
          UCHAR AltSyscall : 1;   // offset: 0x3 (3)
          UCHAR UmsScheduled : 1; // offset: 0x3 (3)
          UCHAR UmsPrimary : 1;   // offset: 0x3 (3)
        };
      };
    };
    struct {
      UCHAR MutantType;     // offset: 0x0 (0)
      UCHAR MutantSize;     // offset: 0x1 (1)
      UCHAR DpcActive;      // offset: 0x2 (2)
      UCHAR MutantReserved; // offset: 0x3 (3)
    };
  };
  LONG SignalState;                // offset: 0x4 (4)
  struct _LIST_ENTRY WaitListHead; // offset: 0x8 (8)
};

// 0x38 (56) bytes
struct _KMUTANT {
  struct _DISPATCHER_HEADER Header;   // offset: 0x0 (0)
  struct _LIST_ENTRY MutantListEntry; // offset: 0x18 (24)
  struct _KTHREAD *OwnerThread;       // offset: 0x28 (40)
  union {
    UCHAR MutantFlags; // offset: 0x30 (48)
    struct {
      UCHAR Abandoned : 1;  // offset: 0x30 (48)
      UCHAR Spare1 : 7;     // offset: 0x30 (48)
      UCHAR Abandoned2 : 1; // offset: 0x30 (48)
      UCHAR AbEnabled : 1;  // offset: 0x30 (48)
      UCHAR Spare2 : 6;     // offset: 0x30 (48)
    };
  };
  UCHAR ApcDisable; // offset: 0x31 (49)
};

// 0x18 (24) bytes
struct _KGATE {
  struct _DISPATCHER_HEADER Header; // offset: 0x0 (0)
};

// 0x20 (32) bytes
struct _MI_EXTENT_DELETION_WAIT_BLOCK {
  struct _MI_EXTENT_DELETION_WAIT_BLOCK *Next; // offset: 0x0 (0)
  struct _KGATE Gate;                          // offset: 0x8 (8)
};

// 0x20 (32) bytes
struct _MI_LARGE_PAGE_LISTS_CHANGING {
  struct _MI_LARGE_PAGE_LISTS_CHANGING *Next; // offset: 0x0 (0)
  struct _KGATE Gate;                         // offset: 0x8 (8)
};

// 0x20 (32) bytes
struct _KSEMAPHORE {
  struct _DISPATCHER_HEADER Header; // offset: 0x0 (0)
  LONG Limit;                       // offset: 0x18 (24)
};

// 0x28 (40) bytes
struct _LPCP_NONPAGED_PORT_QUEUE {
  struct _KSEMAPHORE Semaphore;          // offset: 0x0 (0)
  struct _LPCP_PORT_OBJECT *BackPointer; // offset: 0x20 (32)
};

// 0x20 (32) bytes
struct _LPCP_PORT_QUEUE {
  struct _LPCP_NONPAGED_PORT_QUEUE *NonPagedPortQueue; // offset: 0x0 (0)
  struct _KSEMAPHORE *Semaphore;                       // offset: 0x8 (8)
  struct _LIST_ENTRY ReceiveHead;                      // offset: 0x10 (16)
};

// 0x50 (80) bytes
struct _MMDEREFERENCE_SEGMENT_HEADER {
  struct _KSEMAPHORE Semaphore;                   // offset: 0x0 (0)
  struct _LIST_ENTRY ControlAreaDeleteListHead;   // offset: 0x20 (32)
  struct _LIST_ENTRY UnusedSegmentDeleteListHead; // offset: 0x30 (48)
  struct _LIST_ENTRY PagefileExtensionListHead;   // offset: 0x40 (64)
};

// 0x18 (24) bytes
struct _KEVENT {
  struct _DISPATCHER_HEADER Header; // offset: 0x0 (0)
};

// 0x30 (48) bytes
struct _KWAIT_CHAIN_ENTRY {
  struct _LIST_ENTRY ListEntry; // offset: 0x0 (0)
  struct _KTHREAD *Thread;      // offset: 0x10 (16)
  struct _KEVENT Event;         // offset: 0x18 (24)
};

// 0x38 (56) bytes
struct _MI_RESUME_WORKITEM {
  struct _KEVENT ResumeCompleteEvent; // offset: 0x0 (0)
  struct _WORK_QUEUE_ITEM WorkItem;   // offset: 0x18 (24)
};

// 0x20 (32) bytes
struct _PALPC_PORT_REFERENCE_WAIT_BLOCK {
  struct _KEVENT DesiredReferenceNoEvent; // offset: 0x0 (0)
  LONG DesiredReferenceNo;                // offset: 0x18 (24)
};

// 0x20 (32) bytes
struct _CACHE_UNINITIALIZE_EVENT {
  struct _CACHE_UNINITIALIZE_EVENT *Next; // offset: 0x0 (0)
  struct _KEVENT Event;                   // offset: 0x8 (8)
};

// 0x28 (40) bytes
struct _HIVE_WAIT_PACKET {
  struct _KEVENT WakeEvent;       // offset: 0x0 (0)
  LONG Status;                    // offset: 0x18 (24)
  struct _HIVE_WAIT_PACKET *Next; // offset: 0x20 (32)
};

// 0x28 (40) bytes
struct _MMMOD_WRITER_LISTHEAD {
  struct _LIST_ENTRY ListHead; // offset: 0x0 (0)
  union {
    struct _KGATE Gate;   // offset: 0x10 (16)
    struct _KEVENT Event; // offset: 0x10 (16)
  };
};

// 0x20 (32) bytes
struct _IO_REMOVE_LOCK_COMMON_BLOCK {
  UCHAR Removed;              // offset: 0x0 (0)
  UCHAR Reserved[3];          // offset: 0x1 (1)
  LONG IoCount;               // offset: 0x4 (4)
  struct _KEVENT RemoveEvent; // offset: 0x8 (8)
};

// 0x20 (32) bytes
struct _IO_REMOVE_LOCK {
  struct _IO_REMOVE_LOCK_COMMON_BLOCK Common; // offset: 0x0 (0)
};

// 0x4 (4) bytes
union _MI_RESERVATION_CLUSTER_INFO {
  ULONG ClusterSize : 10;    // offset: 0x0 (0)
  ULONG SequenceNumber : 22; // offset: 0x0 (0)
  LONG EntireInfo;           // offset: 0x0 (0)
};

// 0x8 (8) bytes
struct _ACPI_METHOD_ARGUMENT_V1 {
  USHORT Type;       // offset: 0x0 (0)
  USHORT DataLength; // offset: 0x2 (2)
  union {
    ULONG Argument; // offset: 0x4 (4)
    UCHAR Data[1];  // offset: 0x4 (4)
  };
};

// 0x28 (40) bytes
struct _CALL_HASH_ENTRY {
  struct _LIST_ENTRY ListEntry; // offset: 0x0 (0)
  VOID *CallersAddress;         // offset: 0x10 (16)
  VOID *CallersCaller;          // offset: 0x18 (24)
  ULONG CallCount;              // offset: 0x20 (32)
};

// 0x4 (4) bytes
struct _OBJECT_HEADER_PADDING_INFO {
  ULONG PaddingAmount; // offset: 0x0 (0)
};

// 0x1c (28) bytes
struct _IMAGE_DEBUG_DIRECTORY {
  ULONG Characteristics;  // offset: 0x0 (0)
  ULONG TimeDateStamp;    // offset: 0x4 (4)
  USHORT MajorVersion;    // offset: 0x8 (8)
  USHORT MinorVersion;    // offset: 0xa (10)
  ULONG Type;             // offset: 0xc (12)
  ULONG SizeOfData;       // offset: 0x10 (16)
  ULONG AddressOfRawData; // offset: 0x14 (20)
  ULONG PointerToRawData; // offset: 0x18 (24)
};

// 0x14 (20) bytes
struct _NB10 {
  ULONG Signature; // offset: 0x0 (0)
  ULONG Offset;    // offset: 0x4 (4)
  ULONG TimeStamp; // offset: 0x8 (8)
  ULONG Age;       // offset: 0xc (12)
  CHAR PdbName[1]; // offset: 0x10 (16)
};

// 0x28 (40) bytes
struct _IMAGE_SECTION_HEADER {
  UCHAR Name[8]; // offset: 0x0 (0)
  union {
    ULONG PhysicalAddress; // offset: 0x8 (8)
    ULONG VirtualSize;     // offset: 0x8 (8)

  } Misc;                     // offset: 0x8 (8)
  ULONG VirtualAddress;       // offset: 0xc (12)
  ULONG SizeOfRawData;        // offset: 0x10 (16)
  ULONG PointerToRawData;     // offset: 0x14 (20)
  ULONG PointerToRelocations; // offset: 0x18 (24)
  ULONG PointerToLinenumbers; // offset: 0x1c (28)
  USHORT NumberOfRelocations; // offset: 0x20 (32)
  USHORT NumberOfLinenumbers; // offset: 0x22 (34)
  ULONG Characteristics;      // offset: 0x24 (36)
};

// 0x4 (4) bytes
struct _MMVAD_FLAGS2 {
  ULONG FileOffset : 24;        // offset: 0x0 (0)
  ULONG Large : 1;              // offset: 0x0 (0)
  ULONG TrimBehind : 1;         // offset: 0x0 (0)
  ULONG Inherit : 1;            // offset: 0x0 (0)
  ULONG NoValidationNeeded : 1; // offset: 0x0 (0)
  ULONG PrivateDemandZero : 1;  // offset: 0x0 (0)
  ULONG Spare : 3;              // offset: 0x0 (0)
};

// 0x20 (32) bytes
struct _VF_WATCHDOG_IRP {
  struct _LIST_ENTRY ListEntry; // offset: 0x0 (0)
  struct _IRP *Irp;             // offset: 0x10 (16)
  ULONG DueTickCount;           // offset: 0x18 (24)
  volatile UCHAR Inserted;      // offset: 0x1c (28)
  CHAR TrackedStackLocation;    // offset: 0x1d (29)
  USHORT CancelTimeoutTicks;    // offset: 0x1e (30)
};

// 0x10 (16) bytes
struct _LDR_SERVICE_TAG_RECORD {
  struct _LDR_SERVICE_TAG_RECORD *Next; // offset: 0x0 (0)
  ULONG ServiceTag;                     // offset: 0x8 (8)
};

// 0x50 (80) bytes
struct _LDR_DDAG_NODE {
  struct _LIST_ENTRY Modules;                     // offset: 0x0 (0)
  struct _LDR_SERVICE_TAG_RECORD *ServiceTagList; // offset: 0x10 (16)
  ULONG LoadCount;                                // offset: 0x18 (24)
  ULONG LoadWhileUnloadingCount;                  // offset: 0x1c (28)
  ULONG LowestLink;                               // offset: 0x20 (32)
  struct _LDRP_CSLIST Dependencies;               // offset: 0x28 (40)
  struct _LDRP_CSLIST IncomingDependencies;       // offset: 0x30 (48)
  enum _LDR_DDAG_STATE State;                     // offset: 0x38 (56)
  struct _SINGLE_LIST_ENTRY CondenseLink;         // offset: 0x40 (64)
  ULONG PreorderNumber;                           // offset: 0x48 (72)
};

// 0x1c (28) bytes
struct PROCESSOR_PERFSTATE_POLICY {
  ULONG Revision;         // offset: 0x0 (0)
  UCHAR MaxThrottle;      // offset: 0x4 (4)
  UCHAR MinThrottle;      // offset: 0x5 (5)
  UCHAR BusyAdjThreshold; // offset: 0x6 (6)
  union {
    UCHAR Spare; // offset: 0x7 (7)
    union {
      UCHAR AsUCHAR;                // offset: 0x7 (7)
      UCHAR NoDomainAccounting : 1; // offset: 0x7 (7)
      UCHAR IncreasePolicy : 2;     // offset: 0x7 (7)
      UCHAR DecreasePolicy : 2;     // offset: 0x7 (7)
      UCHAR Reserved : 3;           // offset: 0x7 (7)

    } Flags; // offset: 0x7 (7)
  };
  ULONG TimeCheck;       // offset: 0x8 (8)
  ULONG IncreaseTime;    // offset: 0xc (12)
  ULONG DecreaseTime;    // offset: 0x10 (16)
  ULONG IncreasePercent; // offset: 0x14 (20)
  ULONG DecreasePercent; // offset: 0x18 (24)
};

// 0x4 (4) bytes
union _PPM_IDLE_SYNCHRONIZATION_STATE {
  LONG AsLong;        // offset: 0x0 (0)
  LONG RefCount : 24; // offset: 0x0 (0)
  ULONG State : 8;    // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _CM_FAST_LEAF_HINT {
  union {
    UCHAR Characters[4]; // offset: 0x0 (0)
    ULONG FullHint;      // offset: 0x0 (0)
  };
};

// 0x8 (8) bytes
struct _LEARNING_MODE_DATA {
  ULONG Settings;              // offset: 0x0 (0)
  UCHAR Enabled;               // offset: 0x4 (4)
  UCHAR PermissiveModeEnabled; // offset: 0x5 (5)
};

// 0x40 (64) bytes
struct _WAITING_IRP {
  struct _LIST_ENTRY Links;                                 // offset: 0x0 (0)
  struct _IRP *Irp;                                         // offset: 0x10 (16)
  VOID (*CompletionRoutine)(VOID *arg1, struct _IRP *arg2); // offset: 0x18 (24)
  VOID *Context;                                            // offset: 0x20 (32)
  struct _KEVENT *Event;                                    // offset: 0x28 (40)
  ULONG Information;                                        // offset: 0x30 (48)
  UCHAR BreakAllRH;                                         // offset: 0x34 (52)
  UCHAR OplockBreakNotify;                                  // offset: 0x35 (53)
  struct _FILE_OBJECT *FileObject;                          // offset: 0x38 (56)
};

// 0x4 (4) bytes
union RTLP_HP_LFH_PERF_FLAGS {
  ULONG HotspotDetection : 1;            // offset: 0x0 (0)
  ULONG HotspotFullCommit : 1;           // offset: 0x0 (0)
  ULONG ActiveSubsegment : 1;            // offset: 0x0 (0)
  ULONG SmallerSubsegment : 1;           // offset: 0x0 (0)
  ULONG SingleAffinitySlot : 1;          // offset: 0x0 (0)
  ULONG ApplyLfhDecommitPolicy : 1;      // offset: 0x0 (0)
  ULONG EnableGarbageCollection : 1;     // offset: 0x0 (0)
  ULONG LargePagePreCommit : 1;          // offset: 0x0 (0)
  ULONG OpportunisticLargePreCommit : 1; // offset: 0x0 (0)
  ULONG LfhForcedAffinity : 1;           // offset: 0x0 (0)
  ULONG LfhCachelinePadding : 1;         // offset: 0x0 (0)
  ULONG AllFlags;                        // offset: 0x0 (0)
};

// 0x4 (4) bytes
union _PPM_COORDINATED_SYNCHRONIZATION {
  LONG AsLong;               // offset: 0x0 (0)
  ULONG EnterProcessor : 12; // offset: 0x0 (0)
  ULONG ExitProcessor : 12;  // offset: 0x0 (0)
  ULONG Transition : 2;      // offset: 0x0 (0)
  ULONG Entered : 1;         // offset: 0x0 (0)
  ULONG EntryPriority : 5;   // offset: 0x0 (0)
};

// 0x80 (128) bytes
struct _IOV_IRP_TRACE {
  struct _IRP *Irp;        // offset: 0x0 (0)
  struct _KTHREAD *Thread; // offset: 0x8 (8)
  union {
    struct {
      SHORT KernelApcDisable;  // offset: 0x10 (16)
      SHORT SpecialApcDisable; // offset: 0x12 (18)
    };
    ULONG CombinedApcDisable; // offset: 0x10 (16)
  };
  UCHAR Irql;           // offset: 0x14 (20)
  VOID *StackTrace[13]; // offset: 0x18 (24)
};

// 0x38 (56) bytes
struct _VI_TRACK_IRQL {
  VOID *Thread;        // offset: 0x0 (0)
  UCHAR OldIrql;       // offset: 0x8 (8)
  UCHAR NewIrql;       // offset: 0x9 (9)
  USHORT Processor;    // offset: 0xa (10)
  ULONG TickCount;     // offset: 0xc (12)
  VOID *StackTrace[5]; // offset: 0x10 (16)
};

// 0x4 (4) bytes
struct _HEAP_GLOBAL_APPCOMPAT_FLAGS {
  ULONG SafeInputValidation : 1;  // offset: 0x0 (0)
  ULONG Padding : 1;              // offset: 0x0 (0)
  ULONG CommitLFHSubsegments : 1; // offset: 0x0 (0)
  ULONG AllocateHeapFromEnv : 1;  // offset: 0x0 (0)
};

// 0x10 (16) bytes
struct _TEB_ACTIVE_FRAME_CONTEXT {
  ULONG Flags;           // offset: 0x0 (0)
  const CHAR *FrameName; // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct _VF_TRACKER {
  ULONG TrackerFlags; // offset: 0x0 (0)
  ULONG TrackerSize;  // offset: 0x4 (4)
  ULONG TrackerIndex; // offset: 0x8 (8)
  ULONG TraceDepth;   // offset: 0xc (12)
};

// 0xc (12) bytes
struct _IOP_IRP_EXTENSION_STATUS {
  ULONG Flags;      // offset: 0x0 (0)
  ULONG ActivityId; // offset: 0x4 (4)
  ULONG IoTracking; // offset: 0x8 (8)
};

// 0x4 (4) bytes
union _KSTACK_COUNT {
  LONG Value;            // offset: 0x0 (0)
  ULONG State : 3;       // offset: 0x0 (0)
  ULONG StackCount : 29; // offset: 0x0 (0)
};

// 0x18 (24) bytes
struct _RTL_ATOM_TABLE_REFERENCE {
  struct _LIST_ENTRY LowBoxList; // offset: 0x0 (0)
  ULONG LowBoxID;                // offset: 0x10 (16)
  USHORT ReferenceCount;         // offset: 0x14 (20)
  USHORT Flags;                  // offset: 0x16 (22)
};

// 0x30 (48) bytes
struct _RTL_ATOM_TABLE_ENTRY {
  struct _RTL_ATOM_TABLE_ENTRY *HashLink;     // offset: 0x0 (0)
  USHORT HandleIndex;                         // offset: 0x8 (8)
  USHORT Atom;                                // offset: 0xa (10)
  struct _RTL_ATOM_TABLE_REFERENCE Reference; // offset: 0x10 (16)
  UCHAR NameLength;                           // offset: 0x28 (40)
  WCHAR Name[1];                              // offset: 0x2a (42)
};

// 0x18 (24) bytes
struct _POP_ACTION_TRIGGER {
  enum POWER_POLICY_DEVICE_TYPE Type; // offset: 0x0 (0)
  ULONG Flags;                        // offset: 0x4 (4)
  struct _POP_TRIGGER_WAIT *Wait;     // offset: 0x8 (8)
  union {
    struct {
      ULONG PercentLevel; // offset: 0x0 (0)
    } Battery;            // offset: 0x10 (16)
    struct {
      ULONG Type; // offset: 0x0 (0)
    } Button;     // offset: 0x10 (16)
  };
};

// 0x38 (56) bytes
struct _POP_TRIGGER_WAIT {
  struct _KEVENT Event;                // offset: 0x0 (0)
  LONG Status;                         // offset: 0x18 (24)
  struct _LIST_ENTRY Link;             // offset: 0x20 (32)
  struct _POP_ACTION_TRIGGER *Trigger; // offset: 0x30 (48)
};

// 0x70 (112) bytes
struct _PI_BUS_EXTENSION {
  ULONG Flags;                                // offset: 0x0 (0)
  UCHAR NumberCSNs;                           // offset: 0x4 (4)
  UCHAR *ReadDataPort;                        // offset: 0x8 (8)
  UCHAR DataPortMapped;                       // offset: 0x10 (16)
  UCHAR *AddressPort;                         // offset: 0x18 (24)
  UCHAR AddrPortMapped;                       // offset: 0x20 (32)
  UCHAR *CommandPort;                         // offset: 0x28 (40)
  UCHAR CmdPortMapped;                        // offset: 0x30 (48)
  ULONG NextSlotNumber;                       // offset: 0x34 (52)
  struct _SINGLE_LIST_ENTRY DeviceList;       // offset: 0x38 (56)
  struct _SINGLE_LIST_ENTRY CardList;         // offset: 0x40 (64)
  struct _DEVICE_OBJECT *PhysicalBusDevice;   // offset: 0x48 (72)
  struct _DEVICE_OBJECT *FunctionalBusDevice; // offset: 0x50 (80)
  struct _DEVICE_OBJECT *AttachedDevice;      // offset: 0x58 (88)
  ULONG BusNumber;                            // offset: 0x60 (96)
  enum _SYSTEM_POWER_STATE SystemPowerState;  // offset: 0x64 (100)
  enum _DEVICE_POWER_STATE DevicePowerState;  // offset: 0x68 (104)
};

// 0x10 (16) bytes
struct _BUS_EXTENSION_LIST {
  VOID *Next;                             // offset: 0x0 (0)
  struct _PI_BUS_EXTENSION *BusExtension; // offset: 0x8 (8)
};

// 0x18 (24) bytes
struct _THERMAL_POLICY {
  ULONG Version;           // offset: 0x0 (0)
  UCHAR WaitForUpdate;     // offset: 0x4 (4)
  UCHAR Hibernate;         // offset: 0x5 (5)
  UCHAR Critical;          // offset: 0x6 (6)
  UCHAR ThermalStandby;    // offset: 0x7 (7)
  ULONG ActivationReasons; // offset: 0x8 (8)
  ULONG PassiveLimit;      // offset: 0xc (12)
  ULONG ActiveLevel;       // offset: 0x10 (16)
  UCHAR OverThrottled;     // offset: 0x14 (20)
};

// 0x8 (8) bytes
struct BATTERY_REPORTING_SCALE {
  ULONG Granularity; // offset: 0x0 (0)
  ULONG Capacity;    // offset: 0x4 (4)
};

// 0x4c (76) bytes
struct SYSTEM_POWER_CAPABILITIES {
  UCHAR PowerButtonPresent;                       // offset: 0x0 (0)
  UCHAR SleepButtonPresent;                       // offset: 0x1 (1)
  UCHAR LidPresent;                               // offset: 0x2 (2)
  UCHAR SystemS1;                                 // offset: 0x3 (3)
  UCHAR SystemS2;                                 // offset: 0x4 (4)
  UCHAR SystemS3;                                 // offset: 0x5 (5)
  UCHAR SystemS4;                                 // offset: 0x6 (6)
  UCHAR SystemS5;                                 // offset: 0x7 (7)
  UCHAR HiberFilePresent;                         // offset: 0x8 (8)
  UCHAR FullWake;                                 // offset: 0x9 (9)
  UCHAR VideoDimPresent;                          // offset: 0xa (10)
  UCHAR ApmPresent;                               // offset: 0xb (11)
  UCHAR UpsPresent;                               // offset: 0xc (12)
  UCHAR ThermalControl;                           // offset: 0xd (13)
  UCHAR ProcessorThrottle;                        // offset: 0xe (14)
  UCHAR ProcessorMinThrottle;                     // offset: 0xf (15)
  UCHAR ProcessorMaxThrottle;                     // offset: 0x10 (16)
  UCHAR FastSystemS4;                             // offset: 0x11 (17)
  UCHAR Hiberboot;                                // offset: 0x12 (18)
  UCHAR WakeAlarmPresent;                         // offset: 0x13 (19)
  UCHAR AoAc;                                     // offset: 0x14 (20)
  UCHAR DiskSpinDown;                             // offset: 0x15 (21)
  UCHAR HiberFileType;                            // offset: 0x16 (22)
  UCHAR AoAcConnectivitySupported;                // offset: 0x17 (23)
  UCHAR spare3[6];                                // offset: 0x18 (24)
  UCHAR SystemBatteriesPresent;                   // offset: 0x1e (30)
  UCHAR BatteriesAreShortTerm;                    // offset: 0x1f (31)
  struct BATTERY_REPORTING_SCALE BatteryScale[3]; // offset: 0x20 (32)
  enum _SYSTEM_POWER_STATE AcOnLineWake;          // offset: 0x38 (56)
  enum _SYSTEM_POWER_STATE SoftLidWake;           // offset: 0x3c (60)
  enum _SYSTEM_POWER_STATE RtcWake;               // offset: 0x40 (64)
  enum _SYSTEM_POWER_STATE MinDeviceWakeState;    // offset: 0x44 (68)
  enum _SYSTEM_POWER_STATE DefaultLowLatencyWake; // offset: 0x48 (72)
};

// 0x4 (4) bytes
union _MI_FLAGS {
  LONG EntireFlags;                       // offset: 0x0 (0)
  ULONG VerifierEnabled : 1;              // offset: 0x0 (0)
  ULONG KernelVerifierEnabled : 1;        // offset: 0x0 (0)
  ULONG LargePageKernel : 1;              // offset: 0x0 (0)
  ULONG StopOn4d : 1;                     // offset: 0x0 (0)
  ULONG InitializationPhase : 2;          // offset: 0x0 (0)
  ULONG PageKernelStacks : 1;             // offset: 0x0 (0)
  ULONG CheckZeroPages : 1;               // offset: 0x0 (0)
  ULONG ProcessorPrewalks : 1;            // offset: 0x0 (0)
  ULONG ProcessorPostwalks : 1;           // offset: 0x0 (0)
  ULONG CoverageBuild : 1;                // offset: 0x0 (0)
  ULONG AccessBitReplacementDisabled : 1; // offset: 0x0 (0)
  ULONG CheckExecute : 1;                 // offset: 0x0 (0)
  ULONG ProtectedPagesEnabled : 1;        // offset: 0x0 (0)
  ULONG SecureRelocations : 1;            // offset: 0x0 (0)
  ULONG StrongPageIdentity : 1;           // offset: 0x0 (0)
  ULONG StrongCodeGuarantees : 1;         // offset: 0x0 (0)
  ULONG HardCodeGuarantees : 1;           // offset: 0x0 (0)
  ULONG ExecutePagePrivilegeRequired : 1; // offset: 0x0 (0)
  ULONG SecureKernelCfgEnabled : 1;       // offset: 0x0 (0)
  ULONG FullHvci : 1;                     // offset: 0x0 (0)
  ULONG BootDebuggerActive : 1;           // offset: 0x0 (0)
  ULONG ExceptionHandlingReady : 1;       // offset: 0x0 (0)
  ULONG ShadowStacksSupported : 1;        // offset: 0x0 (0)
  ULONG AccessBitFenceRequired : 1;       // offset: 0x0 (0)
  ULONG PfnDatabaseExists : 1;            // offset: 0x0 (0)
  ULONG DeferredHotAddsCompleted : 1;     // offset: 0x0 (0)
  ULONG SystemPtesReady : 1;              // offset: 0x0 (0)
};

// 0x20 (32) bytes
struct _RTL_RANGE_LIST {
  struct _LIST_ENTRY ListHead; // offset: 0x0 (0)
  ULONG Flags;                 // offset: 0x10 (16)
  ULONG Count;                 // offset: 0x14 (20)
  ULONG Stamp;                 // offset: 0x18 (24)
};

// 0x8 (8) bytes
struct PROCESSOR_IDLESTATE_INFO {
  ULONG TimeCheck;      // offset: 0x0 (0)
  UCHAR DemotePercent;  // offset: 0x4 (4)
  UCHAR PromotePercent; // offset: 0x5 (5)
  UCHAR Spare[2];       // offset: 0x6 (6)
};

// 0x20 (32) bytes
struct PROCESSOR_IDLESTATE_POLICY {
  USHORT Revision; // offset: 0x0 (0)
  union {
    USHORT AsUSHORT;         // offset: 0x2 (2)
    USHORT AllowScaling : 1; // offset: 0x2 (2)
    USHORT Disabled : 1;     // offset: 0x2 (2)
    USHORT Reserved : 14;    // offset: 0x2 (2)

  } Flags;                                   // offset: 0x2 (2)
  ULONG PolicyCount;                         // offset: 0x4 (4)
  struct PROCESSOR_IDLESTATE_INFO Policy[3]; // offset: 0x8 (8)
};

// 0x4 (4) bytes
struct _MI_NODE_NUMBER_ZERO_BASED {
  ULONG ZeroBased; // offset: 0x0 (0)
};

// 0x10 (16) bytes
struct _MI_HUGE_SYSTEM_VIEW_HEAD {
  struct _RTL_AVL_TREE ViewRoot; // offset: 0x0 (0)
  ULONG ViewCount;               // offset: 0x8 (8)
  volatile LONG Lock;            // offset: 0xc (12)
};

// 0x8 (8) bytes
struct _MI_RESAVAIL_FAILURES {
  ULONG Wrap;     // offset: 0x0 (0)
  ULONG NoCharge; // offset: 0x4 (4)
};

// 0x8 (8) bytes
struct _MI_FORCED_COMMITS {
  ULONG Regular; // offset: 0x0 (0)
  ULONG Wrap;    // offset: 0x4 (4)
};

// 0x44 (68) bytes
struct _MI_PROBE_RAISE_TRACKER {
  ULONG UserRangeInKernel;              // offset: 0x0 (0)
  ULONG FaultFailed;                    // offset: 0x4 (4)
  ULONG WriteFaultFailed;               // offset: 0x8 (8)
  ULONG LargePageFailed;                // offset: 0xc (12)
  ULONG UserAccessToKernelPte;          // offset: 0x10 (16)
  ULONG BadPageLocation;                // offset: 0x14 (20)
  ULONG InsufficientCharge;             // offset: 0x18 (24)
  ULONG PageTableCharge;                // offset: 0x1c (28)
  ULONG NoPhysicalMapping;              // offset: 0x20 (32)
  ULONG NoIoReference;                  // offset: 0x24 (36)
  ULONG ProbeFailed;                    // offset: 0x28 (40)
  ULONG PteIsZero;                      // offset: 0x2c (44)
  ULONG StrongCodeWrite;                // offset: 0x30 (48)
  ULONG ReducedCloneCommitChargeFailed; // offset: 0x34 (52)
  ULONG CopyOnWriteAtDispatchNoPages;   // offset: 0x38 (56)
  ULONG NoPageTablesAllowed;            // offset: 0x3c (60)
  ULONG EnclavePageFailed;              // offset: 0x40 (64)
};

// 0x10 (16) bytes
struct _MM_SYSTEM_PAGE_COUNTS {
  ULONG SystemCodePage;        // offset: 0x0 (0)
  ULONG SystemDriverPage;      // offset: 0x4 (4)
  LONG TotalSystemCodePages;   // offset: 0x8 (8)
  LONG TotalSystemDriverPages; // offset: 0xc (12)
};

// 0x18 (24) bytes
struct _LOADER_FEATURE_CONFIGURATION_DIAGNOSTIC_INFORMATION {
  UCHAR OriginalBootStatus;  // offset: 0x0 (0)
  UCHAR NewBootStatus;       // offset: 0x1 (1)
  UCHAR ConfigurationLoaded; // offset: 0x2 (2)
  UCHAR Spare;               // offset: 0x3 (3)
  union {
    ULONG AllFlags;                              // offset: 0x4 (4)
    ULONG LkgSupported : 1;                      // offset: 0x4 (4)
    ULONG FinalBootBeforeRecovery : 1;           // offset: 0x4 (4)
    ULONG ConfigurationComparisonAttempted : 1;  // offset: 0x4 (4)
    ULONG CurrentConfigurationLoadAttempted : 1; // offset: 0x4 (4)
    ULONG LkgConfigurationLoadAttempted : 1;     // offset: 0x4 (4)
    ULONG UsageSubscriptionLoadAttempted : 1;    // offset: 0x4 (4)
    ULONG Spare : 26;                            // offset: 0x4 (4)

  } Flags;                             // offset: 0x4 (4)
  LONG ConfigurationComparisonStatus;  // offset: 0x8 (8)
  LONG CurrentConfigurationLoadStatus; // offset: 0xc (12)
  LONG LkgConfigurationLoadStatus;     // offset: 0x10 (16)
  LONG UsageSubscriptionLoadStatus;    // offset: 0x14 (20)
};

// 0x4 (4) bytes
struct _INPUT_MAPPING_ELEMENT {
  ULONG InputMappingId; // offset: 0x0 (0)
};

// 0xc (12) bytes
union _IOMMU_SVM_CAPABILITIES {
  ULONG AtsCapability : 1; // offset: 0x0 (0)
  ULONG PriCapability : 1; // offset: 0x0 (0)
  struct {
    ULONG PasidCapability : 1; // offset: 0x0 (0)
    struct {
      ULONG PasidMaxWidth : 5;           // offset: 0x0 (0)
      ULONG PasidExePerm : 1;            // offset: 0x0 (0)
      ULONG PasidPrivMode : 1;           // offset: 0x0 (0)
      ULONG AtsPageAlignedRequest : 1;   // offset: 0x0 (0)
      ULONG AtsGlobalInvalidate : 1;     // offset: 0x0 (0)
      ULONG AtsInvalidateQueueDepth : 5; // offset: 0x0 (0)
    } CapReg;                            // offset: 0x4 (4)
  };
  struct {
    ULONG Rsvd : 15; // offset: 0x8 (8)
  };
  ULONG AsULONG; // offset: 0x0 (0)
};

// 0x20 (32) bytes
struct _NETWORK_LOADER_BLOCK {
  UCHAR *DHCPServerACK;              // offset: 0x0 (0)
  ULONG DHCPServerACKLength;         // offset: 0x8 (8)
  UCHAR *BootServerReplyPacket;      // offset: 0x10 (16)
  ULONG BootServerReplyPacketLength; // offset: 0x18 (24)
};

// 0x4 (4) bytes
struct _DEVICE_FLAGS {
  ULONG Failed : 1;     // offset: 0x0 (0)
  ULONG ReadOnly : 1;   // offset: 0x0 (0)
  ULONG Removable : 1;  // offset: 0x0 (0)
  ULONG ConsoleIn : 1;  // offset: 0x0 (0)
  ULONG ConsoleOut : 1; // offset: 0x0 (0)
  ULONG Input : 1;      // offset: 0x0 (0)
  ULONG Output : 1;     // offset: 0x0 (0)
};

// 0x8 (8) bytes
struct _INTERRUPT_HT_INTR_INFO {
  union {
    struct {
      ULONG Mask : 1;            // offset: 0x0 (0)
      ULONG Polarity : 1;        // offset: 0x0 (0)
      ULONG MessageType : 3;     // offset: 0x0 (0)
      ULONG RequestEOI : 1;      // offset: 0x0 (0)
      ULONG DestinationMode : 1; // offset: 0x0 (0)
      ULONG MessageType3 : 1;    // offset: 0x0 (0)
      ULONG Destination : 8;     // offset: 0x0 (0)
      ULONG Vector : 8;          // offset: 0x0 (0)
      ULONG ExtendedAddress : 8; // offset: 0x0 (0)
    } bits;                      // offset: 0x0 (0)
    ULONG AsULONG;               // offset: 0x0 (0)

  } LowPart; // offset: 0x0 (0)
  union {
    struct {
      ULONG ExtendedDestination : 24; // offset: 0x0 (0)
      ULONG Reserved : 6;             // offset: 0x0 (0)
      ULONG PassPW : 1;               // offset: 0x0 (0)
      ULONG WaitingForEOI : 1;        // offset: 0x0 (0)
    } bits;                           // offset: 0x4 (4)
    ULONG AsULONG;                    // offset: 0x4 (4)

  } HighPart; // offset: 0x4 (4)
};

// 0x4 (4) bytes
struct _PCAT_FIRMWARE_INFORMATION {
  ULONG PlaceHolder; // offset: 0x0 (0)
};

// 0x14 (20) bytes
struct _LOADER_HIVE_RECOVERY_INFO {
  ULONG Recovered : 1;          // offset: 0x0 (0)
  ULONG LegacyRecovery : 1;     // offset: 0x0 (0)
  ULONG SoftRebootConflict : 1; // offset: 0x0 (0)
  ULONG MostRecentLog : 3;      // offset: 0x0 (0)
  ULONG Spare : 27;             // offset: 0x4 (4)
  ULONG LogNextSequence;        // offset: 0x8 (8)
  ULONG LogMinimumSequence;     // offset: 0xc (12)
  ULONG LogCurrentOffset;       // offset: 0x10 (16)
};

// 0x10 (16) bytes
struct _PROFILE_PARAMETER_BLOCK {
  USHORT Status;       // offset: 0x0 (0)
  USHORT Reserved;     // offset: 0x2 (2)
  USHORT DockingState; // offset: 0x4 (4)
  USHORT Capabilities; // offset: 0x6 (6)
  ULONG DockID;        // offset: 0x8 (8)
  ULONG SerialNumber;  // offset: 0xc (12)
};

// 0x28 (40) bytes
struct _CONFIGURATION_COMPONENT {
  enum _CONFIGURATION_CLASS Class; // offset: 0x0 (0)
  enum _CONFIGURATION_TYPE Type;   // offset: 0x4 (4)
  struct _DEVICE_FLAGS Flags;      // offset: 0x8 (8)
  USHORT Version;                  // offset: 0xc (12)
  USHORT Revision;                 // offset: 0xe (14)
  ULONG Key;                       // offset: 0x10 (16)
  union {
    ULONG AffinityMask; // offset: 0x14 (20)
    struct {
      USHORT Group;      // offset: 0x14 (20)
      USHORT GroupIndex; // offset: 0x16 (22)
    };
  };
  ULONG ConfigurationDataLength; // offset: 0x18 (24)
  ULONG IdentifierLength;        // offset: 0x1c (28)
  CHAR *Identifier;              // offset: 0x20 (32)
};

// 0x48 (72) bytes
struct _CONFIGURATION_COMPONENT_DATA {
  struct _CONFIGURATION_COMPONENT_DATA *Parent;   // offset: 0x0 (0)
  struct _CONFIGURATION_COMPONENT_DATA *Child;    // offset: 0x8 (8)
  struct _CONFIGURATION_COMPONENT_DATA *Sibling;  // offset: 0x10 (16)
  struct _CONFIGURATION_COMPONENT ComponentEntry; // offset: 0x18 (24)
  VOID *ConfigurationData;                        // offset: 0x40 (64)
};

// 0x28 (40) bytes
struct _SUPPORTED_RANGE {
  struct _SUPPORTED_RANGE *Next; // offset: 0x0 (0)
  ULONG SystemAddressSpace;      // offset: 0x8 (8)
  LONGLONG SystemBase;           // offset: 0x10 (16)
  LONGLONG Base;                 // offset: 0x18 (24)
  LONGLONG Limit;                // offset: 0x20 (32)
};

// 0x4 (4) bytes
struct _FAULT_INFORMATION_X64_FLAGS {
  ULONG FaultAddressValid : 1; // offset: 0x0 (0)
  ULONG Reserved : 31;         // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _FAULT_INFORMATION_ARM64_FLAGS {
  ULONG WriteNotRead : 1;       // offset: 0x0 (0)
  ULONG InstructionNotData : 1; // offset: 0x0 (0)
  ULONG Privileged : 1;         // offset: 0x0 (0)
  ULONG FaultAddressValid : 1;  // offset: 0x0 (0)
  ULONG Reserved : 28;          // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _ARM_LOADER_BLOCK {
  ULONG PlaceHolder; // offset: 0x0 (0)
};

// 0x10 (16) bytes
struct _I386_LOADER_BLOCK {
  VOID *CommonDataArea; // offset: 0x0 (0)
  ULONG MachineType;    // offset: 0x8 (8)
  ULONG VirtualBias;    // offset: 0xc (12)
};

// 0x18 (24) bytes
struct DEBUG_DEVICE_ADDRESS {
  UCHAR Type;  // offset: 0x0 (0)
  UCHAR Valid; // offset: 0x1 (1)
  union {
    UCHAR Reserved[2]; // offset: 0x2 (2)
    struct {
      UCHAR BitWidth;   // offset: 0x2 (2)
      UCHAR AccessSize; // offset: 0x3 (3)
    };
  };
  UCHAR *TranslatedAddress; // offset: 0x8 (8)
  ULONG Length;             // offset: 0x10 (16)
};

// 0xc0 (192) bytes
struct _SUPPORTED_RANGES {
  USHORT Version;                         // offset: 0x0 (0)
  UCHAR Sorted;                           // offset: 0x2 (2)
  UCHAR Reserved;                         // offset: 0x3 (3)
  ULONG NoIO;                             // offset: 0x4 (4)
  struct _SUPPORTED_RANGE IO;             // offset: 0x8 (8)
  ULONG NoMemory;                         // offset: 0x30 (48)
  struct _SUPPORTED_RANGE Memory;         // offset: 0x38 (56)
  ULONG NoPrefetchMemory;                 // offset: 0x60 (96)
  struct _SUPPORTED_RANGE PrefetchMemory; // offset: 0x68 (104)
  ULONG NoDma;                            // offset: 0x90 (144)
  struct _SUPPORTED_RANGE Dma;            // offset: 0x98 (152)
};

// 0x8 (8) bytes
struct _DEBUG_TRANSPORT_DATA {
  ULONG HwContextSize;    // offset: 0x0 (0)
  UCHAR UseSerialFraming; // offset: 0x4 (4)
  UCHAR ValidUSBCoreId;   // offset: 0x5 (5)
  UCHAR USBCoreId;        // offset: 0x6 (6)
};

// 0x20 (32) bytes
struct _HAL_UNMASKED_INTERRUPT_INFORMATION {
  USHORT Version;                            // offset: 0x0 (0)
  USHORT Size;                               // offset: 0x2 (2)
  union _HAL_UNMASKED_INTERRUPT_FLAGS Flags; // offset: 0x4 (4)
  enum _KINTERRUPT_MODE Mode;                // offset: 0x8 (8)
  enum _KINTERRUPT_POLARITY Polarity;        // offset: 0xc (12)
  ULONG Gsiv;                                // offset: 0x10 (16)
  USHORT PinNumber;                          // offset: 0x14 (20)
  VOID *DeviceHandle;                        // offset: 0x18 (24)
};

// 0xc (12) bytes
struct _PCI_BUSMASTER_DESCRIPTOR {
  enum _PCI_BUSMASTER_RID_TYPE Type; // offset: 0x0 (0)
  ULONG Segment;                     // offset: 0x4 (4)
  union {
    struct {
      UCHAR Bus;      // offset: 0x0 (0)
      UCHAR Device;   // offset: 0x1 (1)
      UCHAR Function; // offset: 0x2 (2)
      UCHAR Reserved; // offset: 0x3 (3)
    } DeviceRid;      // offset: 0x8 (8)
    struct {
      UCHAR Bus;      // offset: 0x0 (0)
      UCHAR Device;   // offset: 0x1 (1)
      UCHAR Function; // offset: 0x2 (2)
      UCHAR Reserved; // offset: 0x3 (3)
    } BridgeRid;      // offset: 0x8 (8)
    struct {
      UCHAR SecondaryBus;   // offset: 0x0 (0)
      UCHAR SubordinateBus; // offset: 0x1 (1)
    } MultipleBridges;      // offset: 0x8 (8)
  };
};

// 0x10 (16) bytes
struct _HAL_LOG_REGISTER_CONTEXT {
  VOID (*LogRoutine)(ULONG arg1, VOID *arg2, ULONG arg3); // offset: 0x0 (0)
  ULONG Flag;                                             // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct _INTERRUPT_REMAPPING_INFO {
  ULONG IrtIndex : 30;       // offset: 0x0 (0)
  ULONG FlagHalInternal : 1; // offset: 0x0 (0)
  ULONG FlagTranslated : 1;  // offset: 0x0 (0)
  union {
    struct {
      ULONG MessageAddressHigh; // offset: 0x0 (0)
      ULONG MessageAddressLow;  // offset: 0x4 (4)
      USHORT MessageData;       // offset: 0x8 (8)
      USHORT Reserved;          // offset: 0xa (10)
    } Msi;                      // offset: 0x4 (4)

  } u; // offset: 0x4 (4)
};

// 0xc (12) bytes
struct POWER_ACTION_POLICY {
  enum POWER_ACTION Action; // offset: 0x0 (0)
  ULONG Flags;              // offset: 0x4 (4)
  ULONG EventCode;          // offset: 0x8 (8)
};

// 0x18 (24) bytes
struct SYSTEM_POWER_LEVEL {
  UCHAR Enable;                            // offset: 0x0 (0)
  UCHAR Spare[3];                          // offset: 0x1 (1)
  ULONG BatteryLevel;                      // offset: 0x4 (4)
  struct POWER_ACTION_POLICY PowerPolicy;  // offset: 0x8 (8)
  enum _SYSTEM_POWER_STATE MinSystemState; // offset: 0x14 (20)
};

// 0x28 (40) bytes
struct _VF_SUSPECT_DRIVER_ENTRY {
  struct _LIST_ENTRY Links;        // offset: 0x0 (0)
  ULONG Loads;                     // offset: 0x10 (16)
  ULONG Unloads;                   // offset: 0x14 (20)
  struct _UNICODE_STRING BaseName; // offset: 0x18 (24)
};

// 0x4 (4) bytes
struct _HEAP_STOP_ON_TAG {
  union {
    ULONG HeapAndTagIndex; // offset: 0x0 (0)
    struct {
      USHORT TagIndex;  // offset: 0x0 (0)
      USHORT HeapIndex; // offset: 0x2 (2)
    };
  };
};

// 0xc (12) bytes
struct _OBJECT_REF_STACK_INFO {
  ULONG Sequence;   // offset: 0x0 (0)
  USHORT Index;     // offset: 0x4 (4)
  USHORT NumTraces; // offset: 0x6 (6)
  ULONG Tag;        // offset: 0x8 (8)
};

// 0x48 (72) bytes
struct _PO_NOTIFY_ORDER_LEVEL {
  ULONG DeviceCount;             // offset: 0x0 (0)
  ULONG ActiveCount;             // offset: 0x4 (4)
  struct _LIST_ENTRY WaitSleep;  // offset: 0x8 (8)
  struct _LIST_ENTRY ReadySleep; // offset: 0x18 (24)
  struct _LIST_ENTRY ReadyS0;    // offset: 0x28 (40)
  struct _LIST_ENTRY WaitS0;     // offset: 0x38 (56)
};

// 0x180 (384) bytes
struct _PO_DEVICE_NOTIFY_ORDER {
  UCHAR Locked;                                // offset: 0x0 (0)
  struct _DEVICE_OBJECT **WarmEjectPdoPointer; // offset: 0x8 (8)
  struct _PO_NOTIFY_ORDER_LEVEL OrderLevel[5]; // offset: 0x10 (16)
  ULONG Flags;                                 // offset: 0x178 (376)
};

// 0x2b0 (688) bytes
struct _KPRIQUEUE {
  struct _DISPATCHER_HEADER Header;     // offset: 0x0 (0)
  struct _LIST_ENTRY EntryListHead[32]; // offset: 0x18 (24)
  volatile LONG CurrentCount[32];       // offset: 0x218 (536)
  ULONG MaximumCount;                   // offset: 0x298 (664)
  struct _LIST_ENTRY ThreadListHead;    // offset: 0x2a0 (672)
};

// 0x2b0 (688) bytes
struct _TRIAGE_EX_WORK_QUEUE {
  struct _KPRIQUEUE WorkPriQueue; // offset: 0x0 (0)
};

// 0x28 (40) bytes
struct _TRIAGE_9F_POWER {
  USHORT Signature;                                 // offset: 0x0 (0)
  USHORT Revision;                                  // offset: 0x2 (2)
  struct _LIST_ENTRY *IrpList;                      // offset: 0x8 (8)
  struct _LIST_ENTRY *ThreadList;                   // offset: 0x10 (16)
  struct _TRIAGE_EX_WORK_QUEUE *DelayedWorkQueue;   // offset: 0x18 (24)
  struct _TRIAGE_EX_WORK_QUEUE *DelayedIoWorkQueue; // offset: 0x20 (32)
};

// 0x20 (32) bytes
struct _TRIAGE_9F_PNP {
  USHORT Signature; // offset: 0x0 (0)
  USHORT Revision;  // offset: 0x2 (2)
  struct _TRIAGE_PNP_DEVICE_COMPLETION_QUEUE
      *CompletionQueue;                             // offset: 0x8 (8)
  struct _TRIAGE_EX_WORK_QUEUE *DelayedWorkQueue;   // offset: 0x10 (16)
  struct _TRIAGE_EX_WORK_QUEUE *DelayedIoWorkQueue; // offset: 0x18 (24)
};

// 0x48 (72) bytes
struct _SK_CRASH_MODULE {
  WCHAR ImageName[32]; // offset: 0x0 (0)
  ULONG SizeOfImage;   // offset: 0x40 (64)
  ULONG TimeDateStamp; // offset: 0x44 (68)
};

// 0x38 (56) bytes
struct _VI_DEADLOCK_THREAD {
  struct _KTHREAD *Thread;                    // offset: 0x0 (0)
  struct _VI_DEADLOCK_NODE *CurrentSpinNode;  // offset: 0x8 (8)
  struct _VI_DEADLOCK_NODE *CurrentOtherNode; // offset: 0x10 (16)
  union {
    struct _LIST_ENTRY ListEntry;     // offset: 0x18 (24)
    struct _LIST_ENTRY FreeListEntry; // offset: 0x18 (24)
  };
  ULONG NodeCount;            // offset: 0x28 (40)
  volatile ULONG PagingCount; // offset: 0x2c (44)
  UCHAR ThreadUsesEresources; // offset: 0x30 (48)
};

// 0xf8 (248) bytes
struct _VI_DEADLOCK_RESOURCE {
  enum _VI_DEADLOCK_RESOURCE_TYPE Type;    // offset: 0x0 (0)
  ULONG NodeCount : 16;                    // offset: 0x4 (4)
  ULONG RecursionCount : 16;               // offset: 0x4 (4)
  VOID *ResourceAddress;                   // offset: 0x8 (8)
  struct _VI_DEADLOCK_THREAD *ThreadOwner; // offset: 0x10 (16)
  struct _LIST_ENTRY ResourceList;         // offset: 0x18 (24)
  union {
    struct _LIST_ENTRY HashChainList; // offset: 0x28 (40)
    struct _LIST_ENTRY FreeListEntry; // offset: 0x28 (40)
  };
  VOID *StackTrace[8];       // offset: 0x38 (56)
  VOID *LastAcquireTrace[8]; // offset: 0x78 (120)
  VOID *LastReleaseTrace[8]; // offset: 0xb8 (184)
};

// 0xd0 (208) bytes
struct _VI_DEADLOCK_NODE {
  struct _VI_DEADLOCK_NODE *Parent; // offset: 0x0 (0)
  struct _LIST_ENTRY ChildrenList;  // offset: 0x8 (8)
  struct _LIST_ENTRY SiblingsList;  // offset: 0x18 (24)
  union {
    struct _LIST_ENTRY ResourceList;  // offset: 0x28 (40)
    struct _LIST_ENTRY FreeListEntry; // offset: 0x28 (40)
  };
  struct _VI_DEADLOCK_RESOURCE *Root;      // offset: 0x38 (56)
  struct _VI_DEADLOCK_THREAD *ThreadEntry; // offset: 0x40 (64)
  union {
    ULONG Active : 1;             // offset: 0x48 (72)
    ULONG OnlyTryAcquireUsed : 1; // offset: 0x48 (72)
    ULONG ReleasedOutOfOrder : 1; // offset: 0x48 (72)
    ULONG SequenceNumber : 29;    // offset: 0x48 (72)
    ULONG Whole;                  // offset: 0x48 (72)

  } u1;                      // offset: 0x48 (72)
  LONG ChildrenCount;        // offset: 0x4c (76)
  VOID *StackTrace[8];       // offset: 0x50 (80)
  VOID *ParentStackTrace[8]; // offset: 0x90 (144)
};

// 0x10 (16) bytes
struct _WNF_STATE_DATA {
  struct _WNF_NODE_HEADER Header; // offset: 0x0 (0)
  ULONG AllocatedSize;            // offset: 0x4 (4)
  ULONG DataSize;                 // offset: 0x8 (8)
  ULONG ChangeStamp;              // offset: 0xc (12)
};

// 0x4 (4) bytes
union _WHEAP_ERROR_RECORD_WRAPPER_FLAGS {
  ULONG Preallocated : 1;            // offset: 0x0 (0)
  ULONG FromPersistentStore : 1;     // offset: 0x0 (0)
  ULONG PlatformPfaControl : 1;      // offset: 0x0 (0)
  ULONG PlatformDirectedOffline : 1; // offset: 0x0 (0)
  ULONG Reserved : 28;               // offset: 0x0 (0)
  ULONG AsULONG;                     // offset: 0x0 (0)
};

// 0x38 (56) bytes
struct _WHEAP_ERROR_SOURCE_TABLE {
  ULONG Signature;           // offset: 0x0 (0)
  LONG Count;                // offset: 0x4 (4)
  ULONG NextId;              // offset: 0x8 (8)
  struct _LIST_ENTRY Items;  // offset: 0x10 (16)
  struct _KEVENT InsertLock; // offset: 0x20 (32)
};

// 0x28 (40) bytes
struct _OBP_LOOKUP_CONTEXT {
  struct _OBJECT_DIRECTORY *Directory;        // offset: 0x0 (0)
  VOID *Object;                               // offset: 0x8 (8)
  struct _OBJECT_DIRECTORY_ENTRY **EntryLink; // offset: 0x10 (16)
  ULONG HashValue;                            // offset: 0x18 (24)
  USHORT HashIndex;                           // offset: 0x1c (28)
  UCHAR DirectoryLocked;                      // offset: 0x1e (30)
  UCHAR LockedExclusive;                      // offset: 0x1f (31)
  ULONG LockStateSignature;                   // offset: 0x20 (32)
};

// 0x20 (32) bytes
struct _OBJECT_HEADER_CREATOR_INFO {
  struct _LIST_ENTRY TypeList;  // offset: 0x0 (0)
  VOID *CreatorUniqueProcess;   // offset: 0x10 (16)
  USHORT CreatorBackTraceIndex; // offset: 0x18 (24)
  USHORT Reserved1;             // offset: 0x1a (26)
  ULONG Reserved2;              // offset: 0x1c (28)
};

// 0x20 (32) bytes
struct _OBJECT_HEADER_NAME_INFO {
  struct _OBJECT_DIRECTORY *Directory; // offset: 0x0 (0)
  struct _UNICODE_STRING Name;         // offset: 0x8 (8)
  LONG ReferenceCount;                 // offset: 0x18 (24)
  ULONG Reserved;                      // offset: 0x1c (28)
};

// 0x58 (88) bytes
struct _IOP_FILE_OBJECT_EXTENSION {
  ULONG FoExtFlags;                         // offset: 0x0 (0)
  VOID *FoExtPerTypeExtension[9];           // offset: 0x8 (8)
  enum _IOP_PRIORITY_HINT FoIoPriorityHint; // offset: 0x50 (80)
};

// 0x10 (16) bytes
struct _OB_EXTENDED_PARSE_PARAMETERS {
  USHORT Length;              // offset: 0x0 (0)
  ULONG RestrictedAccessMask; // offset: 0x4 (4)
  struct _EJOB *Silo;         // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct _OBJECT_DUMP_CONTROL {
  VOID *Stream; // offset: 0x0 (0)
  ULONG Detail; // offset: 0x8 (8)
};

// 0x30 (48) bytes
struct _OBJECT_ATTRIBUTES {
  ULONG Length;                       // offset: 0x0 (0)
  VOID *RootDirectory;                // offset: 0x8 (8)
  struct _UNICODE_STRING *ObjectName; // offset: 0x10 (16)
  ULONG Attributes;                   // offset: 0x18 (24)
  VOID *SecurityDescriptor;           // offset: 0x20 (32)
  VOID *SecurityQualityOfService;     // offset: 0x28 (40)
};

// 0x8 (8) bytes
struct _ALPC_WORK_ON_BEHALF_TICKET {
  ULONG ThreadId;              // offset: 0x0 (0)
  ULONG ThreadCreationTimeLow; // offset: 0x4 (4)
};

// 0x8 (8) bytes
struct _KALPC_WORK_ON_BEHALF_DATA {
  struct _ALPC_WORK_ON_BEHALF_TICKET Ticket; // offset: 0x0 (0)
};

// 0x8 (8) bytes
struct _BLOB_COUNTERS {
  ULONG CreatedObjects; // offset: 0x0 (0)
  ULONG DeletedObjects; // offset: 0x4 (4)
};

// 0x8 (8) bytes
struct _ALPC_MESSAGE_ATTRIBUTES {
  ULONG AllocatedAttributes; // offset: 0x0 (0)
  ULONG ValidAttributes;     // offset: 0x4 (4)
};

// 0x10 (16) bytes
struct _HEAP_EXTENDED_ENTRY {
  VOID *Reserved; // offset: 0x0 (0)
  union {
    struct {
      USHORT FunctionIndex; // offset: 0x8 (8)
      USHORT ContextValue;  // offset: 0xa (10)
    };
    ULONG InterceptorValue; // offset: 0x8 (8)
  };
  USHORT UnusedBytesLength;     // offset: 0xc (12)
  UCHAR EntryOffset;            // offset: 0xe (14)
  UCHAR ExtendedBlockSignature; // offset: 0xf (15)
};

// 0x4 (4) bytes
struct _HEAP_DESCRIPTOR_KEY {
  union {
    ULONG Key; // offset: 0x0 (0)
    struct {
      ULONG EncodedCommittedPageCount : 16; // offset: 0x0 (0)
      ULONG LargePageCost : 8;              // offset: 0x0 (0)
      ULONG UnitCount : 8;                  // offset: 0x0 (0)
    };
  };
};

// 0x4 (4) bytes
struct _HEAP_LFH_SUBSEGMENT_ENCODED_OFFSETS {
  union {
    struct {
      USHORT BlockSize;        // offset: 0x0 (0)
      USHORT FirstBlockOffset; // offset: 0x2 (2)
    };
    ULONG EncodedData; // offset: 0x0 (0)
  };
};

// 0x4 (4) bytes
struct _RTL_HP_VS_CONFIG {
  struct {
    ULONG PageAlignLargeAllocs : 1; // offset: 0x0 (0)
    ULONG FullDecommit : 1;         // offset: 0x0 (0)
    ULONG EnableDelayFree : 1;      // offset: 0x0 (0)
  } Flags;                          // offset: 0x0 (0)
};

// 0x8 (8) bytes
struct _RTL_HP_SUB_ALLOCATOR_CONFIGS {
  struct _RTL_HP_LFH_CONFIG LfhConfigs; // offset: 0x0 (0)
  struct _RTL_HP_VS_CONFIG VsConfigs;   // offset: 0x4 (4)
};

// 0x20 (32) bytes
struct VACB_LEVEL_ALLOCATION_LIST {
  struct _LIST_ENTRY VacbLevelList; // offset: 0x0 (0)
  VOID *VacbLevelWithBcbListHeads;  // offset: 0x10 (16)
  ULONG VacbLevelsAllocated;        // offset: 0x18 (24)
};

// 0x20 (32) bytes
struct _CC_ASYNC_READ_CONTEXT {
  UCHAR (*CompletionRoutine)(VOID *arg1); // offset: 0x0 (0)
  VOID *Context;                          // offset: 0x8 (8)
  struct _MDL *Mdl;                       // offset: 0x10 (16)
  CHAR RequestorMode;                     // offset: 0x18 (24)
  ULONG NestingLevel;                     // offset: 0x1c (28)
};

// 0x194 (404) bytes
struct _ASYNC_READ_THREAD_STATS {
  ULONG CurrentLoad[101]; // offset: 0x0 (0)
};

// 0x10 (16) bytes
struct _VACB_ARRAY_HEADER {
  ULONG VacbArrayIndex;     // offset: 0x0 (0)
  ULONG MappingCount;       // offset: 0x4 (4)
  ULONG HighestMappedIndex; // offset: 0x8 (8)
  ULONG Reserved;           // offset: 0xc (12)
};

// 0x8 (8) bytes
struct _WRITE_BEHIND_THROUGHPUT {
  ULONG PagesYetToWrite; // offset: 0x0 (0)
  ULONG Throughput;      // offset: 0x4 (4)
};

// 0x18 (24) bytes
struct _SHARED_CACHE_MAP_LIST_CURSOR {
  struct _LIST_ENTRY SharedCacheMapLinks; // offset: 0x0 (0)
  ULONG Flags;                            // offset: 0x10 (16)
};

// 0x4 (4) bytes
struct _PRIVATE_CACHE_MAP_FLAGS {
  ULONG DontUse : 16;           // offset: 0x0 (0)
  ULONG ReadAheadActive : 1;    // offset: 0x0 (0)
  ULONG ReadAheadEnabled : 1;   // offset: 0x0 (0)
  ULONG PagePriority : 3;       // offset: 0x0 (0)
  ULONG PipelineReadAheads : 1; // offset: 0x0 (0)
  ULONG Available : 10;         // offset: 0x0 (0)
};

// 0x4 (4) bytes
union _POP_FX_DEVICE_STATUS {
  LONG Value;                             // offset: 0x0 (0)
  ULONG SystemTransition : 1;             // offset: 0x0 (0)
  ULONG PepD0Notify : 1;                  // offset: 0x0 (0)
  ULONG IdleTimerOn : 1;                  // offset: 0x0 (0)
  ULONG IgnoreIdleTimeout : 1;            // offset: 0x0 (0)
  ULONG IrpInUse : 1;                     // offset: 0x0 (0)
  ULONG IrpPending : 1;                   // offset: 0x0 (0)
  ULONG DPNRDeviceNotified : 1;           // offset: 0x0 (0)
  ULONG DPNRReceivedFromPep : 1;          // offset: 0x0 (0)
  ULONG IrpFirstPendingIndex : 1;         // offset: 0x0 (0)
  ULONG IrpLastPendingIndex : 1;          // offset: 0x0 (0)
  ULONG SIrpBlocked : 1;                  // offset: 0x0 (0)
  ULONG BlockFastResume : 1;              // offset: 0x0 (0)
  ULONG DirectedPoweredDown : 1;          // offset: 0x0 (0)
  ULONG DirectedTransitionInProgress : 1; // offset: 0x0 (0)
  ULONG Reserved : 18;                    // offset: 0x0 (0)
};

// 0x4 (4) bytes
union _POP_FX_PERF_FLAGS {
  LONG Value;                    // offset: 0x0 (0)
  ULONG Progress : 3;            // offset: 0x0 (0)
  ULONG Reserved : 24;           // offset: 0x0 (0)
  ULONG Synchronicity : 2;       // offset: 0x0 (0)
  ULONG RequestPepCompleted : 1; // offset: 0x0 (0)
  ULONG RequestSucceeded : 1;    // offset: 0x0 (0)
  ULONG NestedCallback : 1;      // offset: 0x0 (0)
};

// 0x8 (8) bytes
union _POP_FX_COMPONENT_FLAGS {
  struct {
    LONG Value;  // offset: 0x0 (0)
    LONG Value2; // offset: 0x4 (4)
  };
  ULONG RefCount : 30; // offset: 0x0 (0)
  ULONG Idling : 1;    // offset: 0x0 (0)
  struct {
    ULONG Active : 1;               // offset: 0x0 (0)
    ULONG CriticalIdleOverride : 1; // offset: 0x4 (4)
    ULONG ResidentOverride : 1;     // offset: 0x4 (4)
  };
  ULONG Reserved : 30; // offset: 0x4 (4)
};

// 0x10 (16) bytes
union _CPU_INFO {
  ULONG AsUINT32[4]; // offset: 0x0 (0)
  struct {
    ULONG Eax; // offset: 0x0 (0)
    ULONG Ebx; // offset: 0x4 (4)
  };
  struct {
    ULONG Ecx; // offset: 0x8 (8)
  };
  ULONG Edx; // offset: 0xc (12)
};

// 0x4 (4) bytes
union _PEP_ACPI_RESOURCE_FLAGS {
  ULONG AsULong;            // offset: 0x0 (0)
  ULONG Shared : 1;         // offset: 0x0 (0)
  ULONG Wake : 1;           // offset: 0x0 (0)
  ULONG ResourceUsage : 1;  // offset: 0x0 (0)
  ULONG SlaveMode : 1;      // offset: 0x0 (0)
  ULONG AddressingMode : 1; // offset: 0x0 (0)
  ULONG SharedMode : 1;     // offset: 0x0 (0)
  ULONG Reserved : 26;      // offset: 0x0 (0)
};

// 0x28 (40) bytes
struct _PEP_ACPI_SPB_RESOURCE {
  enum _PEP_ACPI_RESOURCE_TYPE Type;          // offset: 0x0 (0)
  union _PEP_ACPI_RESOURCE_FLAGS Flags;       // offset: 0x4 (4)
  USHORT TypeSpecificFlags;                   // offset: 0x8 (8)
  UCHAR ResourceSourceIndex;                  // offset: 0xa (10)
  struct _UNICODE_STRING *ResourceSourceName; // offset: 0x10 (16)
  CHAR *VendorData;                           // offset: 0x18 (24)
  USHORT VendorDataLength;                    // offset: 0x20 (32)
};

// 0x48 (72) bytes
struct _PEP_ACPI_GPIO_RESOURCE {
  enum _PEP_ACPI_RESOURCE_TYPE Type;                   // offset: 0x0 (0)
  union _PEP_ACPI_RESOURCE_FLAGS Flags;                // offset: 0x4 (4)
  enum _KINTERRUPT_MODE InterruptType;                 // offset: 0x8 (8)
  enum _KINTERRUPT_POLARITY InterruptPolarity;         // offset: 0xc (12)
  enum _GPIO_PIN_CONFIG_TYPE PinConfig;                // offset: 0x10 (16)
  enum _GPIO_PIN_IORESTRICTION_TYPE IoRestrictionType; // offset: 0x14 (20)
  USHORT DriveStrength;                                // offset: 0x18 (24)
  USHORT DebounceTimeout;                              // offset: 0x1a (26)
  WCHAR *PinTable;                                     // offset: 0x20 (32)
  USHORT PinCount;                                     // offset: 0x28 (40)
  UCHAR ResourceSourceIndex;                           // offset: 0x2a (42)
  struct _UNICODE_STRING *ResourceSourceName;          // offset: 0x30 (48)
  UCHAR *VendorData;                                   // offset: 0x38 (56)
  USHORT VendorDataLength;                             // offset: 0x40 (64)
};

// 0x38 (56) bytes
struct _PEP_ACPI_SPB_UART_RESOURCE {
  struct _PEP_ACPI_SPB_RESOURCE SpbCommon; // offset: 0x0 (0)
  ULONG BaudRate;                          // offset: 0x28 (40)
  USHORT RxBufferSize;                     // offset: 0x2c (44)
  USHORT TxBufferSize;                     // offset: 0x2e (46)
  UCHAR Parity;                            // offset: 0x30 (48)
  UCHAR LinesInUse;                        // offset: 0x31 (49)
};

// 0x38 (56) bytes
struct _PEP_ACPI_SPB_SPI_RESOURCE {
  struct _PEP_ACPI_SPB_RESOURCE SpbCommon; // offset: 0x0 (0)
  ULONG ConnectionSpeed;                   // offset: 0x28 (40)
  UCHAR DataBitLength;                     // offset: 0x2c (44)
  UCHAR Phase;                             // offset: 0x2d (45)
  UCHAR Polarity;                          // offset: 0x2e (46)
  USHORT DeviceSelection;                  // offset: 0x30 (48)
};

// 0x30 (48) bytes
struct _PEP_ACPI_SPB_I2C_RESOURCE {
  struct _PEP_ACPI_SPB_RESOURCE SpbCommon; // offset: 0x0 (0)
  ULONG ConnectionSpeed;                   // offset: 0x28 (40)
  USHORT SlaveAddress;                     // offset: 0x2c (44)
};

// 0x24 (36) bytes
struct _DEVICE_MANAGE_DATA_SET_ATTRIBUTES_OUTPUT {
  ULONG Size;                // offset: 0x0 (0)
  ULONG Action;              // offset: 0x4 (4)
  ULONG Flags;               // offset: 0x8 (8)
  ULONG OperationStatus;     // offset: 0xc (12)
  ULONG ExtendedError;       // offset: 0x10 (16)
  ULONG TargetDetailedError; // offset: 0x14 (20)
  ULONG ReservedStatus;      // offset: 0x18 (24)
  ULONG OutputBlockOffset;   // offset: 0x1c (28)
  ULONG OutputBlockLength;   // offset: 0x20 (32)
};

// 0x1c (28) bytes
struct _DEVICE_DSM_DEFINITION {
  ULONG Action;                  // offset: 0x0 (0)
  UCHAR SingleRange;             // offset: 0x4 (4)
  ULONG ParameterBlockAlignment; // offset: 0x8 (8)
  ULONG ParameterBlockLength;    // offset: 0xc (12)
  UCHAR HasOutput;               // offset: 0x10 (16)
  ULONG OutputBlockAlignment;    // offset: 0x14 (20)
  ULONG OutputBlockLength;       // offset: 0x18 (24)
};

// 0x1c (28) bytes
struct _DEVICE_MANAGE_DATA_SET_ATTRIBUTES {
  ULONG Size;                 // offset: 0x0 (0)
  ULONG Action;               // offset: 0x4 (4)
  ULONG Flags;                // offset: 0x8 (8)
  ULONG ParameterBlockOffset; // offset: 0xc (12)
  ULONG ParameterBlockLength; // offset: 0x10 (16)
  ULONG DataSetRangesOffset;  // offset: 0x14 (20)
  ULONG DataSetRangesLength;  // offset: 0x18 (24)
};

// 0x28 (40) bytes
struct _DBGKD_GET_VERSION32 {
  USHORT MajorVersion;            // offset: 0x0 (0)
  USHORT MinorVersion;            // offset: 0x2 (2)
  USHORT ProtocolVersion;         // offset: 0x4 (4)
  USHORT Flags;                   // offset: 0x6 (6)
  ULONG KernBase;                 // offset: 0x8 (8)
  ULONG PsLoadedModuleList;       // offset: 0xc (12)
  USHORT MachineType;             // offset: 0x10 (16)
  USHORT ThCallbackStack;         // offset: 0x12 (18)
  USHORT NextCallback;            // offset: 0x14 (20)
  USHORT FramePointer;            // offset: 0x16 (22)
  ULONG KiCallUserMode;           // offset: 0x18 (24)
  ULONG KeUserCallbackDispatcher; // offset: 0x1c (28)
  ULONG BreakpointWithStatus;     // offset: 0x20 (32)
  ULONG DebuggerDataList;         // offset: 0x24 (36)
};

// 0xc (12) bytes
struct _PPC_DBGKD_CONTROL_SET {
  ULONG Continue;           // offset: 0x0 (0)
  ULONG CurrentSymbolStart; // offset: 0x4 (4)
  ULONG CurrentSymbolEnd;   // offset: 0x8 (8)
};

// 0xc (12) bytes
struct _ARMCE_DBGKD_CONTROL_SET {
  ULONG Continue;           // offset: 0x0 (0)
  ULONG CurrentSymbolStart; // offset: 0x4 (4)
  ULONG CurrentSymbolEnd;   // offset: 0x8 (8)
};

// 0xc (12) bytes
struct _ARM_DBGKD_CONTROL_SET {
  ULONG Continue;           // offset: 0x0 (0)
  ULONG CurrentSymbolStart; // offset: 0x4 (4)
  ULONG CurrentSymbolEnd;   // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct _X86_DBGKD_CONTROL_SET {
  ULONG TraceFlag;          // offset: 0x0 (0)
  ULONG Dr7;                // offset: 0x4 (4)
  ULONG CurrentSymbolStart; // offset: 0x8 (8)
  ULONG CurrentSymbolEnd;   // offset: 0xc (12)
};

// 0xc (12) bytes
struct _DBGKD_CONTEXT_EX {
  ULONG Offset;      // offset: 0x0 (0)
  ULONG ByteCount;   // offset: 0x4 (4)
  ULONG BytesCopied; // offset: 0x8 (8)
};

// 0x4 (4) bytes
struct _DBGKD_SWITCH_PARTITION {
  ULONG Partition; // offset: 0x0 (0)
};

// 0x14 (20) bytes
struct _DBGKD_GET_SET_BUS_DATA {
  ULONG BusDataType; // offset: 0x0 (0)
  ULONG BusNumber;   // offset: 0x4 (4)
  ULONG SlotNumber;  // offset: 0x8 (8)
  ULONG Offset;      // offset: 0xc (12)
  ULONG Length;      // offset: 0x10 (16)
};

// 0xc (12) bytes
struct _DBGKD_READ_WRITE_MSR {
  ULONG Msr;           // offset: 0x0 (0)
  ULONG DataValueLow;  // offset: 0x4 (4)
  ULONG DataValueHigh; // offset: 0x8 (8)
};

// 0x8 (8) bytes
struct _DBGKD_BREAKPOINTEX {
  ULONG BreakPointCount; // offset: 0x0 (0)
  LONG ContinueStatus;   // offset: 0x4 (4)
};

// 0x4 (4) bytes
struct _DBGKD_QUERY_SPECIAL_CALLS {
  ULONG NumberOfSpecialCalls; // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _DBGKD_RESTORE_BREAKPOINT {
  ULONG BreakPointHandle; // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _DBGKD_SET_CONTEXT {
  ULONG ContextFlags; // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _DBGKD_GET_CONTEXT {
  ULONG Unused; // offset: 0x0 (0)
};

// 0x1c (28) bytes
struct _DBGKD_GET_INTERNAL_BREAKPOINT32 {
  ULONG BreakpointAddress; // offset: 0x0 (0)
  ULONG Flags;             // offset: 0x4 (4)
  ULONG Calls;             // offset: 0x8 (8)
  ULONG MaxCallsPerPeriod; // offset: 0xc (12)
  ULONG MinInstructions;   // offset: 0x10 (16)
  ULONG MaxInstructions;   // offset: 0x14 (20)
  ULONG TotalInstructions; // offset: 0x18 (24)
};

// 0x8 (8) bytes
struct _DBGKD_SET_INTERNAL_BREAKPOINT32 {
  ULONG BreakpointAddress; // offset: 0x0 (0)
  ULONG Flags;             // offset: 0x4 (4)
};

// 0x4 (4) bytes
struct _DBGKD_SET_SPECIAL_CALL32 {
  ULONG SpecialCall; // offset: 0x0 (0)
};

// 0x18 (24) bytes
struct _DBGKD_READ_WRITE_IO_EXTENDED32 {
  ULONG DataSize;      // offset: 0x0 (0)
  ULONG InterfaceType; // offset: 0x4 (4)
  ULONG BusNumber;     // offset: 0x8 (8)
  ULONG AddressSpace;  // offset: 0xc (12)
  ULONG IoAddress;     // offset: 0x10 (16)
  ULONG DataValue;     // offset: 0x14 (20)
};

// 0xc (12) bytes
struct _DBGKD_READ_WRITE_IO32 {
  ULONG DataSize;  // offset: 0x0 (0)
  ULONG IoAddress; // offset: 0x4 (4)
  ULONG DataValue; // offset: 0x8 (8)
};

// 0x8 (8) bytes
struct _DBGKD_WRITE_BREAKPOINT32 {
  ULONG BreakPointAddress; // offset: 0x0 (0)
  ULONG BreakPointHandle;  // offset: 0x4 (4)
};

// 0xc (12) bytes
struct _DBGKD_WRITE_MEMORY32 {
  ULONG TargetBaseAddress;  // offset: 0x0 (0)
  ULONG TransferCount;      // offset: 0x4 (4)
  ULONG ActualBytesWritten; // offset: 0x8 (8)
};

// 0xc (12) bytes
struct _DBGKD_READ_MEMORY32 {
  ULONG TargetBaseAddress; // offset: 0x0 (0)
  ULONG TransferCount;     // offset: 0x4 (4)
  ULONG ActualBytesRead;   // offset: 0x8 (8)
};

// 0x18 (24) bytes
struct _DBGKD_LOAD_SYMBOLS32 {
  ULONG PathNameLength; // offset: 0x0 (0)
  ULONG BaseOfDll;      // offset: 0x4 (4)
  ULONG ProcessId;      // offset: 0x8 (8)
  ULONG CheckSum;       // offset: 0xc (12)
  ULONG SizeOfImage;    // offset: 0x10 (16)
  UCHAR UnloadSymbols;  // offset: 0x14 (20)
};

// 0x8c (140) bytes
struct _X86_KTRAP_FRAME_BLUE {
  ULONG DbgEbp;               // offset: 0x0 (0)
  ULONG DbgEip;               // offset: 0x4 (4)
  ULONG DbgArgMark;           // offset: 0x8 (8)
  USHORT TempSegCs;           // offset: 0xc (12)
  UCHAR Logging;              // offset: 0xe (14)
  UCHAR FrameType;            // offset: 0xf (15)
  ULONG TempEsp;              // offset: 0x10 (16)
  ULONG Dr0;                  // offset: 0x14 (20)
  ULONG Dr1;                  // offset: 0x18 (24)
  ULONG Dr2;                  // offset: 0x1c (28)
  ULONG Dr3;                  // offset: 0x20 (32)
  ULONG Dr6;                  // offset: 0x24 (36)
  ULONG Dr7;                  // offset: 0x28 (40)
  ULONG SegGs;                // offset: 0x2c (44)
  ULONG SegEs;                // offset: 0x30 (48)
  ULONG SegDs;                // offset: 0x34 (52)
  ULONG Edx;                  // offset: 0x38 (56)
  ULONG Ecx;                  // offset: 0x3c (60)
  ULONG Eax;                  // offset: 0x40 (64)
  UCHAR PreviousPreviousMode; // offset: 0x44 (68)
  UCHAR EntropyQueueDpc;      // offset: 0x45 (69)
  UCHAR Reserved[2];          // offset: 0x46 (70)
  ULONG MxCsr;                // offset: 0x48 (72)
  ULONG ExceptionList;        // offset: 0x4c (76)
  ULONG SegFs;                // offset: 0x50 (80)
  ULONG Edi;                  // offset: 0x54 (84)
  ULONG Esi;                  // offset: 0x58 (88)
  ULONG Ebx;                  // offset: 0x5c (92)
  ULONG Ebp;                  // offset: 0x60 (96)
  ULONG ErrCode;              // offset: 0x64 (100)
  ULONG Eip;                  // offset: 0x68 (104)
  ULONG SegCs;                // offset: 0x6c (108)
  ULONG EFlags;               // offset: 0x70 (112)
  ULONG HardwareEsp;          // offset: 0x74 (116)
  ULONG HardwareSegSs;        // offset: 0x78 (120)
  ULONG V86Es;                // offset: 0x7c (124)
  ULONG V86Ds;                // offset: 0x80 (128)
  ULONG V86Fs;                // offset: 0x84 (132)
  ULONG V86Gs;                // offset: 0x88 (136)
};

// 0x8c (140) bytes
struct _X86_KTRAP_FRAME {
  ULONG DbgEbp;               // offset: 0x0 (0)
  ULONG DbgEip;               // offset: 0x4 (4)
  ULONG DbgArgMark;           // offset: 0x8 (8)
  ULONG DbgArgPointer;        // offset: 0xc (12)
  ULONG TempSegCs;            // offset: 0x10 (16)
  ULONG TempEsp;              // offset: 0x14 (20)
  ULONG Dr0;                  // offset: 0x18 (24)
  ULONG Dr1;                  // offset: 0x1c (28)
  ULONG Dr2;                  // offset: 0x20 (32)
  ULONG Dr3;                  // offset: 0x24 (36)
  ULONG Dr6;                  // offset: 0x28 (40)
  ULONG Dr7;                  // offset: 0x2c (44)
  ULONG SegGs;                // offset: 0x30 (48)
  ULONG SegEs;                // offset: 0x34 (52)
  ULONG SegDs;                // offset: 0x38 (56)
  ULONG Edx;                  // offset: 0x3c (60)
  ULONG Ecx;                  // offset: 0x40 (64)
  ULONG Eax;                  // offset: 0x44 (68)
  UCHAR PreviousPreviousMode; // offset: 0x48 (72)
  UCHAR EntropyQueueDpc;      // offset: 0x49 (73)
  UCHAR Reserved[2];          // offset: 0x4a (74)
  ULONG ExceptionList;        // offset: 0x4c (76)
  ULONG SegFs;                // offset: 0x50 (80)
  ULONG Edi;                  // offset: 0x54 (84)
  ULONG Esi;                  // offset: 0x58 (88)
  ULONG Ebx;                  // offset: 0x5c (92)
  ULONG Ebp;                  // offset: 0x60 (96)
  ULONG ErrCode;              // offset: 0x64 (100)
  ULONG Eip;                  // offset: 0x68 (104)
  ULONG SegCs;                // offset: 0x6c (108)
  ULONG EFlags;               // offset: 0x70 (112)
  ULONG HardwareEsp;          // offset: 0x74 (116)
  ULONG HardwareSegSs;        // offset: 0x78 (120)
  ULONG V86Es;                // offset: 0x7c (124)
  ULONG V86Ds;                // offset: 0x80 (128)
  ULONG V86Fs;                // offset: 0x84 (132)
  ULONG V86Gs;                // offset: 0x88 (136)
};

// 0x10 (16) bytes
struct _PNP_ASSIGN_RESOURCES_CONTEXT {
  ULONG IncludeFailedDevices;           // offset: 0x0 (0)
  ULONG DeviceCount;                    // offset: 0x4 (4)
  struct _DEVICE_OBJECT *DeviceList[1]; // offset: 0x8 (8)
};

// 0x8 (8) bytes
struct _STRING32 {
  USHORT Length;        // offset: 0x0 (0)
  USHORT MaximumLength; // offset: 0x2 (2)
  ULONG Buffer;         // offset: 0x4 (4)
};

// 0x8 (8) bytes
struct _CLIENT_ID32 {
  ULONG UniqueProcess; // offset: 0x0 (0)
  ULONG UniqueThread;  // offset: 0x4 (4)
};

// 0x18 (24) bytes
struct _PORT_MESSAGE32 {
  union {
    struct {
      SHORT DataLength;  // offset: 0x0 (0)
      SHORT TotalLength; // offset: 0x2 (2)
    } s1;                // offset: 0x0 (0)
    ULONG Length;        // offset: 0x0 (0)

  } u1; // offset: 0x0 (0)
  union {
    struct {
      SHORT Type;           // offset: 0x0 (0)
      SHORT DataInfoOffset; // offset: 0x2 (2)
    } s2;                   // offset: 0x4 (4)
    ULONG ZeroInit;         // offset: 0x4 (4)

  } u2; // offset: 0x4 (4)
  union {
    struct _CLIENT_ID32 ClientId; // offset: 0x8 (8)
    double DoNotUseThisField;     // offset: 0x8 (8)
  };
  ULONG MessageId; // offset: 0x10 (16)
  union {
    ULONG ClientViewSize; // offset: 0x14 (20)
    ULONG CallbackId;     // offset: 0x14 (20)
  };
};

// 0x1c (28) bytes
struct _NT_TIB32 {
  ULONG ExceptionList; // offset: 0x0 (0)
  ULONG StackBase;     // offset: 0x4 (4)
  ULONG StackLimit;    // offset: 0x8 (8)
  ULONG SubSystemTib;  // offset: 0xc (12)
  union {
    ULONG FiberData; // offset: 0x10 (16)
    ULONG Version;   // offset: 0x10 (16)
  };
  ULONG ArbitraryUserPointer; // offset: 0x14 (20)
  ULONG Self;                 // offset: 0x18 (24)
};

// 0x10 (16) bytes
struct _THERMAL_ZONE_COUNTERS {
  ULONG Temperature;              // offset: 0x0 (0)
  ULONG ThrottleLimit;            // offset: 0x4 (4)
  ULONG ThrottleReasons;          // offset: 0x8 (8)
  ULONG TemperatureHighPrecision; // offset: 0xc (12)
};

// 0xb8 (184) bytes
struct _SYNCH_COUNTERS {
  ULONG SpinLockAcquireCount;                           // offset: 0x0 (0)
  ULONG SpinLockContentionCount;                        // offset: 0x4 (4)
  ULONG SpinLockSpinCount;                              // offset: 0x8 (8)
  ULONG IpiSendRequestBroadcastCount;                   // offset: 0xc (12)
  ULONG IpiSendRequestRoutineCount;                     // offset: 0x10 (16)
  ULONG IpiSendSoftwareInterruptCount;                  // offset: 0x14 (20)
  ULONG ExInitializeResourceCount;                      // offset: 0x18 (24)
  ULONG ExReInitializeResourceCount;                    // offset: 0x1c (28)
  ULONG ExDeleteResourceCount;                          // offset: 0x20 (32)
  ULONG ExecutiveResourceAcquiresCount;                 // offset: 0x24 (36)
  ULONG ExecutiveResourceContentionsCount;              // offset: 0x28 (40)
  ULONG ExecutiveResourceReleaseExclusiveCount;         // offset: 0x2c (44)
  ULONG ExecutiveResourceReleaseSharedCount;            // offset: 0x30 (48)
  ULONG ExecutiveResourceConvertsCount;                 // offset: 0x34 (52)
  ULONG ExAcqResExclusiveAttempts;                      // offset: 0x38 (56)
  ULONG ExAcqResExclusiveAcquiresExclusive;             // offset: 0x3c (60)
  ULONG ExAcqResExclusiveAcquiresExclusiveRecursive;    // offset: 0x40 (64)
  ULONG ExAcqResExclusiveWaits;                         // offset: 0x44 (68)
  ULONG ExAcqResExclusiveNotAcquires;                   // offset: 0x48 (72)
  ULONG ExAcqResSharedAttempts;                         // offset: 0x4c (76)
  ULONG ExAcqResSharedAcquiresExclusive;                // offset: 0x50 (80)
  ULONG ExAcqResSharedAcquiresShared;                   // offset: 0x54 (84)
  ULONG ExAcqResSharedAcquiresSharedRecursive;          // offset: 0x58 (88)
  ULONG ExAcqResSharedWaits;                            // offset: 0x5c (92)
  ULONG ExAcqResSharedNotAcquires;                      // offset: 0x60 (96)
  ULONG ExAcqResSharedStarveExclusiveAttempts;          // offset: 0x64 (100)
  ULONG ExAcqResSharedStarveExclusiveAcquiresExclusive; // offset: 0x68 (104)
  ULONG ExAcqResSharedStarveExclusiveAcquiresShared;    // offset: 0x6c (108)
  ULONG ExAcqResSharedStarveExclusiveAcquiresSharedRecursive; // offset: 0x70
                                                              // (112)
  ULONG ExAcqResSharedStarveExclusiveWaits;              // offset: 0x74 (116)
  ULONG ExAcqResSharedStarveExclusiveNotAcquires;        // offset: 0x78 (120)
  ULONG ExAcqResSharedWaitForExclusiveAttempts;          // offset: 0x7c (124)
  ULONG ExAcqResSharedWaitForExclusiveAcquiresExclusive; // offset: 0x80 (128)
  ULONG ExAcqResSharedWaitForExclusiveAcquiresShared;    // offset: 0x84 (132)
  ULONG ExAcqResSharedWaitForExclusiveAcquiresSharedRecursive; // offset: 0x88
                                                               // (136)
  ULONG ExAcqResSharedWaitForExclusiveWaits;           // offset: 0x8c (140)
  ULONG ExAcqResSharedWaitForExclusiveNotAcquires;     // offset: 0x90 (144)
  ULONG ExSetResOwnerPointerExclusive;                 // offset: 0x94 (148)
  ULONG ExSetResOwnerPointerSharedNew;                 // offset: 0x98 (152)
  ULONG ExSetResOwnerPointerSharedOld;                 // offset: 0x9c (156)
  ULONG ExTryToAcqExclusiveAttempts;                   // offset: 0xa0 (160)
  ULONG ExTryToAcqExclusiveAcquires;                   // offset: 0xa4 (164)
  ULONG ExBoostExclusiveOwner;                         // offset: 0xa8 (168)
  ULONG ExBoostSharedOwners;                           // offset: 0xac (172)
  ULONG ExEtwSynchTrackingNotificationsCount;          // offset: 0xb0 (176)
  ULONG ExEtwSynchTrackingNotificationsAccountedCount; // offset: 0xb4 (180)
};

// 0x10 (16) bytes
struct _PCW_DATA {
  const VOID *Data; // offset: 0x0 (0)
  ULONG Size;       // offset: 0x8 (8)
};

// 0x50 (80) bytes
struct _CM_PARSE_DEBUG_INFO {
  struct _CM_KEY_CONTROL_BLOCK *SymlinkCachedKcb; // offset: 0x0 (0)
  struct _CM_KEY_CONTROL_BLOCK *StartingKcb;      // offset: 0x8 (8)
  struct _CM_KEY_CONTROL_BLOCK *KcbCacheResult;   // offset: 0x10 (16)
  struct _CM_KEY_CONTROL_BLOCK *WalkResult;       // offset: 0x18 (24)
  struct _CM_KEY_CONTROL_BLOCK *DeepestKcbFound;  // offset: 0x20 (32)
  UCHAR KcbCacheLevels;                           // offset: 0x28 (40)
  UCHAR WalkLevels;                               // offset: 0x29 (41)
  UCHAR FailureCount;                             // offset: 0x2a (42)
  struct {
    LONG Status;      // offset: 0x0 (0)
    ULONG Point;      // offset: 0x4 (4)
  } FailurePoints[4]; // offset: 0x2c (44)
};

// 0x8 (8) bytes
struct _HCELL {
  LONG Size; // offset: 0x0 (0)
  union {
    struct {
      union {
        ULONG UserData; // offset: 0x4 (4)
        ULONG Next;     // offset: 0x4 (4)

      } u;     // offset: 0x0 (0)
    } NewCell; // offset: 0x4 (4)

  } u; // offset: 0x4 (4)
};

// 0x48 (72) bytes
struct _CM_DIRTY_VECTOR_LOG_ENTRY {
  struct _ETHREAD *Thread;                   // offset: 0x0 (0)
  enum _CM_DIRTY_VECTOR_OPERATION Operation; // offset: 0x8 (8)
  union {
    struct {
      ULONG Start;                // offset: 0x0 (0)
      ULONG Length;               // offset: 0x4 (4)
    } DirtyVectorModifiedContext; // offset: 0xc (12)
    struct {
      ULONG RangeCount;        // offset: 0x0 (0)
      ULONG SetBitCount;       // offset: 0x4 (4)
    } DirtyDataCaptureContext; // offset: 0xc (12)
    struct {
      ULONG Context1; // offset: 0x0 (0)
      ULONG Context2; // offset: 0x4 (4)
    } Raw;            // offset: 0xc (12)

  } Data;         // offset: 0xc (12)
  VOID *Stack[6]; // offset: 0x18 (24)
};

// 0x8 (8) bytes
struct _KTRANSACTION_HISTORY {
  enum<unnamed - enum - KTMOH_CommitTransaction_Result>
      RecordType; // offset: 0x0 (0)
  ULONG Payload;  // offset: 0x4 (4)
};

// 0x68 (104) bytes
struct _RTL_AVL_TABLE {
  struct _RTL_BALANCED_LINKS BalancedRoot; // offset: 0x0 (0)
  VOID *OrderedPointer;                    // offset: 0x20 (32)
  ULONG WhichOrderedElement;               // offset: 0x28 (40)
  ULONG NumberGenericTableElements;        // offset: 0x2c (44)
  ULONG DepthOfTree;                       // offset: 0x30 (48)
  struct _RTL_BALANCED_LINKS *RestartKey;  // offset: 0x38 (56)
  ULONG DeleteCount;                       // offset: 0x40 (64)
  enum _RTL_GENERIC_COMPARE_RESULTS (*CompareRoutine)(
      struct _RTL_AVL_TABLE *arg1, VOID *arg2, VOID *arg3); // offset: 0x48 (72)
  VOID *(*AllocateRoutine)(struct _RTL_AVL_TABLE *arg1,
                           ULONG arg2); // offset: 0x50 (80)
  VOID (*FreeRoutine)
  (struct _RTL_AVL_TABLE *arg1, VOID *arg2); // offset: 0x58 (88)
  VOID *TableContext;                        // offset: 0x60 (96)
};

// 0xa8 (168) bytes
struct _KTMOBJECT_NAMESPACE {
  struct _RTL_AVL_TABLE Table; // offset: 0x0 (0)
  struct _KMUTANT Mutex;       // offset: 0x68 (104)
  USHORT LinksOffset;          // offset: 0xa0 (160)
  USHORT GuidOffset;           // offset: 0xa2 (162)
  UCHAR Expired;               // offset: 0xa4 (164)
};

// 0x10 (16) bytes
struct _CM_UOW_SET_VALUE_KEY_DATA {
  ULONG PreparedCell; // offset: 0x0 (0)
  ULONG OldValueCell; // offset: 0x4 (4)
  USHORT NameLength;  // offset: 0x8 (8)
  ULONG DataSize;     // offset: 0xc (12)
};

// 0x4 (4) bytes
struct _CM_UOW_SET_SD_DATA {
  ULONG SecurityCell; // offset: 0x0 (0)
};

// 0x488 (1160) bytes
struct _CM_DIRTY_VECTOR_LOG {
  volatile ULONG Next;                       // offset: 0x0 (0)
  ULONG Size;                                // offset: 0x4 (4)
  struct _CM_DIRTY_VECTOR_LOG_ENTRY Log[16]; // offset: 0x8 (8)
};

// 0x28 (40) bytes
struct _CM_WORKITEM {
  struct _LIST_ENTRY ListEntry;      // offset: 0x0 (0)
  ULONG Private;                     // offset: 0x10 (16)
  VOID (*WorkerRoutine)(VOID *arg1); // offset: 0x18 (24)
  VOID *Parameter;                   // offset: 0x20 (32)
};

// 0x8 (8) bytes
struct _KENLISTMENT_HISTORY {
  ULONG Notification;               // offset: 0x0 (0)
  enum _KENLISTMENT_STATE NewState; // offset: 0x4 (4)
};

// 0x4 (4) bytes
struct _CM_COMPONENT_HASH {
  ULONG Hash; // offset: 0x0 (0)
};

// 0x8 (8) bytes
struct _CM_INDEX {
  ULONG Cell; // offset: 0x0 (0)
  union {
    struct _CM_FAST_LEAF_HINT NameHint; // offset: 0x4 (4)
    struct _CM_COMPONENT_HASH HashKey;  // offset: 0x4 (4)
  };
};

// 0x18 (24) bytes
struct _CM_NAME_HASH {
  struct _CM_COMPONENT_HASH ConvKey; // offset: 0x0 (0)
  struct _CM_NAME_HASH *NextHash;    // offset: 0x8 (8)
  USHORT NameLength;                 // offset: 0x10 (16)
  WCHAR Name[1];                     // offset: 0x12 (18)
};

// 0x20 (32) bytes
struct _CM_NAME_CONTROL_BLOCK {
  ULONG Compressed : 1; // offset: 0x0 (0)
  ULONG RefCount : 31;  // offset: 0x0 (0)
  union {
    struct _CM_NAME_HASH NameHash; // offset: 0x8 (8)
    struct {
      struct _CM_COMPONENT_HASH ConvKey; // offset: 0x8 (8)
      struct _CM_KEY_HASH *NextHash;     // offset: 0x10 (16)
      USHORT NameLength;                 // offset: 0x18 (24)
      WCHAR Name[1];                     // offset: 0x1a (26)
    };
  };
};

// 0x10 (16) bytes
struct _CM_INTENT_LOCK {
  ULONG OwnerCount;                // offset: 0x0 (0)
  struct _CM_KCB_UOW **OwnerTable; // offset: 0x8 (8)
};

// 0x4 (4) bytes
struct _CM_PATH_HASH {
  ULONG Hash; // offset: 0x0 (0)
};

// 0x14 (20) bytes
struct _SECURITY_DESCRIPTOR_RELATIVE {
  UCHAR Revision; // offset: 0x0 (0)
  UCHAR Sbz1;     // offset: 0x1 (1)
  USHORT Control; // offset: 0x2 (2)
  ULONG Owner;    // offset: 0x4 (4)
  ULONG Group;    // offset: 0x8 (8)
  ULONG Sacl;     // offset: 0xc (12)
  ULONG Dacl;     // offset: 0x10 (16)
};

// 0x38 (56) bytes
struct _CM_KEY_SECURITY_CACHE {
  ULONG Cell;                                      // offset: 0x0 (0)
  ULONG ConvKey;                                   // offset: 0x4 (4)
  struct _LIST_ENTRY List;                         // offset: 0x8 (8)
  ULONG DescriptorLength;                          // offset: 0x18 (24)
  ULONG RealRefCount;                              // offset: 0x1c (28)
  struct _SECURITY_DESCRIPTOR_RELATIVE Descriptor; // offset: 0x20 (32)
};

// 0x10 (16) bytes
struct _CM_KEY_SECURITY_CACHE_ENTRY {
  ULONG Cell;                                    // offset: 0x0 (0)
  struct _CM_KEY_SECURITY_CACHE *CachedSecurity; // offset: 0x8 (8)
};

// 0x8 (8) bytes
struct _CHILD_LIST {
  ULONG Count; // offset: 0x0 (0)
  ULONG List;  // offset: 0x4 (4)
};

// 0xc (12) bytes
struct _CM_UOW_SET_VALUE_LIST_DATA {
  ULONG RefCount;               // offset: 0x0 (0)
  struct _CHILD_LIST ValueList; // offset: 0x4 (4)
};

// 0x8 (8) bytes
struct _CM_BIG_DATA {
  USHORT Signature; // offset: 0x0 (0)
  USHORT Count;     // offset: 0x2 (2)
  ULONG List;       // offset: 0x4 (4)
};

// 0x28 (40) bytes
struct _CM_KEY_SECURITY {
  USHORT Signature;                                // offset: 0x0 (0)
  USHORT Reserved;                                 // offset: 0x2 (2)
  ULONG Flink;                                     // offset: 0x4 (4)
  ULONG Blink;                                     // offset: 0x8 (8)
  ULONG ReferenceCount;                            // offset: 0xc (12)
  ULONG DescriptorLength;                          // offset: 0x10 (16)
  struct _SECURITY_DESCRIPTOR_RELATIVE Descriptor; // offset: 0x14 (20)
};

// 0x18 (24) bytes
struct _CM_KEY_VALUE {
  USHORT Signature;  // offset: 0x0 (0)
  USHORT NameLength; // offset: 0x2 (2)
  ULONG DataLength;  // offset: 0x4 (4)
  ULONG Data;        // offset: 0x8 (8)
  ULONG Type;        // offset: 0xc (12)
  USHORT Flags;      // offset: 0x10 (16)
  USHORT Spare;      // offset: 0x12 (18)
  WCHAR Name[1];     // offset: 0x14 (20)
};

// 0x18 (24) bytes
struct CMP_OFFSET_ARRAY {
  ULONG FileOffset; // offset: 0x0 (0)
  VOID *DataBuffer; // offset: 0x8 (8)
  ULONG DataLength; // offset: 0x10 (16)
};

// 0x8 (8) bytes
struct _HV_GET_CELL_CONTEXT {
  ULONG Cell;                            // offset: 0x0 (0)
  struct _HV_GET_BIN_CONTEXT BinContext; // offset: 0x4 (4)
};

// 0x38 (56) bytes
struct _HVP_VIEW_MAP {
  VOID *SectionReference;                   // offset: 0x0 (0)
  LONGLONG StorageEndFileOffset;            // offset: 0x8 (8)
  LONGLONG SectionEndFileOffset;            // offset: 0x10 (16)
  struct _CMSI_PROCESS_TUPLE *ProcessTuple; // offset: 0x18 (24)
  ULONG Flags;                              // offset: 0x20 (32)
  struct _RTL_RB_TREE ViewTree;             // offset: 0x28 (40)
};

// 0x4 (4) bytes
struct _MI_SUBSECTION_ENTRY1 {
  ULONG CrossPartitionReferences : 30; // offset: 0x0 (0)
  ULONG SubsectionMappedLarge : 2;     // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _MI_STORE_INPAGE_COMPLETE_FLAGS {
  union {
    ULONG EntireFlags; // offset: 0x0 (0)
    struct {
      ULONG StoreFault : 1;          // offset: 0x0 (0)
      ULONG LowResourceFailure : 1;  // offset: 0x0 (0)
      ULONG Spare : 14;              // offset: 0x0 (0)
      ULONG RemainingPageCount : 16; // offset: 0x0 (0)
    };
  };
};

// 0x4 (4) bytes
struct _MMINPAGE_FLAGS {
  ULONG GetExtents : 1;              // offset: 0x0 (0)
  ULONG PrefetchSystemVmType : 2;    // offset: 0x0 (0)
  ULONG VaPrefetchReadBlock : 1;     // offset: 0x0 (0)
  ULONG CollidedFlowThrough : 1;     // offset: 0x0 (0)
  ULONG ForceCollisions : 1;         // offset: 0x0 (0)
  ULONG InPageExpanded : 1;          // offset: 0x0 (0)
  ULONG IssuedAtLowPriority : 1;     // offset: 0x0 (0)
  ULONG FaultFromStore : 1;          // offset: 0x0 (0)
  ULONG PagePriority : 3;            // offset: 0x0 (0)
  ULONG ClusteredPagePriority : 3;   // offset: 0x0 (0)
  ULONG MakeClusterValid : 1;        // offset: 0x0 (0)
  ULONG PerformRelocations : 1;      // offset: 0x0 (0)
  ULONG ZeroLastPage : 1;            // offset: 0x0 (0)
  ULONG UserFault : 1;               // offset: 0x0 (0)
  ULONG StandbyProtectionNeeded : 1; // offset: 0x0 (0)
  ULONG PteChanged : 1;              // offset: 0x0 (0)
  ULONG PageFileFault : 1;           // offset: 0x0 (0)
  ULONG PageFilePageHashActive : 1;  // offset: 0x0 (0)
  ULONG CoalescedIo : 1;             // offset: 0x0 (0)
  ULONG VmLockNotNeeded : 1;         // offset: 0x0 (0)
  ULONG Spare0 : 1;                  // offset: 0x0 (0)
  ULONG Spare1 : 6;                  // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _MMSECURE_FLAGS {
  ULONG ReadOnly : 1;            // offset: 0x0 (0)
  ULONG ReadWrite : 1;           // offset: 0x0 (0)
  ULONG SecNoChange : 1;         // offset: 0x0 (0)
  ULONG NoDelete : 1;            // offset: 0x0 (0)
  ULONG RequiresPteReversal : 1; // offset: 0x0 (0)
  ULONG ExclusiveSecure : 1;     // offset: 0x0 (0)
  ULONG UserModeOnly : 1;        // offset: 0x0 (0)
  ULONG NoInherit : 1;           // offset: 0x0 (0)
  ULONG CheckVad : 1;            // offset: 0x0 (0)
  ULONG Spare : 3;               // offset: 0x0 (0)
};

// 0x10 (16) bytes
struct _MMADDRESS_LIST {
  union {
    struct _MMSECURE_FLAGS Flags; // offset: 0x0 (0)
    ULONG FlagsLong;              // offset: 0x0 (0)
    VOID *StartVa;                // offset: 0x0 (0)

  } u1;        // offset: 0x0 (0)
  VOID *EndVa; // offset: 0x8 (8)
};

// 0x4 (4) bytes
struct _MMVAD_FLAGS1 {
  ULONG CommitCharge : 31; // offset: 0x0 (0)
  ULONG MemCommit : 1;     // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _MM_SHARED_VAD_FLAGS {
  ULONG Lock : 1;                     // offset: 0x0 (0)
  ULONG LockContended : 1;            // offset: 0x0 (0)
  ULONG DeleteInProgress : 1;         // offset: 0x0 (0)
  ULONG NoChange : 1;                 // offset: 0x0 (0)
  ULONG VadType : 3;                  // offset: 0x0 (0)
  ULONG Protection : 5;               // offset: 0x0 (0)
  ULONG PreferredNode : 6;            // offset: 0x0 (0)
  ULONG PageSize : 2;                 // offset: 0x0 (0)
  ULONG PrivateMemoryAlwaysClear : 1; // offset: 0x0 (0)
  ULONG PrivateFixup : 1;             // offset: 0x0 (0)
  ULONG HotPatchAllowed : 1;          // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _MM_GRAPHICS_VAD_FLAGS {
  ULONG Lock : 1;                   // offset: 0x0 (0)
  ULONG LockContended : 1;          // offset: 0x0 (0)
  ULONG DeleteInProgress : 1;       // offset: 0x0 (0)
  ULONG NoChange : 1;               // offset: 0x0 (0)
  ULONG VadType : 3;                // offset: 0x0 (0)
  ULONG Protection : 5;             // offset: 0x0 (0)
  ULONG PreferredNode : 6;          // offset: 0x0 (0)
  ULONG PageSize : 2;               // offset: 0x0 (0)
  ULONG PrivateMemoryAlwaysSet : 1; // offset: 0x0 (0)
  ULONG WriteWatch : 1;             // offset: 0x0 (0)
  ULONG FixedLargePageSize : 1;     // offset: 0x0 (0)
  ULONG ZeroFillPagesOptional : 1;  // offset: 0x0 (0)
  ULONG GraphicsAlwaysSet : 1;      // offset: 0x0 (0)
  ULONG GraphicsUseCoherentBus : 1; // offset: 0x0 (0)
  ULONG GraphicsNoCache : 1;        // offset: 0x0 (0)
  ULONG GraphicsPageProtection : 3; // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _MM_PRIVATE_VAD_FLAGS {
  ULONG Lock : 1;                         // offset: 0x0 (0)
  ULONG LockContended : 1;                // offset: 0x0 (0)
  ULONG DeleteInProgress : 1;             // offset: 0x0 (0)
  ULONG NoChange : 1;                     // offset: 0x0 (0)
  ULONG VadType : 3;                      // offset: 0x0 (0)
  ULONG Protection : 5;                   // offset: 0x0 (0)
  ULONG PreferredNode : 6;                // offset: 0x0 (0)
  ULONG PageSize : 2;                     // offset: 0x0 (0)
  ULONG PrivateMemoryAlwaysSet : 1;       // offset: 0x0 (0)
  ULONG WriteWatch : 1;                   // offset: 0x0 (0)
  ULONG FixedLargePageSize : 1;           // offset: 0x0 (0)
  ULONG ZeroFillPagesOptional : 1;        // offset: 0x0 (0)
  ULONG Graphics : 1;                     // offset: 0x0 (0)
  ULONG Enclave : 1;                      // offset: 0x0 (0)
  ULONG ShadowStack : 1;                  // offset: 0x0 (0)
  ULONG PhysicalMemoryPfnsReferenced : 1; // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _MMVAD_FLAGS {
  ULONG Lock : 1;             // offset: 0x0 (0)
  ULONG LockContended : 1;    // offset: 0x0 (0)
  ULONG DeleteInProgress : 1; // offset: 0x0 (0)
  ULONG NoChange : 1;         // offset: 0x0 (0)
  ULONG VadType : 3;          // offset: 0x0 (0)
  ULONG Protection : 5;       // offset: 0x0 (0)
  ULONG PreferredNode : 6;    // offset: 0x0 (0)
  ULONG PageSize : 2;         // offset: 0x0 (0)
  ULONG PrivateMemory : 1;    // offset: 0x0 (0)
};

// 0x4 (4) bytes
struct _MODWRITER_FLAGS {
  ULONG KeepForever : 1;        // offset: 0x0 (0)
  ULONG Networked : 1;          // offset: 0x0 (0)
  ULONG IoPriority : 3;         // offset: 0x0 (0)
  ULONG ModifiedStoreWrite : 1; // offset: 0x0 (0)
};

// 0x10 (16) bytes
struct _MI_EXTRA_IMAGE_INFORMATION {
  ULONG SizeOfHeaders;                                 // offset: 0x0 (0)
  ULONG SizeOfImage;                                   // offset: 0x4 (4)
  ULONG TimeDateStamp;                                 // offset: 0x8 (8)
  ULONG ImageCetShadowStacksReady : 1;                 // offset: 0xc (12)
  ULONG ImageCetShadowStacksStrictMode : 1;            // offset: 0xc (12)
  ULONG ImageCetSetContextIpValidationRelaxedMode : 1; // offset: 0xc (12)
  ULONG ImageCetDynamicApisAllowInProc : 1;            // offset: 0xc (12)
  ULONG ImageCetDowngradeReserved1 : 1;                // offset: 0xc (12)
  ULONG ImageCetDowngradeReserved2 : 1;                // offset: 0xc (12)
  ULONG Spare : 26;                                    // offset: 0xc (12)
};

// 0x28 (40) bytes
struct _MI_CONTROL_AREA_WAIT_BLOCK {
  struct _MI_CONTROL_AREA_WAIT_BLOCK *Next; // offset: 0x0 (0)
  ULONG WaitReason;                         // offset: 0x8 (8)
  ULONG WaitResponse;                       // offset: 0xc (12)
  struct _KGATE Gate;                       // offset: 0x10 (16)
};

// 0x4 (4) bytes
struct _MMSECTION_FLAGS {
  ULONG BeingDeleted : 1;                     // offset: 0x0 (0)
  ULONG BeingCreated : 1;                     // offset: 0x0 (0)
  ULONG BeingPurged : 1;                      // offset: 0x0 (0)
  ULONG NoModifiedWriting : 1;                // offset: 0x0 (0)
  ULONG FailAllIo : 1;                        // offset: 0x0 (0)
  ULONG Image : 1;                            // offset: 0x0 (0)
  ULONG Based : 1;                            // offset: 0x0 (0)
  ULONG File : 1;                             // offset: 0x0 (0)
  ULONG AttemptingDelete : 1;                 // offset: 0x0 (0)
  ULONG PrefetchCreated : 1;                  // offset: 0x0 (0)
  ULONG PhysicalMemory : 1;                   // offset: 0x0 (0)
  ULONG ImageControlAreaOnRemovableMedia : 1; // offset: 0x0 (0)
  ULONG Reserve : 1;                          // offset: 0x0 (0)
  ULONG Commit : 1;                           // offset: 0x0 (0)
  ULONG NoChange : 1;                         // offset: 0x0 (0)
  ULONG WasPurged : 1;                        // offset: 0x0 (0)
  ULONG UserReference : 1;                    // offset: 0x0 (0)
  ULONG GlobalMemory : 1;                     // offset: 0x0 (0)
  ULONG DeleteOnClose : 1;                    // offset: 0x0 (0)
  ULONG FilePointerNull : 1;                  // offset: 0x0 (0)
  ULONG PreferredNode : 6;                    // offset: 0x0 (0)
  ULONG GlobalOnlyPerSession : 1;             // offset: 0x0 (0)
  ULONG UserWritable : 1;                     // offset: 0x0 (0)
  ULONG SystemVaAllocated : 1;                // offset: 0x0 (0)
  ULONG PreferredFsCompressionBoundary : 1;   // offset: 0x0 (0)
  ULONG UsingFileExtents : 1;                 // offset: 0x0 (0)
  ULONG PageSize64K : 1;                      // offset: 0x0 (0)
};

// 0x20 (32) bytes
struct _MI_AVAILABLE_PAGE_WAIT_STATES {
  struct _KEVENT Event; // offset: 0x0 (0)
  ULONG EventSets;      // offset: 0x18 (24)
};

// 0x4 (4) bytes
struct _MI_PARTITION_FLAGS {
  ULONG BeingDeleted : 1;                 // offset: 0x0 (0)
  ULONG PageListsInitialized : 1;         // offset: 0x0 (0)
  ULONG StoreReservedPagesCharged : 1;    // offset: 0x0 (0)
  ULONG UseProtectedSlabAllocators : 1;   // offset: 0x0 (0)
  ULONG UseUnprotectedSlabAllocators : 1; // offset: 0x0 (0)
  ULONG PureHoldingPartition : 1;         // offset: 0x0 (0)
  ULONG ZeroPagesOptional : 1;            // offset: 0x0 (0)
  ULONG BackgroundZeroingDisabled : 1;    // offset: 0x0 (0)
};

// 0x8 (8) bytes
struct _MI_CACHED_PTE {
  union {
    struct {
      ULONG GlobalTimeStamp; // offset: 0x0 (0)
      ULONG PteIndex;        // offset: 0x4 (4)
    };
    LONGLONG Long; // offset: 0x0 (0)
  };
};

// 0x4 (4) bytes
struct _EX_PUSH_LOCK_AUTO_EXPAND_STATE {
  union {
    struct {
      ULONG Expanded : 1;      // offset: 0x0 (0)
      ULONG Transitioning : 1; // offset: 0x0 (0)
      ULONG Pageable : 1;      // offset: 0x0 (0)
    };
    ULONG Value; // offset: 0x0 (0)
  };
};

// 0x10 (16) bytes
struct _GUID {
  ULONG Data1;    // offset: 0x0 (0)
  USHORT Data2;   // offset: 0x4 (4)
  USHORT Data3;   // offset: 0x6 (6)
  UCHAR Data4[8]; // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct _RTL_HASH_TABLE {
  ULONG EntryCount;                   // offset: 0x0 (0)
  ULONG MaskBitCount : 5;             // offset: 0x4 (4)
  ULONG BucketCount : 27;             // offset: 0x4 (4)
  struct _SINGLE_LIST_ENTRY *Buckets; // offset: 0x8 (8)
};

// 0x4 (4) bytes
union _MM_PAGE_ACCESS_INFO_FLAGS {
  struct {
    ULONG FilePointerIndex : 9; // offset: 0x0 (0)
    ULONG HardFault : 1;        // offset: 0x0 (0)
    ULONG Image : 1;            // offset: 0x0 (0)
    ULONG Spare0 : 1;           // offset: 0x0 (0)
  } File;                       // offset: 0x0 (0)
  struct {
    ULONG FilePointerIndex : 9; // offset: 0x0 (0)
    ULONG HardFault : 1;        // offset: 0x0 (0)
    ULONG Spare1 : 2;           // offset: 0x0 (0)
  } Private;                    // offset: 0x0 (0)
};

// 0x10 (16) bytes
struct _IO_PRIORITY_INFO {
  ULONG Size;                        // offset: 0x0 (0)
  ULONG ThreadPriority;              // offset: 0x4 (4)
  ULONG PagePriority;                // offset: 0x8 (8)
  enum _IO_PRIORITY_HINT IoPriority; // offset: 0xc (12)
};

// 0x8 (8) bytes
struct _OBJECT_HANDLE_INFORMATION {
  ULONG HandleAttributes; // offset: 0x0 (0)
  ULONG GrantedAccess;    // offset: 0x4 (4)
};

// 0x10 (16) bytes
struct _GENERIC_MAPPING {
  ULONG GenericRead;    // offset: 0x0 (0)
  ULONG GenericWrite;   // offset: 0x4 (4)
  ULONG GenericExecute; // offset: 0x8 (8)
  ULONG GenericAll;     // offset: 0xc (12)
};

// 0x4 (4) bytes
struct _PS_TRUSTLET_ATTRIBUTE_TYPE {
  union {
    struct {
      UCHAR Version;                                          // offset: 0x0 (0)
      UCHAR DataCount;                                        // offset: 0x1 (1)
      UCHAR SemanticType;                                     // offset: 0x2 (2)
      union _PS_TRUSTLET_ATTRIBUTE_ACCESSRIGHTS AccessRights; // offset: 0x3 (3)
    };
    ULONG AttributeType; // offset: 0x0 (0)
  };
};

// 0x8 (8) bytes
struct _PS_TRUSTLET_ATTRIBUTE_HEADER {
  struct _PS_TRUSTLET_ATTRIBUTE_TYPE AttributeType; // offset: 0x0 (0)
  ULONG InstanceNumber : 8;                         // offset: 0x4 (4)
  ULONG Reserved : 24;                              // offset: 0x4 (4)
};

// 0x4 (4) bytes
struct _SINGLE_LIST_ENTRY32 {
  ULONG Next; // offset: 0x0 (0)
};

// 0x8 (8) bytes
struct _IMAGE_DATA_DIRECTORY {
  ULONG VirtualAddress; // offset: 0x0 (0)
  ULONG Size;           // offset: 0x4 (4)
};

// 0x14 (20) bytes
struct _IMAGE_FILE_HEADER {
  USHORT Machine;              // offset: 0x0 (0)
  USHORT NumberOfSections;     // offset: 0x2 (2)
  ULONG TimeDateStamp;         // offset: 0x4 (4)
  ULONG PointerToSymbolTable;  // offset: 0x8 (8)
  ULONG NumberOfSymbols;       // offset: 0xc (12)
  USHORT SizeOfOptionalHeader; // offset: 0x10 (16)
  USHORT Characteristics;      // offset: 0x12 (18)
};

// 0x18 (24) bytes
struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME {
  struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME *Previous; // offset: 0x0 (0)
  struct _ACTIVATION_CONTEXT *ActivationContext;        // offset: 0x8 (8)
  ULONG Flags;                                          // offset: 0x10 (16)
};

// 0x18 (24) bytes
struct _TEB_ACTIVE_FRAME {
  ULONG Flags;                               // offset: 0x0 (0)
  struct _TEB_ACTIVE_FRAME *Previous;        // offset: 0x8 (8)
  struct _TEB_ACTIVE_FRAME_CONTEXT *Context; // offset: 0x10 (16)
};

// 0x4e0 (1248) bytes
struct _GDI_TEB_BATCH32 {
  ULONG Offset : 31;             // offset: 0x0 (0)
  ULONG HasRenderingCommand : 1; // offset: 0x0 (0)
  ULONG HDC;                     // offset: 0x4 (4)
  ULONG Buffer[310];             // offset: 0x8 (8)
};

// 0x28 (40) bytes
struct _ACTIVATION_CONTEXT_STACK {
  struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME *ActiveFrame; // offset: 0x0 (0)
  struct _LIST_ENTRY FrameListCache;                       // offset: 0x8 (8)
  ULONG Flags;                                             // offset: 0x18 (24)
  ULONG NextCookieSequenceNumber;                          // offset: 0x1c (28)
  ULONG StackId;                                           // offset: 0x20 (32)
};

// 0x48 (72) bytes
struct _TP_CALLBACK_ENVIRON_V3 {
  ULONG Version;                          // offset: 0x0 (0)
  struct _TP_POOL *Pool;                  // offset: 0x8 (8)
  struct _TP_CLEANUP_GROUP *CleanupGroup; // offset: 0x10 (16)
  VOID (*CleanupGroupCancelCallback)
  (VOID *arg1, VOID *arg2);                      // offset: 0x18 (24)
  VOID *RaceDll;                                 // offset: 0x20 (32)
  struct _ACTIVATION_CONTEXT *ActivationContext; // offset: 0x28 (40)
  VOID (*FinalizationCallback)
  (struct _TP_CALLBACK_INSTANCE *arg1, VOID *arg2); // offset: 0x30 (48)
  union {
    ULONG Flags; // offset: 0x38 (56)
    struct {
      ULONG LongFunction : 1; // offset: 0x0 (0)
      ULONG Persistent : 1;   // offset: 0x0 (0)
      ULONG Private : 30;     // offset: 0x0 (0)
    } s;                      // offset: 0x38 (56)

  } u;                                         // offset: 0x38 (56)
  enum _TP_CALLBACK_PRIORITY CallbackPriority; // offset: 0x3c (60)
  ULONG Size;                                  // offset: 0x40 (64)
};

// 0x8 (8) bytes
struct _XSTATE_FEATURE {
  ULONG Offset; // offset: 0x0 (0)
  ULONG Size;   // offset: 0x4 (4)
};

// 0xc (12) bytes
struct _KSYSTEM_TIME {
  ULONG LowPart;  // offset: 0x0 (0)
  LONG High1Time; // offset: 0x4 (4)
  LONG High2Time; // offset: 0x8 (8)
};

// 0xa (10) bytes
struct _ISA_VECTOR {
  UCHAR Type;                        // offset: 0x0 (0)
  UCHAR Length;                      // offset: 0x1 (1)
  UCHAR Bus;                         // offset: 0x2 (2)
  UCHAR Source;                      // offset: 0x3 (3)
  ULONG GlobalSystemInterruptVector; // offset: 0x4 (4)
  USHORT Flags;                      // offset: 0x8 (8)
};

// 0x8 (8) bytes
struct _IO_NMISOURCE {
  UCHAR Type;                        // offset: 0x0 (0)
  UCHAR Length;                      // offset: 0x1 (1)
  USHORT Flags;                      // offset: 0x2 (2)
  ULONG GlobalSystemInterruptVector; // offset: 0x4 (4)
};

// 0x8 (8) bytes
struct _HAL_HV_DMA_DOMAIN_INFO {
  ULONG DomainId; // offset: 0x0 (0)
  UCHAR IsStage1; // offset: 0x4 (4)
};

// 0xc (12) bytes
struct _HAL_HV_SVM_DEVICE_CAPABILITIES {
  ULONG SvmSupported : 1;     // offset: 0x0 (0)
  ULONG PciExecute : 1;       // offset: 0x0 (0)
  ULONG NoExecute : 1;        // offset: 0x0 (0)
  ULONG Reserved : 28;        // offset: 0x0 (0)
  ULONG OverflowPossible : 1; // offset: 0x0 (0)
  ULONG PasidCount;           // offset: 0x4 (4)
  ULONG IommuIndex;           // offset: 0x8 (8)
};

// 0x18 (24) bytes
struct _HAL_HV_SVM_SYSTEM_CAPABILITIES {
  ULONG SvmSupported : 1;        // offset: 0x0 (0)
  ULONG GpaAlwaysValid : 1;      // offset: 0x0 (0)
  ULONG MaxPasidSpaceCount;      // offset: 0x4 (4)
  ULONG MaxPasidSpacePasidCount; // offset: 0x8 (8)
  ULONG MaxPrqSize;              // offset: 0xc (12)
  ULONG IommuCount;              // offset: 0x10 (16)
  ULONG MinIommuPasidCount;      // offset: 0x14 (20)
};

// 0xc (12) bytes
struct _IOAPIC {
  UCHAR Type;             // offset: 0x0 (0)
  UCHAR Length;           // offset: 0x1 (1)
  UCHAR IOAPICID;         // offset: 0x2 (2)
  UCHAR Reserved;         // offset: 0x3 (3)
  ULONG IOAPICAddress;    // offset: 0x4 (4)
  ULONG SystemVectorBase; // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct _DMA_TRANSFER_INFO_V2 {
  ULONG MapRegisterCount;          // offset: 0x0 (0)
  ULONG ScatterGatherElementCount; // offset: 0x4 (4)
  ULONG ScatterGatherListSize;     // offset: 0x8 (8)
  ULONG LogicalPageCount;          // offset: 0xc (12)
};

// 0xc (12) bytes
struct _DMA_TRANSFER_INFO_V1 {
  ULONG MapRegisterCount;          // offset: 0x0 (0)
  ULONG ScatterGatherElementCount; // offset: 0x4 (4)
  ULONG ScatterGatherListSize;     // offset: 0x8 (8)
};

// 0x14 (20) bytes
struct _DMA_ADAPTER_INFO_V1 {
  ULONG ReadDmaCounterAvailable; // offset: 0x0 (0)
  ULONG ScatterGatherLimit;      // offset: 0x4 (4)
  ULONG DmaAddressWidth;         // offset: 0x8 (8)
  ULONG Flags;                   // offset: 0xc (12)
  ULONG MinimumTransferUnit;     // offset: 0x10 (16)
};

// 0x14 (20) bytes
struct _DMA_TRANSFER_INFO {
  ULONG Version; // offset: 0x0 (0)
  union {
    struct _DMA_TRANSFER_INFO_V1 V1; // offset: 0x4 (4)
    struct _DMA_TRANSFER_INFO_V2 V2; // offset: 0x4 (4)
  };
};

// 0x18 (24) bytes
struct _DMA_ADAPTER_INFO {
  ULONG Version;                  // offset: 0x0 (0)
  struct _DMA_ADAPTER_INFO_V1 V1; // offset: 0x4 (4)
};

// 0x8 (8) bytes
struct _DMA_REQUEST_LINE_BINDING_DESCRIPTION {
  ULONG RequestLine;   // offset: 0x0 (0)
  ULONG ChannelNumber; // offset: 0x4 (4)
};

// 0x18 (24) bytes
struct _HALP_DMA_TRANSLATION_BUFFER {
  struct _HALP_DMA_TRANSLATION_BUFFER *Next;   // offset: 0x0 (0)
  ULONG EntryCount;                            // offset: 0x8 (8)
  struct _HALP_DMA_TRANSLATION_ENTRY *Entries; // offset: 0x10 (16)
};

// 0x10 (16) bytes
struct _HALP_DMA_TRANSLATION_BUFFER_POSITION {
  struct _HALP_DMA_TRANSLATION_BUFFER *Buffer; // offset: 0x0 (0)
  ULONG Offset;                                // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct _PLATFORM_INTERRUPT {
  UCHAR Type;          // offset: 0x0 (0)
  UCHAR Length;        // offset: 0x1 (1)
  USHORT Flags;        // offset: 0x2 (2)
  UCHAR InterruptType; // offset: 0x4 (4)
  UCHAR APICID;        // offset: 0x5 (5)
  UCHAR ACPIEID;       // offset: 0x6 (6)
  UCHAR IOSAPICVector; // offset: 0x7 (7)
  ULONG GlobalVector;  // offset: 0x8 (8)
  ULONG Reserved;      // offset: 0xc (12)
};

// 0x8 (8) bytes
struct _PROCLOCALAPIC {
  UCHAR Type;            // offset: 0x0 (0)
  UCHAR Length;          // offset: 0x1 (1)
  UCHAR ACPIProcessorID; // offset: 0x2 (2)
  UCHAR APICID;          // offset: 0x3 (3)
  ULONG Flags;           // offset: 0x4 (4)
};

// 0x24 (36) bytes
struct _DESCRIPTION_HEADER {
  ULONG Signature;    // offset: 0x0 (0)
  ULONG Length;       // offset: 0x4 (4)
  UCHAR Revision;     // offset: 0x8 (8)
  UCHAR Checksum;     // offset: 0x9 (9)
  CHAR OEMID[6];      // offset: 0xa (10)
  CHAR OEMTableID[8]; // offset: 0x10 (16)
  ULONG OEMRevision;  // offset: 0x18 (24)
  CHAR CreatorID[4];  // offset: 0x1c (28)
  ULONG CreatorRev;   // offset: 0x20 (32)
};

// 0x58 (88) bytes
struct _KAPC {
  UCHAR Type;                      // offset: 0x0 (0)
  UCHAR SpareByte0;                // offset: 0x1 (1)
  UCHAR Size;                      // offset: 0x2 (2)
  UCHAR SpareByte1;                // offset: 0x3 (3)
  ULONG SpareLong0;                // offset: 0x4 (4)
  struct _KTHREAD *Thread;         // offset: 0x8 (8)
  struct _LIST_ENTRY ApcListEntry; // offset: 0x10 (16)
  VOID *Reserved[3];               // offset: 0x20 (32)
  VOID *NormalContext;             // offset: 0x38 (56)
  VOID *SystemArgument1;           // offset: 0x40 (64)
  VOID *SystemArgument2;           // offset: 0x48 (72)
  CHAR ApcStateIndex;              // offset: 0x50 (80)
  CHAR ApcMode;                    // offset: 0x51 (81)
  UCHAR Inserted;                  // offset: 0x52 (82)
};

// 0x11 (17) bytes
struct _PROCLOCALSAPIC {
  UCHAR Type;                     // offset: 0x0 (0)
  UCHAR Length;                   // offset: 0x1 (1)
  UCHAR ACPIProcessorID;          // offset: 0x2 (2)
  UCHAR APICID;                   // offset: 0x3 (3)
  UCHAR APICEID;                  // offset: 0x4 (4)
  UCHAR Reserved[3];              // offset: 0x5 (5)
  ULONG Flags;                    // offset: 0x8 (8)
  ULONG ACPIProcessorUIDInteger;  // offset: 0xc (12)
  CHAR ACPIProcessorUIDString[1]; // offset: 0x10 (16)
};

// 0x8 (8) bytes
struct _INTERRUPT_LINE {
  ULONG UnitId; // offset: 0x0 (0)
  LONG Line;    // offset: 0x4 (4)
};

// 0x10 (16) bytes
struct _SECONDARY_INTERRUPT_LINE_STATE {
  enum _KINTERRUPT_POLARITY Polarity; // offset: 0x0 (0)
  enum _KINTERRUPT_MODE Mode;         // offset: 0x4 (4)
  ULONG Vector;                       // offset: 0x8 (8)
  UCHAR Unmasked;                     // offset: 0xc (12)
};

// 0x4 (4) bytes
union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS {
  ULONG Primary : 1;              // offset: 0x0 (0)
  ULONG ContainmentWarning : 1;   // offset: 0x0 (0)
  ULONG Reset : 1;                // offset: 0x0 (0)
  ULONG ThresholdExceeded : 1;    // offset: 0x0 (0)
  ULONG ResourceNotAvailable : 1; // offset: 0x0 (0)
  ULONG LatentError : 1;          // offset: 0x0 (0)
  ULONG Propagated : 1;           // offset: 0x0 (0)
  ULONG Reserved : 25;            // offset: 0x0 (0)
  ULONG AsULONG;                  // offset: 0x0 (0)
};

// 0x4 (4) bytes
union _WHEA_ERROR_RECORD_HEADER_FLAGS {
  ULONG Recovered : 1;     // offset: 0x0 (0)
  ULONG PreviousError : 1; // offset: 0x0 (0)
  ULONG Simulated : 1;     // offset: 0x0 (0)
  ULONG DeviceDriver : 1;  // offset: 0x0 (0)
  ULONG CriticalEvent : 1; // offset: 0x0 (0)
  ULONG PersistPfn : 1;    // offset: 0x0 (0)
  ULONG Reserved : 26;     // offset: 0x0 (0)
  ULONG AsULONG;           // offset: 0x0 (0)
};

// 0x4 (4) bytes
union _WHEA_ERROR_RECORD_HEADER_VALIDBITS {
  ULONG PlatformId : 1;  // offset: 0x0 (0)
  ULONG Timestamp : 1;   // offset: 0x0 (0)
  ULONG PartitionId : 1; // offset: 0x0 (0)
  ULONG Reserved : 29;   // offset: 0x0 (0)
  ULONG AsULONG;         // offset: 0x0 (0)
};

// 0x4 (4) bytes
union _WHEA_ERROR_PACKET_FLAGS {
  ULONG PreviousError : 1;               // offset: 0x0 (0)
  ULONG CriticalEvent : 1;               // offset: 0x0 (0)
  ULONG HypervisorError : 1;             // offset: 0x0 (0)
  ULONG Simulated : 1;                   // offset: 0x0 (0)
  ULONG PlatformPfaControl : 1;          // offset: 0x0 (0)
  ULONG PlatformDirectedOffline : 1;     // offset: 0x0 (0)
  ULONG AddressTranslationRequired : 1;  // offset: 0x0 (0)
  ULONG AddressTranslationCompleted : 1; // offset: 0x0 (0)
  ULONG Reserved2 : 24;                  // offset: 0x0 (0)
  ULONG AsULONG;                         // offset: 0x0 (0)
};

// 0x4 (4) bytes
union _WHEA_EVENT_LOG_ENTRY_FLAGS {
  ULONG Reserved1 : 1;      // offset: 0x0 (0)
  ULONG LogInternalEtw : 1; // offset: 0x0 (0)
  ULONG LogBlackbox : 1;    // offset: 0x0 (0)
  ULONG LogSel : 1;         // offset: 0x0 (0)
  ULONG RawSel : 1;         // offset: 0x0 (0)
  ULONG NoFormat : 1;       // offset: 0x0 (0)
  ULONG Driver : 1;         // offset: 0x0 (0)
  ULONG Reserved2 : 25;     // offset: 0x0 (0)
  ULONG AsULONG;            // offset: 0x0 (0)
};

// 0x20 (32) bytes
struct _WHEA_EVENT_LOG_ENTRY_HEADER {
  ULONG Signature;                         // offset: 0x0 (0)
  ULONG Version;                           // offset: 0x4 (4)
  ULONG Length;                            // offset: 0x8 (8)
  enum _WHEA_EVENT_LOG_ENTRY_TYPE Type;    // offset: 0xc (12)
  ULONG OwnerTag;                          // offset: 0x10 (16)
  enum _WHEA_EVENT_LOG_ENTRY_ID Id;        // offset: 0x14 (20)
  union _WHEA_EVENT_LOG_ENTRY_FLAGS Flags; // offset: 0x18 (24)
  ULONG PayloadLength;                     // offset: 0x1c (28)
};

// 0x20 (32) bytes
struct _WHEA_EVENT_LOG_ENTRY {
  struct _WHEA_EVENT_LOG_ENTRY_HEADER Header; // offset: 0x0 (0)
};

// 0x1c (28) bytes
struct _WHEA_NOTIFICATION_DESCRIPTOR {
  UCHAR Type;                           // offset: 0x0 (0)
  UCHAR Length;                         // offset: 0x1 (1)
  union _WHEA_NOTIFICATION_FLAGS Flags; // offset: 0x2 (2)
  union {
    struct {
      ULONG PollInterval; // offset: 0x0 (0)
    } Polled;             // offset: 0x4 (4)
    struct {
      ULONG PollInterval;             // offset: 0x0 (0)
      ULONG Vector;                   // offset: 0x4 (4)
      ULONG SwitchToPollingThreshold; // offset: 0x8 (8)
      ULONG SwitchToPollingWindow;    // offset: 0xc (12)
      ULONG ErrorThreshold;           // offset: 0x10 (16)
      ULONG ErrorThresholdWindow;     // offset: 0x14 (20)
    } Interrupt;                      // offset: 0x4 (4)
    struct {
      ULONG PollInterval;             // offset: 0x0 (0)
      ULONG Vector;                   // offset: 0x4 (4)
      ULONG SwitchToPollingThreshold; // offset: 0x8 (8)
      ULONG SwitchToPollingWindow;    // offset: 0xc (12)
      ULONG ErrorThreshold;           // offset: 0x10 (16)
      ULONG ErrorThresholdWindow;     // offset: 0x14 (20)
    } LocalInterrupt;                 // offset: 0x4 (4)
    struct {
      ULONG PollInterval;             // offset: 0x0 (0)
      ULONG Vector;                   // offset: 0x4 (4)
      ULONG SwitchToPollingThreshold; // offset: 0x8 (8)
      ULONG SwitchToPollingWindow;    // offset: 0xc (12)
      ULONG ErrorThreshold;           // offset: 0x10 (16)
      ULONG ErrorThresholdWindow;     // offset: 0x14 (20)
    } Sci;                            // offset: 0x4 (4)
    struct {
      ULONG PollInterval;             // offset: 0x0 (0)
      ULONG Vector;                   // offset: 0x4 (4)
      ULONG SwitchToPollingThreshold; // offset: 0x8 (8)
      ULONG SwitchToPollingWindow;    // offset: 0xc (12)
      ULONG ErrorThreshold;           // offset: 0x10 (16)
      ULONG ErrorThresholdWindow;     // offset: 0x14 (20)
    } Nmi;                            // offset: 0x4 (4)
    struct {
      ULONG PollInterval;             // offset: 0x0 (0)
      ULONG Vector;                   // offset: 0x4 (4)
      ULONG SwitchToPollingThreshold; // offset: 0x8 (8)
      ULONG SwitchToPollingWindow;    // offset: 0xc (12)
      ULONG ErrorThreshold;           // offset: 0x10 (16)
      ULONG ErrorThresholdWindow;     // offset: 0x14 (20)
    } Sea;                            // offset: 0x4 (4)
    struct {
      ULONG PollInterval;             // offset: 0x0 (0)
      ULONG Vector;                   // offset: 0x4 (4)
      ULONG SwitchToPollingThreshold; // offset: 0x8 (8)
      ULONG SwitchToPollingWindow;    // offset: 0xc (12)
      ULONG ErrorThreshold;           // offset: 0x10 (16)
      ULONG ErrorThresholdWindow;     // offset: 0x14 (20)
    } Sei;                            // offset: 0x4 (4)
    struct {
      ULONG PollInterval;             // offset: 0x0 (0)
      ULONG Vector;                   // offset: 0x4 (4)
      ULONG SwitchToPollingThreshold; // offset: 0x8 (8)
      ULONG SwitchToPollingWindow;    // offset: 0xc (12)
      ULONG ErrorThreshold;           // offset: 0x10 (16)
      ULONG ErrorThresholdWindow;     // offset: 0x14 (20)
    } Gsiv;                           // offset: 0x4 (4)

  } u; // offset: 0x4 (4)
};

// 0x4 (4) bytes
struct _WHEA_PCI_SLOT_NUMBER {
  union {
    struct {
      ULONG DeviceNumber : 5;   // offset: 0x0 (0)
      ULONG FunctionNumber : 3; // offset: 0x0 (0)
      ULONG Reserved : 24;      // offset: 0x0 (0)
    } bits;                     // offset: 0x0 (0)
    ULONG AsULONG;              // offset: 0x0 (0)

  } u; // offset: 0x0 (0)
};

// 0x4 (4) bytes
union _XPF_MCE_FLAGS {
  ULONG MCG_CapabilityRW : 1;    // offset: 0x0 (0)
  ULONG MCG_GlobalControlRW : 1; // offset: 0x0 (0)
  ULONG Reserved : 30;           // offset: 0x0 (0)
  ULONG AsULONG;                 // offset: 0x0 (0)
};

// 0x2c (44) bytes
struct _WHEA_AER_BRIDGE_DESCRIPTOR {
  USHORT Type;                              // offset: 0x0 (0)
  UCHAR Enabled;                            // offset: 0x2 (2)
  UCHAR Reserved;                           // offset: 0x3 (3)
  ULONG BusNumber;                          // offset: 0x4 (4)
  struct _WHEA_PCI_SLOT_NUMBER Slot;        // offset: 0x8 (8)
  USHORT DeviceControl;                     // offset: 0xc (12)
  union _AER_BRIDGE_DESCRIPTOR_FLAGS Flags; // offset: 0xe (14)
  ULONG UncorrectableErrorMask;             // offset: 0x10 (16)
  ULONG UncorrectableErrorSeverity;         // offset: 0x14 (20)
  ULONG CorrectableErrorMask;               // offset: 0x18 (24)
  ULONG AdvancedCapsAndControl;             // offset: 0x1c (28)
  ULONG SecondaryUncorrectableErrorMask;    // offset: 0x20 (32)
  ULONG SecondaryUncorrectableErrorSev;     // offset: 0x24 (36)
  ULONG SecondaryCapsAndControl;            // offset: 0x28 (40)
};

// 0x20 (32) bytes
struct _WHEA_AER_ENDPOINT_DESCRIPTOR {
  USHORT Type;                                // offset: 0x0 (0)
  UCHAR Enabled;                              // offset: 0x2 (2)
  UCHAR Reserved;                             // offset: 0x3 (3)
  ULONG BusNumber;                            // offset: 0x4 (4)
  struct _WHEA_PCI_SLOT_NUMBER Slot;          // offset: 0x8 (8)
  USHORT DeviceControl;                       // offset: 0xc (12)
  union _AER_ENDPOINT_DESCRIPTOR_FLAGS Flags; // offset: 0xe (14)
  ULONG UncorrectableErrorMask;               // offset: 0x10 (16)
  ULONG UncorrectableErrorSeverity;           // offset: 0x14 (20)
  ULONG CorrectableErrorMask;                 // offset: 0x18 (24)
  ULONG AdvancedCapsAndControl;               // offset: 0x1c (28)
};

// 0x24 (36) bytes
struct _WHEA_AER_ROOTPORT_DESCRIPTOR {
  USHORT Type;                                // offset: 0x0 (0)
  UCHAR Enabled;                              // offset: 0x2 (2)
  UCHAR Reserved;                             // offset: 0x3 (3)
  ULONG BusNumber;                            // offset: 0x4 (4)
  struct _WHEA_PCI_SLOT_NUMBER Slot;          // offset: 0x8 (8)
  USHORT DeviceControl;                       // offset: 0xc (12)
  union _AER_ROOTPORT_DESCRIPTOR_FLAGS Flags; // offset: 0xe (14)
  ULONG UncorrectableErrorMask;               // offset: 0x10 (16)
  ULONG UncorrectableErrorSeverity;           // offset: 0x14 (20)
  ULONG CorrectableErrorMask;                 // offset: 0x18 (24)
  ULONG AdvancedCapsAndControl;               // offset: 0x1c (28)
  ULONG RootErrorCommand;                     // offset: 0x20 (32)
};

// 0x18 (24) bytes
struct _ECP_LIST {
  ULONG Signature;            // offset: 0x0 (0)
  ULONG Flags;                // offset: 0x4 (4)
  struct _LIST_ENTRY EcpList; // offset: 0x8 (8)
};

// 0x28 (40) bytes
struct _IO_DRIVER_CREATE_CONTEXT {
  SHORT Size;                                 // offset: 0x0 (0)
  struct _ECP_LIST *ExtraCreateParameter;     // offset: 0x8 (8)
  VOID *DeviceObjectHint;                     // offset: 0x10 (16)
  struct _TXN_PARAMETER_BLOCK *TxnParameters; // offset: 0x18 (24)
  struct _EJOB *SiloContext;                  // offset: 0x20 (32)
};

// 0x10 (16) bytes
union _KGDTENTRY64 {
  struct {
    USHORT LimitLow; // offset: 0x0 (0)
    USHORT BaseLow;  // offset: 0x2 (2)
  };
  struct {
    UCHAR BaseMiddle; // offset: 0x0 (0)
    UCHAR Flags1;     // offset: 0x1 (1)
    UCHAR Flags2;     // offset: 0x2 (2)
    UCHAR BaseHigh;   // offset: 0x3 (3)
  } Bytes;            // offset: 0x4 (4)
  struct {
    struct {
      ULONG BaseMiddle : 8;  // offset: 0x0 (0)
      ULONG Type : 5;        // offset: 0x0 (0)
      ULONG Dpl : 2;         // offset: 0x0 (0)
      ULONG Present : 1;     // offset: 0x0 (0)
      ULONG LimitHigh : 4;   // offset: 0x0 (0)
      ULONG System : 1;      // offset: 0x0 (0)
      ULONG LongMode : 1;    // offset: 0x0 (0)
      ULONG DefaultBig : 1;  // offset: 0x0 (0)
      ULONG Granularity : 1; // offset: 0x0 (0)
      ULONG BaseHigh : 8;    // offset: 0x0 (0)
    } Bits;                  // offset: 0x4 (4)
    ULONG BaseUpper;         // offset: 0x8 (8)
  };
  struct {
    ULONG MustBeZero; // offset: 0xc (12)
    LONGLONG DataLow; // offset: 0x0 (0)
  };
  LONGLONG DataHigh; // offset: 0x8 (8)
};

// 0x50 (80) bytes
struct _RTL_RETPOLINE_ROUTINES {
  ULONG UnwindDataOffset;    // offset: 0x0 (0)
  ULONG SwitchtableJump[16]; // offset: 0x4 (4)
  ULONG CfgIndirectRax;      // offset: 0x44 (68)
  ULONG NonCfgIndirectRax;   // offset: 0x48 (72)
  ULONG ImportR10;           // offset: 0x4c (76)
};

// 0x50 (80) bytes
struct _EXCEPTION_RECORD32 {
  LONG ExceptionCode;             // offset: 0x0 (0)
  ULONG ExceptionFlags;           // offset: 0x4 (4)
  ULONG ExceptionRecord;          // offset: 0x8 (8)
  ULONG ExceptionAddress;         // offset: 0xc (12)
  ULONG NumberParameters;         // offset: 0x10 (16)
  ULONG ExceptionInformation[15]; // offset: 0x14 (20)
};

// 0x54 (84) bytes
struct _DBGKM_EXCEPTION32 {
  struct _EXCEPTION_RECORD32 ExceptionRecord; // offset: 0x0 (0)
  ULONG FirstChance;                          // offset: 0x50 (80)
};

// 0x38 (56) bytes
struct _NT_TIB {
  struct _EXCEPTION_REGISTRATION_RECORD *ExceptionList; // offset: 0x0 (0)
  VOID *StackBase;                                      // offset: 0x8 (8)
  VOID *StackLimit;                                     // offset: 0x10 (16)
  VOID *SubSystemTib;                                   // offset: 0x18 (24)
  union {
    VOID *FiberData; // offset: 0x20 (32)
    ULONG Version;   // offset: 0x20 (32)
  };
  VOID *ArbitraryUserPointer; // offset: 0x28 (40)
  struct _NT_TIB *Self;       // offset: 0x30 (48)
};

// 0x10 (16) bytes
struct _CUSTOM_SYSTEM_EVENT_TRIGGER_CONFIG {
  ULONG Size;             // offset: 0x0 (0)
  const WCHAR *TriggerId; // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct _FS_FILTER_SECTION_SYNC_OUTPUT {
  ULONG StructureSize;        // offset: 0x0 (0)
  ULONG SizeReturned;         // offset: 0x4 (4)
  ULONG Flags;                // offset: 0x8 (8)
  ULONG DesiredReadAlignment; // offset: 0xc (12)
};

// 0x18 (24) bytes
struct _DEVICE_OBJECT_LIST_ENTRY {
  struct _DEVICE_OBJECT *DeviceObject;       // offset: 0x0 (0)
  enum _DEVICE_RELATION_LEVEL RelationLevel; // offset: 0x8 (8)
  ULONG Ordinal;                             // offset: 0xc (12)
  ULONG Flags;                               // offset: 0x10 (16)
};

// 0x30 (48) bytes
struct DOCK_INTERFACE {
  USHORT Size;                              // offset: 0x0 (0)
  USHORT Version;                           // offset: 0x2 (2)
  VOID *Context;                            // offset: 0x8 (8)
  VOID (*InterfaceReference)(VOID *arg1);   // offset: 0x10 (16)
  VOID (*InterfaceDereference)(VOID *arg1); // offset: 0x18 (24)
  ULONG (*ProfileDepartureSetMode)
  (VOID *arg1, enum PROFILE_DEPARTURE_STYLE arg2); // offset: 0x20 (32)
  ULONG (*ProfileDepartureUpdate)(VOID *arg1);     // offset: 0x28 (40)
};

// 0x28 (40) bytes
struct _DEVICE_OBJECT_LIST {
  ULONG Count;                                 // offset: 0x0 (0)
  ULONG MaxCount;                              // offset: 0x4 (4)
  ULONG TagCount;                              // offset: 0x8 (8)
  enum _PNP_DEVICE_DELETE_TYPE OperationCode;  // offset: 0xc (12)
  struct _DEVICE_OBJECT_LIST_ENTRY Devices[1]; // offset: 0x10 (16)
};

// 0x10 (16) bytes
struct _RELATION_LIST {
  struct _DEVICE_OBJECT_LIST *DeviceObjectList; // offset: 0x0 (0)
  UCHAR Sorted;                                 // offset: 0x8 (8)
};

// 0xc (12) bytes
struct _POWER_SEQUENCE {
  ULONG SequenceD1; // offset: 0x0 (0)
  ULONG SequenceD2; // offset: 0x4 (4)
  ULONG SequenceD3; // offset: 0x8 (8)
};

// 0x40 (64) bytes
struct _DEVICE_CAPABILITIES {
  USHORT Size;                             // offset: 0x0 (0)
  USHORT Version;                          // offset: 0x2 (2)
  ULONG DeviceD1 : 1;                      // offset: 0x4 (4)
  ULONG DeviceD2 : 1;                      // offset: 0x4 (4)
  ULONG LockSupported : 1;                 // offset: 0x4 (4)
  ULONG EjectSupported : 1;                // offset: 0x4 (4)
  ULONG Removable : 1;                     // offset: 0x4 (4)
  ULONG DockDevice : 1;                    // offset: 0x4 (4)
  ULONG UniqueID : 1;                      // offset: 0x4 (4)
  ULONG SilentInstall : 1;                 // offset: 0x4 (4)
  ULONG RawDeviceOK : 1;                   // offset: 0x4 (4)
  ULONG SurpriseRemovalOK : 1;             // offset: 0x4 (4)
  ULONG WakeFromD0 : 1;                    // offset: 0x4 (4)
  ULONG WakeFromD1 : 1;                    // offset: 0x4 (4)
  ULONG WakeFromD2 : 1;                    // offset: 0x4 (4)
  ULONG WakeFromD3 : 1;                    // offset: 0x4 (4)
  ULONG HardwareDisabled : 1;              // offset: 0x4 (4)
  ULONG NonDynamic : 1;                    // offset: 0x4 (4)
  ULONG WarmEjectSupported : 1;            // offset: 0x4 (4)
  ULONG NoDisplayInUI : 1;                 // offset: 0x4 (4)
  ULONG Reserved1 : 1;                     // offset: 0x4 (4)
  ULONG WakeFromInterrupt : 1;             // offset: 0x4 (4)
  ULONG SecureDevice : 1;                  // offset: 0x4 (4)
  ULONG ChildOfVgaEnabledBridge : 1;       // offset: 0x4 (4)
  ULONG DecodeIoOnBoot : 1;                // offset: 0x4 (4)
  ULONG Reserved : 9;                      // offset: 0x4 (4)
  ULONG Address;                           // offset: 0x8 (8)
  ULONG UINumber;                          // offset: 0xc (12)
  enum _DEVICE_POWER_STATE DeviceState[7]; // offset: 0x10 (16)
  enum _SYSTEM_POWER_STATE SystemWake;     // offset: 0x2c (44)
  enum _DEVICE_POWER_STATE DeviceWake;     // offset: 0x30 (48)
  ULONG D1Latency;                         // offset: 0x34 (52)
  ULONG D2Latency;                         // offset: 0x38 (56)
  ULONG D3Latency;                         // offset: 0x3c (60)
};

// 0x4 (4) bytes
struct _SYSTEM_POWER_STATE_CONTEXT {
  union {
    struct {
      ULONG Reserved1 : 8;               // offset: 0x0 (0)
      ULONG TargetSystemState : 4;       // offset: 0x0 (0)
      ULONG EffectiveSystemState : 4;    // offset: 0x0 (0)
      ULONG CurrentSystemState : 4;      // offset: 0x0 (0)
      ULONG IgnoreHibernationPath : 1;   // offset: 0x0 (0)
      ULONG PseudoTransition : 1;        // offset: 0x0 (0)
      ULONG KernelSoftReboot : 1;        // offset: 0x0 (0)
      ULONG DirectedDripsTransition : 1; // offset: 0x0 (0)
      ULONG Reserved2 : 8;               // offset: 0x0 (0)
    };
    ULONG ContextAsUlong; // offset: 0x0 (0)
  };
};

// 0x8 (8) bytes
struct _POP_FX_DEPENDENT {
  ULONG Index;         // offset: 0x0 (0)
  ULONG ProviderIndex; // offset: 0x4 (4)
};

// 0x8 (8) bytes
struct _POP_FX_PROVIDER {
  ULONG Index;      // offset: 0x0 (0)
  UCHAR Activating; // offset: 0x4 (4)
};

// 0x10 (16) bytes
struct _DEVICE_RELATIONS {
  ULONG Count;                       // offset: 0x0 (0)
  struct _DEVICE_OBJECT *Objects[1]; // offset: 0x8 (8)
};

// 0x4 (4) bytes
struct _TOKEN_MANDATORY_POLICY {
  ULONG Policy; // offset: 0x0 (0)
};

// 0x68 (104) bytes
struct _FAST_ERESOURCE {
  VOID *Reserved1[3]; // offset: 0x0 (0)
  ULONG Reserved2;    // offset: 0x18 (24)
  VOID *Reserved3[4]; // offset: 0x20 (32)
  ULONG Reserved4[4]; // offset: 0x40 (64)
  VOID *Reserved5;    // offset: 0x50 (80)
  VOID *Reserved6[2]; // offset: 0x58 (88)
};

// 0x38 (56) bytes
struct _IMAGE_ROM_OPTIONAL_HEADER {
  USHORT Magic;                  // offset: 0x0 (0)
  UCHAR MajorLinkerVersion;      // offset: 0x2 (2)
  UCHAR MinorLinkerVersion;      // offset: 0x3 (3)
  ULONG SizeOfCode;              // offset: 0x4 (4)
  ULONG SizeOfInitializedData;   // offset: 0x8 (8)
  ULONG SizeOfUninitializedData; // offset: 0xc (12)
  ULONG AddressOfEntryPoint;     // offset: 0x10 (16)
  ULONG BaseOfCode;              // offset: 0x14 (20)
  ULONG BaseOfData;              // offset: 0x18 (24)
  ULONG BaseOfBss;               // offset: 0x1c (28)
  ULONG GprMask;                 // offset: 0x20 (32)
  ULONG CprMask[4];              // offset: 0x24 (36)
  ULONG GpValue;                 // offset: 0x34 (52)
};

// 0x10 (16) bytes
struct _MI_PAGE_COLORS {
  ULONG PageSize[4]; // offset: 0x0 (0)
};

// 0x18 (24) bytes
struct _OBJECT_DIRECTORY_ENTRY {
  struct _OBJECT_DIRECTORY_ENTRY *ChainLink; // offset: 0x0 (0)
  VOID *Object;                              // offset: 0x8 (8)
  ULONG HashValue;                           // offset: 0x10 (16)
};

// 0x8 (8) bytes
struct _PO_POWER_PLANE_PROFILE {
  ULONG ExclusivePowerMw; // offset: 0x0 (0)
  ULONG PeakPowerMw;      // offset: 0x4 (4)
};

// 0x10 (16) bytes
struct _PEP_WORK_ACPI_NOTIFY {
  struct POHANDLE__ *DeviceHandle; // offset: 0x0 (0)
  ULONG NotifyCode;                // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct _PEP_WORK_COMPLETE_PERF_STATE {
  struct POHANDLE__ *DeviceHandle; // offset: 0x0 (0)
  ULONG Component;                 // offset: 0x8 (8)
  UCHAR Succeeded;                 // offset: 0xc (12)
};

// 0x10 (16) bytes
struct _PEP_WORK_COMPLETE_IDLE_STATE {
  struct POHANDLE__ *DeviceHandle; // offset: 0x0 (0)
  ULONG Component;                 // offset: 0x8 (8)
};

// 0x10 (16) bytes
struct _PEP_WORK_IDLE_STATE {
  struct POHANDLE__ *DeviceHandle; // offset: 0x0 (0)
  ULONG Component;                 // offset: 0x8 (8)
  ULONG State;                     // offset: 0xc (12)
};

// 0x10 (16) bytes
struct _PEP_WORK_ACTIVE_COMPLETE {
  struct POHANDLE__ *DeviceHandle; // offset: 0x0 (0)
  ULONG Component;                 // offset: 0x8 (8)
};

// 0x70 (112) bytes
struct _PENDING_RELATIONS_LIST_ENTRY {
  struct _LIST_ENTRY Link;                     // offset: 0x0 (0)
  struct _WORK_QUEUE_ITEM WorkItem;            // offset: 0x10 (16)
  struct _PNP_DEVICE_EVENT_ENTRY *DeviceEvent; // offset: 0x30 (48)
  struct _DEVICE_OBJECT *DeviceObject;         // offset: 0x38 (56)
  struct _RELATION_LIST *RelationsList;        // offset: 0x40 (64)
  struct _IRP *EjectIrp;                       // offset: 0x48 (72)
  enum IRPLOCK Lock;                           // offset: 0x50 (80)
  ULONG Problem;                               // offset: 0x54 (84)
  UCHAR ProfileChangingEject;                  // offset: 0x58 (88)
  UCHAR DisplaySafeRemovalDialog;              // offset: 0x59 (89)
  enum _SYSTEM_POWER_STATE LightestSleepState; // offset: 0x5c (92)
  struct DOCK_INTERFACE *DockInterface;        // offset: 0x60 (96)
  UCHAR DequeuePending;                        // offset: 0x68 (104)
  enum _PNP_DEVICE_DELETE_TYPE DeleteType;     // offset: 0x6c (108)
};

// 0x14 (20) bytes
struct _ETW_LBR_SUPPORT {
  ULONG LbrHandle;            // offset: 0x0 (0)
  ULONG LbrOptions;           // offset: 0x4 (4)
  volatile ULONG HookIdCount; // offset: 0x8 (8)
  USHORT HookId[4];           // offset: 0xc (12)
};

// 0xc (12) bytes
struct _SECURITY_QUALITY_OF_SERVICE {
  ULONG Length;                                          // offset: 0x0 (0)
  enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel; // offset: 0x4 (4)
  UCHAR ContextTrackingMode;                             // offset: 0x8 (8)
  UCHAR EffectiveOnly;                                   // offset: 0x9 (9)
};

// 0x40 (64) bytes
struct _OBJECT_CREATE_INFORMATION {
  ULONG Attributes;                                 // offset: 0x0 (0)
  VOID *RootDirectory;                              // offset: 0x8 (8)
  CHAR ProbeMode;                                   // offset: 0x10 (16)
  ULONG PagedPoolCharge;                            // offset: 0x14 (20)
  ULONG NonPagedPoolCharge;                         // offset: 0x18 (24)
  ULONG SecurityDescriptorCharge;                   // offset: 0x1c (28)
  VOID *SecurityDescriptor;                         // offset: 0x20 (32)
  struct _SECURITY_QUALITY_OF_SERVICE *SecurityQos; // offset: 0x28 (40)
  struct _SECURITY_QUALITY_OF_SERVICE
      SecurityQualityOfService; // offset: 0x30 (48)
};

// 0x30 (48) bytes
struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION {
  ULONG SecurityAttributeCount;                     // offset: 0x0 (0)
  struct _LIST_ENTRY SecurityAttributesList;        // offset: 0x8 (8)
  ULONG WorkingSecurityAttributeCount;              // offset: 0x18 (24)
  struct _LIST_ENTRY WorkingSecurityAttributesList; // offset: 0x20 (32)
};

// 0x10 (16) bytes
struct _SID_AND_ATTRIBUTES {
  VOID *Sid;        // offset: 0x0 (0)
  ULONG Attributes; // offset: 0x8 (8)
};

// 0x38 (56) bytes
struct _PO_DIRECTED_DRIPS_STATE {
  struct _LIST_ENTRY QueueLink;        // offset: 0x0 (0)
  struct _LIST_ENTRY VisitedQueueLink; // offset: 0x10 (16)
  volatile ULONG Flags;                // offset: 0x20 (32)
  ULONG CachedFlags;                   // offset: 0x24 (36)
  ULONG DeviceUsageCount;              // offset: 0x28 (40)
  VOID *Diagnostic;                    // offset: 0x30 (48)
};

// 0x68 (104) bytes
struct _PO_DEVICE_NOTIFY {
  struct _LIST_ENTRY Link;             // offset: 0x0 (0)
  struct _LIST_ENTRY PowerChildren;    // offset: 0x10 (16)
  struct _LIST_ENTRY PowerParents;     // offset: 0x20 (32)
  struct _DEVICE_OBJECT *TargetDevice; // offset: 0x30 (48)
  UCHAR OrderLevel;                    // offset: 0x38 (56)
  struct _DEVICE_OBJECT *DeviceObject; // offset: 0x40 (64)
  WCHAR *DeviceName;                   // offset: 0x48 (72)
  WCHAR *DriverName;                   // offset: 0x50 (80)
  ULONG ChildCount;                    // offset: 0x58 (88)
  ULONG ActiveChild;                   // offset: 0x5c (92)
  ULONG ParentCount;                   // offset: 0x60 (96)
  ULONG ActiveParent;                  // offset: 0x64 (100)
};

// 0x1c (28) bytes
struct _PROC_PERF_QOS_CLASS_POLICY {
  ULONG MaxPolicyPercent;              // offset: 0x0 (0)
  ULONG MaxEquivalentFrequencyPercent; // offset: 0x4 (4)
  ULONG MinPolicyPercent;              // offset: 0x8 (8)
  ULONG AutonomousActivityWindow;      // offset: 0xc (12)
  ULONG EnergyPerfPreference;          // offset: 0x10 (16)
  UCHAR ProvideGuidance;               // offset: 0x14 (20)
  UCHAR AllowThrottling;               // offset: 0x15 (21)
  UCHAR PerfBoostMode;                 // offset: 0x16 (22)
  UCHAR LatencyHintPerf;               // offset: 0x17 (23)
  UCHAR TrackDesiredCrossClass;        // offset: 0x18 (24)
};

// 0xc (12) bytes
struct _SID {
  UCHAR Revision;                                       // offset: 0x0 (0)
  UCHAR SubAuthorityCount;                              // offset: 0x1 (1)
  struct _SID_IDENTIFIER_AUTHORITY IdentifierAuthority; // offset: 0x2 (2)
  ULONG SubAuthority[1];                                // offset: 0x8 (8)
};

// 0x8 (8) bytes
struct _CM_INDEX_HINT_BLOCK {
  ULONG Count;      // offset: 0x0 (0)
  ULONG HashKey[1]; // offset: 0x4 (4)
};

// 0x8 (8) bytes
struct _CM_KEY_INDEX {
  USHORT Signature; // offset: 0x0 (0)
  USHORT Count;     // offset: 0x2 (2)
  ULONG List[1];    // offset: 0x4 (4)
};

// 0x30 (48) bytes
struct _MAPIC {
  struct _DESCRIPTION_HEADER Header; // offset: 0x0 (0)
  ULONG LocalAPICAddress;            // offset: 0x24 (36)
  ULONG Flags;                       // offset: 0x28 (40)
  ULONG APICTables[1];               // offset: 0x2c (44)
};

// 0x28 (40) bytes
struct _RSDT_32 {
  struct _DESCRIPTION_HEADER Header; // offset: 0x0 (0)
  ULONG Tables[1];                   // offset: 0x24 (36)
};

// 0x14 (20) bytes
struct _FILE_GET_QUOTA_INFORMATION {
  ULONG NextEntryOffset; // offset: 0x0 (0)
  ULONG SidLength;       // offset: 0x4 (4)
  struct _SID Sid;       // offset: 0x8 (8)
};

// 0xc (12) bytes
struct _COMPRESSED_DATA_INFO {
  USHORT CompressionFormatAndEngine; // offset: 0x0 (0)
  UCHAR CompressionUnitShift;        // offset: 0x2 (2)
  UCHAR ChunkShift;                  // offset: 0x3 (3)
  UCHAR ClusterShift;                // offset: 0x4 (4)
  UCHAR Reserved;                    // offset: 0x5 (5)
  USHORT NumberOfChunks;             // offset: 0x6 (6)
  ULONG CompressedChunkSizes[1];     // offset: 0x8 (8)
};

// 0x8 (8) bytes
struct _PROCESSOR_IDLE_DEPENDENCY {
  ULONG ProcessorIndex;    // offset: 0x0 (0)
  UCHAR ExpectedState;     // offset: 0x4 (4)
  UCHAR AllowDeeperStates; // offset: 0x5 (5)
  UCHAR LooseDependency;   // offset: 0x6 (6)
};

// 0x28 (40) bytes
struct _RTL_DYNAMIC_HASH_TABLE {
  ULONG Flags;           // offset: 0x0 (0)
  ULONG Shift;           // offset: 0x4 (4)
  ULONG TableSize;       // offset: 0x8 (8)
  ULONG Pivot;           // offset: 0xc (12)
  ULONG DivisorMask;     // offset: 0x10 (16)
  ULONG NumEntries;      // offset: 0x14 (20)
  ULONG NonEmptyBuckets; // offset: 0x18 (24)
  ULONG NumEnumerators;  // offset: 0x1c (28)
  VOID *Directory;       // offset: 0x20 (32)
};

// 0xe8 (232) bytes
struct _SYSTEM_POWER_POLICY {
  ULONG Revision;                               // offset: 0x0 (0)
  struct POWER_ACTION_POLICY PowerButton;       // offset: 0x4 (4)
  struct POWER_ACTION_POLICY SleepButton;       // offset: 0x10 (16)
  struct POWER_ACTION_POLICY LidClose;          // offset: 0x1c (28)
  enum _SYSTEM_POWER_STATE LidOpenWake;         // offset: 0x28 (40)
  ULONG Reserved;                               // offset: 0x2c (44)
  struct POWER_ACTION_POLICY Idle;              // offset: 0x30 (48)
  ULONG IdleTimeout;                            // offset: 0x3c (60)
  UCHAR IdleSensitivity;                        // offset: 0x40 (64)
  UCHAR DynamicThrottle;                        // offset: 0x41 (65)
  UCHAR Spare2[2];                              // offset: 0x42 (66)
  enum _SYSTEM_POWER_STATE MinSleep;            // offset: 0x44 (68)
  enum _SYSTEM_POWER_STATE MaxSleep;            // offset: 0x48 (72)
  enum _SYSTEM_POWER_STATE ReducedLatencySleep; // offset: 0x4c (76)
  ULONG WinLogonFlags;                          // offset: 0x50 (80)
  ULONG Spare3;                                 // offset: 0x54 (84)
  ULONG DozeS4Timeout;                          // offset: 0x58 (88)
  ULONG BroadcastCapacityResolution;            // offset: 0x5c (92)
  struct SYSTEM_POWER_LEVEL DischargePolicy[4]; // offset: 0x60 (96)
  ULONG VideoTimeout;                           // offset: 0xc0 (192)
  UCHAR VideoDimDisplay;                        // offset: 0xc4 (196)
  ULONG VideoReserved[3];                       // offset: 0xc8 (200)
  ULONG SpindownTimeout;                        // offset: 0xd4 (212)
  UCHAR OptimizeForPower;                       // offset: 0xd8 (216)
  UCHAR FanThrottleTolerance;                   // offset: 0xd9 (217)
  UCHAR ForcedThrottle;                         // offset: 0xda (218)
  UCHAR MinThrottle;                            // offset: 0xdb (219)
  struct POWER_ACTION_POLICY OverThrottled;     // offset: 0xdc (220)
};

// 0x148 (328) bytes
struct _POP_POWER_SETTING_VALUES {
  ULONG StructureSize;                               // offset: 0x0 (0)
  struct _SYSTEM_POWER_POLICY PopPolicy;             // offset: 0x4 (4)
  enum SYSTEM_POWER_CONDITION CurrentAcDcPowerState; // offset: 0xec (236)
  UCHAR AwayModeEnabled;                             // offset: 0xf0 (240)
  UCHAR AwayModeEngaged;                             // offset: 0xf1 (241)
  UCHAR AwayModePolicyAllowed;                       // offset: 0xf2 (242)
  volatile LONG AwayModeIgnoreUserPresent;           // offset: 0xf4 (244)
  volatile LONG AwayModeIgnoreAction;                // offset: 0xf8 (248)
  UCHAR DisableFastS4;                               // offset: 0xfc (252)
  UCHAR DisableStandbyStates;                        // offset: 0xfd (253)
  ULONG UnattendSleepTimeout;                        // offset: 0x100 (256)
  volatile ULONG DiskIgnoreTime;                     // offset: 0x104 (260)
  volatile ULONG DeviceIdlePolicy;                   // offset: 0x108 (264)
